{
    "title": "Method and system for a runtime user account creation operation within a single-sign-on process in a federated computing environment",
    "abstract": "A method, system, apparatus, and computer program product are presented to support computing systems of different enterprises that interact within a federated computing environment. Federated single-sign-on operations can be initiated at the computing systems of federation partners on behalf of a user even though the user has not established a user account at a federation partner prior to the initiation of the single-sign-on operation. For example, an identity provider can initiate a single-sign-on operation at a service provider while attempting to obtain access to a controlled resource on behalf of a user. When the service provider recognizes that it does not have a linked user account for the user that allows for a single-sign-on operation with the identity provider, the service provider creates a local user account. The service provider can also pull user attributes from the identity provider as necessary to perform the user account creation operation.",
    "function": [
        "What is the essential function of the product or process?",
        " The essential function of the patented method and system is to enable user authentication and account creation within a federated computing environment, supporting single-sign-on operations across different systems. This allows users to access protected resources hosted by various systems without needing pre-established accounts, by dynamically creating user accounts based on received identifiers and attributes."
    ],
    "operation": [
        "How does the product or process operate?",
        " The patented method and system operate within a federated computing environment, enabling single-sign-on (SSO) operations across different systems. When a user attempts to access a protected resource hosted by a second system (service provider), the first system (identity provider) initiates an SSO operation on behalf of the user. If the service provider lacks a linked user account for the user, it dynamically creates one based on received identifiers and attributes from the identity provider. This process"
    ],
    "results": [
        "What results does this product or process achieve?",
        " The patented method and system achieve the following results:\n\n1. Enable single-sign-on (SSO) operations across different systems within a federated computing environment, even when the user has not established an account at the service provider prior to initiating SSO.\n2. Dynamically create user accounts at the service provider based on received identifiers and attributes from the identity provider, allowing for seamless access to protected resources hosted by various systems.\n3. Support efficient"
    ],
    "alternatives": [
        "What ingredients, materials, or processes are alternatives that can work in the same way?",
        " Alternative ingredients, materials, or processes that can work in the same way include:\n\n1. Different protocols for single-sign-on (SSO) operations, such as OAuth 2.0 or OpenID Connect.\n2. Alternative methods for user account creation and management, such as using a centralized identity provider or leveraging existing user accounts from other systems.\n3. Utilizing different communication channels between the identity provider and service provider, such"
    ]
}