{
    "title": "Binders",
    "abstract": "An un-reacted substantially formaldehyde free curable binder solution for binding loose matter consists essentially of a solution obtainable by dissolving a reducing sugar, an ammonium salt acid precursor optionally a carboxylic acid or a precursor thereof and optionally ammonia in water.",
    "function": [
        "What is the essential function of the product or process?",
        " The essential function of this patent is to provide a substantially formaldehyde-free binder solution for binding loose matter, such as mineral fibres, into a desired shape. The binder solution consists of reducing sugars, ammonium salts, and optionally carboxylic acids or their precursors, dissolved in water. The solution has specific pH and solids content requirements and may include silane or silicon-containing coupling agents."
    ],
    "operation": [
        "How does the product or process operate?",
        " The patented product or process operates by creating a substantially formaldehyde-free binder solution, which consists of reducing sugars, ammonium salts, and optionally carboxylic acids or their precursors dissolved in water. This binder solution is used to bind loose matter, such as mineral fibres, into a desired shape. The binder solution has specific pH and solids content requirements and may include silane or silicon-"
    ],
    "results": [
        "What results does this product or process achieve?",
        " The patented product or process achieves a substantially formaldehyde-free binder solution for binding loose matter, such as mineral fibres, into a desired shape. This solution consists of reducing sugars, ammonium salts, and optionally carboxylic acids or their precursors dissolved in water. The binder solution has specific pH and solids content requirements and may include silane or silicon-containing coupling agents. The resulting material"
    ],
    "alternatives": [
        "What ingredients, materials, or processes are alternatives that can work in the same way?",
        " Alternative ingredients for the binder solution could include other reducing sugars like fructose or sucrose, different ammonium salts such as ammonium chloride or ammonium acetate, and alternative carboxylic acids or their precursors like citric acid or malic acid. Additionally, other silane or silicon-containing coupling agents could be used instead of the specified ones. The process could also be adapted to use different methods"
    ]
}