{
    "title": "Binders and materials made therewith",
    "abstract": "A curable aqueous composition is disclosed comprising a carbohydrate, a crosslinking agent, and an amine base, wherein the curable aqueous composition has a pH adjusted by the amine base. Further disclosed is a method of forming a curable aqueous solution.",
    "function": [
        "What is the essential function of the product or process?",
        " The essential function is to create a thermal or acoustical fiberglass insulation product with a formaldehyde-free, water-resistant, thermoset binder matrix that attaches glass fibers together, providing desired insulation properties."
    ],
    "operation": [
        "How does the product or process operate?",
        " The product or process operates by spraying an uncured aqueous binder solution, containing Maillard reactants (amine and carbohydrate reactants), onto a mat of glass fibers. Residual heat and airflow evaporate water, curing the binder through a Maillard reaction, forming a formaldehyde-free, water-resistant, thermoset binder matrix that attaches the glass fibers together."
    ],
    "results": [
        "What results does this product or process achieve?",
        " The product or process achieves a thermal or acoustical fiberglass insulation product with glass fibers bound together by a formaldehyde-free, water-resistant, thermoset binder matrix. This matrix is created through a Maillard reaction between an amine reactant and a carbohydrate reactant, resulting in nitrogen-containing polymers that attach the glass fibers. The insulation product has desired properties such as density, b"
    ],
    "alternatives": [
        "What ingredients, materials, or processes are alternatives that can work in the same way?",
        " Alternative ingredients may include different amine reactants (e.g., proteins, peptides, amino acids), carbohydrate reactants (e.g., monosaccharides, disaccharides, polysaccharides), organic acids, silicon-containing coupling agents, and corrosion inhibitors. The process can also be adapted by using various curing oven temperatures and times."
    ]
}