{
    "title": "Systems and methods to detect rare mutations and copy number variation",
    "abstract": "The present disclosure provides a system and method for the detection of rare mutations and copy number variations in cell free polynucleotides. Generally, the systems and methods comprise sample preparation, or the extraction and isolation of cell free polynucleotide sequences from a bodily fluid; subsequent sequencing of cell free polynucleotides by techniques known in the art; and application of bioinformatics tools to detect rare mutations and copy number variations as compared to a reference. The systems and methods also may contain a database or collection of different rare mutations or copy number variation profiles of different diseases, to be used as additional references in aiding detection of rare mutations, copy number variation profiling or general genetic profiling of a disease.",
    "function": [
        "What is the essential function of the product or process?",
        " The essential function of this patented system and method is to detect rare mutations and copy number variations in cell-free DNA (cfDNA) from bodily fluids, using techniques like sequencing, bioinformatics tools, and reference databases for genetic profiling of diseases."
    ],
    "operation": [
        "How does the product or process operate?",
        " The patented system and method operate by extracting cell-free DNA (cfDNA) from bodily fluids, tagging it with unique identifiers, amplifying the tagged DNA, sequencing the amplified DNA, mapping the sequence reads to reference sequences, grouping reads into families based on their identifiers, collapsing reads within each family to determine base calls at specific genetic loci, and detecting rare mutations or copy number variations by analyzing these base calls."
    ],
    "results": [
        "What results does this product or process achieve?",
        " The patented system and method achieve the detection of rare mutations, gene fusions, copy number variations, and other genetic alterations in cell-free DNA (cfDNA) from bodily fluids. This enables the identification of disease-related genetic profiles, aiding in early diagnosis, monitoring treatment response, and personalized medicine approaches for various diseases, including cancer."
    ],
    "alternatives": [
        "What ingredients, materials, or processes are alternatives that can work in the same way?",
        " Alternative methods may include:\n1. Using different tagging techniques, such as unique molecular identifiers (UMIs) or barcodes, for cfDNA molecules.\n2. Employing alternative amplification methods like multiple displacement amplification (MDA) or rolling circle amplification (RCA).\n3. Utilizing different sequencing technologies, such as single-molecule real-time (SMRT) sequencing or nanopore sequ"
    ]
}