{
    "title": "Systems and methods to detect rare mutations and copy number variation",
    "abstract": "The present disclosure provides a system and method for the detection of rare mutations and copy number variations in cell free polynucleotides. Generally, the systems and methods comprise sample preparation, or the extraction and isolation of cell free polynucleotide sequences from a bodily fluid; subsequent sequencing of cell free polynucleotides by techniques known in the art; and application of bioinformatics tools to detect rare mutations and copy number variations as compared to a reference. The systems and methods also may contain a database or collection of different rare mutations or copy number variation profiles of different diseases, to be used as additional references in aiding detection of rare mutations, copy number variation profiling or general genetic profiling of a disease.",
    "function": [
        "What is the essential function of the product or process?",
        " The essential function of this patented system and method is to detect rare mutations and copy number variations in cell-free polynucleotides from bodily samples by sequencing, filtering, mapping, quantifying, and analyzing the sequence reads against reference sequences or control samples. This enables identification of genetic variations associated with diseases."
    ],
    "operation": [
        "How does the product or process operate?",
        " The patented system and method operate by sequencing cell-free polynucleotides from a bodily sample, filtering, mapping, quantifying, and analyzing sequence reads against reference sequences or control samples. This enables the detection of rare mutations and copy number variations associated with diseases. The process may involve isolating extracellular polynucleotides, generating copies prior to sequencing, attaching barcodes for identification, and selectively enriching regions from"
    ],
    "results": [
        "What results does this product or process achieve?",
        " The patented system and method achieve the detection of rare mutations and copy number variations in cell-free polynucleotides from bodily samples. This enables identification of genetic variations associated with diseases, aiding in diagnosis, prognosis, and personalized treatment strategies."
    ],
    "alternatives": [
        "What ingredients, materials, or processes are alternatives that can work in the same way?",
        " Alternative methods for detecting rare mutations and copy number variations in cell-free polynucleotides may include:\n\n1. Different sequencing techniques, such as Sanger sequencing or alternative next-generation sequencing platforms.\n2. Various bioinformatics tools for mapping, quantifying, and analyzing sequence reads against reference sequences or control samples.\n3. Alternative sample preparation methods, such as different extraction and isolation techniques for"
    ]
}