{
    "title": "Efficient low dropout linear regulator",
    "abstract": "An electronic device incorporates a linear voltage regulator circuit which includes an external pass transistor that does not rely on internal compensation, provides high gain, and exhibits reduce silicon area and power requirements. Circuits according to the present invention provide sufficient bandwidth with an error amplifier and drive capability to keep any secondary poles sufficiently far from the unity gain bandwidth (UGB) while maintaining good power supply rejection.",
    "inventors": [
        "Poss"
    ],
    "document_number": "07298567",
    "publication_date": "20071120",
    "assignees": [
        "Hitachi Global Storage Technologies Netherlands B.V."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An electronic device comprising:",
            "components": [
                {
                    "component": "a first circuit portion; and",
                    "subcomponents": []
                },
                {
                    "component": "a linear regulator circuit connected to said first circuit portion, said linear regulator circuit comprising:",
                    "subcomponents": [
                        "a circuit control node;",
                        "a circuit output node to which a load is connected, a voltage at said circuit output node being determined based on a voltage signal at said circuit control node;",
                        "an amplifier circuit having a first amplifier input and a second amplifier input, and further having an amplifier output, said first amplifier input configured for receiving a reference voltage, said amplifier circuit receiving power from a first voltage source;",
                        "a source follower circuit having a source follower input node and a source follower output, said amplifier output configured drive said source follower input node, said source follower output coupled to said circuit control node; and",
                        "a feedback circuit coupled between said circuit output node and said second amplifier input;",
                        "wherein a bandwidth at said circuit control node changes to track a bandwidth at said circuit output node as said load changes."
                    ]
                },
                {
                    "component": "a circuit control node;",
                    "subcomponents": []
                },
                {
                    "component": "a circuit output node to which a load is connected, a voltage at said circuit output node being determined based on a voltage signal at said circuit control node;",
                    "subcomponents": []
                },
                {
                    "component": "an amplifier circuit having a first amplifier input and a second amplifier input, and further having an amplifier output, said first amplifier input configured for receiving a reference voltage, said amplifier circuit receiving power from a first voltage source;",
                    "subcomponents": []
                },
                {
                    "component": "a source follower circuit having a source follower input node and a source follower output, said amplifier output configured drive said source follower input node, said source follower output coupled to said circuit control node; and",
                    "subcomponents": []
                },
                {
                    "component": "a feedback circuit coupled between said circuit output node and said second amplifier input;",
                    "subcomponents": []
                },
                {
                    "component": "wherein a bandwidth at said circuit control node changes to track a bandwidth at said circuit output node as said load changes.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The electronic device of claim 1 wherein said electronic device is a hard disk device.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The electronic device of claim 2 wherein said first circuit portion is a hard disk device controller.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The electronic device of claim 1 further comprising a current mirror circuit coupled between said amplifier output and said source follower.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The electronic device of claim 4 further comprising a resistor component coupled between a second voltage source and said source follower input node.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The electronic device of claim 5 wherein said first voltage source is different from the second voltage source.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The electronic device of claim 1 wherein said source follower circuit comprises a transistor element in series connection with a current source.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The electronic device of claim 1 wherein said amplifier circuit comprises a single op amp component.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The electronic device of claim 1 wherein said feedback path comprises a pair of resistor components configured as a voltage divider.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The electronic device of claim 1 wherein a pass element having a control node is connected to said circuit control node, wherein a output node of said pass element is connected to said circuit output node, whereby said pass element can provide a regulated output voltage at its output node to said load connected thereto.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The electronic device of claim 10 wherein a second voltage source different from said first voltage source is connected to said load via said pass element, thereby providing a voltage to said load that is independent of said first voltage source.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The electronic device of claim 1 comprising a total bandwidth that is a factor of 10 higher than a unity gain bandwidth of said electronic device.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A hard disk controller circuit comprising:",
            "components": [
                {
                    "component": "a first circuit node;",
                    "subcomponents": []
                },
                {
                    "component": "a second circuit node to which a load is connected, wherein a voltage level therea varies in accordance with a voltage level of said first circuit node;",
                    "subcomponents": []
                },
                {
                    "component": "an error amplifier having a first amplifier input configured to be coupled to a reference voltage, having a second amplifier input, and having an amplifier output, said error amplifier configured to receive power from a first voltage source;",
                    "subcomponents": []
                },
                {
                    "component": "a gain stage comprising a source follower circuit in electrical communication with said amplifier output and with said first circuit node; and",
                    "subcomponents": []
                },
                {
                    "component": "a feedback path coupled between said second node and said second circuit amplifier input, said feedback path including a pair of resistors configured as a voltage divider;",
                    "subcomponents": []
                },
                {
                    "component": "wherein a bandwidth at said first circuit node changes to track a bandwidth at said second circuit node as said load changes.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The circuit of claim 13 wherein a pass element having a control node is connected to said first circuit node, wherein a output node of said pass element is connected to said second circuit node, whereby said pass element can provide a regulated output voltage at its output node to said load connected thereto.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The circuit of claim 14 wherein a second voltage source different from said first voltage source is connected to said load via said pass element, thereby providing a voltage to said load that is independent of said first voltage source.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The circuit of claim 13 wherein said gain stage comprises a first transistor component in series with a current source and having a control terminal, said amplifier output configured to drive said control terminal.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The circuit of claim 16 further comprising a resistor component coupled between a second voltage source and said control terminal.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The circuit of claim 17 wherein said first voltage source and said second voltage source are the same.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The circuit of claim 17 wherein said first voltage source and said second voltage source are different.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The circuit of claim 13 comprising a total bandwidth that is a factor of 10 higher than a unity gain bandwidth of said circuit.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. In a hard disk drive device, a method for regulating an output voltage level suitable for supplying power to a first circuit comprising:",
            "components": [
                {
                    "component": "detecting said output voltage level;",
                    "subcomponents": []
                },
                {
                    "component": "producing an error signal based on a comparison of said output voltage level relative to a reference voltage;",
                    "subcomponents": []
                },
                {
                    "component": "controlling a source follower circuit with said error signal to produce a source follower output at a source follower node; and",
                    "subcomponents": []
                },
                {
                    "component": "varying said output voltage level based on said source follower output at an output node to which a load is connected,",
                    "subcomponents": []
                },
                {
                    "component": "wherein a bandwidth at said output node has a pole at a frequency greater than a unity gain frequency of said first circuit, and wherein a bandwidth at said source follower node changes to track said bandwidth at said output node as said load changes.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The method of claim 21 wherein said first circuit is a hard disk controller.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The method of claim 21 further comprising setting a DC operating point of said source follower circuit via a resistor element coupled to a first voltage source.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The method of claim 23 further comprising controlling a pass circuit with said source follower output to produce said output voltage level.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The method of claim 24 wherein controlling said pass circuit with includes applying said source follower output to a control node of said pass circuit, said pass circuit being powered by a second voltage source, wherein a pole at said control node of said pass circuit varies with a pole at said circuit output node.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The method of claim 25 wherein said first voltage level is different from said second voltage level.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The method of claim 21 wherein the disk first circuit comprises a total bandwidth that is a factor of 10 higher than said unity gain bandwidth.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. A hard disk drive device having a hard disk controller, said hard disk controller including a voltage regulator circuit for regulating an output voltage level comprising:",
            "components": [
                {
                    "component": "first means for detecting said output voltage level;",
                    "subcomponents": []
                },
                {
                    "component": "second means for producing an error signal based on a comparison of said output voltage level relative to a reference voltage, said second means couple to a first voltage source; and",
                    "subcomponents": []
                },
                {
                    "component": "a source follower circuit in electrical communication with said first means to produce a source follower output at a source follower node,",
                    "subcomponents": []
                },
                {
                    "component": "wherein said output voltage level is varied in response to variances in said source follower output at an output node to which a load is connected,",
                    "subcomponents": []
                },
                {
                    "component": "wherein a bandwidth at said output node has a pole at a frequency greater than a unity gain frequency of said voltage regulator circuit, and wherein a bandwidth at said source follower node changes to track said bandwidth at said output node as said load changes.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The circuit of claim 28 wherein said source follower output is connected to a pass element that is connected to a second voltage source, wherein an output of said pass element constitutes said output voltage level.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The circuit of claim 28 further comprising a resistor component connected between said first voltage source and said source follower circuit.",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The method of claim 28 wherein the voltage regulator circuit comprises a total bandwidth that is a factor of 10 higher than said unity gain bandwidth.",
            "components": []
        }
    ],
    "description": [
        "The present invention is related to U.S. application Ser. No. 10/789,774, filed Feb. 27, 2004, and is herein incorporated by reference in its entirety for all purposes.",
        "The present invention relates generally to analog circuits, and in particular low dropout linear regulators and systems which incorporate low dropout linear regulators.",
        "Most linear regulators have feedback which needs some type of stability compensation, either external or internal compensation. To obtain more precise voltage regulation, larger gain is required which inherently makes the feedback less stable. These two trade-offs, large gain and stability, create a design challenge. Other design considerations require low current, reduced silicon area, and good power supply rejection. Many techniques have been implemented for stability compensation. The following patents constitute a sampling of conventional solutions: U.S. Pat. Nos. 4,908,566, 5,168,209, 5,637,992, 5,648,718, 5,744,944, 5,850,139, 5,945,818, 5,982,226, and 6,522,112. All of these techniques use some type of internal zero compensation.",
        "FIG. 3 shows a simplified open loop transfer function of a linear regulator. A regulator with feedback becomes unstable if the open loop gain is >0 dB and the phase is −180 degrees. This condition occurs if at least 2 poles exist below the unity gain bandwidth (UGB). The zero compensation method from the cited patents essentially adds 90 degrees back to the transfer function and keeps the loop stable. Methods to add zero compensation typically increase the power requirement of the circuit and increase the silicon area, especially if large capacitors are needed in silicon.",
        "The P0 pole in FIG. 3 is typically caused by a main compensating load capacitor C1, as shown in FIG. 4. Pa of FIG. 3 represents a secondary pole that can be caused by parasitic capacitive loading (Cp1) at the gate of T1 or by a parasitic capacitance (Cp2) at the base of Tpass, or even by the OpAmp itself. In general, a circuit arrangement can cause stability problems if at least 2 poles exist below the UGB (i.e., less than the unity gain frequency) and no zero compensation is provided.",
        "In essence there are many places where secondary poles can exist. As in FIG. 4, nodes V1, V3, Vf, Vout and the OpAmp are potential areas where poles exist. Node V3, however, can be the most difficult node to keep sufficiently low in parasitic capacitance, since it has to drive off the chip and at the base of the Pass transistor resulting in 10's of pF's.",
        "The other traditional method of stability compensation is to rely on the ESR (equivalent series resistance) of the load capacitor. The ESR of the load capacitor can provide a compensating zero to offset the extra pole in the feedback typically from the amplifier stage. The issue with relying on the ESR of the capacitor is there can be a narrow range of ESR values allowed for a given design.",
        "There is need for an integrated linear regulator have relatively large gain while maintaining stability, with reduced chip layout area and reduced power consumption.",
        "The present invention is directed to a linear regulator and circuits incorporating a linear regulator. A typical linear circuit according to the invention includes an external pass transistor that does not rely on internal compensation, provides high gain, and exhibits reduced silicon area and power requirements. Circuits according to the present invention provide sufficient bandwidth with an error amplifier and drive capability to keep any secondary poles sufficiently far from the unity gain bandwidth (UGB) while maintaining good power supply rejection. In accordance with the invention operation of the circuit does not rely on the equivalent series resistance (ESR) of the load capacitor.",
        "Aspects, advantages and novel features of the present invention will become apparent from the following description of the invention presented in conjunction with the accompanying drawings, wherein:",
        "FIG. 1 shows an illustrative embodiment of a linear regulator circuit according to the present invention;",
        "FIG. 2 shows a Bode plot of the behavior of the linear regulator circuit of FIG. 1;",
        "FIG. 3 shows a Bode plot of a conventional linear regulator circuit;",
        "FIG. 4 shows a typical linear regulator circuit;",
        "FIG. 5A shows a disk drive system which incorporates a linear voltage regulator according to the invention; and",
        "FIG. 5B shows another disk drive system which incorporates a linear voltage regulator according to the invention; and",
        "FIG. 6 shows an example of a configuration using multiple OpAmps.",
        "Circuits embodied in accordance with the present invention keep the secondary poles beyond the UGB. See FIG. 2 for example. Pb represents a secondary pole in the system. As long as the secondary poles are sufficiently beyond the UGB (i.e., greater than the unity gain frequency), the regulator will be stable. There are many places where secondary poles can exist. As can be seen in FIG. 4, for example, nodes V1, V3, Vf, Vout and the OpAmp are potential areas where poles exist. Node V3, however, can be an especially difficult node to keep sufficiently low in parasitic capacitance, since it has to drive off the chip and at the base of the pass transistor Tpass, resulting in capacitance of tens of pF's.",
        "Referring to FIG. 1, a linear regulator 100 includes an error amplifier comprising an OpAmp circuit. In one embodiment, a single conventional OpAmp device is used. The OpAmp includes a non-inverting input that is coupled to a node which receives a reference voltage, Vref. The OpAmp includes an inverting input that is coupled to a node Vf. An output of the OpAmp is coupled to a node V1. A current mirror circuit comprising transistors T4 and T1 is coupled to the node V1. The OpAmp outputs by way of the node V1 a driving current to the current mirror circuit. A voltage source VDD2 is provided to power the OpAmp. It can be appreciated by those of ordinary skill that alternative embodiments of the invention can incorporate an OpAmp circuit design configured around an arrangement of multiple OpAmp devices. FIG. 6 shows an example of a configuration in which the OpAmp component shown in FIG. 1 comprises multiple OpAmp devices.",
        "A resistor R1 is coupled between a second voltage source VDD1 and the drain of T1 at a node V2. Transistor device T2 is configured as a source follower, having a gate terminal that is connected to the node V2 and a source terminal that is connected to a current source represented schematically as IS. The source terminal of T2 is also coupled to Ib flowing at a node V3. Typical devices used for transistor device T2 include, but are not limited to, P-type FET's (field effect transistors), N-type FET's, NPN BJT's (bipolar junction transistors), and PNP BJT's.",
        "A pass circuit comprising element Tpass has a control terminal that is connected to the node V3. The voltage source VDD1 is connected to a first terminal of the pass element Tpass. The pass element can be any of a number of transistor devices such as a BJT. Though, the embodiment illustrated in FIG. 1 shows the device to be a device that is external to the linear regulator 100, one of ordinary skill will understand that the pass element can be incorporated on-chip.",
        "A second terminal of the pass element Tpass is coupled to an output node Vout to provide a regulated voltage to a load. A compensating capacitor C1 is coupled across the load. An equivalent series inductance (ESL) of the capacitor is schematically represented. A feedback path from the output node Vout to the node Vf is provided through the voltage divider network formed by a pair of resistors Rf.",
        "In operation, a circuit according to the invention operates to drive the base node V3 such that the bandwidth at that node is high enough to place a pole beyond the UGB. This ensures stability of the circuit while providing efficient operation for low quiescent current and good power supply rejection. Referring to the illustrative circuit according to the invention, shown in FIG. 1, the output of the OpAmp component is a current which drives the diode-connected mirror of T4 and T1. Transistor device T1, with R1 connected to its drain node, provides gain and a DC operating point at node V2.",
        "As noted above, the transistor device T2 is configured as a source follower and thus operates as a low output impedance gain stage to provide a low impedance drive to node V3. Current source IS provides a bias current to T2 that is substantially less than the base current, Ib. The voltage source VDD1 provides a current to the pass transistor Tpass and a common voltage reference to R1. It is noted that the voltage source VDD2 does not have to be the same potential as VDD1. However, in a particular embodiment of the invention VDD2 can be the same potential as VDD1.",
        "The compensating capacitor C1 provides the pole P0 (see FIG. 2). Because T2 is configured as a source follower, its output impedance is low. Consequently, the source follower output can drive the parasitic capacitance Cp of the pass element Tpass that exists on node V3 to provide sufficient bandwidth so that the secondary pole Pb can be located beyond the frequency of the UGB. This effect is shown in FIG. 2, where the second pole is. The current for T2 is provided primarily by the base of the pass element Tpass. This configuration exhibits certain advantages. For example, since the current required to supply base current to Tpass is low during low load current, the quiescent current for the total regulator is low.",
        "Another advantage with this configuration is that the source follower acts as a gain stage with an output impedance that decreases with an increase in load current. The current flow through transistor device T2 increases as the current draw through the load increases. This in turn decreases the output resistance of T2 thus increasing the bandwidth of node V3. More bandwidth at V3 is needed during higher current loads because the pole at Vout increases as well with higher current loads. So the poles at V3 and Vout track each other despite the load change. This is a desirable characteristic because it ensures stability during high current loads.",
        "IS is a small current to keep transistor device T2 turned ON when no base current is needed during low current demands of the load. The current IS serves as a replacement current when Ib becomes very small during a low loading conditions, to ensure a bias current through the source follower while allowing the pass element Tpass to shut off. This aspect of the invention ensures low quiescent power consumption.",
        "R1 is used to set a normal bias point for node V2 in the linear operating range of Tpass and to keep the pole at a frequency sufficiently higher than the UGB to ensure stable operation. The resistor R1 is also used to keep the power supply rejection of the linear regulator low. If VDD1 changes, node V2 will track this movement and force V3 to move in the same manner to keep the base-emitter voltage of Tpass constant. As noted above, VDD2 and VDD1 could be the same potential, but can be different if the voltage VDD2 for the OpAmp needs to be larger or smaller than VDD1.",
        "A key aspect of the invention, as embodied in the illustrative circuit of FIG. 3, is to keep the resulting bandwidth from the combined effect of the nodes Vf, V1, V2, V3 and the OpAmp approximately a factor of 10 higher than the UGB to maintain stability. With the illustrative circuit shown, keeping the bandwidths at these levels is reasonably achievable. Also, circuits according to the invention do not require a large amount of silicon area to implement and do not draw a large amount of current during operation. In fact, the OpAmp could be a series of OpAmps with several additional internal nodes, provided that the bandwidth of the nodes are sufficiently high.",
        "As a final observation, consideration with any linear regulator of the equivalent series inductance (ESL) needs to be understood. The resonance of the capacitor C1 is determined by the capacitance and ESL. The resonance of the capacitor should be chosen to be higher than the UGB.",
        "Generally, a linear voltage regulator circuit according to the present invention, can be used in many electronic circuits which require a regulated voltage. FIG. 5A shows an example of the present invention as embodied in an electronic device. In particular, a hard disk drive system 500 is shown. Typical components include a magnetic head component 522 for reading tracks of data from a disk 512. A signal representing the modulated light signal is sensed by a pre-amp circuit 524 and delivered to a data channel 526. Main power from a computer (not shown) supplies power to the whole drive. However, the voltage requirements for the pre-amp circuit 524, the data channel 526, a controller 528, and a motor and actuator circuit 530, each have different supply level requirements, current draw, tolerance and voltage ripple requirements. Imbedded in the data channel 526 and the controller 528 typically are sensitive circuits such as phase-locked loops and signal processing circuitry which require tighter tolerance and less “noisy” supplies than the motor and actuator circuit 530, for example. In FIG. 5A, Vcc supplies power to a PNP transistor pass element 504, and may be provided by a switching power supply and will have a higher tolerance and ripple.",
        "A linear regulator circuit 502 in accordance with the present invention is provided to control the pass element 504. The voltage nodes of 502 correspond to the same nodes as FIG. 1. The linear regulator circuit 502 of the present invention will supply a tighter tolerance and quieter supply to these sensitive circuits in the data channel and controller. The Vout shown in FIG. 5A is the linear regulator output and supplies power to circuits 526 and 528 at Vdd. The voltage supply Vcc shown in FIG. 5A couples to the VDD1 supply of FIG. 1.",
        "Providing VDD2 separate from VDD1 allows a lower voltage to be used for the pass element than for the opamp. For example, VDD2=3.3V is a typical power supply voltage for an opamp. However, typical HDD electronics can be driven at a lower voltage of 2.5 V. Thus, setting VDD1 to 2.5 V provides about a 0.8V drop in HDD supply voltage levels with corresponding drops in power loss and heat dissipation.",
        "FIG. 5B illustrates another configuration of a hard disk drive system 500′. Here, the linear regulator circuit 502 is shown incorporated in the controller component 528."
    ],
    "citations": [
        "3984780",
        "4908566",
        "5168209",
        "5631598",
        "5637992",
        "5648718",
        "5744944",
        "5850139",
        "5945818",
        "5982226",
        "6246221",
        "6522112",
        "6573694",
        "6586987",
        "6639373",
        "6646495",
        "6960907"
    ],
    "us_classification": "360 46",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "11",
            "subclass": "B",
            "main_group": "5",
            "subgroup": "09"
        }
    ]
}