{
    "title": "System and method for analyzing a patient status for myocardial ischemia for use in automated patient care",
    "abstract": "A system and method for providing diagnosis and monitoring of myocardial ischemia for use in automated patient care is described. At least one recorded physiological measure is compared to at least one other recorded physiological measure on a substantially regular basis to quantify a change in patient pathophysiological status for equivalent patient information. An absence, an onset, a progression, a regression, and a status quo of myocardial ischemia is evaluated dependent upon the change in patient pathophysiological status.",
    "inventors": [
        "Bardy"
    ],
    "document_number": "07299087",
    "publication_date": "20071120",
    "assignees": [
        "Cardiac Intelligence Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A system for analyzing a patient status for myocardial ischemia for use in automated patient care, comprising:",
            "components": [
                {
                    "component": "a server system receiving a set of one or more physiological measures relating to patient information directly recorded by a medical device on a substantially continuous basis or derived therefrom;",
                    "subcomponents": []
                },
                {
                    "component": "a database module storing the physiological measures set into a patient care record for an individual patient into a database; and",
                    "subcomponents": []
                },
                {
                    "component": "an analyzer analyzing one or more of the physiological measures in the physiological measures set relative to one or more other physiological measures and determining therefrom an onset, a progression, a regression, and a status quo of myocardial ischemia.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A system according to claim 1 , further comprising:",
            "components": [
                {
                    "component": "the analyzer analyzing the physiological measures in the physiological measures set relative to the other physiological measures and determining therefrom an onset, a progression, a regression, and a status quo of diseases other than myocardial ischemia.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A system according to claim 1 , further comprising: the server system receiving a set of one or more quality of life measures relating to patient information recorded on a substantially continuous basis or derived therefrom;",
            "components": [
                {
                    "component": "the database module staring the quality of life measures set into the patient care record for the individual patient into the database; and",
                    "subcomponents": []
                },
                {
                    "component": "the analyzer analyzing the quality of life measures in the physiological measures set relative to the other quality of life measures and determining therefrom an onset, a progression, a regression, and a status quo of myocardial ischemia.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A system according to claim 1 , further comprising:",
            "components": [
                {
                    "component": "the server system receiving a set of one or more baseline physiological measures relating to patient information recorded during an initial time period or derived therefrom;",
                    "subcomponents": []
                },
                {
                    "component": "the database module storing the baseline physiological measures set into the patient care record for the individual patient into the database; and",
                    "subcomponents": []
                },
                {
                    "component": "the analyzer analyzing the physiological measures in the physiological measures set relative to the baseline physiological measures and determining therefrom an onset, a progression, a regression, and a status quo of myocardial ischemia.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A system according to claim 1 , further comprising:",
            "components": [
                {
                    "component": "a comparison module retrieving the other physiological measures from measures sets for at least one of an individual patient, a peer group, and a overall patient population.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A method for analyzing a patient status for myocardial ischemia for use in automated patient care, comprising:",
            "components": [
                {
                    "component": "receiving a set of one or more physiological measures relating to patient information directly recorded by a medical device on a substantially continuous basis or derived therefrom;",
                    "subcomponents": []
                },
                {
                    "component": "storing the physiological measures set into a patient care record for an individual patient into a database; and",
                    "subcomponents": []
                },
                {
                    "component": "analyzing one or more of the physiological measures in the physiological measures set relative to one or more other physiological measures and determining therefrom an onset, a progression, a regression, and a status quo of myocardial ischemia.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A method according to claim 6 , further comprising:",
            "components": [
                {
                    "component": "analyzing the physiological measures in the physiological measures set relative to the other physiological measures and determining therefrom an onset, a progression, a regression, and a status quo of diseases other than myocardial ischemia.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A method according to claim 6 , further comprising:",
            "components": [
                {
                    "component": "receiving a set of one or more quality of life measures relating to patient information recorded on a substantially continuous basis or derived therefrom;",
                    "subcomponents": []
                },
                {
                    "component": "storing the quality of life measures set into the patient care record for the individual patient into the database; and",
                    "subcomponents": []
                },
                {
                    "component": "analyzing the quality of life measures in the physiological measures set relative to the other quality of life measures and determining therefrom an onset, a progression, a regression, and a status quo of myocardial ischemia.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A method according to claim 6 , further comprising:",
            "components": [
                {
                    "component": "receiving a set of one or more baseline physiological measures relating to patient information recorded during an initial time period or derived therefrom;",
                    "subcomponents": []
                },
                {
                    "component": "storing the baseline physiological measures set into the patient care record for the individual patient into the database; and",
                    "subcomponents": []
                },
                {
                    "component": "analyzing the physiological measures in the physiological measures set relative to the baseline physiological measures and determining therefrom an onset, a progression, a regression, and a status quo of myocardial ischemia.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A method according to claim 6 , further comprising:",
            "components": [
                {
                    "component": "retrieving the other physiological measures from measures sets for at least one of an individual patient, a peer group, and a overall patient population.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A computer-readable storage medium for a device holding code for performing the method according to claim 6 .",
            "components": []
        }
    ],
    "description": [
        "This patent application is a divisional of U.S. Ser. No. 10/116,654, filed on Apr. 4, 2002, now U.S. Pat. No. 6,827,690, issued Dec. 7, 2004; which is a continuation of U.S. Ser. No. 09/441,612, now filed on Nov. 16, 1999 U.S. Pat. No. 6,368,284, issued Apr. 9, 2002, the disclosures of which are incorporated by reference, and the priority filing dates of which are claimed.",
        "The present invention relates in general to myocardial ischemia (or myocardial infarction) diagnosis and analysis, and, in particular, to a system and method for providing diagnosis and monitoring of myocardial ischemia for use in automated patient care throughout disease onset, progression, regression, and status quo.",
        "Presently, myocardial ischemia, usually from the narrowing of the coronary arteries as a result of atherosclerosis, is one of the leading causes of cardiovascular disease-related deaths in the world. Clinically, myocardial ischemia involves a decreased oxygen and nutrient delivery to the myocardium resulting from diminished coronary artery blood flow which in turn leads primarily to abnormalities of left ventricular function and cardiac rhythm and the consequences thereof. Myocardial ischemia occurs when the demands of the heart for oxygen and nutrients are not met commensurately by available blood supply. The physiological effects of myocardial ischemia range from minimal to a complete failure of cardiac pumping function depending upon the degree of myocardial involvement and/or associated cardiac rhythm abnormalities. Clinical manifestations of myocardial ischemia include chest pain or discomfort (angina); respiratory distress, including shortness of breath; fatigue; reduced exercise capacity or tolerance; and nausea.",
        "Several factors make the early diagnosis and prevention of myocardial ischemia, as well as the monitoring of the progression of myocardial ischemia, relatively difficult. First, the onset of myocardial ischemia is generally subtle and sometimes occurs without any clinical manifestations perceptible to the patient. Often, the symptoms are mild and ignored. The patient may also compensate by changing his or her daily activities in an unconscious manner to minimize symptoms. As a result, myocardial ischemia can remain undiagnosed until more serious problems arise, such as severe congestive heart failure leading to cardiac arrest or pulmonary edema. Moreover, the susceptibility to suffer from myocardial ischemia depends upon the patient's age, sex, physical condition, and other factors, such as diabetes, blood pressure, cholesterol and homocystine levels. No one factor is dispositive. Finally, annual or even monthly checkups provide, at best, a “snapshot” of patient wellness and the incremental and subtle clinicophysiological changes which portend the onset or progression of myocardial ischemia often go unnoticed, even with regular health care. Documentation of subtle changes following initiation of therapy, that can guide and refine further evaluation and therapy, can be equally elusive.",
        "Nevertheless, taking advantage of frequently and regularly measured physiological measures, such as recorded manually by a patient, via an external monitoring or therapeutic device, or via implantable device technologies, can provide a degree of detection and prevention heretofore unknown. For instance, patients already suffering from some form of treatable heart disease often receive an implantable pulse generator (IPG), cardiovascular monitor, therapeutic device, or similar external wearable device, with which rhythm and structural problems of the heart can be monitored and treated. These types of devices are useful for detecting physiological changes in patient conditions through the retrieval and analysis of telemetered signals stored in an on-board, volatile memory. Typically, these devices can store more than thirty minutes of per heartbeat data recorded on a per heartbeat, binned average basis, or on a derived basis from, for example, a trial or ventricular electrical activity, ST and T wave electrocardiographic changes, coronary sinus blood flow and composition, cardiac enzyme release, minute ventilation, patient activity score, cardiac output score, mixed venous oxygen score, cardiovascular pressure measures, and the like. However, the proper analysis of retrieved telemetered signals requires detailed medical subspecialty knowledge, particularly by cardiologists.",
        "Alternatively, these telemetered signals can be remotely collected and analyzed using an automated patient care system. One such system is described in a related, commonly owned U.S. Pat. No. 6,312,378, issued Nov. 6, 2001, the disclosure of which is incorporated herein by reference. A medical device adapted to be implanted in an individual patient records telemetered signals that are then retrieved on a regular, periodic basis using an interrogator or similar interfacing device. The telemetered signals are downloaded via an internetwork onto a network server on a regular, e.g., daily, basis and stored as sets of collected measures in a database along with other patient care records. The information is then analyzed in an automated fashion and feedback, which includes a patient status indicator, is provided to the patient.",
        "While such an automated system can serve as a valuable tool in providing remote patient care, an approach to systematically correlating and analyzing the raw collected telemetered signals, as well as manually collected physiological measures, through applied cardiovascular medical knowledge to accurately diagnose the onset of a particular medical condition, such as myocardial ischemia, is needed. One automated patient care system directed to a patient-specific monitoring function is described in U.S. Pat. No. 5,113,869 ('869) to Nappholz et al. The '869 patent discloses an implantable, programmable electrocardiography (ECG) patient monitoring device that senses and analyzes ECG signals to detect ECG and physiological signal characteristics predictive of malignant cardiac arrhythmias. The monitoring device can communicate a warning signal to an external device when arrhythmias are predicted. Like the ECG morphology of malignant cardiac tachycardias, the electrocardiographic diagnosis of myocardial ischemia is well established and can be readily predicted using on-board signal detection techniques. However, the Nappholz device is limited to detecting tachycardias. The Nappholz device is patient specific and is unable to automatically take into consideration a broader patient or peer group history for reference to detect and consider the progression or improvement of myocardial ischemia. In addition, the Nappholz device does not take into account other physiological or chemical measures indicative of myocardial ischemia. Moreover, the Nappholz device has a limited capability to automatically self-reference multiple data points in time and cannot detect disease regression even in the individual patient. Also, the Nappholz device must be implanted and cannot function as an external monitor. Finally, the Nappholz device is incapable of tracking the cardiovascular and cardiopulmonary consequences of any rhythm disorder.",
        "Consequently, there is a need for a systematic approach to detecting trends in regularly collected physiological and chemical data indicative of the onset, progression, regression, or status quo of myocardial ischemia diagnosed and monitored using an automated, remote patient care system. The physiological data could be telemetered signals data recorded either by an external or an implantable medical device or, alternatively, individual measures collected through manual means. Preferably, such an approach would be capable of diagnosing both myocardial ischemia conditions, as well as the symptoms of other diseases. In addition, findings from individual, peer group, and general population patient care records could be integrated into continuous, on-going monitoring and analysis.",
        "The present invention provides a system and method for diagnosing and monitoring the onset, progression, regression, and status quo of myocardial ischemia using an automated collection and analysis patient care system. Measures of patient cardiovascular information are either recorded by an external or implantable medical device, such as an IPG, cardiovascular or heart failure monitor, or other therapeutic device, or manually through conventional patient-operable means. The measures are collected on a regular, periodic basis for storage in a database along with other patient care records. Derived measures are developed from the stored measures. Select stored and derived measures are analyzed and changes in patient condition are logged. The logged changes are compared to quantified indicator thresholds to detect the principal cardiovascular pathophysiological manifestations of myocardial ischemia: ST segment and/or T wave changes on the ECG, left ventricular wall motion changes, increased coronary sinus lactate production, increased serum creating kinase, increased serum troponin, increased ventricular arrhythmias, increased left ventricular end diastolic pressure, and reduced cardiac output.",
        "An embodiment of the present invention is an automated system and method for diagnosing and monitoring myocardial ischemia and outcomes thereof. A plurality of monitoring sets is retrieved from a database. Each of the monitoring sets includes recorded measures relating to patient information recorded on a substantially continuous basis. A patient status change is determined by comparing at least one recorded measure from each of the monitoring sets to at least one other recorded measure. Both recorded measures relate to the same type of patient information. Each patient status change is tested against an indicator threshold corresponding to the same type of patient information as the recorded measures that were compared. The indicator threshold corresponds to a quantifiable physiological measure of a pathophysiology indicative of myocardial ischemia.",
        "A further embodiment is an automated collection and analysis patient care system and method for diagnosing and monitoring myocardial ischemia and outcomes thereof. A plurality of monitoring sets is retrieved from a database. Each monitoring set includes recorded measures that each relate to patient information and include either medical device measures or derived measures calculable therefrom. The medical device measures are recorded on a substantially continuous basis. A set of indicator thresholds is defined. Each indicator threshold corresponds to a quantifiable physiological measure of a pathophysiology indicative of myocardial ischemia and relates to the same type of patient information as at least one of the recorded measures. A myocardial ischemia finding is diagnosed. A change in patient status is determined by comparing at least one recorded measure to at least one other recorded measure with both recorded measures relating to the same type of patient information. Each patient status change is compared to the indicator threshold corresponding to the same type of patient information as the recorded measures that were compared.",
        "A further embodiment is an automated patient care system and method for diagnosing and monitoring myocardial ischemia and outcomes thereof. Recorded measures organized into a monitoring set for an individual patient are stored into a database. Each recorded measure is recorded on a substantially continuous basis and relates to at least one aspect of monitoring angina, reduced exercise capacity and/or respiratory distress. A plurality of the monitoring sets is periodically retrieved from the database. At least one measure related to myocardial ischemia onset, progression, regression, and status quo is evaluated. A patient status change is determined by comparing at least one recorded measure from each of the monitoring sets to at least one other recorded measure with both recorded measures relating to the same type of patient information. Each patient status change is tested against an indicator threshold corresponding to the same type of patient information as the recorded measures that were compared. The indicator threshold corresponds to a quantifiable physiological measure of a pathophysiology indicative of angina, reduced exercise capacity and/or respiratory distress.",
        "The present invention provides a capability to detect and track subtle trends and incremental changes in recorded patient information for diagnosing and monitoring myocardial ischemia. When coupled with an enrollment in a remote patient monitoring service having the capability to remotely and continuously collect and analyze external or implantable medical device measures, myocardial ischemia detection, prevention, and tracking regression from therapeutic maneuvers become feasible.",
        "Still other embodiments of the present invention will become readily apparent to those skilled in the art from the following detailed description, wherein is described embodiments of the invention by way of illustrating the best mode contemplated for carrying out the invention. As will be realized, the invention is capable of other and different embodiments and its several details are capable of modifications in various obvious respects, all without departing from the spirit and the scope of the present invention. Accordingly, the drawings and detailed description are to be regarded as illustrative in nature and not as restrictive.",
        "FIG. 1 is a block diagram showing an automated collection and analysis patient care system for diagnosing and monitoring myocardial ischemia and outcomes thereof in accordance with the present invention;",
        "FIG. 2 is a database schema showing, by way of example, the organization of a device and derived measures set record for care of patients with myocardial ischemia stored as part of a patient care record in the database of the system of FIG. 1;",
        "FIG. 3 is a database schema showing, by way of example, the organization of a quality of life and symptom measures set record for care of patients with myocardial ischemia stored as part of a patient care record in the database of the system of FIG. 1;",
        "FIG. 4 is a database schema showing, by way of example, the organization of a combined measures set record for care of patients with myocardial ischemia stored as part of a patient care record in the database of the system of FIG. 1;",
        "FIG. 5 is a block diagram showing the software modules of the server system of the system of FIG. 1;",
        "FIG. 6 is a record view showing, by way of example, a set of partial patient care records for care of patients with myocardial ischemia stored in the database of the system of FIG. 1;",
        "FIG. 7 is a Venn diagram showing, by way of example, peer group overlap between the partial patient care records of FIG. 6;",
        "FIGS. 8A-8B are flow diagrams showing a method for diagnosing and monitoring myocardial ischemia and outcomes thereof using an automated collection and analysis patient care system in accordance with the present invention;",
        "FIG. 9 is a flow diagram showing the routine for retrieving reference baseline sets for use in the method of FIGS. 8A-8B;",
        "FIG. 10 is a flow diagram showing the routine for retrieving monitoring sets for use in the method of FIGS. 8A-8B;",
        "FIGS. 11A-11F are flow diagrams showing the routine for testing threshold limits for use in the method of FIGS. 8A-8B;",
        "FIG. 12 is a flow diagram showing the routine for evaluating the onset, progression, regression, and status quo of myocardial ischemia for use in the method of FIGS. 8A-8B;",
        "FIGS. 13A-13D are flow diagrams showing the routine for determining an onset of myocardial ischemia for use in the routine of FIG. 12;",
        "FIGS. 14A-14D are flow diagrams showing the routine for determining progression or worsening of myocardial ischemia for use in the routine of FIG. 12;",
        "FIGS. 15A-15D are flow diagrams showing the routine for determining regression or improving of myocardial ischemia for use in the routine of FIG. 12; and",
        "FIG. 16 is a flow diagram showing the routine for determining threshold stickiness (“hysteresis”) for use in the method of FIG. 12.",
        "FIG. 1 is a block diagram showing an automated collection and analysis patient care system 10 for diagnosing and monitoring myocardial ischemia in accordance with the present invention. An exemplary automated collection and analysis patient care system suitable for use with the present invention is disclosed in the related, commonly-owned U.S. Pat. No. 6,312,378, issued Nov. 6, 2001, the disclosure of which is incorporated herein by reference. Preferably, an individual patient 11 is a recipient of an implantable medical device 12, such as, by way of example, an IPG, cardiovascular or heart failure monitor, or therapeutic device, with a set of leads extending into his or her heart and electrodes implanted throughout the cardiopulmonary system. Alternatively, an external monitoring or therapeutic medical device 26, a subcutaneous monitor or device inserted into other organs, a cutaneous monitor, or even a manual physiological measurement device, such as an electrocardiogram or heart rate monitor, could be used. The implantable medical device 12 and external medical device 26 include circuitry for recording into a short-term, volatile memory telemetered signals stored for later retrieval, which become part of a set of device and derived measures, such as described below, by way of example, with reference to FIG. 2. Exemplary implantable medical devices suitable for use in the present invention include the Discovery line of pacemakers, manufactured by Guidant Corporation, Indianapolis, Ind., and the Gem line of ICDs, manufactured by Medtronic Corporation, Minneapolis, Minn.",
        "The telemetered signals stored in the implantable medical device 12 are preferably retrieved upon the completion of an initial observation period and subsequently thereafter on a continuous, periodic (daily) basis, such as described in the related, commonly-owned U.S. Pat. No. 6,221,011, issued Apr. 24, 2001, the disclosure of which is incorporated herein by reference. A programmer 14, personal computer 18, or similar device for communicating with an implantable medical device 12 can be used to retrieve the telemetered signals. A magnetized reed switch (not shown) within the implantable medical device 12 closes in response to the placement of a wand 13 over the site of the implantable medical device 12. The programmer 14 sends programming or interrogating instructions to and retrieves stored telemetered signals from the implantable medical device 12 via RF signals exchanged through the wand 13. Similar communication means are used for accessing the external medical device 26. Once downloaded, the telemetered signals are sent via an internetwork 15, such as the Internet, to a server system 16 which periodically receives and stores the telemetered signals as device measures in patient care records 23 in a database 17, as further described below, by way of example, with reference to FIGS. 2 and 3. An exemplary programmer 14 suitable for use in the present invention is the Model 2901 Programmer Recorder Monitor, manufactured by Guidant Corporation, Indianapolis, Ind.",
        "The patient 11 is remotely monitored by the server system 16 via the internetwork 15 through the periodic receipt of the retrieved device measures from the implantable medical device 12 or external medical device 26. The patient care records 23 in the database 17 are organized into two identified sets of device measures: an optional reference baseline 26 recorded during an initial observation period and monitoring sets 27 recorded subsequently thereafter. The device measures sets are periodically analyzed and compared by the server system 16 to indicator thresholds corresponding to quantifiable physiological measures of a pathophysiology indicative of myocardial ischemia, as further described below with reference to FIG. 5. As necessary, feedback is provided to the patient 11. By way of example, the feedback includes an electronic mail message automatically sent by the server system 16 over the internetwork 15 to a personal computer 18 (PC) situated for local access by the patient 11. Alternatively, the feedback can be sent through a telephone interface device 19 as an automated voice mail message to a telephone 21 or as an automated facsimile message to a facsimile machine 22, both also situated for local access by the patient 11. Moreover, simultaneous notifications can also be delivered to the patient's physician, hospital, or emergency medical services provider 29 using similar feedback means to deliver the information.",
        "The server system 10 can consist of either a single computer system or a cooperatively networked or clustered set of computer systems. Each computer system is a general purpose, programmed digital computing device consisting of a central processing unit (CPU), random access memory (RAM), non-volatile secondary storage, such as a hard drive or CD ROM drive, network interfaces, and peripheral devices, including user interfacing means, such as a keyboard and display. Program code, including software programs, and data are loaded into the RAM for execution and processing by the CPU and results are generated for display, output, transmittal, or storage, as is known in the art.",
        "The database 17 stores patient care records 23 for each individual patient to whom remote patient care is being provided. Each patient care record 23 contains normal patient identification and treatment profile information, as well as medical history, medications taken, height and weight, and other pertinent data (not shown). The patient care records 23 consist primarily of two sets of data: device and derived measures (D&DM) sets 24a, 24b and quality of life (QOL) sets 25a, 25b, the organization of which are further described below with respect to FIGS. 2 and 3, respectively. The device and derived measures sets 24a, 24b and quality of life and symptom measures sets 25a, 25b can be further logically categorized into two potentially overlapping sets. The reference baseline 26 is a special set of device and derived reference measures sets 24a and quality of life and symptom measures sets 25a recorded and determined during an initial observation period. Monitoring sets 27 are device and derived measures sets 24b and quality of life and symptom measures sets 25b recorded and determined thereafter on a regular, continuous basis. Other forms of database organization are feasible.",
        "The implantable medical device 12 and, in a more limited fashion, the external medical device 26, record patient information for care of patients with myocardial ischemia on a regular basis. The recorded patient information is downloaded and stored in the database 17 as part of a patient care record 23. Further patient information can be derived from recorded data, as is known in the art. FIG. 2 is a database schema showing, by way of example, the organization of a device and derived measures set record 40 for patient care stored as part of a patient care record in the database 17 of the system of FIG. 1. Each record 40 stores patient information which includes a snapshot of telemetered signals data which were recorded by the implantable medical device 12 or the external medical device 26, for instance, on per heartbeat, binned average or derived bases; measures derived from the recorded device measures; and manually collected information, such as obtained through a patient medical history interview or questionnaire. The following non-exclusive information can be recorded for a patient: a trial electrical activity 41, ventricular electrical activity 42, PR interval or AV interval 43, QRS measures 44, ST segment measures 45, T wave measures 46, QT interval 47, body temperature 48, posture 49, cardiovascular pressures 50, pulmonary artery diastolic pressure measure 51, cardiac output 52, systemic blood pressure 53, patient geographic location (altitude) 54, mixed venous oxygen score 55, arterial oxygen score 56, pulmonary measures 57, minute ventilation 58, potassium [K+] level 59, sodium [Na+] level 60, glucose level 61, blood urea nitrogen (BUN) and creatinine 62, acidity (pH) level 63, hematocrit 64, hormonal levels 65, cardiac injury chemical tests 66, serum creatinine kinase 67, serum troponin 68, left ventricular wall motion changes 69, myocardial blood flow 70, coronary sinus lactate production 71, cardiac injury chemical tests 72, central nervous system (CNS) injury chemical tests 73, central nervous system blood flow 74, interventions made by the implantable medical device or external medical device 75, and the relative success of any interventions made 76. In addition, the implantable medical device or external medical device communicates device-specific information, including battery status, general device status and program settings 77 and the time of day 78 for the various recorded measures. Other types of collected, recorded, combined, or derived measures are possible, as is known in the art.",
        "The device and derived measures sets 24a, 24b (shown in FIG. 1), along with quality of life and symptom measures sets 25a, 25b, as further described below with reference to FIG. 3, are continuously and periodically received by the server system 16 as part of the on-going patient care monitoring and analysis function. These regularly collected data sets are collectively categorized as the monitoring sets 27 (shown in FIG. 1). In addition, select device and derived measures sets 24a and quality of life and symptom measures sets 25a can be designated as a reference baseline 26 at the outset of patient care to improve the accuracy and meaningfulness of the serial monitoring sets 27. Select patient information is collected, recorded, and derived during an initial period of observation or patient care, such as described in the related, commonly-owned U.S. Pat. No. 6,221,011, issued Apr. 24, 2001, the disclosure of which is incorporated herein by reference.",
        "As an adjunct to remote patient care through the monitoring of measured physiological data via the implantable medical device 12 or external medical device 26, quality of life and symptom measures sets 25a can also be stored in the database 17 as part of the reference baseline 26, if used, and the monitoring sets 27. A quality of life measure is a semi-quantitative self-assessment of an individual patient's physical and emotional well-being and a record of symptoms, such as provided by the Duke Activities Status Indicator. These scoring systems can be provided for use by the patient 11 on the personal computer 18 (shown in FIG. 1) to record his or her quality of life scores for both initial and periodic download to the server system 16. FIG. 3 is a database schema showing, by way of example, the organization of a quality of life record 80 for use in the database 17. The following information is recorded for a patient: overall health wellness 81, psychological state 82, activities of daily living 83, work status 84, geographic location 85, family status 86, shortness of breath 87, energy level 88, exercise tolerance 89, chest discomfort 90, nausea 91, diaphoresis 92, and time of day 93, and other quality of life and symptom measures as would be known to one skilled in the art.",
        "The patient may also add non-device quantitative measures, such as the six-minute walk distance, as complementary data to the device and derived measures sets 24a, 24b and the symptoms during the six-minute walk to quality of life and symptom measures sets 25a, 25b.",
        "Other types of quality of life and symptom measures are possible, such as those indicated by responses to the Minnesota Living with Heart Failure Questionnaire described in E. Braunwald, ed., “Heart Disease—A Textbook of Cardiovascular Medicine,” pp. 452-454, W. B. Saunders Co. (1997), the disclosure of which is incorporated herein by reference. Similarly, functional classifications based on the relationship between symptoms and the amount of effort required to provoke them can serve as quality of life and symptom measures, such as the New York Heart Association (NYHA) classifications I, II, III and IV, for angina also described in Ibid.",
        "On a periodic basis, the patient information stored in the database 17 is analyzed and compared to pre-determined cutoff levels, which, when exceeded, can provide etiological indications of myocardial ischemia symptoms. FIG. 4 is a database schema showing, by way of example, the organization of a combined measures set record 95 for use in the database 17. Each record 95 stores patient information obtained or derived from the device and derived measures sets 24a, 24b and quality of life and symptom measures sets 25a, 25b as maintained in the reference baseline 26, if used, and the monitoring sets 27. The combined measures set 95 represents those measures most (but not exhaustively or exclusively) relevant to a pathophysiology indicative of myocardial ischemia and are determined as further described below with reference to FIGS. 8A-8B. The following information is stored for a patient: heart rate 96, heart rhythm (e.g., normal sinus vs. a trial fibrillation) 97, ST segment elevation 98, ST segment depression 99, T wave inversion (including changes) 100, pacing modality 101, pulmonary artery diastolic pressure 102, cardiac output 103, arterial oxygen score 104, mixed venous oxygen score 105, respiratory rate 106, transthoracic impedance 107, pressures 108, left ventricular wall motion changes 109, myocardial blood flow 110, coronary sinus lactate production 111, myocardial band creatinine kinase levels 112, troponin levels 113, patient activity score 114, posture 105, exercise tolerance quality of life and symptom measures 116, respiratory distress quality of life and symptom measures 117, chest discomfort quality of life and symptom measures 118, any interventions made to treat myocardial ischemia 119, including treatment by medical device, via drug infusion administered by the patient or by a medical device, surgery, and any other form of medical intervention as is known in the art, the relative success of any such interventions made 120, and time of day 121. Other types of comparison measures regarding myocardial ischemia are possible as is known in the art. In the described embodiment, each combined measures set 95 is sequentially retrieved from the database 17 and processed. Alternatively, each combined measures set 95 could be stored within a dynamic data structure maintained transitorily in the random access memory of the server system 16 during the analysis and comparison operations.",
        "FIG. 5 is a block diagram showing the software modules of the server system 16 of the system 10 of FIG. 1. Each module is a computer program written as source code in a conventional programming language, such as the C or Java programming languages, and is presented for execution by the CPU of the server system 16 as object or byte code, as is known in the art. The various implementations of the source code and object and byte codes can be held on a computer-readable storage medium or embodied on a transmission medium in a carrier wave. The server system 16 includes three primary software modules, database module 125, diagnostic module 126, and feedback module 128, which perform integrated functions as follows.",
        "First, the database module 125 organizes the individual patient care records 23 stored in the database 17 (shown in FIG. 1) and efficiently stores and accesses the reference baseline 26, monitoring sets 27, and patient care data maintained in those records. Any type of database organization could be utilized, including a flat file system, hierarchical database, relational database, or distributed database, such as provided by database vendors, such as Oracle Corporation, Redwood Shores, Calif.",
        "Next, the diagnostic module 126 makes findings of myocardial ischemia based on the comparison and analysis of the data measures from the reference baseline 26 and monitoring sets 27. The diagnostic module includes three modules: comparison module 130, analysis module 131, and quality of life module 132. The comparison module 130 compares recorded and derived measures retrieved from the reference baseline 26, if used, and monitoring sets 27 to indicator thresholds 129. The database 17 stores individual patient care records 23 for patients suffering from various health disorders and diseases for which they are receiving remote patient care. For purposes of comparison and analysis by the comparison module 130, these records can be categorized into peer groups containing the records for those patients suffering from similar disorders, as well as being viewed in reference to the overall patient population. The definition of the peer group can be progressively refined as the overall patient population grows. To illustrate, FIG. 6 is a record view showing, by way of example, a set of partial patient care records for care of patients with myocardial ischemia stored in the database 17 for three patients, Patient 1, Patient 2, and Patient 3. For each patient, three sets of peer measures, X, Y, and Z are shown. Each of the measures, X, Y, and Z, could be either collected or derived measures from the reference baseline 26, if used, and monitoring sets 27.",
        "The same measures are organized into time-based sets with Set 0 representing sibling measures made at a reference time t=0. Similarly, Set n−2, Set n−1 and Set n each represent sibling measures made at later reference times t=n−2, t=n−1 and t=n, respectively. Thus, for a given patient, such as Patient 1, serial peer measures, such as peer measure X0 through Xn, represent the same type of patient information monitored over time. The combined peer measures for all patients can be categorized into a health disorder- or disease-matched peer group. The definition of disease-matched peer group is a progressive definition, refined over time as the number of monitored patients grows. Measures representing different types of patient information, such as measures X0, Y0, and Z0, are sibling measures. These are measures which are also measured over time, but which might have medically significant meaning when compared to each other within a set for an individual patient.",
        "The comparison module 130 performs two basic forms of comparisons. First, individual measures for a given patient can be compared to other individual measures for that same patient (self-referencing). These comparisons might be peer-to-peer measures, that is, measures relating to a one specific type of patient information, projected over time, for instance, Xn, Xn−1, Xn−2, . . . X0, or sibling-to-sibling measures, that is, measures relating to multiple types of patient information measured during the same time period, for a single snapshot, for instance, Xn, Yn, and Zn, or projected over time, for instance, Xn, Yn, Zn, Xn−1, Yn−1, Zn−1, Xn−2, Yn−2, Zn−2, . . . X0, Y0, Z0. Second, individual measures for a given patient can be compared to other individual measures for a group of other patients sharing the same disorder- or disease-specific characteristics (peer group referencing) or to the patient population in general (population referencing). Again, these comparisons might be peer-to-peer measures projected over time, for instance, Xn, Xn′, Xn″, Xn−1, Xn−1′, Xn−1″, Xn−2, Xn−2′Xhd n−2″, . . . X0, X0°,XO″, or comparing the individual patient's measures to an average from the group. Similarly, these comparisons might be sibling-to-sibling measures for single snapshots, for instance, Xn, Xn′, Xn″, Yn, Yn′, Yn″, and Zn, Zn′, Zn″, or projected over time, for instance, Xn, Xn′, Xn″, Yn, Yn′, Yn″, Zn, Zn′, Zn″, Xn−1, Xn−1′, Xn−1″, Yn−1, Yn−1′, Yn−1″, Zn−1, Zn−1′, Zn−1″, Xn−2, Xn−2′, Xn−2″, Yn−2, Yn−2′, Yn−2″, Zn−2, Zn−2′, Zn−2″, . . . X0, X0′, X0″, Y0, Y0′, Y0″, and Z0, Z0′, Z0″. Other forms of comparisons are feasible, including multiple disease diagnoses for diseases exhibiting similar physiological measures or which might be a secondary disease candidate. Other forms of comparisons are feasible, including multiple disease diagnoses for diseases exhibiting similar abnormalities in physiological measures that might result from a second disease but manifest in different combinations or onset in different temporal sequences.",
        "FIG. 7 is a Venn diagram showing, by way of example, peer group overlap between the partial patient care records 23 of FIG. 1. Each patient care record 23 includes characteristics data 350, 351, 352, including personal traits, demographics, medical history, and related personal data, for patients 1, 2 and 3, respectively. For example, the characteristics data 350 for patient 1 might include personal traits which include gender and age, such as male and an age between 40-45; a demographic of resident of New York City; and a medical history consisting of anterior myocardial infraction, congestive heart failure and diabetes. Similarly, the characteristics data 351 for patient 2 might include identical personal traits, thereby resulting in partial overlap 353 of characteristics data 350 and 351. Similar characteristics overlap 354, 355, 356 can exist between each respective patient. The overall patient population 357 would include the universe of all characteristics data. As the monitoring population grows, the number of patients with personal traits matching those of the monitored patient will grow, increasing the value of peer group referencing. Large peer groups, well matched across all monitored measures, will result in a well known natural history of disease and will allow for more accurate prediction of the clinical course of the patient being monitored. If the population of patients is relatively small, only some traits 356 will be uniformly present in any particular peer group. Eventually, peer groups, for instance, composed of 100 or more patients each, would evolve under conditions in which there would be complete overlap of substantially all salient data, thereby forming a powerful core reference group for any new patient being monitored.",
        "Referring back to FIG. 5, the analysis module 131 analyzes the results from the comparison module 130, which are stored as a combined measures set 95 (not shown), to a set of indicator thresholds 129, as further described below with reference to FIGS. 8A-8B. Similarly, the quality of life module 132 compares quality of life and symptom measures 25a, 25b from the reference baseline 26 and monitoring sets 27, the results of which are incorporated into the comparisons performed by the comparison module 13, in part, to either refute or support the findings based on physiological “hard” data. Finally, the feedback module 128 provides automated feedback to the individual patient based, in part, on the patient status indicator 127 generated by the diagnostic module 126. As described above, the feedback could be by electronic mail or by automated voice mail or facsimile. The feedback can also include normalized voice feedback, such as described in the related, commonly-owned U.S. Pat. No. 6,203,495, issued Mar. 20, 2001, the disclosure of which is incorporated herein by reference. In addition, the feedback module 128 determines whether any changes to interventive measures are appropriate based on threshold stickiness (“hysteresis”) 133, as further described below with reference to FIG. 15. The threshold stickiness 133 can prevent fickleness in diagnostic routines resulting from transient, non-trending and non-significant fluctuations in the various collected and derived measures in favor of more certainty in diagnosis. In a further embodiment of the present invention, the feedback module 128 includes a patient query engine 134 which enables the individual patient 11 to interactively query the server system 16 regarding the diagnosis, therapeutic maneuvers, and treatment regimen. Conversely, the patient query engines 134 can be found in interactive expert systems for diagnosing medical conditions can interactively query the patient. Using the personal computer 18 (shown in FIG. 1), the patient can have an interactive dialogue with the automated server system 16, as well as human experts as necessary, to self assess his or her medical condition. Such expert systems are well known in the art, an example of which is the MYCIN expert system developed at Stanford University and described in Buchanan, B. & Shortlife, E., “RULE-BASED EXPERT SYSTEMS. The MYCIN Experiments of the Stanford Heuristic Programming Project,” Addison-Wesley (1984). The various forms of feedback described above help to increase the accuracy and specificity of the reporting of the quality of life and symptomatic measures.",
        "FIGS. 8A-8B are flow diagrams showing a method for diagnosing and monitoring myocardial ischemia and outcomes thereof 135 using an automated collection and analysis patient care system 10 in accordance with the present invention. First, the indicator thresholds 129 (shown in FIG. 5) are set (block 136) by defining a quantifiable physiological measure of a pathophysiology indicative of myocardial ischemia and relating to the each type of patient information in the combined device and derived measures set 95 (shown in FIG. 4). The actual values of each indicator threshold can be finite cutoff values, weighted values, or statistical ranges, as discussed below with reference to FIGS. 11A-11F. Next, the reference baseline 26 (block 137) and monitoring sets 27 (block 138) are retrieved from the database 17, as further described below with reference to FIGS. 9 and 10, respectively. Each measure in the combined device and derived measures set 95 is tested against the threshold limits defined for each indicator threshold 129 (block 139), as further described below with reference to FIGS. 11A-11F. The potential onset, progression, regression, or status quo of myocardial ischemia is then evaluated (block 140) based upon the findings of the threshold limits tests (block 139), as further described below with reference to FIGS. 13A-13D, 14A-14D, 15A-15D.",
        "In a further embodiment, multiple near-simultaneous disorders are considered in addition to primary myocardial ischemia. Primary myocardial ischemia is defined as the onset or progression of myocardial ischemia without obvious inciting cause. Secondary myocardial ischemia is defined as the onset or progression of myocardial ischemia (in a patient with or without pre-existing myocardial ischemia) from another disease process, such as coronary insufficiency, respiratory insufficiency, atrial fibrillation, and so forth. Other health disorders and diseases can potentially share the same forms of symptomatology as myocardial ischemia, such as congestive heart failure, respiratory insufficiency, pneumonia, exacerbation of chronic bronchitis, renal failure, sleep-apnea, stroke, anemia, atrial fibrillation, other cardiac arrhythmias, and so forth. If more than one abnormality is present, the relative sequence and magnitude of onset of abnormalities in the monitored measures becomes most important in sorting and prioritizing disease diagnosis and treatment.",
        "Thus, if other disorders or diseases are being cross-referenced and diagnosed (block 141), their status is determined (block 142). In the described embodiment, the operations of ordering and prioritizing multiple near-simultaneous disorders (box 151) by the testing of threshold limits and analysis in a manner similar to congestive heart failure as described above, preferably in parallel to the present determination, is described in the related, commonly-owned U.S. Pat. No. 6,440,066, issued Aug. 27, 2002, the disclosure of which is incorporated herein by reference. If myocardial ischemia is due to an obvious inciting cause, i.e., secondary myocardial ischemia, (block 143), an appropriate treatment regimen for myocardial ischemia as exacerbated by other disorders is adopted that includes treatment of secondary disorders, e.g., myocardial ischemia, respiratory insufficiency, atrial fibrillation, and so forth (block 144) and a suitable patient status indicator 127 for myocardial ischemia is provided (block 146) to the patient. Suitable devices and approaches to diagnosing and treating congestive heart failure, respiratory distress and atrial fibrillation are described in related, commonly-owned U.S. Pat. No. 6,336,903, issued Jan. 8, 2002; U.S. Pat. No. 6,398,728, issued Jun. 4, 2002; and U.S. Pat. No. 6,411,840, issued Jun. 25, 2002, the disclosures of which are incorporated herein by reference.",
        "Otherwise, if primary myocardial ischemia is indicated (block 143), a primary treatment regimen is followed (block 145). A patient status indicator 127 for myocardial ischemia is provided (block 146) to the patient regarding physical well-being, disease prognosis, including any determinations of disease onset, progression, regression, or status quo, and other pertinent medical and general information of potential interest to the patient.",
        "Finally, in a further embodiment, if the patient submits a query to the server system 16 (block 147), the patient query is interactively processed by the patient query engine (block 148). Similarly, if the server elects to query the patient (block 149), the server query is interactively processed by the server query engine (block 150). The method then terminates if no further patient or server queries are submitted.",
        "FIG. 9 is a flow diagram showing the routine for retrieving reference baseline sets 137 for use in the method of FIGS. 8A-8B. The purpose of this routine is to retrieve the appropriate reference baseline sets 26, if used, from the database 17 based on the types of comparisons being performed. First, if the comparisons are self referencing with respect to the measures stored in the individual patient care record 23 (block 152), the reference device and derived measures set 24a and reference quality of life and symptom measures set 25a, if used, are retrieved for the individual patient from the database 17 (block 153). Next, if the comparisons are peer group referencing with respect to measures stored in the patient care records 23 for a health disorder- or disease-specific peer group (block 154), the reference device and derived measures set 24a and reference quality of life and symptom measures set 25a, if used, are retrieved from each patient care record 23 for the peer group from the database 17 (block 155). Data for each measure (e.g., minimum, maximum, averaged, standard deviation (SD), and trending data) from the reference baseline 26 for the peer group is then calculated (block 156). Finally, if the comparisons are population referencing with respect to measures stored in the patient care records 23 for the overall patient population (block 157), the reference device and derived measures set 24a and reference quality of life and symptom measures set 25a, if used, are retrieved from each patient care record 23 from the database 17 (block 158). Minimum, maximum, averaged, standard deviation, and trending data and other numerical processes using the data, as is known in the art, for each measure from the reference baseline 26 for the peer group is then calculated (block 159). The routine then returns.",
        "FIG. 10 is a flow diagram showing the routine for retrieving monitoring sets 138 for use in the method of FIGS. 8A-8B. The purpose of this routine is to retrieve the appropriate monitoring sets 27 from the database 17 based on the types of comparisons being performed. First, if the comparisons are self referencing with respect to the measures stored in the individual patient care record 23 (block 160), the device and derived measures set 24b and quality of life and symptom measures set 25b, if used, are retrieved for the individual patient from the database 17 (block 161). Next, if the comparisons are peer group referencing with respect to measures stored in the patient care records 23 for a health disorder- or disease-specific peer group (block 162), the device and derived measures set 24b and quality of life and symptom measures set 25b, if used, are retrieved from each patient care record 23 for the peer group from the database 17 (block 163). Data for each measure (e.g., minimum, maximum, averaged, standard deviation, and trending data) from the monitoring sets 27 for the peer group is then calculated (block 164). Finally, if the comparisons are population referencing with respect to measures stored in the patient care records 23 for the overall patient population (block 165), the device and derived measures set 24b and quality of life and symptom measures set 25b, if used, are retrieved from each patient care record 23 from the database 17 (block 166). Minimum, maximum, averaged, standard deviation, and trending data and other numerical processes using the data, as is known in the art, for each measure from the monitoring sets 27 for the peer group is then calculated (block 167). The routine then returns.",
        "FIGS. 11A-11F are flow diagrams showing the routine for testing threshold limits 139 for use in the method of FIGS. 8A and 8B. The purpose of this routine is to analyze, compare, and log any differences between the observed, objective measures stored in the reference baseline 26, if used, and the monitoring sets 27 to the indicator thresholds 129. Briefly, the routine consists of tests pertaining to each of the indicators relevant to diagnosing and monitoring myocardial ischemia. The threshold tests focus primarily on: (1) changes to and rates of change for the indicators themselves, as stored in the combined device and derived measures set 95 (shown in FIG. 4) or similar data structure; and (2) violations of absolute threshold limits which trigger an alert. The timing and degree of change may vary with each measure and with the natural fluctuations noted in that measure during the reference baseline period. In addition, the timing and degree of change might also vary with the individual and the natural history of a measure for that patient.",
        "One suitable approach to performing the threshold tests uses a standard statistical linear regression technique using a least squares error fit. The least squares error fit can be calculated as follows:",
        "y\n        =\n        \n          \n            β\n            0\n          \n          +\n          \n            \n              β\n              1\n            \n            ⁢\n            x\n          \n        \n      \n    \n    \n      \n        (\n        1\n        )\n      \n    \n  \n  \n    \n      \n        β\n        =\n        \n          \n            S\n            ⁢\n            \n              \n            \n            ⁢\n            \n              S\n              xy\n            \n          \n          \n            S\n            ⁢\n            \n              \n            \n            ⁢\n            \n              S\n              xx\n            \n          \n        \n      \n    \n    \n      \n        (\n        2\n        )\n      \n    \n  \n  \n    \n      \n        \n          S\n          ⁢\n          \n            \n          \n          ⁢\n          \n            S\n            xy\n          \n        \n        =\n        \n          \n            \n              ∑\n              \n                i\n                =\n                1\n              \n              n\n            \n            ⁢\n            \n              \n                x\n                i\n              \n              ⁢\n              \n                y\n                i\n              \n            \n          \n          -\n          \n            \n              \n                (\n                \n                  \n                    ∑\n                    \n                      i\n                      =\n                      1\n                    \n                    n\n                  \n                  ⁢\n                  \n                    x\n                    i\n                  \n                \n                )\n              \n              ⁢\n              \n                (\n                \n                  \n                    ∑\n                    \n                      i\n                      =\n                      1\n                    \n                    n\n                  \n                  ⁢\n                  \n                    y\n                    i\n                  \n                \n                )\n              \n            \n            n\n          \n        \n      \n    \n    \n      \n        (\n        3\n        )\n      \n    \n  \n  \n    \n      \n        \n          S\n          ⁢\n          \n            \n          \n          ⁢\n          \n            S\n            xy\n          \n        \n        =\n        \n          \n            \n              ∑\n              \n                i\n                =\n                1\n              \n              n\n            \n            ⁢\n            \n              x\n              i\n              2\n            \n          \n          -\n          \n            \n              \n                (\n                \n                  \n                    ∑\n                    \n                      i\n                      =\n                      1\n                    \n                    n\n                  \n                  ⁢\n                  \n                    x\n                    i\n                  \n                \n                )\n              \n              2\n            \n            n\n          \n        \n      \n    \n    \n      \n        (\n        4\n        )\n      \n    \n  \n\n\n\n\nwhere n is the total number of measures, xi is the time of day for measure i, and y i is the value of measure i, β1 is the slope, and β0 is the y-intercept of the least squares error line. A positive slope β1 indicates an increasing trend, a negative slope β1 indicates a decreasing trend, and no slope indicates no change in patient condition for that particular measure. A predicted measure value can be calculated and compared to the appropriate indicator threshold 129 for determining whether the particular measure has either exceeded an acceptable threshold rate of change or the absolute threshold limit.",
        "For any given patient, three basic types of comparisons between individual measures stored in the monitoring sets 27 are possible: self referencing, peer group, and general population, as explained above with reference to FIG. 6. In addition, each of these comparisons can include comparisons to individual measures stored in the pertinent reference baselines 24.",
        "The indicator thresholds 129 for detecting a trend indicating progression into a state of myocardial ischemia or a state of imminent or likely myocardial ischemia, for example, over a one week time period, can be as follows:\n\n    \n    \n        (1) Heart rate (block 170): If the heart rate has increased over 1.0 SD from the mean heart rate in the reference baseline 26 (block 171), the increased heart rate and time span over which it occurs are logged in the combined measures set 95 (block 172).\n        (2) ST segment elevation (block 173): If the ST segment elevation on the electrocardiogram has increased over 1.0 SD from the mean ST segment elevation level in the reference baseline 26 (block 174), the increased ST segment elevation and time span over which it occurs are logged in the combined measures set 95 (block 175).\n        (3) ST segment depression (block 176): If the ST segment depression on the electrocardiogram has increased over 1.0 SD from the mean ST segment depression level in the reference baseline 26 (block 177), the increased ST segment depression and time span are logged in the combined measures set 95 (block 178).\n        (4) Creatinine kinase (block 179): If the myocardial creatinine kinase has increased over 1.0 SD from the mean myocardial creatinine kinase in the reference baseline 26 (block 180), the increased myocardial creatinine kinase and time span are logged in the combined measures set 95 (block 181).\n        (5) Troponin (block 182): If the myocardial troponin has increased over 1.0 SD from the mean myocardial troponin in the reference baseline 26 (block 183), the increased myocardial troponin and time span are logged in the combined measures set 95 (block 184).\n        (6) Coronary sinus lactate (block 185): If the coronary sinus lactate has increased over 1.0 SD from the mean coronary sinus lactate in the reference baseline 26 (block 186), the increased coronary sinus lactate and time span are logged in the combined measures set 95 (block 187).\n        (7) Myocardial blood flow (block 188): If the myocardial blood flow has decreased over 1.0 SD from the mean myocardial blood flow in the reference baseline 26 (block 189), the decreased myocardial blood flow and time span are logged in the combined measures set 95 (block 190).\n        (8) Cardiac output (block 191): If the cardiac output has decreased over 1.0 SD from the mean cardiac output in the reference baseline 26 (block 192), the decreased cardiac output and time span are logged in the combined measures set 95 (block 193).\n        (9) Pulmonary artery diastolic pressure (PADP) (block 194) reflects left ventricular filling pressure and is a measure of left ventricular dysfunction. Ideally, the left ventricular end diastolic pressure (LVEDP) should be monitored, but in practice is difficult to measure. Consequently, without the LVEDP, the PADP, or derivatives thereof, are suitable for use as an alternative to LVEDP in the present invention. If the PADP has increased over 1.0 SD from the mean PADP in the reference baseline 26 (block 195), the increased PADP and time span over which that increase occurs are logged in the combined measures set 95 (block 196). Other cardiac pressures or derivatives could also apply.\n        (10) Myocardial wall motion (block 197): If the myocardial wall motion has decreased over 1.0 SD from the mean myocardial wall motion in the reference baseline 26 (block 198), the decreased myocardial wall motion and time span are logged in the combined measures set 95 (block 199).\n        (11) Patient activity score (block 200): If the mean patient activity score has decreased over 1.0 SD from the mean patient activity score in the reference baseline 26 (block 201), the decreased patient activity score and time span are logged in the combined measures set 95 (block 202).\n        (12) Exercise tolerance quality of life (QOL) measures (block 203): If the exercise tolerance QOL has decreased over 1.0 SD from the mean exercise tolerance in the reference baseline 26 (block 204), the decrease in exercise tolerance and the time span over which it occurs are logged in the combined measures set 95 (block 205).\n        (13) Respiratory distress quality of life (QOL) measures (block 206): If the respiratory distress QOL measure has deteriorated by more than 1.0 SD from the mean respiratory distress QOL measure in the reference baseline 26 (block 207), the increase in respiratory distress and the time span over which it occurs are logged in the combined measures set 95 (block 208).\n        (14) QRS duration (block 209): The presence or absence of a QRS duration greater than or equal to 120 ms, like left bundle branch block, is determined and, if present (block 210), a prolonged QRS duration is logged (block 211).\n        (15) Atrial fibrillation (block 212): The presence or absence of atrial fibrillation (AF) is determined and, if present (block 213), atrial fibrillation is logged (block 214).\n        (16) Rhythm changes (block 215): The type and sequence of conduction abnormalities and rhythm measure changes is significant and is determined based on the timing of the relevant QRS duration measure and the relevant rhythm measure, such as sinus rhythm. For instance, a finding that the QRS duration has suddenly broadened may make relying upon ST segment or T wave changes as markers of myocardial ischemia difficult. Similarly, a rhythm measure change to atrial fibrillation may precipitate myocardial ischemia but rhythm measure changes should indicate therapy directions against atrial fibrillation rather than the primary onset of myocardial ischemia. Thus, if there are QRS duration changes and/or rhythm measure changes (block 216), the sequence of the QRS duration changes and the rhythm measure changes and associated time spans are logged (block 217).",
        "Note also that an inversion of the indicator thresholds 129 defined above could similarly be used for detecting a trend in disease regression. One skilled in the art would recognize that these measures would vary based on whether or not they were recorded during rest or during activity and that the measured activity score can be used to indicate the degree of patient rest or activity. The patient activity score can be determined via an implantable motion detector, for example, as described in U.S. Pat. No. 4,428,378, issued Jan. 31, 1984, to Anderson et al., the disclosure of which is incorporated herein by reference.",
        "The indicator thresholds 129 for detecting a trend towards a state of myocardial ischemia can also be used to declare, a priori, myocardial ischemia present, regardless of pre-existing trend data when certain limits are established, such as:\n\n    \n    \n        (1) An absolute limit of ST segment elevation (block 173) exceeding 2.0 mm in the absence of a QRS duration greater than or equal to 120 ms is an a priori definition of myocardial ischemia.\n        (2) An absolute limit of myocardial band creatinine kinase mass (block 179) above 5 ng/ml is an a priori definition of myocardial ischemia.\n        (3) An absolute limit of troponin-I (block 182) above 0.5 ng/ml is an a priori definition of myocardial ischemia.",
        "FIG. 12 is a flow diagram showing the routine for evaluating the onset, progression, regression and status quo of myocardial ischemia 140 for use in the method of FIGS. 8A and 8B. The purpose of this routine is to evaluate the presence of sufficient indicia to warrant a diagnosis of the onset, progression, regression, and status quo of myocardial ischemia. Quality of life and symptom measures 25a, 25b can be included in the evaluation (block 230) by determining whether any of the individual quality of life and symptom measures 25a, 25b have changed relative to the previously collected quality of life and symptom measures from the monitoring sets 27 and the reference baseline 26, if used. For example, an increase in the shortness of breath measure 87 and exercise tolerance measure 89 would corroborate a finding of myocardial ischemia. Similarly, a transition from NYHA Class II angina to NYHA Class III angina would indicate a deterioration or, conversely, a transition from NYHA Class III to NYHA Class II angina status would indicate improvement or progress. Incorporating the quality of life and symptom measures 25a, 25b into the evaluation can help, in part, to refute or support findings based on physiological data. Next, a determination as to whether any changes to interventive measures are appropriate based on threshold stickiness (“hysteresis”) is made (block 231), as further described below with reference to FIG. 15.",
        "The routine returns upon either the determination of a finding or elimination of all factors as follows. If a finding of myocardial ischemia was not previously diagnosed (block 232), a determination of disease onset is made (block 233), as further described below with reference to FIGS. 13A-13C. Otherwise, if myocardial ischemia was previously diagnosed (block 232), a further determination of either disease progression or worsening (block 234) or regression or improving (block 235) is made, as further described below with reference to FIGS. 14A-14C and 15A-15C, respectively. If, upon evaluation, neither disease onset (block 233), worsening (block 234) or improving (block 235) is indicated, a finding of status quo is appropriate (block 236) and noted (block 237). Otherwise, myocardial ischemia and the related outcomes are actively managed (block 238) through the administration of, non-exclusively, anticoagulation, antiplatelet drugs, beta-blockade, coronary vasodilators, afterload reduction, lipid lowering drugs, electrical therapies, mechanical therapies, and other therapies as are known in the art. The management of myocardial ischemia is described, by way of example, in E. Braunwald, ed., “Heart Disease—A Textbook of Cardiovascular Medicine,” Chs. 36-38, W. B. Saunders Co. (1997), the disclosure of which is incorporated herein by reference. The routine then returns.",
        "FIGS. 13A-13D are flow diagrams showing the routine for determining an onset of myocardial ischemia 233 for use in the routine of FIG. 12. Myocardial ischemia is possible based on three general symptom categories: reduced exercise capacity (block 244), respiratory distress (block 251), and increased chest discomfort (angina) (block 261). An effort is made to diagnose myocardial ischemia manifesting primarily as resulting in reduced exercise capacity (block 244), increased respiratory distress (block 251) and/or angina (block 261). Increased chest discomfort, or angina, can be a direct marker of myocardial ischemia. Reduced exercise capacity generally serves as a marker of low cardiac output and respiratory distress as a marker of increased left ventricular end diastolic pressure. Both reduced exercise capacity and respiratory distress may result from a myocardial wall motion abnormality that occurs in response to myocardial ischemia. The clinical aspects of acute myocardial ischemia (and infarction) are described, by way of example, in E. Braunwald, ed., “Heart Disease—A Textbook of Cardiovascular Medicine,” Chs. 1 and 36-38, W. B. Saunders Co. (1997), the disclosure of which is incorporated herein by reference.",
        "As primary cardiac disease considerations, multiple individual indications (blocks 240-243, 245-250, 252-260) should be present for the three respective principal symptom findings of myocardial ischemia related reduced exercise capacity (block 244), myocardial ischemia related respiratory distress (block 251), or myocardial ischemia related chest discomfort (block 261), to be indicated, both for disease onset or disease progression. The presence of primary key findings alone can be sufficient to indicate an onset of myocardial ischemia and secondary key findings serve to corroborate disease onset. Note the presence of any abnormality can trigger an analysis for the presence or absence of secondary disease processes, such as the presence of atrial fibrillation, pneumonia, or congestive heart failure. Secondary disease considerations can be evaluated using the same indications (see, e.g., blocks 141-144 of FIGS. 8A-8B), but with adjusted indicator thresholds 129 (shown in FIG. 5) triggered at a change of 0.5 SD, for example, instead of 1.0 SD.",
        "In the described embodiment, the reduced exercise capacity, respiratory distress, and chest discomfort findings (blocks 244, 251, 261) can be established by consolidating the respective individual indications (blocks 240-243, 245-250, 252-260) in several ways. First, in a preferred embodiment, each individual indication (blocks 240-243, 245-250, 252-260) is assigned a scaled index value correlating with the relative severity of the indication. For example, ST segment elevation (block 252) could be measured on a scale from ‘1’ to ‘5’ wherein a score of ‘1’ indicates no change in ST segment elevation from the reference point, a score of ‘2’ a 0.5 SD change, a score of ‘3’ a 1.0 SD change, a score of ‘4’ a 2.0 SD change, and a score of ‘5’ indicates a change exceeding 3.0 SD. The index value for each of the individual indications (blocks 240-243, 245-250, 252-260) can then either be aggregated or averaged with a result exceeding the aggregate or average maximum indicating an appropriate myocardial ischemia finding.",
        "Preferably, all scores are weighted depending upon the assignments made from the measures in the reference baseline 26. For instance, ST segment changes 98, 99 (shown in FIG. 4) could be weighted more heavily than heart rate 96 if the heart rate in the reference baseline 26 is particularly high at the outset, making the detection of further disease progression from increases in heart rate, less sensitive. In the described embodiment, ST segment elevation 98 receives the most weight in determining increased chest discomfort whereas new wall motion abnormalities 109 receive the most weight in determining a reduced exercise or respiratory distress finding.",
        "Alternatively, a simple binary decision tree can be utilized wherein each of the individual indications (blocks 240-243, 245-250, 252-260) is either present or is not present. All or a majority of the individual indications (blocks 240-243, 245-250, 252-260) should be present for the relevant myocardial ischemia finding to be affirmed.",
        "Other forms of consolidating the individual indications (blocks 240-243, 245-250, 252-260) are feasible.",
        "FIGS. 14A-14D are flow diagrams showing the routine for determining a progression or worsening of myocardial ischemia 234 for use in the routine of FIG. 12. The primary difference between the determinations of disease onset, as described with reference to FIGS. 13A-13D, and disease progression is the evaluation of changes indicated in the same factors present in a disease onset finding. Thus, a revised myocardial ischemia finding is possible based on the same three general symptom categories: reduced exercise capacity (block 274), respiratory distress (block 281), and chest discomfort (angina) (block 291). The same factors which need be indicated to warrant a diagnosis of myocardial ischemia onset are evaluated to determine disease progression.",
        "Similarly, FIGS. 15A-15D are flow diagrams showing the routine for determining a regression or improving of myocardial ischemia 235 for use in the routine of FIG. 12. The same factors as described above with reference to FIGS. 13A-13D and 14A-14D, trending in opposite directions from disease onset or progression, are evaluated to determine disease regression. As primary cardiac disease considerations, multiple individual indications (blocks 300-303, 305-310, 312-320) should be present for the three principal findings of myocardial ischemia related reduced exercise capacity (block 304), myocardial ischemia related respiratory distress (block 311), or myocardial ischemia related chest discomfort (block 321), to indicate disease regression.",
        "FIG. 16 is a flow diagram showing the routine for determining threshold stickiness (“hysteresis”) 231 for use in the method of FIG. 12. Stickiness, also known as hysteresis, is a medical practice doctrine whereby a diagnosis or therapy will not be changed based upon small or temporary changes in a patient reading, even though those changes might temporarily move into a new zone of concern. For example, if a patient measure can vary along a scale of ‘1’ to ‘10’ with ‘10’ being worse, a transient reading of ‘6,’ standing alone, on a patient who has consistently indicated a reading of ‘5’ for weeks will not warrant a change in diagnosis without a definitive prolonged deterioration first being indicated. Stickiness dictates that small or temporary changes require more diagnostic certainty, as confirmed by the persistence of the changes, than large changes would require for any of the monitored (device) measures. Stickiness also makes reversal of important diagnostic decisions, particularly those regarding life-threatening disorders, more difficult than reversal of diagnoses of modest import. As an example, automatic external defibrillators (AEDs) manufactured by Heartstream, a subsidiary of Agilent Technologies, Seattle, Wash., monitor heart rhythms and provide interventive shock treatment for the diagnosis of ventricular fibrillation. Once diagnosis of ventricular fibrillation and a decision to shock the patient has been made, a pattern of no ventricular fibrillation must be indicated for a relatively prolonged period before the AED changes to a “no-shock” decision. As implemented in this AED example, stickiness mandates certainty before a decision to shock is disregarded. In practice, stickiness also dictates that acute deteriorations in disease state are treated aggressively while chronic, more slowly progressing disease states are treated in a more tempered fashion.",
        "Thus, if the patient status indicates a status quo (block 330), no changes in treatment or diagnosis are indicated and the routine returns. Otherwise, if the patient status indicates a change away from status quo (block 330), the relative quantum of change and the length of time over which the change has occurred is determinative. If the change of approximately 0.5 SD has occurred over the course of about one month (block 331), a gradually deteriorating condition exists (block 332) and a very tempered diagnostic, and if appropriate, treatment program is undertaken. If the change of approximately 1.0 SD has occurred over the course of about one week (block 333), a more rapidly deteriorating condition exists (block 334) and a slightly more aggressive diagnostic, and if appropriate, treatment program is undertaken. If the change of approximately 2.0 SD has occurred over the course of about one day (block 335), an urgently deteriorating condition exists (block 336) and a moderately aggressive diagnostic, and if appropriate, treatment program is undertaken. If the change of approximately 3.0 SD has occurred over the course of about one hour (block 337), an emergency condition exists (block 338) and an immediate diagnostic, and if appropriate, treatment program is undertaken as is practical. Finally, if the change and duration fall outside the aforementioned ranges (blocks 331-338), an exceptional condition exists (block 339) and the changes are reviewed manually, if necessary. The routine then returns. These threshold limits and time ranges may then be adapted depending upon patient history and peer-group guidelines.",
        "The present invention provides several benefits. One benefit is improved predictive accuracy from the outset of patient care when a reference baseline is incorporated into the automated diagnosis. Another benefit is an expanded knowledge base created by expanding the methodologies applied to a single patient to include patient peer groups and the overall patient population. Collaterally, the information maintained in the database could also be utilized for the development of further predictive techniques and for medical research purposes. Yet a further benefit is the ability to hone and improve the predictive techniques employed through a continual reassessment of patient therapy outcomes and morbidity rates.",
        "Other benefits include an automated, expert system approach to the cross-referral, consideration, and potential finding or elimination of other diseases and health disorders with similar or related etiological indicators and for those other disorders that may have an impact on myocardial ischemia. Although disease specific markers will prove very useful in discriminating the underlying cause of symptoms, many diseases, other than myocardial ischemia, will alter some of the same physiological measures indicative of myocardial ischemia. Consequently, an important aspect of considering the potential impact of other disorders will be, not only the monitoring of disease specific markers, but the sequencing of change and the temporal evolution of more general physiological measures, for example heart rate, ECG ST-T wave changes, pulmonary artery diastolic pressure, and cardiac output, to reflect disease onset, progression or regression in more than one type of disease process.",
        "While the invention has been particularly shown and described as referenced to the embodiments thereof, those skilled in the art will understand that the foregoing and other changes in form and detail may be made therein without departing from the spirit and scope of the invention."
    ],
    "citations": [
        "3837339",
        "4142533",
        "4197856",
        "4531527",
        "4686999",
        "4803625",
        "4809697",
        "4852570",
        "4899758",
        "4958645",
        "4974607",
        "4987897",
        "5040536",
        "5113859",
        "5113869",
        "5133346",
        "5199428",
        "5301105",
        "5331549",
        "5336245",
        "5355889",
        "5357427",
        "5390238",
        "5416695",
        "5421343",
        "5437278",
        "5438983",
        "5464012",
        "5544661",
        "5553609",
        "5557514",
        "5576952",
        "5584868",
        "5591215",
        "5603331",
        "5660183",
        "5673691",
        "5687734",
        "5697959",
        "5704345",
        "5704366",
        "5711297",
        "5713350",
        "5720770",
        "5720771",
        "5724580",
        "5724983",
        "5738102",
        "5743267",
        "5897493",
        "5749907",
        "5749908",
        "5752976",
        "5769074",
        "5772586",
        "5772599",
        "5772604",
        "5778882",
        "5785650",
        "5785660",
        "5788640",
        "5792062",
        "5819251",
        "5855593",
        "5860918",
        "5876353",
        "5879375",
        "5891178",
        "5911132",
        "5931857",
        "5954640",
        "5957861",
        "5974124",
        "5987352",
        "5993386",
        "6004276",
        "6014581",
        "6024699",
        "6038469",
        "6047203",
        "6050940",
        "6063028",
        "6067466",
        "6073046",
        "6080106",
        "6083248",
        "6093146",
        "6095985",
        "6102856",
        "6122351",
        "6129675",
        "6135951",
        "6139494",
        "6152882",
        "6155267",
        "6168653",
        "6171237",
        "6171256",
        "6168563",
        "6223078",
        "6225901",
        "6234964",
        "6246992",
        "6249705",
        "6250309",
        "6263245",
        "6283923",
        "6287252",
        "6290646",
        "6302844",
        "6306088",
        "6336900",
        "6363282",
        "6368284",
        "6416471",
        "6428483",
        "6442433",
        "6454705",
        "6477424",
        "6662032",
        "6827670",
        "6913577",
        "2003/0055679",
        "0 342 859",
        "0 513 457",
        "0 531 889",
        "0 711 531",
        "WO 97/39792",
        "WO 98/01742",
        "WO 98/42103",
        "WO 99/46718",
        "WO 99/55226"
    ],
    "us_classification": "600513",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "61",
            "subclass": "B",
            "main_group": "5",
            "subgroup": "0452"
        }
    ]
}