{
    "title": "Top-load sink/laundry combo",
    "abstract": "An automatic washing machine including a drum, a sink, connection means for water and drain line, which are assembled in one integrated unit. It looks like a vanity with a built-in laundry machine and could be installed in any bathroom, kitchen or any utility room, mobile home, RV or even a boat having standard provision for sink connection. It could replace any existing standard sink giving customer an additional laundry capability.",
    "inventors": [
        "Usherovich",
        "Jemal",
        "Kan",
        "Mosionzhnik"
    ],
    "document_number": "07296443",
    "publication_date": "20071120",
    "assignees": [
        "Haier America Trading, LLC"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A top-load sink/laundry combo, comprising:",
            "components": [
                {
                    "component": "a cabinet;",
                    "subcomponents": []
                },
                {
                    "component": "a sink with a faucet mounted on the cabinet;",
                    "subcomponents": []
                },
                {
                    "component": "a water supply and drain line connected to the sink; and",
                    "subcomponents": []
                },
                {
                    "component": "an automatic top-loading washing machine including a drum, the automatic top-loading washing machine being connected to the water supply and the drain line and being pivotally attached to a first horizontally suspended rotation axle in a bottom of the cabinet, the washing machine having a vibration-proof connection to a front panel of the cabinet, which is pivotally attached to a second horizontal rotation axle on the front of the cabinet.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The top-load sink/laundry combo defined in claim 1 wherein said automatic top-loading washing machine includes a heater for drying.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The top-load sink/laundry combo defined in claim 2 wherein said sink/laundry combo has the built-in P-trap having a tank-like lower portion positioned to reduce vibration of the cabinet.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The top-load sink/laundry combo defined in claim 2 further including ventilation means directly connected to the drain line and bypassing the P-trap.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The top-load sink/laundry combo defined in claim 1 wherein said sink/laundry combo has a built-in P-trap having an expansion tank-like lowering lower portion positioned to reduce vibration of the cabinet.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A top-load sink/laundry combo, comprising:",
            "components": [
                {
                    "component": "a cabinet;",
                    "subcomponents": []
                },
                {
                    "component": "a sink with a faucet mounted on a top of the cabinet;",
                    "subcomponents": []
                },
                {
                    "component": "a water supply and a drain line connected to the sink;",
                    "subcomponents": []
                },
                {
                    "component": "an automatic top-loading washing machine, which is connected to the water supply and the drain line and is pivotally attached to a horizontally suspended rotation axle in a bottom of the cabinet,",
                    "subcomponents": []
                },
                {
                    "component": "the sink/laundry combo including a built-in P-trap, which is mounted flush to a wall positioned adjacent the cabinet, the P-trap including a lower expansion portion positioned to lower vibration of the cabinet.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The top-load sink/laundry combo defined in claim 6 wherein said automatic top-loading washing machine is fitted with a heater for drying.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The top-load sink/laundry combo defined in claim 7 further including ventilation means directly connected to the drain line and bypassing P-trap.",
            "components": []
        }
    ],
    "description": [
        "The vast majority of building apartments have no space and no provision for stationary washers or washer/dryer combo. So the laundry in such apartments is a problem. Portable washer is a kind of solution, but it is always on your way when used and it always takes your valuable storage space when unused.",
        "Washer/dryer combo, with condensation device similar to Automatic washing machine fitted for drying and described in a U.S. Pat. No. 5,588,313 do not requires ventilation, but is too heavy and bulky to be a convenient portable appliance. Well known are also built-in appliances like Compact top loading dishwasher suitable for fitting inside furniture units described in a U.S. Pat. No. 4,739,781. This design requires separate kitchen cabinet.",
        "Stationary sink/washer combination is patented in U.S. Pat. No. 3,026,699, Germany Patents #3409972 and #3429117 and also in Japan Patent # JP403075089A.",
        "Despite that the idea of Sink/Washer combo is generally not new, we don't have this product on a market because of complicated and troublesome installation.",
        "The invention relates to the field of automatic top-loading washing machines and washer/dryer combo and targeting improvements related to performance, installation and reliable operation.",
        "The Top-load Sink/Laundry Combo consists of an automatic washing machine with or without drying capacity and the sink, which is mounted on the top of the cabinet. All this is assembled in one integrated unit (concealed laundry).",
        "This combination utilizing the space under the sink for laundry machine by re-shaping both P-trap and the sink and provide the user with “Zero-space” stationary washer or washer/dryer combo. It is connected to water supply by standard flexible hoses and to drain line via modified flexible P-trap.",
        "It resembles a vanity with built-in laundry machine under the sink. It could replace any existing standard sink giving customer convenience of laundry capability. An additional advantage of this invention is in increased speed of the drying because a part of hot and humid air from a dryer is directed to the drain line behind the P-trap utilizing drain line's ventilation pipes.",
        "Special water container acting as a part of the drain system used as a counterweight, which decreases vibration caused by drum.",
        "FIG. 1 is an illustrative view of sink and washer combination. The drum with a front panel is shown in open position.",
        "FIG. 2 is an illustrative view of drum and front panel swings open.",
        "FIG. 3 is an illustrative view of pivotally mounted sink in closed position.",
        "FIG. 4 is an illustrative view of pivotally mounted sink in open position.",
        "FIG. 5 is an illustrative view of connections to the drain line.",
        "The top-load sink/laundry combo (see FIG. 1 and FIG. 5) consists of an automatic washing machine having a drum 1 and the sink 2 with a faucet 3, which is mounted on the top of the cabinet 4. All this is assembled in one integrated unit.",
        "The unit is connected to water supply by flexible hoses (hook-ups) like typical sink and to drain line 7 by drainpipe 14 via modified flexible P-trap 5. P-trap 5 is located under the sink 2 flush to the wall 6.",
        "Top-load units with horizontal rotation axle of the drum (required for tumbling) could be equipped with a heater, blower and vent and operate like washer-dryer combo.",
        "In a process of drying all hot and humid air could be directed outside via regular or retractable ventilation hose.",
        "When outside ventilation is not available a condensation device could be used. In order to increase the speed of the drying process at least part of the hot and humid air is directed via ventilation hose 9 and coupling 10 to the drain line's ventilation pipe 8 bypassing the P-trap 5.",
        "The check valve 11 prevents bad drain line's smell from returning back to dryer. In preferred embodiment (see FIG. 1) the drum 1 and adjacent laundry related mechanics are permanently suspended inside of the cabinet 4. However, it could be mounted pivotally or removable. This gives customer convenience of better access for loading/unloading operations by removing the laundry (drum section) out of the sink by sliding out of the cabinet (like a drawer), rotation around vertical axle (like a door) or rotation around horizontal axle 18 (like on FIG. 2).",
        "In order to minimize the force required for relocation of the drum while assuring the safety of operations a motion-absorbing device 17 is connected between the drum 1 and a front door 12. A position-securing device (bar) 15, which is connected to the front door, allows locking the door in any position and prevents the drum from rotation when the door is open. When door is closed the bar 15 is pushed down.",
        "Flexible P-trap 5 is positioned flush to the wall 6, which assures reliable connection during vibration and gives more space for a drum 1.",
        "In order to decrease vibration of the cabinet the lower part of a P-trap made with tank-like expansion 13, which accumulates a few gallons of running water. This expansion 13 is attached to the cabinet and increases its weight and stability. In addition the cabinet is connected to the wall with vibration-absorbing anchors.",
        "In different embodiment (see FIGS. 3 & 4) an access to the drum 1 is made by lifting the sink 2. The faucet is permanently attached to the top of the cabinet and sink is pivotally connected to horizontal axle. The water out of the sink will be drained via flexible drain line pipe 16. The drain hole of the sink could be moved off-center for space saving purposes. It could be done as well without flexible drain line pipe using pressure connection to the rigid drain line pipe under the sink."
    ],
    "citations": [
        "2444125",
        "2719071",
        "2959044",
        "3026699",
        "3039284",
        "3039286",
        "3071424",
        "3230961",
        "3504683",
        "3927452",
        "4081915",
        "4115485",
        "4535610",
        "5253493",
        "5706678",
        "5983520",
        "32 07 410",
        "34 09 972",
        "34 29 117",
        "39 31 226",
        "296 02 009",
        "56-27235",
        "3-75089",
        "10-23987",
        "2001-140313",
        "2003-125959",
        "2103449",
        "2106105"
    ],
    "us_classification": "68  3R",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "08",
            "subclass": "B",
            "main_group": "3",
            "subgroup": "12"
        }
    ]
}