{
    "title": "Process for preparing N6 substituted aminopurine ribofuranose nucleosides",
    "abstract": "An improved process for preparing N6 -substituted aminopurine ribofuranose nucleosides. Compounds of this type are known to be usefull in the prepartation of compounds having activitity at adenosine receptors, e.g. Adenosine A1 receptor. The process comprises the step of reacting a 6-halopurine ribofuranose nucleoside with an amine in the presence of CaCO3 , wherein acid is added to the reaction mixture.",
    "inventors": [
        "Berry",
        "Roberts",
        "Xie"
    ],
    "document_number": "07297787",
    "publication_date": "20071120",
    "assignees": [
        "Glaxo Group Limited"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A process wherein a N",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The process according to claim 1 wherein the 6-halopurine ribofuranose nucleoside is a 6-chloropurine ribofuranose nucleoside.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The process according to a claim 2 wherein the acid is selected from the group consisting of aliphatic and aromatic carboxylic acids, aliphatic and aromatic sulfonic acids, halogen acids, and mineral acids.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The process according to claim 3 wherein the acid is acetic acid.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The process according to claim 4 wherein the compound of formula (I) is (2S, 3S, 4R, 5R)-2-(5-tert-butyl-[1,3,4]oxadiazol-2-yl)-5-[6-(4-chloro-2-fluoro-phenylamino)-purin-9-yl]-tetrahydro-furan-3,4-diol.",
            "components": []
        }
    ],
    "description": [
        "This application is filed pursuant to 35 USC 371 as a United States National Phase Application of International Patent Application Serial No. PCT/GB02/01344 filed on Mar. 19, 2002, which claims priority from 0106867.5 filed on Mar. 20, 2001 in the United Kingdom.",
        "The present invention relates to an improved process for the preparation of N6-substituted aminopurine ribofuranose nucleosides. More particularly, the invention is concerned with an improved process for preparing N6-substituted aminopurine ribofuranose nucleosides by amination of the corresponding 6-halopurine ribofuranose nucleoside in the presence of CaCO3. Compounds of this type are known to be useful in the preparation of compounds having activity at adenosine receptors, e.g. the Adenosine A1 receptor.",
        "Adenosine A1 agonists and processes for their preparation are described in: EP0322242, WO97/43300, WO99/24449, WO99/24450, WO99/24452, WO99/67262, WO98/16539 (Novo Nordisk A/S); WO98/04126 (Rhone-Poulenc Rorer Pharmaceuticals Inc.); and WO98/01459 (Novo Nordisk A/S). For example, in WO99/67262 (Glaxo Group Limited), adenosine derivatives are prepared by reaction of a halopurine ribofuranose nucleoside with an amine either in the absence or presence of a solvent such as an alcohol, an ether, a substituted amide, a halogenated hydrocarbon, an aromatic hydrocarbon, dimethyl sulfoxide (DMSO) or acetonitrile, preferably at an elevated temperature, in the presence of a suitable acid scavenger, for example, inorganic bases such as sodium, cesium or potassium carbonate, or organic bases such as triethylamine, diisopropylethylamine or pyridine, optionally in the presence of a palladium catalyst and phosphine ligand.",
        "An alternative process for the preparation of arylamines is described in U.S. Pat. No. 5,576,460 (Buchwald). This process involves reacting an amine with an aryl halide compound in the presence of a nickel or palladium catalyst. The present inventors found, however, that when reacting 6-halopurine ribofuranose nucleosides with certain amines (e.g. 4-chloro-2-fluoroaniline), the process had low reproducibility and tended to give incomplete reaction and very low yield. The incomplete reaction, in addition to the necessity of removing the palladium heavy metal makes the process impractical for preparing certain 6-substituted aminopurine ribofuranose nucleosides.",
        "CaCO3 processes for preparing adenosine derivatives are described in Kwatra et al., (1987) J. Med. Chem. 30:954, Fleysher et al., (1969) J. Med. Chem. 12:1056 and Yadava et al. (1988) Himalayan Chem. Pharm Bull. 5:31. For example, Fleysher et al. describes the synthesis of N6-phenyladenosine from 6-chloropurine riboside in absolute ethanol in the presence of CaCO3. However, the present inventors found that when anilines of poor nucleophilicity like 4-cholor-2-fluoroaniline were reacted with 6-chloropurine riboside under these conditions, the reaction was slow and a significant amount of N6-aryladenine by-product was derived from cleavage of the glycosyl linkage. The reaction was also found to be sensitive to the choice of solvents, for example, it had no meaningful conversion in 2-methoxyethanol and provided only 25% yield of product in isopropanol.",
        "The problem to be solved by the present invention was therefore to provide an improved process for the preparation of N6-substituted aminopurine ribofuranose nucleosides.",
        "The present inventors have surprisingly found that when a CaCO3 process is used for preparing N6-substituted aminopurine ribofuranose nucleosides, the addition of acid at the start of the reaction accelerates the reaction, improves the yield, and/or reduces the quantity of acid hydrolysis by-products generated. It is surprising that the addition of acid improves the efficiency of the reaction instead of neutralising the base (CaCO3) and preventing the reaction. Previously, CaCO3 had been used as an acid scavenger (base) to promote reactions in which an acid was generated.",
        "Accordingly, the present invention provides a process for preparing N6-substituted aminopurine ribofuranose nucleosides comprising the step of reacting a 6-halopurine ribofuranose nucleoside (e.g. a 6-chloropurine ribofuranose nucleoside) with an amine (e.g. an aliphatic amine, alicyclic amine or aromatic amine) in the presence of CaCO3, characterised in that acid is added to the reaction mixture at the start of the reaction.",
        "A further aspect of the invention is the use of the process of the invention in the preparation of compounds which have activity at adenosine receptors, e.g. the Adenosine A1 receptor.",
        "A preferred aspect of the invention is the use of the process of the invention in the preparation of N6-aminopurine ribofuranose nucleosides as described in EP0322242, WO97/43300, WO99/24449, WO99/24450, WO99/24452, WO99/67262, WO98/16539 (Novo Nordisk A/S); WO98/04126 (Rhone-Poulenc Rorer Pharmaceuticals Inc.); and WO98/01459 (Novo Nordisk A/S) which are all incorporated herein by reference in their entirety.",
        "Another preferred aspect of the invention is a process for preparing a N6-substituted aminopurine ribofuranose nucleoside of formula (I):",
        "comprising the step of reacting a 6-halopurine ribofuranose nucleoside of formula (II) with an amine of formula (III) in the presence of CaCO3, characterised in that acid is added to the reaction mixture at the start of the reaction;\n\nwherein the 6-halopurine ribofuranose nucleoside of formula (II) and the amine of formula (III) are:",
        "wherein L represents halogen;\n\n    R2 represents C1-3alkyl, C1-3alkenyl, C1-3alkoxy, halogen or hydrogen;\n    R3 represents (i) hydrogen, (ii) C1-6alkyl optionally substituted by one or more halogens, (iii) C1-6 alkylOCH2— where the alkyl chain is optionally substituted by one or more halogens, (iv) an acetylene group, or (v) a 5-membered heterocyclic group optionally substituted by: C1-6alkoxy-, —C1-6alkylO(CH2)n— where n is 0-6, C3-7cycloalkyl, C1-6hydroxyalkyl, halogen or a —C1-6alkyl, —C1-6alkenyl or —C1-6alkynyl group optionally substituted by one or more halogens;\n    R4 and R5 independently represent hydrogen, acyl, —C1-6alkyl or a suitable protecting group (e.g. acetyl or a protecting group wherein R4 and R5 together form an alkylidene group);\n    R1 represents hydrogen or a group selected from:\n    (i) -(alk)n-(C3-9)cycloalkyl or -(alk)n-(C3-9)cycloalkenyl, said cycloalkyl or cycloalkenyl group being optionally substituted by one or more substituents selected from OH, halogen, C1-6alkyl, —C1-6alkoxy, C2-6alkenyloxy-, C2-6 alkynyloxy-, and phenyl, wherein (alk) represents C1-3alkyl and n represents 0 or 1, and said (alk) group may be optionally substituted by a C3-6cycloalkyl group;\n    (ii) a phenyl group optionally substituted by one or more substituents selected from: halogen, OH, CF3, cyano, —C1-6alkyl, —C2-6alkenyl, —C2-6alkynyl, C1-6alkoxy-, —C1-6alkylOH, —CO2H and —CO2C1-6 alkyl;\n    (iii) a C4-7aliphatic heterocyclic group containing at least one heteroatom selected from O, N and S, and optionally substituted by one or more substituents selected from: OH, —C1-6alkyl, —C1-6alkoxy, —CO2(C1-4)alkyl, —CO(C1-4)alkyl, —CO2aryl, and —CO2(alk)n(C3-6)cycloalkyl, wherein (alk) is C1-3alkyl and n represents 0 or 1;\n    (iv) a straight or branched C1-12alkyl group optionally substituted by one or more groups selected from phenyl, halogen, hydroxy, and C3-7 cycloalkyl, wherein one or more carbon atoms of the C1-12alkyl group may be optionally replaced by a group independently selected from S(═O)n (where n is 0, 1 or 2) and N; and\n    \n        (v) a fused bicyclic ring",
        "wherein A represents C4-6 cycloalkyl or phenyl and B represents phenyl optionally substituted by C1-3alkyl, and the bicyclic ring is attached to the purine-6-amino moiety via a ring atom of ring A.",
        "In an alternative aspect R1 represents:\n\n    (i) -(alk)n-(C3-9)cycloalkyl, including bridged cycloalkyl, optionally substituted by one or more substituents selected from: OH, halogen, —C1-3alkoxy, or phenyl wherein (alk) represents C1-3alkyl or C1-3alkylene and n represents 0 or 1;\n    (ii) a C4-7aliphatic heterocyclic group containing at least one heteroatom selected from O, N or S, and optionally substituted by one or more subsituents selected from: OH, —C1-6alkyl, —C1-6alkoxy —CO2(C1-4)alkyl, and —CO(C1-3alkyl);\n    (iii) a straight or branched C1-12 alkyl, optionally including one or more O, S(═O)n (where n is 0, 1 or 2) and N groups substituted within the alkyl chain, said alkyl optionally substituted by one or more of the following groups: phenyl, halogen, hydroxy or C3-7cycloalkyl;\n    (iv) a phenyl group optionally substituted by one or more substituents selected from: halogen, CF3, cyano, —C1-6 alkyl, —C2-6 alkenyl, —C1-6alkoxy, —C1-6 alkylOH, —CO2H and —CO2C1-6 alkyl.",
        "As used herein, the terms “alkyl” and “alkoxy” mean both straight and branched chain saturated hydrocarbon groups. Examples of alkyl groups include methyl, ethyl, propyl and butyl groups. Examples of alkoxy groups include methoxy and ethoxy groups. Other examples include propoxy and butoxy. The term “hydroxyalkyl” means both straight and branched chain saturated hydrocarbon groups substituted by a hydroxy group. Alkyl groups may be unsubstituted, or substituted with one to four substituents, preferably one to three substituents as defined hereinabove.",
        "One to three, preferably one or two, carbon atoms of an alkyl chain may be replaced by a group independently selected from S(═O)n (where n is 0, 1 or 2) and N. When the heteroatom N replaces a carbon atom in a C1-12alkyl group the N atom will, where appropriate be substituted by one or two substituents selected from hydrogen and C1-6alkyl.",
        "As used herein, the terms “alkenyl”, “alkynyl”, “alkenyloxy” and “alkynyloxy” mean both straight and branched chain unsaturated hydrocarbon groups. Examples of alkenyl groups include ethylene and propylene. Examples of alkynyl groups include ethynyl and propynyl. Examples of alkynyloxy groups include propynyloxy and ethynyloxy. Examples of alkenyloxy groups include propenyloxy and ethenyloxy.",
        "As used herein, the term “halo” or ‘halogen’ means fluorine, chlorine, bromine or iodine.",
        "As used herein, the term “acyl” means a straight or branched C1-6alkyl-C═O group.",
        "As used herein the term “aryl” means monocyclic or bicyclic aromatic carbocyclic groups such as phenyl or naphthyl, preferably phenyl.",
        "As used herein, the term “cycloalkyl” means an aliphatic group preferably having 3 to 9 carbon atoms in the ring system. The cycloalkyl group can be monocyclic or bicyclic. A bicyclic group may be fused or bridged. Preferably, the cycloalkyl group is monocyclic. Examples of monocyclic cycloalkyl groups include cyclopropyl, cyclobutyl, cyclopentyl, cyclohexyl and cycloheptyl. Another example of a monocyclic cycloalkyl group is cyclooctyl. Examples of bicyclic cycloalkyl groups include bicyclo[2.2.1]hept-2-yl. Cycloalkyl groups may be unsubstituted, or substituted with one to four substituents, preferably one or two substituents as defined hereinabove.",
        "As used herein, the term “cycloalkenyl” means a partially unsaturated aliphatic group having 3 to 9 carbon atoms in the ring system. The cycloalkenyl group can be monocyclic or bicyclic. Preferably, the cycloalkyl group is monocyclic. Examples of monocyclic cycloalkenyl groups include cyclopentenyl and cyclohexenyl. Cycloalkenyl groups may be unsubstituted, or substituted with one to four substituents, preferably one or two substituents as defined hereinabove.",
        "As used herein, the term “heterocyclic group” means rings containing one or more heteroatoms selected from: nitrogen, sulphur and oxygen. The heterocycle may be aromatic or non-aromatic, i.e., may be saturated, partially or fully unsaturated. Examples of 5-membered groups include isoxazole, oxadiazole, pyrazole, oxazole, triazole, tetrazole and thiadiazole.",
        "When the heteroatom N replaces a carbon atom in a C1-12alkyl group the N atom will, where appropriate be substituted by one or two substituents selected from hydrogen and C1-6alkyl.",
        "As used herein, the term “aliphatic heterocyclic group” as defined for R1 means a cyclic group of 4 to 7 carbon atoms wherein one or more of the carbon atoms is/are replaced by heteroatoms independently selected from nitrogen, oxygen or sulfur. This group may be unsubstituted, or substituted with one to four substituents, preferably one or two substituents as defined hereinabove. Examples of aliphatic heterocyclic groups include piperidinyl, tetrahydrofuranyl and tetrahydropyranyl.",
        "As used herein, the term “aliphatic amine” means an amine group comprising straight or branched chains of carbon atoms, saturated or unsaturated.",
        "As used herein, the term “alicyclic amine” means an amine group comprising at least one closed ring of carbon atoms, e.g. cycloalkyl groups.",
        "As used herein, the term “aromatic amine” means an amine group comprising at least one benzene ring.",
        "Preferably, L represents chlorine.",
        "Preferably, R2 represents halogen or hydrogen, more preferably hydrogen.",
        "Preferably, R3 represents an acetylene group, or a 5-membered heterocyclic group optionally substituted by a C1-4alkyl. Preferably the heterocyclic group is selected from an isoxazole, oxadiazole, pyrazole, oxazole, triazole, tetrazole or thiadiazole, more preferably an isoxazole, a 1,2,4- or 1,3,4-oxadiazole.",
        "Preferably R4 and R5 represent hydrogen, or together form an alkylidene group. More preferably, R4 and R5 together form an alkylidene group.",
        "Conveniently, R1 may represent (alk)n-C3-9cycloalkyl wherein n is 0 or 1 and the said cycloalkyl is either unsubstituted or substituted by at least one substituent selected from halogen, particularly fluorine, and OH. Alternatively the cycloalkyl group may be either unsubstituted or substituted by at least one substituent selected from —C1-6alkyl, C1-6alkoxy-, phenyl and OH. Further alternative substituents include at least one substituent selected from halogen, C2-6alkenyloxy-, and —C3-6 cycloalkyl. More preferably, the cycloalkyl group is unsubstituted or monosubstituted with OH or C1-3 alkyl, yet more preferably by OH. The cycloalkyl group may also be monosubstituted by C2-6alkenyloxy- or —C3-6cycloalkyl, or substituted by one or two halogen atoms. Preferably the cycloalkyl ring has 3 to 8 carbon atoms, more preferably 5 or 6 carbon atoms. Cycloalkyl groups include hydroxycyclopentyl or methoxycyclohexyl. Other cycloalkyl groups include propenyloxycyclohexyl, ethyloxycyclohexyl, difluorocyclohexyl, dicyclopropylmethyl, cyclooctyl and cycloheptyl. Preferably n is zero. When n is 1 and the (alk) group is substituted, substituents include cyclopropyl.",
        "R1 may represent (alk)n-(C3-9)cycloalkenyl wherein n is 0 or 1 and the said cycloalkenyl is unsubstituted or substituted by at least one substituent selected from —C1-6alkyl, C1-6alkoxy-, phenyl and OH. Alternative substituents include at least one substituent selected from halogen, —C2-6 alkenyloxy, and —C3-6cycloalkyl. Preferably n is zero. More preferably, the cycloalkenyl group is unsubstituted. Preferably the cycloalkenyl ring has 5 or 6 carbon atoms, more preferably the ring is cyclohexenyl.",
        "Alternatively, R1 may represent a substituted or unsubstituted aliphatic heterocyclic group, the substitutent being selected from C1-6alkyl, or —CO2(C1-4)alkyl. The substituent may also be —CO2phenyl or —CO2(alk)n(C3-6)cycloalkyl. Preferably the aliphatic heterocyclic ring is 6 membered and more preferably contains only one O, N or S heteroatom. Conveniently, the aliphatic heterocyclic group is unsubstituted or, when substituted, the substituent is —CO2(C1-4)alkyl or —CO2(alk)n(C3-6)cycloalkyl or —CO2phenyl, the heteroatom is N and the substituent is directly attached to said ring nitrogen atom. Preferably when the heterocycle is substituted with —CO2(C1-4)alkyl, the heteroatom is N and the substituent is directly attached to said ring nitrogen atom. Most preferably when the heterocyclic ring is unsubstituted the heteroatom is O. Most preferably when the heterocyclic ring is substituted the heteroatom is N.",
        "Alternatively, R1 may represent a straight or branched alkyl of 1-6 carbon atoms optionally with at least one S(═O)n and where S(═O)n is present, optionally substituted with N at a position adjacent to the S(═O)n group; where there is an group is preferred; where there is an S(═O)n in the chain, preferably n is 1 or 2, more preferably n is 2. The alkyl group conveniently may be unsubstituted or substituted by at least one OH group.",
        "Alternatively R1 may represent a phenyl group which is substituted by one or two substituents selected from OH, C1-6alkyl, particularly C1-4alkyl and halogen. Preferably the phenyl is disubstituted in the 2, 3 or 2, 4 or 2,5 positions. Preferably both substituents are halogen more particularly, fluorine and chlorine. For example, a particularly preferred combination is 2-fluoro and 4-chloro.",
        "In an alternative aspect the phenyl is monosubstituted by C1-6 alkyl, for example methyl.",
        "In a preferred aspect of the invention, R1 represents phenyl optionally substituted by halogen or C1-6alkyl, -(alk)n-C3-6 cycloalkyl optionally substituted by OH, or a C5-6 aliphatic heterocyclic group containing one heteroatom selected from O, N or S and optionally subsituted by —C1-6alkyl or —CO2C1-4alkyl.",
        "It is to be understood that the present invention covers all combinations of particular and preferred groups mentioned above.",
        "The process of the present invention involves the addition of acid to the reaction mixture at the start of the reaction. The addition of acid to the reaction mixture at the start of the reaction catalyses the reaction. Suitable acids include aliphatic and aromatic carboxylic acids, aliphatic and aromatic sulfonic acids, halogen acids (e.g. HCl, HBr, HI) or mineral acids (e.g. phosphoric acid, sulphuric acid, nitric acid). The acid is preferably acetic acid, p-toluenesulfonic acid, hydrochloric acid or trifluoroacetic acid, more preferably acetic acid or hydrochloric acid, most preferably acetic acid. Carboxylic acids may be used as a solvent for the amination of 6-halopurine nucleosides or added into the reaction mixture as a separate ingredient (i.e. as a catalyst). When the acid is added as a separate ingredient, suitable solvents include alcohols (MeOH, EtOH, propanol, isopropanol, t-butyl alcohol), toluene, N,N-dimethylformamide (DMF), dimethyl sulfoxide (DMSO), ethers and MeCN. The acid is preferably present in the range 5-20 mol % of the reaction mixture.",
        "The process of the invention is suitably carried out at elevated temperature. Preferably the temperature is in the range 50-120° C., more preferably 80-120° C., most preferably 85-95° C.",
        "Compounds of formula (II) may be prepared by any method known in the art. For example, a suitable method for the preparation of compounds of formula (II) is disclosed in WO99/67262. Compounds of formula (III) are well known in the art.",
        "The process of the invention can be used in the preparation of compounds which are active at adenosine receptor(s), by any method known in the art, for example as described in WO99/67262 EP0322242, WO97/43300, WO99/24449, WO99/24450, WO99/24452, WO99/67262, WO98/16539 (Novo Nordisk A/S); WO98/04126 (Rhone-Poulenc Rorer Pharmaceuticals Inc.); WO98/01459 (Novo Nordisk A/S) and as shown in the Examples. The compound may be an agonist or antagonist, but is preferably an agonist. It will be understood that the process of the invention can be used either in the preparation of an intermediate or in the preparation of a final compound. A further aspect of the invention is therefore the use of the process of the invention in the preparation of a compound which is active at one or more adenosine receptors, e.g. Adenosine A1 receptor, Adenosine A2a receptor. Another aspect of the invention is the use of the process of the invention in the preparation of an Adenosine A1 agonist, e.g. (2S, 3S, 4R, 5R)-2-(5 tert-butyl-[1,3,4]oxadiazol-2-yl)-5-[6-(4-chloro-2-fluoro-phenylamino)-purin-9-yl]-tetrahydro-furan-3,4-diol.",
        "The following examples illustrate aspects of this invention but should not be construed as limiting the scope of the invention in any way.",
        "(a)",
        "To a mixture of 40.0 g (95.1 mmol) of 9-[(3aR,4R,6S,6aS)-6-(5-tert-butyl-1,3,4-oxadiazol-2-yl)-2,2-dimethyltetrahydrofuro[3,4-d][1,3]dioxol-4-yl]-6-chloro-9H-purine and 9.52 g (95.1 mmol) of CaCO3 powder was successively added 200 mL of glacial acetic acid and 21.1 mL (190 mmol) of 4-chloro-2-fluoroaniline at ambient temperature under nitrogen. The light brown mixture was heated at 76° C. for 1.5 to 2.0 h. The mixture was cooled to below 30° C. and diluted with 200 mL of toluene. The mixture was concentrated to about 120 mL by distillation at 35-45° C. under vacuum below 50 torr. This azeotropic process was repeated with a second charge of 240 mL of toluene and distilled to about 200 mL. The above mixture was filtered by suction and the filtrate was concentrated to about 80 mL at 35-45° C. under vacuum to provide a toluene solution of crude product of N-{9-[(3aR,6S,6aS)-6-(5-tert-butyl-1,3,4-oxadiazol-2-yl)-2,2-dimethyltetrahydrofuro [3,4-d][1,3]dioxol-4-yl]-9H-purin-6-yl}N-(4-chloro-2-fluorophenyl)amine.",
        "(b)",
        "To the above mixture was added 160 mL of 19:1 mixture of trifluoroacetic acid and water over 10 min with ice water cooling. Upon completion of the deacetonization after 22 h at 0-5° C., the reaction was quenched by addition of 800 mL of 2.5 N NaOH over 15 min with ice-water cooling. The resultant white solid was filtered. The filtering cake was washed with 500 mL of water and briefly dried to give 62.3 g of crude product containing 4-chloro-2-fluoroaniline. Recrystallization from acetonitrile provided 34.3 g (74%) of (2S, 3S, 4R, 5R)-2-(5 tert-butyl-[1,3,4]oxadiazol-2-yl)-5-[6-(4-chloro-2-fluoro-phenylamino)-purin-9-yl]-tetrahydro-furan-3,4-diol as a crystalline white solid. 1H NMR (300 MHz) δ 1.31 (s, 9H), 4.81 (m, 1H), 4.99 (m, 1H), 5.17 (d, J=3 Hz, 1H), 5.92 (m, 1H), 6.16 (d, J=3 Hz, 1H), 7.32 (m, 1H), 7.51 (m, 1H), 7.64 (m, 1H), 8.24 (m, 1H), 8.52 (m, 1H), 9.74 (s, 1H).",
        "The table below shows the results of a controlled study comparing the literature method described in Fleysher, M. H. et al., J. Med. Chem. (1969) 12:1056 with the method of the present invention*.",
        "*To a mixture of 300 mg (0.713 mmol) of 9-[(3aR,4R,6S,6aS)-6-(5-tert-butyl-1,3,4-oxadiazol-2-yl)-2,2-dimethyltetrahydrofuro[3,4]-[ ][1,3]dioxol-4-yl]-6-chloro-9H-purine and 0.24 mL (2.14 mmol) of 4-chloro-2-fluoroaniline in 4.7 mL of absolute ethanol was successively added 0-143 mg (0-1.43 mmol) of CaCO3 powder and 0-35 μL (0-143 mmol) of 4 N HCl in 1,4-dioxane at ambient temperature. The mixture was heated at reflux and aliquot samples were taken at various time of the reaction. The samples were analysed by the HPLC method as follows. Column: Luna C18 50×2 mm, 3 μm; wavelength: 270 nm; flow rate: 1 mL/min at 40° C.; mobile phase A: H2O (0.05% TFA); mobile phase B: MeCN (0.05% TFA); gradient 0-95% B over 8 min. Peaks of the starting chloropurine nucleoside, the product N-{9-[(3aR,6S,6aS)-6-(5-tert-butyl-1,3,4-oxadiazol-2-yl)-2,2-dimethyltetrahydrofuro[3,4-d[1,3]dioxol-4-yl]-9H-purin-6-yl}-N-(4-chloro-2-fluorophenyl) and three major impurities derived from decomposition of the isoxazole and acetonide moieties were examined.",
        "Results\n\n\n\n\n\n\n\n\n\n\n\n\nStarting*\nMajor\n\n\n\nProduct*\nMaterial\nImpurities*\n\n\n\n\n\n\n\n\n\n\n\n\nReaction\n(AUC %)\n(AUC %)\n(AUC %)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nconditions\n1.5 h\n3.0 h\n1.5 h\n3.0 h\n1.5 h\n3.0 h\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA\nControl\n5.0\n64\n69\n16\n0\n 3.2\n\n\nB\n4N HCl (0.2 eq)\n71\n57\n4.6\n0\n10\n27\n\n\nC\nCaCO3 (2eq),\n69\n73\n8.7\n3.2\n4.5\n 7.7\n\n\n\n4N HCl (0.1 eq)\n\n\nD\nCaCO3 (2eq)\n17\n72**\n56\n1.2**\n0\n11**\n\n\n\n\n\n*The area under curve (AUC) readings for HPLC was not adjusted for 4-chloro-2-fluoroaniline.\n\n\n**These results were based on HPLC analysis after reflux for 5 hours.\n\n\nData for 3.0 h is not available.",
        "Compared with the CaCO3 method described in the literature, the method of the present invention is faster. After 1.5 h, the control reaction (no CaCO3, no HCl) had only 5% product, HCl reaction 71%, CaCO3/HCl reaction 69% and CaCO3 reaction 17%. These numbers demonstrate that addition of HCl to the reaction mixture increased reaction rate. CaCO3 appeared to reduce the level of impurities (compare impurity level for reactions B and C, 10% vs. 4.5% at the 1.5th h and 27% vs. 7.7% at the 3rd h). For results at the 3 h, the last reaction (D) is not a direct comparison due to the fact the numbers in ** were taken at the 5th hour.",
        "In addition to the above data, it should be noted that when acetic acid was used as catalyst/solvent in the presence of only one equivalent of CaCO3, HPLC showed 87% product, 1.7% starting material and only 2.5% impurities after only 1.0 h at 76° C.",
        "The controlled study not only confirmed the acceleration of the reaction, but also the reduction in the amount of by-product derived from the acid induced degradation."
    ],
    "citations": [
        "6492348",
        "6677316",
        "0 322 242",
        "97/43300",
        "98/01426",
        "98/01459",
        "98/16539",
        "99/24449",
        "99/24450",
        "99/24451",
        "99/67262",
        "00/75158"
    ],
    "us_classification": "536 2711",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "07",
            "subclass": "H",
            "main_group": "19",
            "subgroup": "167"
        }
    ]
}