{
    "title": "Compact apparatus for noninvasive measurement of glucose through near-infrared spectroscopy",
    "abstract": "A near IR spectrometer-based analyzer attaches continuously or semi-continuously to a human subject and collects spectral measurements for determining a biological parameter in the sampled tissue, such as glucose concentration. The analyzer includes an optical system optimized to target the cutaneous layer of the sampled tissue so that interference from the adipose layer is minimized. The optical system includes at least one optical probe. Spacing between optical paths and detection fibers of each probe and between probes is optimized to minimize sampling of the adipose subcutaneous layer and to maximize collection of light backscattered from the cutaneous layer. Penetration depth is optimized by limiting range of distances between paths and detection fibers. Minimizing sampling of the adipose layer greatly reduces interference contributed by the fat band in the sample spectrum, increasing signal-to-noise ratio. Providing multiple probes also minimizes interference in the sample spectrum due to placement errors.",
    "inventors": [
        "Acosta",
        "Henderson",
        "Abul-Haj",
        "Ruchti",
        "Monfre",
        "Blank",
        "Hazen"
    ],
    "document_number": "07299080",
    "publication_date": "20071120",
    "assignees": [
        "Sensys Medical, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An apparatus for noninvasive measurement of glucose through near-infrared spectroscopy, comprising:",
            "components": [
                {
                    "component": "a base module comprising a grating and a detector array;",
                    "subcomponents": []
                },
                {
                    "component": "a sampling module, configured to be securely and removeably attached to a sample site, and coupled to said base module, said sampling module comprising an illumination source;",
                    "subcomponents": []
                },
                {
                    "component": "an optic system configured to be located before and/or after said sample site for coupling said illumination source to said sample and said sample to said detector array;",
                    "subcomponents": []
                },
                {
                    "component": "an optical filter configured to be located between said illumination source and said sample site, wherein said optical filter comprises:",
                    "subcomponents": [
                        "a silicon filter for removing light under 1050 nm, wherein said grating can be used in the 1150 to 1850 nm region without detection of second or higher order light off of said grating, and"
                    ]
                },
                {
                    "component": "a silicon filter for removing light under 1050 nm, wherein said grating can be used in the 1150 to 1850 nm region without detection of second or higher order light off of said grating, and",
                    "subcomponents": []
                },
                {
                    "component": "a communication bundle for carrying optical and/or electrical signals between said base module and said sampling module, and for carrying power to said sampling module from said base module.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The apparatus of claim 1 , said optic system comprising any of:",
            "components": [
                {
                    "component": "an optical filter, a light blocker, and a standardization material.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The apparatus of claim 1 , said sampling module further comprising at least one of:",
            "components": [
                {
                    "component": "a low profile sampling interface;",
                    "subcomponents": []
                },
                {
                    "component": "a low wattage stabilized source in close proximity to said sampled site;",
                    "subcomponents": []
                },
                {
                    "component": "an excitation collection cavity or optics;",
                    "subcomponents": []
                },
                {
                    "component": "a guide;",
                    "subcomponents": []
                },
                {
                    "component": "a preheated interfacing solution;",
                    "subcomponents": []
                },
                {
                    "component": "means for maintaining a temperature controlled skin sample;",
                    "subcomponents": []
                },
                {
                    "component": "a mechanism for constant pressure and/or displacement of sampled skin tissue;",
                    "subcomponents": []
                },
                {
                    "component": "a photonic stimulation source; and",
                    "subcomponents": []
                },
                {
                    "component": "collection optics or fiber.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The apparatus of claim 1 , said sampling module further comprising:",
            "components": [
                {
                    "component": "a guide that is configured to be securely and removeably attached to said sampling site, said guide continuously and/or periodically physically and optically locating said sampling module relative to said sample site in a repeatable manner and with minimal disturbance to said sampling site.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The apparatus of claim 4 , further comprising:",
            "components": [
                {
                    "component": "means for pretreatment of said sample site to provide appropriate contact of said sampling module to said sampling site to reduce specular reflectance, to approach and maintain appropriate sampling site temperature variation, and to minimize sampling site hydration changes.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The apparatus of claim 4 , wherein said sampling module reversibly couples into said guide for reproducible contact pressure and/or sampling location.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The apparatus of claim 6 , said guide further comprising:",
            "components": [
                {
                    "component": "at least one magnet for aiding in positioning a sampling module probe to ensure proper penetration of said probe into a guide aperture, and to enable a constant pressure and/or displacement interface of said sampling site;",
                    "subcomponents": []
                },
                {
                    "component": "wherein said magnet is optionally electrically activated to facilitate controlled movement into a guide aperture and to allow, through reversal of said magnet poles, withdrawal from said guide aperture without pulling.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The apparatus of claim 6 , wherein said reversible coupling of said sampling module into said guide allows said sampling module to be removed and coupled to an intensity reference and/or a wavelength reference that have a same guide interface.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The apparatus of claim 8 , wherein said intensity reference comprises a 99% reflective material, and wherein said wavelength reference is polystyrene.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The apparatus of claim 1 , wherein said sampling module collects a diffusely reflected or transflected signal from said sampling site.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The apparatus of claim 1 , either of said base module and said sampling module comprising any of:",
            "components": [
                {
                    "component": "a wavelength reference standard; and",
                    "subcomponents": []
                },
                {
                    "component": "an intensity reference standard.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The apparatus of claim 1 , wherein said communication bundle is integrated between said sampling module and said base module.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The apparatus of claim 1 , wherein said sampling module and said base module are integrated together into a handheld unit.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The apparatus of claim 1 , said sampling module comprising:",
            "components": [
                {
                    "component": "a housing;",
                    "subcomponents": []
                },
                {
                    "component": "a reflector;",
                    "subcomponents": []
                },
                {
                    "component": "a lamp coupled to said reflector; and",
                    "subcomponents": []
                },
                {
                    "component": "a photodiode for monitoring said lamp and for maintaining said lamp's output by means of a lamp output controller.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The apparatus of claim 14 , wherein said reflector, and hence incident light emanating therefrom, is centered on an angle off of a normal to said sample site to allow room for a collection fiber.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The apparatus of claim 14 , wherein light is focused through said silicon filter onto an aperture at said sample site.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The apparatus of claim 14 , wherein said source, said housing, and said reflector are arranged to bring in source light nearly parallel to said sample site surface.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The apparatus of claim 1 , said sampling module further comprising:",
            "components": [
                {
                    "component": "a heater for maintaining said sampling site at a constant temperature.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The apparatus of claim 1 , said sampling module further comprising:",
            "components": [
                {
                    "component": "a detection fiber for collecting diffusely reflected light.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The apparatus of claim 1 , wherein said base module either resides on a support surface, or said base module may be worn by a person.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The apparatus of claim 1 , wherein said sampling module couple to any of a hand, finger, palmar region, base of thumb, forearm, volar aspect of the forearm, dorsal aspect of the forearm, upper arm, head, earlobe, eye, tongue, chest, torso, abdominal region, thigh, calf, foot, plantar region, and toe.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The apparatus of claim 1 , further comprising:",
            "components": [
                {
                    "component": "a docking station for said base module.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The apparatus of claim 1 , wherein said base module is coupled directly to said sampling module, with said communication bundle forming an integral part thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The apparatus of claim 1 , wherein said sampling module further comprises:",
            "components": [
                {
                    "component": "a housing providing a minimum of 6 O.D. blocking in ultraviolet, visible, and near-IR from 700 to 1000 nm.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The apparatus of claim 24 , wherein said housing comorises silicon.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The apparatus of claim 1 , said illumination source comprising:",
            "components": [
                {
                    "component": "a tungsten halogen source ranging in power from 0.05 W to 5 W.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The apparatus of claim 1 , said illumination source comprising:",
            "components": [
                {
                    "component": "at least one light emitting diode (LED).",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The apparatus of claim 1 , further comprising:",
            "components": [
                {
                    "component": "a photodiode, and",
                    "subcomponents": []
                },
                {
                    "component": "a feedback controller for allowing said illumination source to be driven at different levels at different points in time during and prior to data acquisition;",
                    "subcomponents": []
                },
                {
                    "component": "wherein said photodiode is placed before an optional order sorter to detect visible light from said illumination source; and",
                    "subcomponents": []
                },
                {
                    "component": "wherein said photodiode comprises any of a silicon, InGaAs, InPGaAs, PbS, and PbSe detector.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The apparatus of claim 1 , said illumination source further comprising:",
            "components": [
                {
                    "component": "a reflector having any of a parabolic, elliptical, and spherical shape.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The apparatus of claim 1 , wherein said sampling module further comprising:",
            "components": [
                {
                    "component": "folding optics for bringing light in at a low angle relative to said sampling site surface, wherein said folding optics optionally comprise any of a mirror and a focusing mirror.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The apparatus of claim 1 , said communication bundle further comprising:",
            "components": [
                {
                    "component": "quick connect optics which comprise:",
                    "subcomponents": [
                        "a first collection optic that is fixed into said communication bundle; and",
                        "a connector in said communication bundle for accepting a second collection optic that in turn couples to said base module."
                    ]
                },
                {
                    "component": "a first collection optic that is fixed into said communication bundle; and",
                    "subcomponents": []
                },
                {
                    "component": "a connector in said communication bundle for accepting a second collection optic that in turn couples to said base module.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. The apparatus of claim 31 , further comprising:",
            "components": [
                {
                    "component": "at least one optical device for coupling light by any of magnifying and de-magnifying lenses and folding mirrors.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. The apparatus of claim 32 , wherein said second collection optic is readily removed from said sampling module, allowing said sampling module to remain in contact with said sampling site.",
            "components": []
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The apparatus of claim 1 , wherein said illumination source further comprises a heat source.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. The apparatus of claim 1 , wherein said optical filter is located after said illumination source but not in contact with any of said sampling site and a coupling fluid.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. The apparatus of claim 1 , wherein said optical filter comprises:",
            "components": [
                {
                    "component": "at least two filters located between said illumination source and said sampling site, wherein a first filter removes heat, and wherein a second filter reduces spectral reflectance.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00037",
            "preamble": "37. The apparatus of claim 1 , wherein said optical filter comprises:",
            "components": [
                {
                    "component": "a filter comprising of any of the following:",
                    "subcomponents": [
                        "a filter that is a silicon longpass optic;",
                        "a filter that is coated to block a region in a wavelength range of 1900 to 2500 nm;",
                        "a filter that is antireflection-coated to match refractive indices and increase light throughput, and/or used in combination with a shortpass filters;",
                        "a filter that is coated with a blocker for removing a largest intensity of a black body curve of a typical tungsten halogen source that is not blocked by silicon, wherein said blocking band may cover any region from about 1800 nm on up to 3000 nm; and",
                        "a filter that is used in combination with an RG glass that cuts off at about 2500 nm to provide a bandpass filter passing light from approximately 1100 to 2500 nm, wherein said filter combination is optionally used in conjunction with a coating layer to provide a bandpass from 1100 to 1900 nm."
                    ]
                },
                {
                    "component": "a filter that is a silicon longpass optic;",
                    "subcomponents": []
                },
                {
                    "component": "a filter that is coated to block a region in a wavelength range of 1900 to 2500 nm;",
                    "subcomponents": []
                },
                {
                    "component": "a filter that is antireflection-coated to match refractive indices and increase light throughput, and/or used in combination with a shortpass filters;",
                    "subcomponents": []
                },
                {
                    "component": "a filter that is coated with a blocker for removing a largest intensity of a black body curve of a typical tungsten halogen source that is not blocked by silicon, wherein said blocking band may cover any region from about 1800 nm on up to 3000 nm; and",
                    "subcomponents": []
                },
                {
                    "component": "a filter that is used in combination with an RG glass that cuts off at about 2500 nm to provide a bandpass filter passing light from approximately 1100 to 2500 nm, wherein said filter combination is optionally used in conjunction with a coating layer to provide a bandpass from 1100 to 1900 nm.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00038",
            "preamble": "38. The apparatus of claim 1 , said sampling module further comprising:",
            "components": [
                {
                    "component": "a member shaped into a parabolic optic surrounding part of said illumination source, wherein an outside of said member comprises coating with a reflector.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00039",
            "preamble": "39. The apparatus of claim 38 , wherein said member comprises any of silicon and plastic.",
            "components": []
        },
        {
            "claim_number": "CLM-00040",
            "preamble": "40. The apparatus of claim 1 , said sampling module further comprising:",
            "components": [
                {
                    "component": "an illumination source filament that is wrapped around a collection fiber; and",
                    "subcomponents": []
                },
                {
                    "component": "a reflector for directing light into an aperture for admission therethrough to said sampling site, wherein said reflector optionally is any of surface coated for reflectance on an incident light surface, and transmissive with an outer surface of said reflector being reflectively coated.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00041",
            "preamble": "41. The apparatus of claim 40 , further comprising:",
            "components": [
                {
                    "component": "a window defined between said illumination source and said sampling site, said window optionally comprising a filter.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00042",
            "preamble": "42. The apparatus of claim 1 , said sampling module further comprising:",
            "components": [
                {
                    "component": "a broadband source operatively combined with a single element detector.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00043",
            "preamble": "43. The apparatus of claim 1 , said sampling module further comprising:",
            "components": [
                {
                    "component": "a Fabry-Perot interferometer.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00044",
            "preamble": "44. The apparatus of claim 1 , said sampling module comprising:",
            "components": [
                {
                    "component": "a surface defining an aperture for providing optical pathlengths within a sample for indirectly monitoring glucose concentrations within a body, providing acceptable energy delivery to said sampling site, and providing appropriate heating/temperature control of said sampling site;",
                    "subcomponents": []
                },
                {
                    "component": "wherein variation of said aperture affects a net analyte signal of a sampled tissue.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00045",
            "preamble": "45. The apparatus of claim 44 , further comprising:",
            "components": [
                {
                    "component": "a fiber optic collection fiber placed in a center of an illumination area defined by said aperture.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00046",
            "preamble": "46. The apparatus of claim 44 , further comprising:",
            "components": [
                {
                    "component": "means for performing an indirect determination of glucose from sample constituents which comprise any of fat, protein, and water and that are distributed as a function of depth in a sample, wherein a magnitude of an indirect signal varies with said aperture.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00047",
            "preamble": "47. The apparatus of claim 44 , further comprising:",
            "components": [
                {
                    "component": "a removable plug for placement in said aperture to stabilize tissue at said sampling site by providing a same tissue displacement as a probe.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00048",
            "preamble": "48. The apparatus of claim 44 , further comprising:",
            "components": [
                {
                    "component": "a contact window for allowing a continuous barrier for hydration of said sampling site and a constant pressure interface.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00049",
            "preamble": "49. The apparatus of claim 1 , wherein said sampling module is semi-permanently attached to said sampling site with a replaceable adhesive.",
            "components": []
        },
        {
            "claim_number": "CLM-00050",
            "preamble": "50. The apparatus of claim 1 , sampling module further comprising any of:",
            "components": [
                {
                    "component": "means for any of photonic stimulation, ultrasound pretreatment, mechanical stimulation, cooling, and heating.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00051",
            "preamble": "51. The apparatus of claim 1 , sampling module further comprising any of:",
            "components": [
                {
                    "component": "an LED for providing photonic stimulation to induce capillary blood vessel dilation.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00052",
            "preamble": "52. The apparatus of claim 1 ; further comprising:",
            "components": [
                {
                    "component": "a coupling fluid disposed between said sampling module and said sampling site for coupling incident photons into a tissue sample, wherein said coupling fluid is optionally preheated to minimize changes to a surface temperature of said sampling site, and minimize spectral changes observed from said tissue sample, wherein said coupling fluid, if preheated, is preheated using any of illumination source energy, sampling site heater energy, and an auxiliary heat source.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00053",
            "preamble": "53. The apparatus of claim 1 , further comprising:",
            "components": [
                {
                    "component": "means for automated delivery of a coupling fluid prior to sampling.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00054",
            "preamble": "54. The apparatus of claim 1 , said sampling module further comprising:",
            "components": [
                {
                    "component": "a collection fiber placed into an aperture formed through a base, said collection fiber being in contact with a sampling site surface.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00055",
            "preamble": "55. The apparatus of claim 1 , further comprising:",
            "components": [
                {
                    "component": "means for using any of a signal and an absence of observed intensity at large water absorbance bands near 1450, 1900, and 2500 nm to determine when said sampling module is in good spectral contact with a sampling site surface.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00056",
            "preamble": "56. The apparatus of claim 1 , wherein said base module further comprises:",
            "components": [
                {
                    "component": "a two-way wireless communication system for transferring data, between said base module and any of said sampling module and a data collection/processing system.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00057",
            "preamble": "57. The apparatus of claim 1 , further comprising:",
            "components": [
                {
                    "component": "means for standardizing a wavelength axis of near-IR based on a comparative analysis of a master and slave spectra of a standardization material.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00058",
            "preamble": "58. The apparatus of claim 57 , said means for standardizing comprising:",
            "components": [
                {
                    "component": "a material having absorption bands in a targeted wavelength region for determining said x-axis, said material comprising any of polystyrene, erbium oxide, dysprosium oxide, and holmium oxide.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00059",
            "preamble": "59. The apparatus of claim 57 , wherein said material used for standardization is any of:",
            "components": [
                {
                    "component": "measured external to said base module;",
                    "subcomponents": []
                },
                {
                    "component": "measured continuously and mounted within said base module in a separate light path, wherein said internal wavelength standard is measured simultaneously with said sample;",
                    "subcomponents": []
                },
                {
                    "component": "moved through an actuator into a main optical train at an appropriate time;",
                    "subcomponents": []
                },
                {
                    "component": "wherein a reference spectrum is collected in any of a transmittance mode, reflectance mode, or a diffuse reflectance mode.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00060",
            "preamble": "60. The apparatus of claim 57 , further comprising:",
            "components": [
                {
                    "component": "means for measuring a reference spectrum and a standardization spectrum through spectroscopic measurement of a non-absorbing material and a material with known and immutable spectral absorbance bands, respectively.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00061",
            "preamble": "61. The apparatus of claim 60 , said means for measuring further comprising:",
            "components": [
                {
                    "component": "a master spectrum of a standardization material; and",
                    "subcomponents": []
                },
                {
                    "component": "means for determining a discrepancy between said master spectrum and an instrument standardization spectrum;",
                    "subcomponents": []
                },
                {
                    "component": "wherein said master spectrum and wavelength regions are optionally stored in a nonvolatile memory.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00062",
            "preamble": "62. The apparatus of claim 61 , wherein at least one window across a spectrum of said x-axis phase shift between said master spectrum and an acquired spectrum are determined through a cross-correlation function after removing instrument related baseline variations, wherein said phase shift is used to correct said x-axis of said acquired spectrum to said master spectrum.",
            "components": []
        },
        {
            "claim_number": "CLM-00063",
            "preamble": "63. The apparatus of claim 1 , said base module further comprising:",
            "components": [
                {
                    "component": "means for bias correcting spectral data collected in one or both of the X (spectra) and Y (glucose concentration) data.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00064",
            "preamble": "64. The apparatus of claim 1 , said base module further comprising:",
            "components": [
                {
                    "component": "means for calibrating to an individual or a group of individuals based upon a calibration data set comprised of paired data points of processed spectral measurements and reference biological parameter values.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00065",
            "preamble": "65. The apparatus of claim 64 , wherein for glucose measurement, said reference values comprise at least one of the following: finger capillary blood glucose, alternate site capillary blood glucose at a site on the body other than the finger, interstitial glucose, or venous blood glucose.",
            "components": []
        },
        {
            "claim_number": "CLM-00066",
            "preamble": "66. The apparatus of claim 1 , wherein said base module is integrally connected to a docking station; wherein said docking station comprises a computer and a glucose management center; wherein said glucose management center keeps track of events occurring in time which may include any of glucose intake, insulin delivery, and determined glucose concentration.",
            "components": []
        },
        {
            "claim_number": "CLM-00067",
            "preamble": "67. The apparatus of claim 1 , said base module further comprising:",
            "components": [
                {
                    "component": "means for estimating precision of measurement through a statistical analysis of repeated or successive measurements; and",
                    "subcomponents": [
                        "means for determining when a biological parameter is close to a preset lever through a statistical estimate of confidence limits of a future analyte prediction made through a simple slope (change in said biological parameter over change in time) estimate based on an exponentially moving average, where said confidence limits are based upon said estimate of precision."
                    ]
                },
                {
                    "component": "means for determining when a biological parameter is close to a preset lever through a statistical estimate of confidence limits of a future analyte prediction made through a simple slope (change in said biological parameter over change in time) estimate based on an exponentially moving average, where said confidence limits are based upon said estimate of precision.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00068",
            "preamble": "68. The apparatus of claim 1 , said base module further comprising:",
            "components": [
                {
                    "component": "means for determining when a biological parameter is close to a preset level through a standard time series analysis; wherein an alarm is invoked if an associated present alarm level is within a confidence interval of a future biological parameter prediction.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00069",
            "preamble": "69. The apparatus of claim 1 , either of said sampling module and said base module further comprising:",
            "components": [
                {
                    "component": "means for taking any of continuous and semi-continuous measurements when said sampling module is in contact with said sampling site.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00070",
            "preamble": "70. The apparatus of claim 1 , said base module further comprising:",
            "components": [
                {
                    "component": "means for using time based information and trends to perform various functions, comprising any of: estimation of precision, estimation of confidence intervals, and prediction of future events.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00071",
            "preamble": "71. The apparatus of claim 1 , further comprising:",
            "components": [
                {
                    "component": "a link provided to an insulin delivery system to provide a feedback mechanism for control purposes.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00072",
            "preamble": "72. The apparatus of claim 1 , any of said base module and said sampling module comprising:",
            "components": [
                {
                    "component": "a spectrometer system comprising LEDs to provide near-infrared radiation to said sample site over predefined wavelength ranges, wherein each of said LED's provides near-infrared radiation over a band of wavelengths.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00073",
            "preamble": "73. The apparatus of claim 72 , wherein wavelengths of said LED's are selected specifically to optimize a signal-to-noise ratio of a net analyte signal of a target analyte, and are arranged at various distances with respect to detection elements to provide a means for sampling various tissue volumes for purposes of averaging and determination of a differential measurement.",
            "components": []
        },
        {
            "claim_number": "CLM-00074",
            "preamble": "74. The apparatus of claim 72 , wherein said LED's are sequentially energized one at a time and/or in groups to obtain various estimates of diffuse reflectance of various tissue volumes at specific wavelengths or bands of wavelengths.",
            "components": []
        },
        {
            "claim_number": "CLM-00075",
            "preamble": "75. The apparatus of claim 72 , wherein said LED's are pulsed to provide short measurements with high signal-to-noise ratios to provide greater illumination intensity while avoiding photo heating of a sampled tissue volume.",
            "components": []
        },
        {
            "claim_number": "CLM-00076",
            "preamble": "76. The apparatus of claim 72 , wherein said LED's are modulated at a particular duty cycle and frequency to remove additive noise and to provide simultaneous measurement of multiple wavelengths.",
            "components": []
        },
        {
            "claim_number": "CLM-00077",
            "preamble": "77. The apparatus of claim 72 , wherein said LED's illuminate said sample site directly.",
            "components": []
        },
        {
            "claim_number": "CLM-00078",
            "preamble": "78. The apparatus of claim 72 , further comprising:",
            "components": [
                {
                    "component": "a mixing chamber with a reflective surface located between said LED's and an optical window to provide a nearly uniform distribution onto a sample tissue region surrounding a detectioh fiber, wherein each LED is optionally recessed into a material, having a reflective surface.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00079",
            "preamble": "79. The apparatus of claim 72 , wherein groups of LED's are employed with each group associated with a single filter type, and wherein said LED's are arranged at distances surrounding a detection fiber and energized to enable detection of light associated with different wavelength bands and different illumination to detection distances.",
            "components": []
        },
        {
            "claim_number": "CLM-00080",
            "preamble": "80. The apparatus of claim 79 , wherein said groups of LED's are arranged in any of:",
            "components": [
                {
                    "component": "annuli (rings) at specific distances surrounding said detection fiber, wherein said filters are arranged in rings surrounding said detection fiber and covering associated LED's; and",
                    "subcomponents": []
                },
                {
                    "component": "wedges surrounding said detection fiber, wherein said filters are either of a wedged or triangular shape and are arranged to cover associated LED's.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00081",
            "preamble": "81. The apparatus of claim 79 , wherein each LED or group of LED's has an associated optical filter that is used to limit a bandwidth of emitted light, wherein a different filter is mounted such that light emitted and delivered to said sampling site from said LED passes through said filter, wherein a filter associated with an LED has a specific bandwidth and is centered on a particular wavelength that is within a native bandwidth of said LED, wherein groups of LED's are optionally associated with a same filter.",
            "components": []
        },
        {
            "claim_number": "CLM-00082",
            "preamble": "82. The apparatus of claim 79 , wherein said LED's have a bandwidth relatively broader than net analyte and interference signals.",
            "components": []
        },
        {
            "claim_number": "CLM-00083",
            "preamble": "83. The apparatus of claim 79 , wherein said LED's are used in a spectrometer without a dispersive element and a single element detector, wherein thin dielectric films are used as in Fabry-Perot interference filters and a filter is associated with each LED.",
            "components": []
        },
        {
            "claim_number": "CLM-00084",
            "preamble": "84. The apparatus of claim 1 , said optic system comprising a plurality of optical probes, wherein an optical probe includes:",
            "components": [
                {
                    "component": "one or more optical paths for incident radiation;",
                    "subcomponents": []
                },
                {
                    "component": "one or more detection fibers for each of said optical paths; and",
                    "subcomponents": []
                },
                {
                    "component": "a spacer having a radial dimension that establishes a minimum distance between said incident radiation and said one or more detection fibers;",
                    "subcomponents": []
                },
                {
                    "component": "wherein a maximum penetration distance of said incident radiation is greater than said radial dimension.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00085",
            "preamble": "85. The apparatus of claim 84 , wherein nearest neighbor optical probes are uniformly a minimum distance from each other, so that the collection of light from a targeted depth in a tissue sample is maximized and interference from other depths is minimized.",
            "components": []
        },
        {
            "claim_number": "CLM-00086",
            "preamble": "86. The apparatus of claim 84 , wherein said optic system includes at least two of said optical probes.",
            "components": []
        },
        {
            "claim_number": "CLM-00087",
            "preamble": "87. The apparatus of claim 84 , wherein said optics system includes either three or five of said optical probes.",
            "components": []
        },
        {
            "claim_number": "CLM-00088",
            "preamble": "88. The apparatus of claim 84 , wherein each optical probe is positioned to be at least 8 mm distant from its nearest neighbor.",
            "components": []
        },
        {
            "claim_number": "CLM-00089",
            "preamble": "89. The apparatus of claim 84 , wherein said radial dimension is from approximately 50 μm to approximately 3000 μm.",
            "components": []
        },
        {
            "claim_number": "CLM-00090",
            "preamble": "90. The apparatus of claim 89 , wherein said radial distance is approximately 100 μm.",
            "components": []
        },
        {
            "claim_number": "CLM-00091",
            "preamble": "91. The apparatus of claim 89 , wherein said radial distance is approximately 200 μm.",
            "components": []
        },
        {
            "claim_number": "CLM-00092",
            "preamble": "92. The apparatus of claim 89 , wherein said radial distance is approximately 300 μm.",
            "components": []
        }
    ],
    "description": [
        "This application:",
        "claims benefit of U.S. Provisional Patent Application Ser. No. 60/211,852, filed Jun. 15, 2000; and",
        "is a continuation-in-part of U.S. patent application Ser. No. 10/472,856, filed Sep. 18, 2003 now U.S. Pat. No. 7,133,710, which",
        "claims priority from PCT application No. PCT/US03/07065 filed Mar. 7, 2003; and",
        "claims benefit of U.S. Provisional Patent Application Ser. Nos. 60/362,885, filed Mar. 8, 2002, and 60/362,899, filed on Mar. 8, 2002, and 60/448,840, filed Feb. 19, 2003.",
        "1. Field of the Invention",
        "This invention relates generally to the noninvasive measurement of biological parameters through near-infrared spectroscopy. More particularly, the invention relates to the use of fiber optics for the illumination of analyte samples.",
        "2. Discussion of the Prior Art",
        "Over the past decade or so, near infrared (NIR) spectroscopy has been used in the food and agriculture industries to analyze ground wheat and other samples, See, for example, P. Williams, K. Norris, eds., Near-Infrared Technology in the Agricultural and Food Industries, American Association of Cereal Chemists, St. Paul Minn. (1987) More recently, NIR has found increasing use in pharmaceutical and biomedical application, including the non-destructive monitoring of pharmaceuticals and the transcutaneous measurement of analytes in biological tissue. See C. Horland, B. Davies, Proc. SPIE 1320, 46 (1990) and R. Robinson R. Eaton, R. Haaland, G. Koepp, E. Thomas, B. Stallard, P. Robinson. Clin. Chem, v. 38, 1618-1622 (1992) and J. Burmeister, M. Arnold, G. Small, Diabetes Technology and Therapeutics, v.1, 5-16 (2000) and S. Malin, T. Ruchti, T. Blank, S. Thennadil, S. Monfré, Clin Chem, v. 45, 1651-1658 (1999) or O. Khalil, Clin Chem, v. 45, 165-177 (1999). NIR measurement is performed by directing broadband NIR light through a sample and comparing the spectrum of the incident light to the spectrum of the light that exits the sample. The calculated absorbance spectrum provides a measure of optical density of the sample as a function of NIR wavelength. Individual chemical species have characteristic shaped NIR spectral profiles that typically overlap the spectral features of other species leading to a complex aggregate spectrum that is comprised of the spectral signatures of all NIR active components contained in the sample. The spectral contributions of individual species can be quantitatively evaluated using multivariate mathematics.",
        "Advantages of NIR measurement include nondestructive, noninvasive analysis of the sample, high signal to noise ratios, deep penetration of the sample and the option of using fiber optic technology. Of the disadvantages, the most obvious is poor selectivity due to the characteristically overlapped NIR spectral bands of sample constituents. Highly overlapped spectral bands require the use of multivariate calibration mathemetics and substantial numbers of calibration spectra, with associated glucose values to develop models capable of extracting the relevant analyte information.",
        "To those knowledgeable in the art, the size, arrangement and number of detection and illumination optical fibers at the interface of a probe designed to launch light toward and collect light from a tissue sample, such as human skin, significantly impacts the received signal.",
        "Various attempts have been made in the past to provide devices that illuminate and collect light from a tissue sample. See, for example, K. Maruo, K. Shimizu, M. Oka, Device for Non-invasive determination of glucose concentration in blood, European Patent Application No. EP 0 843 986; and R. Nordstrom, M. Modell, A. Zelenchuk,; and R. Nordstrom, M. Modell, A. Zelenchuk, Systems and methods for optical examination of samples, U.S. Pat. No. 6,411,838 (Jun. 25, 2002).",
        "However, such known devices have provided less than satisfactory results. In particular, the prior art devices have been unsuccessful at compensating for variations in skin thickness at the tissue measurement site. Accordingly, the illuminating beam often over-penetrates the skin, with too much light traveling into the adipose layer. The resulting fat band increases the level of noise and interference in the resulting sample spectrum. It would present a significant technological advance to provide an optical probe that was optimized to target the cutaneous layer of the tissue sample, thereby minimizing interference from the fat band in spectral measurements.",
        "The invention involves the monitoring of a biological parameter through a compact analyzer. The preferred apparatus is a spectrometer based system that is attached continuously or semi-continuously to a human subject and collects spectral measurements that are used to determine a biological parameter in the sampled tissue. The preferred target analyte is glucose. The preferred analyzer is a near-IR based glucose analyzer for determining the glucose concentration in the body.",
        "The analyzer includes an optic system optimized to target the cutaneous layer of the sampled tissue so that interference from the adipose layer is minimized. The cutaneous sampling optical system includes a plurality of optical probes. The spacing between the illumination and detection fibers of each probe and the spacing between bundlets is optimized to minimize sampling of the adipose subcutaneous layer and to maximize collection of light that has been backscattered from the cutaneous layer. The invention optimizes penetration depth by limiting the range of distances between illumination fibers and detection fibers. By minimizing sampling of the adipose layer, interference contributed by the fat band is greatly reduced in the sample spectrum, thereby increasing signal-to-noise ratio for the target analyte: The provision of multiple probes also minimizes interference in the sample spectrum due to placement errors.",
        "FIG. 1 shows a sampling module, a communication bundle and a base module according to the invention;",
        "FIG. 2 shows a preferred embodiment with a grating and detector array according to the invention;",
        "FIG. 3 shows a preferred embodiment of the sampling module according to the invention;",
        "FIG. 4 shows a low profile embodiment of the sampling module according to the invention;",
        "FIG. 5 provides a three-dimensional view of an optic system according to the invention;",
        "FIG. 6 provides a schematic diagram of the optic system of FIG. 5 according to the invention;",
        "FIG. 7 provides a cross section of an optical probe from the optic system of FIG. 6 according to the invention;",
        "FIG. 8 provides an alternative optical probe for the optic system of FIG. 5 according to the invention;",
        "FIG. 9 shows mean second derivative spectra in the fat band area for a pool of test subjects according to the invention;",
        "FIG. 10 shows a single filter embodiment of the sampling module according to the invention;",
        "FIG. 11 shows an alternative embodiment of the sampling module according to the invention;",
        "FIG. 12 shows noninvasive glucose predictions in a concentration correlation plot according to the invention;",
        "FIG. 13 shows an LED based embodiment of the sampling module according to the invention;",
        "FIG. 14 shows a possible LED reflector according to the invention; and",
        "FIG. 15 shows filter shapes optionally coupled to the LED according to the invention.",
        "The presently preferred embodiment of the invention uses a sampling module coupled to a base module. The sampling module includes an illumination system based upon an incandescent lamp. The base module includes a grating and detector array. The base module may be connected to the sampling module through a communication bundle. In this document, the combined sampling module, communication bundle, base module, and associated electronics and software is referred to as a spectrometer and/or glucose analyzer. In FIG. 1, the sampling module 10 is semi-permanently attached to the forearm of a subject 12, a communication bundle 14 carries optical and/or electrical signal to and/or from a base module 16 located on a table, and the communication bundle carries power to the sampling module from the base module.",
        "A block diagram of the noninvasive glucose analyzer is provided in FIG. 2. Essential elements of the glucose analyzer are the source 21, guiding optics 14 before and/or after the sample for coupling the source to the sample and the sample to the detector(s) 23, detector(s) and associated electronics 24, and data processing system 25. In FIG. 2, an optional optical filter 30, light blocker 31, and standardization material 32 are shown. These components may also be positioned after the sample and before the detector. Variations of this simple block diagram are readily appreciated and understood by those skilled in the art.",
        "The sampling module, base module, and communication bundle are further described herein. Key features of the invention may include but are not limited to: a semi-permanent patient/instrument interface sampling module 10 incorporating at least one of a low profile sampling interface 34, a low wattage stabilized source 21 in close proximity to the sampled site, an excitation collection cavity or optics, a guide, a preheated interfacing solution such as FLUORINERT (3M COMPANY, St. Paul Minn.), a temperature controlled skin sample, a mechanism for constant pressure and/or displacement of the sampled skin tissue, a photonic stimulation source, and collection optics or fiber.",
        "In the preferred embodiment the sampling module protrudes less than two centimeters from the skin measurement site. The sampling module may interface with a guide that may be semi-permanently attached to a sampling location on a human body. The guide aids in continuously and/or periodically physically and optically coupling the sampling module to the tissue measurement site in a repeatable manner with minimal disturbance. In addition, the guide in combination with the sampling module is responsible for pretreatment of the sample site for providing appropriate contact of the sampling device to the skin for the purpose of reducing specular reflectance, approaching and maintaining appropriate skin temperature variation, and inducing skin hydration changes. The sampling module preferably collects a diffusely reflected or transflected signal from the sampled region of skin.",
        "In the preferred embodiment, the base module or semi-remote system includes at least a wavelength selection device such as a grating 35 and a detector preferably a detector array with an optional wavelength reference standard 36 such as polystyrene and an optional intensity reference standard such as a 99% reflective Labsphere® disk. The remote system is coupled to the sampling module via a communication bundle 14 that carries as least the optical signal and optionally power. Additionally, the communication bundle may transmit control and monitoring signal between the sampling module and the remote system. The remote system has at least one of an embedded computer 25, a display 37, and an interface to an external computer system. The remote system may be in close proximity to the guide element.",
        "In one version of the invention, the sampling module and base module are integrated together into a compact handheld unit. The communication bundle is integrated between the two systems.",
        "One version of the sampling module of the invention is presented in FIG. 3. The housing 301 is made of silicon. The lamp 302 is a 0.8 W tungsten halogen source (Welch-Allyn 01270) coupled to a reflector 303. A photodiode 309 is used to monitor the lamp and to keep its output stable through the use of a lamp output control circuit, especially right after power-up. The reflector, and hence the incident light, is centered on an angle six degrees off of the skin's normal to allow room for a collection fiber. The light is focused through a 1 mm thick silicon window 306 onto an aperture at the skin. The silicon operates as a longpass filter. The illuminated aperture of the skin has a 2.4 mm diameter. Positioning onto a sampling site is performed through a guide. The patient sampling module reversibly couples into the guide for reproducible contact pressure and sampling location. Magnets 312 are used in the guide to aid in the positioning of the probe, to ensure proper penetration of the probe into the guide aperture and to enable a constant pressure and/or displacement interface of the sampled skin 308. The reversible nature of coupling the sampling module into the guide allows the sampling module to be removed and coupled to an intensity reference and/or a wavelength reference that have the same guide interface and are preferably housed with the base module. The preferred intensity reference is a 99% reflective Labsphere® material and the preferred wavelength reference is polystyrene. The preferred sampling module uses a heater 309 for maintaining the skin at a constant temperature. A 600 μm detection fiber 310 collects diffusely reflected light from the center of the silicon window. The detection fiber is coated in a manner to block source photons from penetrating through the cladding to the core. For example a metal sheath may be placed around the detection fiber. In this configuration, the length of the detection fiber is 0.7 meters. The communication bundle includes a power supply from the base unit. A blocking mechanism may be included to allow the detection of detector dark current or baseline. The base module incorporating a grating, detected array, associated electronics, and associated software is coupled to the sampling module via this bundle. In this configuration, the sampling module extends roughly three inches from the arm.",
        "It should be appreciated that in the preferred embodiment, many of the components are optional and/or variable. Some specific variations are described in this section. It is recognized that the components or properties discussed in this section may be varied or in some cases eliminated without altering the scope and intent of the invention.",
        "In the preferred embodiment, the base module resides on a table, the sampling module interfaces through a semi-permanently attached guide to the dorsal aspect of the forearm, and a communication bundle carries power and optical signal between the two modules. Alternatively, the base module may be worn on the person, for example on a belt. The sampling module could couple to any of a hand, finger, palmar region, base of thumb, forearm, volar aspect of the forearm, dorsal aspect of the forearm, upper arm, head, earlobe, eye, tongue, chest, torso, abdominal region, thigh, calf, foot, plantar region, and toe. When the base module is on the table, it may plug into a standard wall outlet for power. When worn on the person, the module may be battery powered. When the base module is worn on the person, an optional docking station may be provided as described below for power and data analysis. It is noted here that the base module may couple directly to the sampling module without a communication bundle. The combined base module and sampling module may be integrated into a handheld near-IR based glucose analyzer that couples to the sampling site through an optional guide.",
        "Sampling Module",
        "The sampling module housing in the preferred embodiment was selected to be constructed of silicon based upon a number of factors including but not limited to: providing a minimum of 6 O.D. blocking in the ultraviolet, visible, and near-IR from 700 to 1000 nm at a 1 mm thickness, low cost, manufacturability, durability, water resistance, and availability. It is recognized that it is the functionality of the housing that is important and that the above listed properties may be obtained through a variety of materials such as metals, composites, and plastics without altering the scope and intent of the invention.",
        "The 0.8 W tungsten halogen source is preferred for a number of reasons including but not limited to its power requirements, performance specifications such as color temperature, spectral output, and lifetime as well as on parameters such as ruggedness, portability, cost, and size. It is recognized that the source power is selected based upon the total net analyte signal generated and the amount of light reaching the detection system. It has been determined that the 0.8 W source in conjunction with the aperture and collection fiber of the preferred embodiment provides adequate signal and depth of penetration of the photons for the indirect determination of glucose using features in the 1150 to 1850 nm range. However, sources ranging from 0.05 W to 5 W may be used in this invention. As described in the alternative embodiment section, light emitting diodes (LED's) may be used as the source. The source is preferably powered by the base module through the connection cable described below. However, especially with the smaller sources a battery power supply may be incorporated into the sampling module.",
        "A photodiode is used in the preferred embodiment in conjunction with feedback control electronics to maintain the source at constant power output during data collection which is desirable during data acquisition. The photodiode is placed before the order sorter (the silicon longpass filter), in order to detect visible light from the source. The preferred photodiode is a silicon detector. Other less desirable photodiodes include but are not limited to InGaAs, InPGaAs, PbS, and PbSe. This arrangement of components is preferred due to the low cost, durability, and availability of detectors available in the visible and near-IR from 700 to 1000 nm where the long pass filter discussed below used later in the optical train blocks the optical signal used in the feedback loop. The control electronics allow the source to be driven at different levels at different points in time during and prior to data acquisition. In the preferred embodiment, the source is initially run at a higher power in order to minimize the analyzer warm-up time. The photodiode and feedback electronics are optional, but are used in the preferred embodiment. Many spectrometers are common in the art that do not use a separate detector for monitoring the source intensity.",
        "The source housing/reflector combination in the preferred embodiment was selected based upon a number of factors including but not limited to: providing acceptable energy delivery to the sample site, reflectivity, manufacturability, ruggedness, size, cost, and providing appropriate heating/temperature control of the sample site. The specific reflector in the preferred embodiment is parabolic. The properties were optimized using standard ray trace software to image the lamp filament onto the aperture defining the sampling location. The optical prescription is tuned for a specific spectral range (1100 to 1900 nm) and the coatings are designed to reflect optimally in this range. It is recognized that the reflector may be elliptical or even spherical and that the mechanical and optical properties of the reflector may be varied without altering the scope and intent of the invention. For example, in the simplest embodiment the source may shine light directly onto the sampled surface without the use of a reflector. In such cases, in order to deliver similar energy to the sampled skin through the aperture, a larger source is required. In another example, the specific focal distance of the reflector may be varied, which impacts the overall dimensions of the interface without affecting functionality. Similarly, a different substrate may be used as the reflector or metallized coatings such as gold, silver, and aluminum may be applied to the substrate.",
        "The source/housing reflector in the preferred embodiment may be modified to bring in the source light nearly parallel to the skin surface. One objective of a low profile design is to maintain a sampling module that may be semi-permanently attached to the sampling site. A low profile sampling module has the benefit of increase acceptance by the consumer and is less susceptible to bumping or jarring during normal wear. A semi-permanent interface would allow consecutive glucose determinations in an automated continuous or semi-continuous fashion as described below. Light brought in at a low angle relative to the skin may be turned into the skin with folding optics. A simple mirror may be used; however, a focusing mirror is preferred in order to optimally couple light into the aperture. A representative embodiment is provided in FIG. 4.",
        "One feature that may be used in this embodiment and in the other embodiments is the use of quick connect optics. In this case a 600 μm fiber 40 is used as the collection optic. The 600 μm fiber is fixed into the sampling module 41. The sampling module has a connector for accepting a 300 μm fiber 42 that in turn couples to a slit prior to the grating in the base module. The coupling of the light may be done by lenses, which may be magnifying or de-magnifying or with folding mirrors 44 with appropriate attention to matching numerical apertures. An important concept in this design is that the second collection optic is readily removed from the sampling module allowing the sampling module to remain in contact with the arm. In addition, the quick connect optic allows the user to travel remotely from the base module until the next reading is desired.",
        "As previously described, the invention includes guiding optics 14 before and/or after the sample for coupling the source to the sample and the sample to the detector(s). In one embodiment of the invention, the guiding optics may be a cutaneous targeting optic system, as shown in FIGS. 5-9. The above-mentioned co-pending application, J. Garside, S. Monfre, B. Elliot, T. Ruchti, F. Grochoki, Fiber optic illumination and detection patterns, shapes and locations for use in spectroscopic analysis, U.S. patent application Ser. No. 09/415,389 (Oct. 8, 1999), now U.S. Pat. No. 6,411,373 (Jun. 25, 2002) describes a method and apparatus for optimizing fiber optic illumination and detection patterns, shapes and locations for use in the noninvasive prediction of analytes, such as blood glucose. According to the teachings of Garside, et al., an optical probe is provided that is optimized to sample the cutaneous layer of a tissue sample, minimizing spectral interference contributed by the subcutaneous dermal layer.",
        "Turning to FIG. 5, an optical interface 50 is shown. The optical interface 50 incorporates an optic system 51.",
        "FIG. 6 shows a cross-section of the optic system 51. As shown, the optic system is composed of several smaller elements, referred to herein as probes. In the current embodiment of the invention, the optic system includes five probes.",
        "FIG. 7 shows a detailed cross section of an individual probe. Each probe includes, for example, twenty-two optical paths such as illumination fibers and ten detection fibers. Thus the entire bundle contains 110 fibers at the illumination end and fifty fibers at the detection end. The entire probe is preferably fabricated from a fiber such as ULTRASIL 200 (OFS OPTICS, INC., Norcross Ga.).",
        "FIG. 8 shows an alternate configuration for optic system composed of three probes. In this configuration, the illumination end of the probe preferably contains ninety-three fibers and the detection end preferably contains sixteen fibers.",
        "FIG. 9 shows the mean second derivative spectrum in the fat band area for test subjects of failed calibration, and for tests that led to some statistical significance in calibration.",
        "The embodiments of FIGS. 6-8 are provided for illustrative purposes. Other combinations of optical paths and detection fibers can be selected according to the principles described by Garside, et al., Ser. No. 09/415,389 (Oct. 8, 1999), now U.S. Pat. No. 6,411,373. Additionally, guided by the principles of the invention, one skilled in the art will readily conceive of other embodiments entirely consistent with the spirit and scope of the invention.",
        "In the current embodiment, a minimum distance is maintained between the optical paths for the incident light and the detection fibers through the use of a spacer, as shown in FIG. 13. Preferably, the spacer is sized so that the maximum penetration distance of the incident radiation is greater than the radial dimension of the spacer. Preferably the radial dimension ranges from approximately 50 μm to approximately 3000 μm. More particularly, the radial dimension can be any of: 100, 200, or 300 μm.",
        "It should be appreciated that the optical interface of FIGS. 5-8 finds application in other applications in addition to the current described embodiments. For example, the optical interface can be used in the detection of other analytes. Furthermore, the optical interface can be deployed in other settings that require coupling of a light source and a sample.",
        "Locating the source and reflector housing near the skin allows for temperature control/warm-up of the skin. The optical source is a heat source. Skin temperature is an important variable in near-IR noninvasive glucose determination. A thermistor 45 sensing the sampling module or patient skin temperature and feeding this information back to the source via feedback electronics prior to sampling may be used prior spectral data acquisition in order elevate the skin temperature to a desirable sampling range such as 30 to 40 degrees centigrade. The inclusion of a heater, thermistor, and associated feedback electronics are optional to this invention. In another embodiment, the skin temperature may be measured spectrally by the relative positions of water, fat, and protein in an acquired near-IR spectrum or through a multivariate analysis.",
        "In the preferred embodiment, an optical filter is placed between the source and the sampling site. In the preferred embodiment, the optical filter is silicon. The silicon window was selected based upon a number of factors. One factor is that silicon behaves as a longpass filter with blocking to at least six optical density units with a 1 mm thickness from the ultraviolet through the visible to 1000 nm. Second, the longpass characteristic of silicon acts as an order sorter benefiting the grating detector combination in the base module. Third, the longpass characteristic of silicon removes unwanted photons in the ultraviolet, visible, and near-IR that would heat the skin at unwanted depths and to undesirable temperatures due to conversion of the light into heat via the process of absorbance. Instead, the silicon is heated by these photons resulting in maintenance of skin temperature near the surface via conduction. Fourth, silicon offers excellent transmissive features in the near-IR over the spectral region of interest of 1150 to 1850 nm. Notably, silicon is the same material as the source housing and source reflector. Therefore, a single molding or part may be used for all three components. In the preferred embodiment, a silicon window is in contact with the skin to minimize specular reflectance. In the preferred embodiment, this window is anti-reflection coated based upon properties of air on the photon incident side and based upon the optical properties of the coupling fluid on the skin surface side of the optic.",
        "Many configurations exist in which the longpass filter is not in direct contact with the skin. First, the longpass filter may be placed after the source but not in contact with the skin. For example, the filter may be placed in or about the pupil plane. In this configuration, photons removed by the filter that result in the heating of the filter do not result in direct heating of the sample site via conduction. Rather, the much slower and less efficient convection process conveys this heat. This reduces the risk of over heating the skin. Alternatively, two filters may be placed between the source and the skin. These filters may or may not be the same. The first filter removes heat as above. The second filter reduces spectral reflectance as above. In a third configuration, the order sorter nature of the longpass filter is central. Silicon removes light under 1050 nm. This allows a grating to be used in the 1150 to 1850 nm region without the detection of second or higher order light off of the grating as long as the longpass filter, silicon, is placed before the grating. Therefore, in the third configuration the longpass filter may be after the sample.",
        "It is recognized that many filter designs exist. In the preferred embodiment a silicon longpass filter is used. The filters may be coated to block particular regions such as 1900 to 2500 nm, antireflection-coated in order to match refractive indices and increase light throughput, and/or used in combination with other filters such as shortpass filters. One configuration coats the silicon with a blocker from 1900 to 2500 nm. This has the advantage of removing the largest intensity of the blackbody curve of a typical tungsten halogen source that is not blocked by silicon or in the desirable region of 1150 to 1850 nm. This blocking band may cover any region from about 1800 nm on up to 3000 nm. Another configuration is a silicon longpass filter used in combination with an RG glass such as RG-850 that cuts off at about 2500 nm. The combination provides a very cost effective and readily reproduced bandpass filter passing light from approximately 1100 to 2500 nm. Notably this filter combination may be used in conjunction with a coating layer such as a blocker from 1900 to 2500 nm in order to provide a bandpass from 1100 to 1900 nm. Those skilled in the art will recognize that there exist multiple configurations of off the shelf and customized longpass, shortpass, and bandpass filter that may be placed in one or more of the locations described above that fulfill the utility requirements described above. An alternative embodiment of the source/reflector/filter is shown in FIG. 10. In this embodiment, silicon is shaped into a parabolic optic 100 surrounding part of the source 101. The outside of the silicon is coated with a reflector 102 such as gold. This embodiment allows a low profile source coupled to the skin. The total height off of the skin may be less than 1 cm with this configuration. The shape of the silicon optic in conjunction with coating the outside of the silicon with a reflective material such as gold allows efficient coupling of the photons into the skin. An additional optional protective coating over the reflector material allows the silicon optic to also act as a housing for the sampling module with the benefits of silicon listed above. Notably, the initial surface of the silicon (near the source) removes the higher energy photons that results in heating of the source optics prior to contact with the skin. The later part of the silicon (near the skin) in combination with a collection fiber acts as a mechanism for reducing specular reflectance. This configuration eliminates the optional two filter system as heat and spectral reflectance are dealt with in one optic. Essentially, the silicon is acting as a turning optic to allow a very low profile sampling module, as a longpass filter, as an order sorter, as a heat blocker, as a spectral reflectance blocker, and as a very manufacturable, cheap, and durable component.",
        "An alternative embodiment of the source/reflector/filter is shown in FIG. 11. In this embodiment, the source filament 110 is wrapped around a collection fiber 111. The reflector now directs light into the skin aperture through an optic 112. The optic may be surface coated for reflectance on the incident light surface. Alternatively, as above, the reflector may be transmissive and the outer surface of the reflector may be reflectively coated. As above, this allows the reflector to act as the housing. In this embodiment, there exists a filter adjacent to the skin that in conjunction with a collection optic, fiber, or tube adjacent to the skin results in the blocking of specular reflectance.",
        "An alternative embodiment combines a broadband source with a single element detector without the use of a grating. In one case, an interferometer composed of two parallel, highly reflecting plates separated by an air gap may be used. One of the parallel plates may be translated mechanically such that the distance between the plates varies. Technically, this is a Fabry-Perot interferometer. When the mirror distance is fixed and adjusted for parallelism by a spacer such as invar or quartz, the system is referred to as a Fabry-Perot etalon. This system allows narrow excitation lines as a function of time. Therefore, no dispersive element is required and a single element detector may be used. The interferometer may be placed in one of multiple positions in the optical train.",
        "In the preferred embodiment, the illuminated aperture of the skin has a 2.4 mm diameter. The aperture in the preferred embodiment was selected based upon a number of factors including but not limited to: providing optical pathlengths within the sample for indirectly monitoring glucose concentrations within the body, providing acceptable energy delivery to the sample site, and providing appropriate heating/temperature control of the sample site. As discussed below, a fiber optic collection fiber is placed in the center of this illumination area. This allows the incident photon approximately 1 mm of radial travel from the point of illumination to the collection fiber. This translates into depths of penetration that probe water, fat, and protein bands as well as scattering effects that may be used for the indirect determination of glucose. It is recognized that the dimensions of the aperture need not be the exact dimensions of the preferred embodiment. An important aspect is the ability to deliver photons to a skin tissue, allow them to penetrate to depths that allow an indirect measurement of glucose, and detect those photons.",
        "It is recognized that these properties may be varied without altering the scope and intent of the invention. For example, the aperture of 2.4 mm may be varied. The aperture provides an outer limit of where photons from the source may penetrate the skin. This in turn defines the largest depth of penetration and optical pathlengths observed. While the aperture may be varied from 1.2 to 5 mm in diameter, the 2.4 mm diameter allows collection of spectra with excellent features for the indirect measurement of glucose. At smaller apertures, the average depth of penetration of the collected photons decreases. Therefore, variation of the aperture affects the net analyte signal of the sampled tissue. Varying aperture shapes are possible as the shape affects the distribution of photons penetration depth and optical pathlength. The indirect determination of glucose may be performed off of sample constituents such as fat, protein, and water that are distributed as a function of depth. Therefore, the magnitude of the indirect signal varies with the aperture. In addition, multiple excitation sites and collection sites are possible. This could aid, for example, in sampling a representative section of the skin. For example, if one probe was located on a hair follicle, the others may be used independently or in conjunction with the first site in order to acquire the analytical signal necessary to determine glucose.",
        "Guide",
        "In the preferred embodiment, the entire patient interface module (PIM) couples into a guide that is semi-permanently attached to the skin with a replaceable adhesive. The guide aids in sampling repeatability. The guide is intended to surround interfacing optics for the purpose of sampling in a precise location. Typically this is done with an interface surrounding the interface probe. In the main embodiment, the guide is attached for the subject's waking hours. A guide may be attached in a more permanent fashion such as for a week or a month, especially in continuous monitoring glucose analyzers discussed below. The guide allows improved precision in sampling location. Precision in sampling location allows bias to be removed if a process such as mean centering is used in the algorithm. This is addressed in the preprocessing section below. Additionally, the guide allows for a more constant pressure/constant displacement to be applied to the sampling location which also enhances precision and accuracy of the glucose determination. While the guide greatly enhances positioning and allows associated data processing to be simpler and more robust, the guide is not an absolute requirement of the sampling module.",
        "In the preferred embodiment of the invention, magnets are used to aid in a user friendly mechanism for coupling the sampling module to the sampled site. Further, the magnets allow the guide to be reversibly attached to the sampling module. Further, the guide aids in the optical probe adequately penetrating into the guide aperture. In addition, the magnets allow a constant, known, and precise alignment between the sampling probe and the sampled site. In the preferred embodiment two magnets are used, one on each side of the sampled site, in order to enhance alignment. One or more magnets may provide the same effect. It is recognized that there exist a large number of mechanical methods for coupling two devices together, such as lock and key mechanisms, electro-magnets, machined fits, VELCRO, adhesives, snaps, and many other techniques commonly known to those skilled in the art that allow the key elements described above to be provided. In addition, the magnets may be electrically activated to facilitate a controlled movement of the probe into the guide aperture and to allow, through reversal of the magnet poles, the probe to be withdrawn from the guide without pulling on the guide.",
        "The guide may optionally contain a window in the aperture that may be the longpass/bandpass filter. Alternatively, the aperture may be filled with a removable plug. The contact of a window or plug with the skin stabilizes the tissue by providing the same tissue displacement as the probe and increases the localized skin surface and shallow depth hydration. As opposed to the use of a removable plug, use of a contact window allows a continuous barrier for proper hydration of the sampling site and a constant pressure interface. The use of a plug or contact window leads to increased precision and accuracy in glucose determination by the removal of issues associated with dry or pocketed skin at the sampling site.",
        "The guide may optionally contain any of a number of elements designed to enhance equilibration between the glucose concentration at the sampling site and a capillary site, such as the fingertip. Rapidly moving glucose values with time can lead to significant discrepancies between alternate site blood glucose concentration and blood glucose concentration in the finger. The concentration differences are directly related to diffusion and perfusion that combine to limit the rate of the equilibrium process. Equilibrium between the two sites allows for the use of glucose-related signal measured at an alternate site to be more accurate in predicting finger blood glucose values.",
        "A number of optional elements may be incorporated into the sampling module and/or guide to increase sampling precision and to increase the net analyte signal for the indirect glucose determination. These optional elements are preferably powered through the base module and connection cable described below but may be battery operated. Equalization approaches include photonic stimulation, ultrasound pretreatment, mechanical stimulation, and heating. Notably, equilibration of the glucose concentration between the sampled site and a well-perfused region such as an artery or the capillary bed of the fingertip is not required. A minimization of the difference in glucose concentration between the two regionsl aids in subsequent glucose determination.",
        "The guide may optionally contain an LED providing photonic stimulation about 890 nm, which is known to induce capillary blood vessel dilation. This technique may be used to aid in equilibration of alternative site glucose concentrations with those of capillary blood. By increasing the vessel dilation, and thereby the blood flow rate to the alternate site, the limiting nature of mass transfer rates and their effect on blood glucose differences in tissue is minimized. The resulting effect is to reduce the differences between the finger and the alternate site blood glucose concentrations. The preferred embodiment uses (nominally) 890 nm LED's in an array with control electronics set into the arm guide. The LED's can also be used in a continuous monitoring application where they are located in the probe sensing tip at the tissue interface. Due to the periods of excitation required for stimulation, the 890 nm LED is preferably powered by a rechargeable battery in the guide so that the LED may be powered when the communication bundle is not used.",
        "The guide may optionally contain an apparatus capable of delivering ultrasound energy into the sample site. Again, this technique may be used to aid in equilibration of alternative site glucose concentrations with those of capillary blood by stimulating perfusion and/or blood flow.",
        "The guide may optionally contain an apparatus that provides mechanical stimulation of the sampled site prior to spectral data acquisition. One example is a piezoelectric modulator that pulses in an out relative to the skin surface a distance of approximately 20 to 50 μm in a continuous or duty cycle fashion.",
        "The guide may optionally contain a heating and/or cooling element, such as a strip heater or an energy transfer pad. Heating is one mechanism of glucose compartment equilibration. These elements may be used to match the core body temperature, to manipulate the local perfusion of blood, to avoid sweating and/or to modify the distribution of fluids among the various tissue compartments.",
        "It is recognized that the sampling module can interface directly to a skin sampling without the use of a guide.",
        "In the preferred embodiment of the invention, a coupling fluid is used to efficiently couple the incident photons into the tissue sample. The preferred coupling fluid is the perfluoro compound FLUORINERT. Different formulations are available including FC-40 and FC-70. FC-40 is preferred. While many coupling fluids are available for matching refractive indices, FLUORINERT is preferred due to its non-toxic nature when applied to skin and due to its absence of near-IR absorbance bands that would act as interferences. In the preferred embodiment, the coupling fluid is preheated to between 90 and 95° F., preferably to 92° F. Preheating the coupling fluid minimizes changes to the surface temperature of the contacted site, thus minimizing spectral changes observed from the sampled tissue. The coupling fluid may be preheated using the source energy, the optional sample site heater energy, or through an auxiliary heat source. Preheating FC-70 is preferable due to its poorer viscosity. The preheated FC-70 is not as likely to run off of the sample site. Automated delivery prior to sampling is an option. Such a system could be a gated reservoir of fluorinert in the sample module. Manual delivery of the coupling fluid is also an option, such as a spray bottle delivery system. Coverage of the sample site is a key criteria in any delivery system.",
        "In the preferred embodiment of the invention, the sampling site is the dorsal aspect of the forearm. In addition, the volar and ventral aspect of the forearm are excellent sampling locations. It is further recognized that the guide may be attached to other sampling locations such as the hand, fingertips, palmar region, base of thumb, forearm, upper arm, head, earlobe, chest, torso, abdominal region, thigh, calf, foot, plantar region, and toes. It is preferable but not required to sample regions of the skin that do not vary due to usage as with the fingertips or near joints, change with time due to gravity like the back of the upper arm, or have very thick skin such as the plantar region, or abdominal region.",
        "There are a number of possible configurations for collection optics. In the preferred embodiment, light is incident to the sample through the longpass filter which is in contact with the skin. In the preferred embodiment, there exists a hole in the middle of the longpass filter. A collection fiber is placed into the hole in contact with the skin. This configuration forces incident photons into the sampled skin prior to collection into the fiber optic. If the fiber optic were merely pushed up against the filter, then light could bounce through the filter directly into the collection fiber without entering the skin resulting in a spectral reflectance term. Once the collection fiber is in contact with the skin, the signal (or rather absence of observed intensity) at the large water absorbance bands near 1450, 1900, and 2500 nm may be used to determine when the apparatus is in good spectral contact with the sampled skin. The preferred collection optic is a single 600 μm detection fiber. It is recognized that the hole and the fiber may be altered in dimension to couple in another sized fiber such as a 300 μm detection fiber. As those skilled in the art will appreciate, the fiber diameter is most efficient when it is optimally optically coupled to the detection system. Therefore, as detector systems slits and detector element sizes are varied, the collection optics should also be varied. The center collection fiber of 600 μm combined with the aperture of 2.4 mm is related to a central fiber collecting incident light from a bundle. The collection optic is not necessarily limited to a fiber optic. Additional configurations include but are not limited to a light pipe or a solid piece of optical glass.",
        "In the preferred embodiment, the collected signal is turned 90° off axis to send the signal roughly parallel to the arm in order to minimize the height of the sampling module. This may be accomplished by such common means as a folding mirror or bending of a fiber optic, as described above.",
        "In one embodiment, the collected light is coupled to a second collection that connects at its opposite end to the base module. The purpose of this configuration is to allow the sampling module to be worn on the person without the bulk of the rest of the spectrometer here referred to as the base module. A quick connect connector is used to allow rapid connection of the base module to the sampling module in a reproducible and user friendly fashion. The connecting cable carries at least the optical signal. In the preferred embodiment, the connection cable also carries power to the source and optional elements, such as the thermistor, heater, or sample compartment glucose concentration equilibration apparatus. This connector also allows the diameter of the collection fiber to be changed. For example, the 600 μm collection fiber may be downsized to a 300 μm connection fiber with appropriate attention to coupling optics and numerical apertures obvious to those skilled in the art. Some advantages of the smaller diameter connection fiber are described here. First, the smaller diameter fiber has a tighter bend radius. Second, if a slit is used prior to the spectrometer then the fiber can be made of appropriate dimension for coupling to the slit. Third, the smaller diameter fiber is less susceptible to breakage. An additional consideration is cost.",
        "It is recognized that collection/detection elements may be recessed away from the window in order to avoid the direct detection of surface reflectance. It is further recognized that coupling fluids may be used to increase the angle of collection to the detection element.",
        "Base Module",
        "In the preferred embodiment, the base module includes at least a spectrometer (grating and detector system). The grating is optimized to deliver peak energy about 1600 nm. The detector is an InGaAs array covering the range of 1100 to 1900 nm. A main purpose of the spectrometer is wavelength separation and detection. Variations in the grating/detector system are readily understood by those skilled in the art.",
        "In an alternative embodiment, a broadband source is combined with a detector array without the use of a dispersive element. In one case, filters are placed in from the detectors. One type of filter are thin dielectric films, such as in Fabry-Perot interference filters. These filters may be placed into a linear, bundle, or rectangular pattern depending upon how the light is coupled to the detector. For example, a slit may be used in conjunction with a rectangular array of filters and detectors. Alternatively, a fiber may be used in conjunction with a bundle of filters and associated detectors. Another type of filter is a linear variable filter. For example, a linear variable filter may sit in from of a linear array of filters. Many variations on these optical layouts are known to those skilled in the art.",
        "The Power/Control Module may be coupled to the user's belt or other location other than the measurement site. In an alternate embodiment the patient interface module contains a battery and two-way wireless communication system. In this configuration the Control/Power module may be carried by the patient. For example, a handheld computer or Palm computing platform can be equipped with a two-way wireless communication system for receiving data from the patient interface module and sending instructions. The computer system then provides the system with analysis capabilities.",
        "In an alternate embodiment the base module contains a battery and two-way wireless communication system. In this configuration the Control/Power module is contained a remote location that is either carried by the patient or not. For example, a handheld computer or palm computing platform can be equipped with a two-way wireless communication system for receiving data from the patient interface module and sending instructions. The computer system then provides the system with analysis capabilities.",
        "The Control/Power Module contains the control electronics, power system, batteries, embedded computer and interface electronics. Control electronics provide a means for initiating events from the embedded or attached computer system and interfacing the detector electronics (amplifiers) which provide a voltage that is related to the detected light intensity. Digitizing the detected voltage through the use of an analog-to-digital converter is performed. The signals detected are used to form a spectrum which is represents the diffusely reflected and detected light intensity versus wavelength. In addition, historical measurements are made available through a display and/or an external communication port to a computer or computer system, e.g. a Palmtop. In an alternate embodiment, the measurement and ancillary information is transferred to a remote display and receiving unit, such as a handheld computer or stand-alone display module through a wireless communication. In this latter system, a display and receiving unit may be incorporated into a watch, pen, personal desktop assistance, cell phone, or blood glucose monitoring device.",
        "Spectrometer",
        "It is here noted, that variation of one component may affect optimal or preferred characteristics of other components. For example, variation in the source may affect the quality or design of the reflector, the thickness of the filter, the used aperture size, the time or power requirements for maintaining or heating the skin and/or FLUORINERT, and the diameter of the collection fiber. Similarly, changing another component such as the collection fiber diameter impacts the other elements. Those skilled in the art will appreciate the interaction of these elements. Those skilled in the art will also immediately appreciate that one or more components of the spectrometer may be changed without altering the scope of the invention.",
        "Important regions to detect are permutations and combinations of bands due to water centered about 1450, 1900, or 2600 nm, protein bands centered about 1180, 1280, 1690, 1730, 2170, or 2285 nm, fat bands centered about 1210, 1675, 1715, 1760, 2130, 2250, or 2320 nm, or glucose bands centered about 1590, 1730, 2150, and 2272 nm.",
        "A preferred physical orientation of the spectrometer is in a vertical position. For example, when sampling on the dorsal aspect of the forearm when the palm is face down on a support it is preferable for the sampling module to come down onto the arm from above. This allows the weight of the sampling module to be reproducible.",
        "Standards",
        "Near-infrared devices are composed of optical and mechanical components that vary due to manufacturing tolerances, vary in optical alignment, and change with time due to mechanical factors such as wear and strain, and environmental factors such as temperature variation. This results in changes in the x-axis of a given spectrometer with time as well as instrument-to-instrument variation. When a calibration model is used to extract information about a sample, such as the glucose concentration in the body, these instrument related changes result in wavelength uncertainty that reduces the accessibility of the signal related to the property of interest. These variations also degrades the device accuracy when a calibration model is transferred from one instrument to another.",
        "A system for standardizing the wavelength axis of near-IR optical systems that measures light at a multiplicity of wavelengths is described in this section. The preferred embodiment is that presented in FIG. 2. The system described in this section may be used with the instrument configurations described in the remainder of this document. The spectrometer system detects the transmitted or reflected near-infrared radiation from the sample within a specified wavelength range and the analyzer determines the absorbance at various wavelengths after a standardization procedure. Methods for standardizing the x-axis of a spectrometer based system rely on a comparative analysis of a master and slave spectra of a standardization material. A material with absorption bands in the targeted wavelength region is used for determining the x-axis. Typically, the reference or standard absorbance bands are reasonably sharp, stable, and distributed across the wavelength region of interest (1100 to 1900 nm). Common materials for this purpose are polystyrene, erbium oxide, dysprosium oxide, and holmium oxide though a large number of plastics may be used. Internal polystyrene has been used as a reference in the FOSS, formerly NIRSystems spectrometers. However, in these systems, polystyrene is used in conjunction with an actuated rotating grating and a single detector. In the preferred embodiment of this invention no actuated grating is used.",
        "The material used for standardization may be measured external to the spectrometer system with an external mounting system. However, the material mounted in a separate standard mounting system external to the spectrometer must be placed on the device by the user at designated time periods. This process is subject to positioning error and increases the complexity of the measurement protocol from the standpoint of the user. This is particularly a problem in consumer oriented devices, such as non-invasive glucose sensors, in which the user may not be technically oriented.",
        "Alternatively, the reference may be continuously mounted internal to the instrument in a separate light path. In this configuration, the internal wavelength standard may be measured simultaneously with the sample. Alternatively, the reference may be moved through an actuator into the main optical train at an appropriate time, optionally in an automated process. In either of these systems, the reference spectrum may be collected in transmittance of reflectance mode. However, it is preferable to collected an external reference in diffuse reflectance mode. For example a polystyrene disk placed at an angle to the incident light to minimize specular reflectance may be backed by a reflector such as a LABSPHERE reference. For an internal reference, a similar arrangement may be used, but a transmittance spectrum is preferred.",
        "The wavelength standardization system includes associated methods for measurement of a reference spectrum and a (wavelength) standardization spectrum through the spectroscopic measurement of a non-absorbing material and a material with known and immutable spectral absorbance bands respectively. The spectrum of the standardization material is used in-conjunction with an associated method for standardizing the x-axis of sample spectra that are collected subsequently. The method includes a master spectrum of the standardization material and a method for determining the discrepancy between the master and instrument standardization spectrum. The master spectrum and the wavelength regions are stored in nonvolatile memory of the instrument computer system. One method of calculating the phase difference or x-axis shift between the master and slave spectra is through the use of cross correlation. For example, one or more windows across the spectrum the x-axis phase shift between the master and acquired spectrum are determined through a cross-correlation function after removing instrument related baseline variations. The phase shift is used to correct (standardize) the x-axis of the acquired spectrum to the master spectrum. Other approaches include interpolation or wavelet transformation.",
        "Preprocessing",
        "After conversion of the photons into intensity and optionally absorbance units, preprocessing occurs. The detected spectrum may be processed through multiple preprocessing steps including outlier analysis, standardization, absorbance calculation, filtering, correction, and application to a linear or nonlinear model for generation of an estimate (measurement) of the targeted analyte or constituent which is displayed to the user.",
        "Of particular note is the preprocessing step of bias correcting the spectral data collected in one or both of the X (spectra) and Y (glucose concentration) data. In particular, the first scan of a day may have a reference glucose concentration associated with it. This glucose concentration may be used as a bias correction for glucose determinations collected until subsequent calibration. Similarly, the first spectrum of the day may be used to adjust calibration components from the X block. Notably, the guide allows the same sampling location to be obtained until the guide is removed. This directly impacts the use of the first spectrum and reference glucose concentration to adjust the model in terms of preprocessing and subsequent model application.",
        "Additional preprocessing techniques are covered in the introductory section. These techniques are well understood by those skilled in the art.",
        "Modeling",
        "Subsequent data analysis may include a soft model or a calibration such as PCR or PLS. Many other modes of data analysis exist such as neural networks. A method has been invented for calibrating the device to an individual or a group of individuals based upon a calibration data set. The calibration data set is comprised of paired data points of processed spectral measurements and reference biological parameter values. For example, in the case of glucose measurement, the reference values are one or more of the following: finger capillary blood glucose, alternate site capillary blood glucose, i.e. a site on the body other than the finger, interstitial glucose or venous blood glucose. The calibration data is subject to optimal sample selection to remove outliers, data correlating to ancillary factors and data with excessive variation. Spectral measurements are preprocessed prior to calibration through filtering and scattering correction and normalized to a background template collected each time the guide system is attached to the skin tissue. Measurements are performed after preprocessing data collected subsequent to calibration as discussed above through the calibration or model to measure the variation of the biological parameter relative to its value at the time the guide was attached. The scope of these techniques was addressed in the prior art section and are well known to those skilled in the art.",
        "Results of a study using a noninvasive glucose analyzer are presented here. The study used a custom built noninvasive near-IR glucose analyzer. The analyzer is conceptually as presented in the preferred embodiment with components including a tungsten halogen source, a back-reflector, a bandpass optical filter, a fiber optic illumination bundle, a guide, a fluorinert coupling fluid, a guide, an aperture, a forearm sampling site, a collection fiber, a slit, a dispersive grating, and an InGaAs array detector though the spectrometer was larger in overall dimensions than in the preferred embodiment. However, the miniaturized sampling module has been demonstrated to deliver equivalent energy to the sample site. A calibration model was built. A subsequent prediction data set was initiated two weeks after all parameters were fixed in the calibration model. Subsequent prediction data (spectra) were collected with two spectrometers on seven people over a period of seven weeks. Preprocessing included a Savitsky-Golay first derivative with twenty-seven points and mean centering. A PLS model was applied with a fifteen factor model to the resulting data over a range of 1200 to 1800 nm. A total of 976 glucose determinations were made. The outlier analysis program was automated. The results are presented in FIG. 12 in a concentration correlation plot overlaid with a Clarke error grid. Overall, 99.9% of the glucose predictions fell into the ‘A’ or ‘B’ region of the Clarke error grid. These glucose predictions are considered clinically accurate.",
        "Docking Station",
        "In the preferred embodiment, the base module is integrally connected to the docking station. In addition to the grating, detector assembly, and power supply, the docking station includes a computer and a glucose management center. The glucose management system may keep track of events occurring in time such as glucose intake, insulin delivery, and determined glucose concentration. These may be graphed with time or exported to exterior devices, such as a doctor's computer.",
        "A process is provided for estimating the precision of the measurement through a statistical analysis of repeated or successive measurements. A method is implemented for determining when the biological parameter is close to a preset level through a statistical estimate of the confidence limits of a future analyte prediction. The prediction is made through a simple slope, e.g. change in the biological parameter over the change in time, estimate based on an exponentially moving average and the confidence limits are based upon the estimate of precision. Alternately, the prediction is made through a standard time series analysis. An alarm is invoked if the associated present alarm level is within the confidence interval of a future biological parameter prediction. This process is used, for example, to detect the potential for hypoglycemia in diabetics in the near future, e.g. within 10-30 minutes. In addition, the process is used to detect potential outliers through a determination of the statistical consistency of a particular measurement with its expected value.",
        "Continuous/Semi-Continuous Glucose Determination",
        "Continuous or semi-continuous measurements may be taken when the sampling module is in contact with the sampling site. Measurements of a biological parameter that are made at short intervals relative to the change in the biological parameter such that the measurement process is continuous. In the preferred embodiment, measurements may be made every six seconds. Realistically, the glucose concentration does not change to a measurable level within six seconds. Therefore, readings taken at a less frequent interval such as every 1, 5, 10, 20, 30, or 60 minutes can be made. Readings taken at this interval are still referred to as continuous and/or semi-continuous. The continuous readings may be performed in an automated fashion.",
        "It is noted that when the biological parameter is slowly varying, the guide can remain attached to the individual while the rest of the system is intermittently attached at particular intervals to make continuous or semi-continuous readings.",
        "An element of the invention is the use of the time based information and trends to perform other functions such as estimate of the precision, confidence intervals and prediction of future events.",
        "A process is provided for estimating the precision of the measurement through a statistical analysis of repeated or successive measurements. A method is implemented for determining when the biological parameter is close to a preset level through a statistical estimate of the confidence limits of a future analyte prediction. The prediction is made through a simple slope, e.g. change in the biological parameter over the change in time, estimate based on an exponentially moving average and the confidence limits are based upon the estimate of precision. Alternately, the prediction is made through a standard time series analysis. An alarm is invoked if the associated present alarm level is within the confidence interval of a future biological parameter prediction. This process is used, for example, to detect the potential for hypoglycemia in diabetics in the near future, e.g. within 10-30 minutes. In addition, the process is used to detect potential outliers through a determination of the statistical consistency of a particular measurement with its expected value.",
        "In circumstances in which the Control/Power. module can be secured without disturbing the sample site the two modules are merged into one that are attached to the subject through the guide interface system. Finally, when the biological parameter is slowly varying, the guide can remain attached to the individual while the rest of the system is intermittently attached at particular intervals.",
        "A link is disclosed to an insulin delivery system. When the monitored biological parameter is glucose, a link is provided to an insulin delivery system to provide a feedback mechanism for control purposes. The link is either a direct or a wireless connection. In addition, a communication system is provided for transmitting the patient's monitored glucose levels to his physician.",
        "An Alternative Embodiment",
        "As in the preferred embodiment, a primary alternative embodiment of the invention includes two main modules: a sampling module and base module connected though a communication bundle. The modules are as described in the preferred embodiment with the exception of the source and the associated wavelength selection/detection components. In the alternative embodiment of the invention, the spectrometer system uses LED's to both provide near-infrared radiation to the sample and to perform wavelength selection over predefined wavelength ranges. This embodiment has the significant advantage of not requiring a dispersive element or interferometer based system for the purpose of wavelength selection. Rather, each LED provides near-infrared radiation over a band of wavelengths and thereby gives the necessary means for wavelength selection.",
        "The wavelengths of the LED's are selected specifically to optimize the signal-to-noise ratio of the net analyte signal of the target analyte and are arranged at various distances with respect to the detection elements to provide a means for sampling various tissue volumes for the purpose of averaging and the determination of a differential measurement. The LED's are sequentially energized one at a time and/or in groups to obtain various estimates of the diffuse reflectance of various tissue volumes at specific wavelengths or bands of wavelengths. In addition, the LED's can be pulsed to provide short measurements with high signal-to-noise ratios. This provides greater illumination intensity, while avoiding photo heating of the sampled tissue volume. Alternately, the LED's can be modulated at a particular duty cycle and frequency to provide a means for removing additive noise and simultaneous measurement of multiple wavelengths.",
        "The wavelengths of the LED(s) are selected specifically to optimize the signal-to-noise ratio of the net analyte signal of the target biological parameter and are arranged at various distances with respect to the detection elements to provide a means for sampling various tissue volumes for the purpose of averaging and the determination of a differential measurement. The LED's are sequentially energized one at a time and/or in groups to obtain various estimates of the diffuse reflectance of various tissue volumes. In addition, the LED's can be pulsed to provided short measurements with a high signal-to-noise ratio while avoiding photo heating of the sampled tissue volume. Alternately, the LED's can be modulated at a particular duty cycle and frequency to provide a means for removing additive noise and simultaneous measurement of multiple wavelengths.",
        "With an LED source, the remainder of the spectrometer remains as in the preferred embodiment and its species. For example, the LED's may be stabilized with control electronics, optics may be used to guide the source intensity to the sampled aperture, a guide may be used, a coupling fluid may be used, temperature stabilization of the source and or sample may be used, collection optics integrate with the sampled skin directly, a communication bundle may be employed, and a base module is used with or without a docking station. As in the preferred embodiment, the detector may stare directly at the tissue.",
        "A number of instrument configurations of the alternative embodiment are presented below. Those skilled in the art will recognize that permutations and combinations of these embodiments are possible.",
        "In the simplest embodiment, the LED's may illuminate the sample directly, as in FIG. 13. In FIG. 13, a coupling fluid 134, as disclosed above, is shown between the device and the tissue sample. An optional mixing chamber with a reflective surface may be used between the LED's 130 and the optical window 131 to provide a nearly uniform distribution onto the tissue region 132 surrounding the detection fiber 133. A spacer 135 may also be provided between the fiber and the LED's. In this embodiment, the LED's are designed with a bandwidth enabling the measurement, and the LED's are arranged in a manner that allows the sampling and detection of a particular tissue volume at a particular band of wavelengths. Each LED may be recessed into a material 141 having a reflective surface 140 as shown in FIG. 14.",
        "In this scenario, two arrangements are used. First, a mixing chamber is present as shown in FIG. 13 with the filter inserted in the place of the optical window. This allows the LED's to be used in much the same way as a broadband source.",
        "Second, the illumination-to-detection distance may be used for measurement purposes so the mixing chamber is removed and the LED's are put in close proximity or even touching the overall sampling site via optional filters. In this second mode, the distance from the illumination spot of the LED to the collection optics is known. This allows the average depth of penetration of the photons and average pathlength to be known. This allows wavelength dependent scanning of depth and radial variation from the collection spot, and allows wavelength specific information to be used in an indirect reading of the glucose concentration.",
        "In the preferred embodiment, groups of LED's (FIG. 15; 1500) are employed with each group associated with a single filter type, more than one physical filter may be necessary. The LED's are arranged at distances surrounding the detection fiber and energized according to a strategy enabling the detection of light associated with different wavelength bands and different illumination to detection distances (see FIG. 15). In one embodiment (FIG. 15a) the groups of LED's are arranged in annuli (rings) at specific distances surrounding the detection fiber. The filters are arranged in rings surrounding the detection fiber and covering the associated LED's. Each annular ring of the filter may have its own filter characteristics. In a second arrangement (FIG. 15b), groups of LED's are arranged in wedges surrounding the detection fiber. In the second embodiment the filters may be of a wedged or triangular shape and are arranged to cover their associated LED's. Each wedge filter may have its own filter characteristics.",
        "In another embodiment, each LED or group of LED's has an associated optical filter that is used to limit the bandwidth of emitted light. A different filter is mounted such that the light emitted and delivered to the sample from the LED passes through the filter. The filter associated with an LED is designed with a specific bandwidth and is centered on a particular wavelength that is within the native bandwidth of the LED. To provide for a broader illumination pattern or to increase the light energy delivered to the sample, groups of LEDs can be associated with the same filter. Through alternate energization of the LEDs or by modulating each LED or LED group at different frequencies (and demodulating after detection), narrow wavelength bands on the order of 5-100 nm can be distinguished and measured through a single element detector.",
        "In another embodiment, the LED's have a bandwidth relatively broader than the net analyte and interference signals. The light collected by the detection fiber is passed through a slit and imaged onto dispersive element which disperses the band of detected light onto an array of detector elements. In this configuration, optical filters on the LED's are not employed.",
        "In another embodiment, the LED's are used in a spectrometer without a dispersive element and a single element detector. In one case, thin dielectric films are used as in Fabry-Perot interference filters. A filter is associated with each LED. In a second case, an interferometer composed of two parallel, highly reflecting plates separated by an air gap may be used. One of the parallel plates may be translated mechanically such that the distance between the plates varies. Technically, this is a Fabry-Perot interferometer. When the mirror distance is fixed and adjusted for parallelism by a spacer such as invar or quartz, the system is referred to as a Fabry-Perot etalon. Both cases allow narrow excitation lines and may be used by sequentially firing the LED's as above.",
        "A number of spectrometer configurations are possible for this measurement as are outlined above. Basically the spectroscopic measurement system includes a source of near-infrared radiation, a wavelength selection system, an interface to the patient, photon guiding optics, and a detector.",
        "Although the invention has been described herein with reference to certain preferred embodiments, one skilled in the art will readily appreciate that other applications may be substituted for those set forth herein without departing from the spirit and scope of the present invention. Accordingly, the invention should only be limited by the claims included below."
    ],
    "citations": [
        "5131391",
        "5632273",
        "5687717",
        "5770454",
        "5825488",
        "5879373",
        "5978691",
        "6040578",
        "6095974",
        "6152876",
        "6157041",
        "6411838",
        "6507687",
        "2004/0163032"
    ],
    "us_classification": "600316",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "61",
            "subclass": "B",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}