{
    "title": "Method and system to implement seller authorized buying privileges within a network-based shopping facility",
    "abstract": "The present invention discloses a system and method for an Internet-based shopping facility. The shopping facility allows a seller to select shoppers that may bid on the seller's auction listing or offer to but the seller's fixed price listing. Only the shoppers that receive authorization from the seller may bid on or buy the item or service offered for sale by the seller.",
    "inventors": [
        "Taylor",
        "Morin",
        "Goodwine",
        "Sze",
        "Cooney",
        "Hsin",
        "Fung",
        "Shaviv"
    ],
    "document_number": "07299206",
    "publication_date": "20071120",
    "assignees": [
        "eBay Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method to pre-approve a bidder for network-based shopping, the method including:",
            "components": [
                {
                    "component": "receiving an authorization communication, over a network, at a network-based auction facility, the authorization communication to authorize the bidder to bid on a particular sale listing that is listed for sale by a seller; and",
                    "subcomponents": []
                },
                {
                    "component": "at the network-based auction facility, automatically recording the bidder as authorized to bid on the particular sale listing responsive to the authorization communication.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein the network-based auction facility requires the seller to authorize the bidder before the bidder bids on the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , wherein the authorization communication includes a seller request to authorize bidders to bid on the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein the authorization communication includes allowing the seller to add and to remove an authorization restriction multiple times during an auction pertaining to the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 3 , including receiving a request communication, the request communication including a bidder request to the seller to request the seller to authorize the bidder to bid on the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 3 , including providing access, to the seller, to",
            "components": [
                {
                    "component": "a bidding history associated with the bidder and profile information associated with the bidder thereby to assist the seller in determining whether to authorize the bidder to bid on the particular sale listing.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 6 , wherein the bidding history and the profile information are provided by the network-based auction facility.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , wherein the particular sale listing is selected from a group consisting of a charity listing, an events listing and a holiday promotions listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 1 , wherein the network includes the Internet.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 9 , wherein the network-based auction facility includes an auction web site.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 9 , wherein an authorization restriction requirement is displayed on a web page that includes information regarding the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 1 , wherein seller vetting process information is displayed on a personalized web page of the seller that is linked to a web page of the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 1 , wherein the seller authorizes only a predetermined currency to purchase the particular sale listing that is listed for sale by the seller.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 1 , wherein the seller authorizes a predetermined geographic area, and wherein if the bidder is within the predetermined geographic area then the bidder is allowed, by the network-based auction facility, to bid on the particular sale listing that is listed for sale by the seller and if the bidder is outside the predetermined geographic area then the bidder is prevented from bidding on the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A method to pre-approve a buyer for network-based shopping, the method including:",
            "components": [
                {
                    "component": "receiving an authorization communication, over a network, at a network-based shopping facility the authorization communication to authorize the buyer to buy a particular offering offered for sale by a seller; and",
                    "subcomponents": []
                },
                {
                    "component": "at the network-based auction facility, automatically recording the buyer as authorized to buy the particular offering responsive to the authorization communication.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A system to pre-approve a bidder for network-based shopping, the system including:",
            "components": [
                {
                    "component": "a communications module to communicate between a network-based auction facility and a seller; and",
                    "subcomponents": []
                },
                {
                    "component": "an authorization module to record a seller authorization of a bidder to bid on a particular sale listing via the communication.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The system of claim 16 , wherein the authorization module requires the seller to authorize the bidder before the bidder may bids on the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The system of claim 16 , wherein the authorization communication includes a seller request to authorize bidders to bid on the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The system of claim 16 , wherein the seller can add and remove the pre-approval restriction multiple times during the auction pertaining to the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The system of claim 18 , wherein the communication module is to receive a request communication, the request communication including a bidder request to the seller to authorize the bidder to bid on the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The system of claim 18 , wherein the communications module is to provide access, to the seller, to a bidding history associated with the bidder and profile information associated with the bidder thereby to assist the seller in determining whether to authorize the bidder to bid on the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The system of claim 21 , wherein the bidding history and the profile information are provided by the network-based auction facility.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The system of claim 16 , wherein the particular sale listing is selected from a group of sales listings consisting of a charity sales listing, an events sales listing and a holiday promotions sales listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The system of claim 16 , wherein the network includes the Internet.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The system of claim 24 , wherein the network-based auction facility includes an auction web site.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The system of claim 24 , wherein an authorization restriction requirement is displayed on a view item web page.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The system of claim 16 , wherein seller vetting process information is displayed on a personalized web page of the seller that is linked to a web page of the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The system of claim 16 , wherein the seller authorizes only a predetermined currency to purchase the particular sale listing that is listed for sale by the seller.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The system of claim 16 , wherein the seller authorizes a predetermined geographic area, and wherein if the bidder is within the predetermined geographic area then the bidder is allowed, by the network-based auction facility, to bid on the particular sale listing that is listed for sale by the seller and if the bidder is outside the predetermined geographic area then the bidder is prevented from bidding on the particular sale listing.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. A system to pre-approve a buyer for network-based shopping, the system including:",
            "components": [
                {
                    "component": "a communications module to communicate between a network-based shopping facility and a seller; and",
                    "subcomponents": []
                },
                {
                    "component": "an authorization module to record a seller authorization of a buyer to buy a particular offering via the communication.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. A computer-readable medium storing instructions that, when executed by a processor, cause the processor to:",
            "components": [
                {
                    "component": "communicate between a network-based auction facility and a seller, the communication to authorize a bidder to bid on a particular sale listing that is listed for sale by the seller; and",
                    "subcomponents": []
                },
                {
                    "component": "automatically record the bidder as authorized to bid on the particular sale listing responsive to the communication.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. A system to pre-approve a bidder for network-based shopping including:",
            "components": [
                {
                    "component": "a first means for receiving a communication between a network-based auction facility and a seller; and",
                    "subcomponents": []
                },
                {
                    "component": "a second means for automatically recording a seller authorization of a bidder to bid on a particular sale listing responsive to the communication.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. A computer-readable medium storing instructions to that, when executed by a processor, cause the processor to:",
            "components": [
                {
                    "component": "communicate between a network-based auction facility and a seller, the communication to authorize a buyer to buy a particular offering offered for sale by the seller; and",
                    "subcomponents": []
                },
                {
                    "component": "automatically record the buyer as authorized to buy the particular offering responsive to the communication.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application claims the benefit of U.S. Provisional Application No. 60/250,637 filed Nov. 30, 2000.",
        "The present invention relates to electronic commerce. Specifically, the present invention provides for a seller to select shoppers to provide buying privileges to buy an offering offered for sale by the seller within a network-based shopping facility such as, for example, an Internet-based shopping facility.",
        "More and more Internet users are realizing the ease and convenience of buying and selling online by way of person-to-person online trading pioneered by eBay Inc., the assignee of the present invention. As a result, collectors, hobbyists, small dealers, unique item seekers, bargain hunters, and other consumers are able to buy and sell millions of items at various online shopping sites.",
        "The success of the online shopping sites, such as the Internet-based shopping facilities, depends upon their ability to provide enjoyable shopping experiences and easy-to-use and reliable environments in which buyers and sellers can conduct business efficiently. The online shopping sites can offer their services by facilitating auctions or by allowing sellers to offer their offerings for fixed prices. The current Internet-based shopping facilities have been presented with public relations risks due to excessive bid retraction and cancellation activities. For example, the reputation of eBay Inc. as a safe trading place was threatened because of the excessive bid retraction and cancellation activities during the recent auction of the Titanic deck chair and other high profile listings. It is estimated that as many as eighty percent of the bids made on the Internet-based shopping facilities are bogus.",
        "In the light of the foregoing, there is a need to enhance the traders' trust of the online shopping facilities. Particularly, it would be valuable and useful to provide a seller with a degree of confidence that a specific shopper is sincere about bidding on the seller's auction listing or offering to buy the seller's fixed price listing.",
        "According to one aspect of the present invention, a method to facilitate network-based shopping comprising facilitating a communication between a network-based auction facility and a seller whereby the seller authorizes a bidder to bid on an offering offered for sale by the seller is disclosed.",
        "Furthermore, the method comprises automatically recording the bidder as authorized to bid on the offering responsive to the communication.",
        "Other features of the present invention will be apparent from the accompanying drawings and from the detailed description that follows.",
        "The present invention is illustrated by way of example and not limitation in the figures of the accompanying drawings, in which like references indicate similar elements, and in which:",
        "FIG. 1 is block diagram illustrating an exemplary network-based commerce facility in the form of an Internet-based auction facility 10;",
        "FIG. 2 illustrates the web home page for an exemplary Internet-based auction facility;",
        "FIG. 3 illustrates the pre-approve bidders main web page for an exemplary Internet-based auction facility;",
        "FIG. 4 illustrates the pre-approve bidders logon web page for an exemplary Internet-based auctions facility;",
        "FIG. 5 illustrates the pre-approve bidders form web page for an exemplary Internet-based auctions facility;",
        "FIGS. 6A and 6B illustrate the view item web page for an exemplary Internet-based auction facility;",
        "FIG. 6C illustrates an exemplary error message;",
        "FIG. 7 is a database diagram illustrating an exemplary database for the Internet-based auction facility;",
        "FIG. 8 is a diagrammatic representation of an exemplary embodiment of the bidder feedback profile summary table;",
        "FIG. 9 is a diagrammatic representation of one exemplary embodiment of the bidder feedback profile details table; and",
        "FIG. 10 illustrates the flow chart of one embodiment of the method for seller authorized bidding through an Internet-based auction facility.",
        "A method and system to implement seller authorized buying privileges within a network-based shopping facility are described. The present invention proposes a method and system whereby a seller can select shoppers to provide buying privileges to buy an offering offered for sale by the seller. The buying privileges can include the authorization to bid on the seller's auction listing and the authorization to offer to buy the seller's fixed price listing. A listing may, for example, comprise an item or service offering. In this description, the terms listing, item and offering are used interchangeably. Unauthorized bidders are blocked from bidding on the item.",
        "An advantage of the present invention is that the seller does not have to manually monitor shopping activities because only the shoppers pre-approved by the seller are allowed to bid on or offer to buy the seller's listing. The shoppers also benefit from the present invention because a healthier trading environment is created because only the pre-approved candidates are allowed to compete with them. The community benefits in general because the shopping facility is perceived to have a safer trading place for the community because only the serious shoppers are allowed to bid on and offer to buy the listings. Seller authorized buying privileges can be requested by any seller with privileges to list on the shopping facility and for any listing, although the sellers with high profile listings would have more interest to do so. The present invention is extremely useful for high profile listings: charity listings, special events and holiday promotions.",
        "In the ensuing description, a method and system to implement seller authorized buying privileges within a network-based auction facility are described. It will be appreciated that the method and system are also applicable to the fixed priced listings. In this description, the terms pre-approval and authorization are used interchangeably. In various embodiments, the seller is empowered to use different mechanisms to pre-approve bidders. For example, the seller may view a potential bidder's bidding history and profile to determine whether or not to pre-approve the bidder to bid on a listing. It is understood that if the vetting process is too strict, the conversion rate on the item will be affected. To mitigate, in one embodiment, the auction facility educates the sellers to use proper vetting mechanism to choose their bidders. Also, in one embodiment, the seller may remove the pre-approval restriction anytime during the auction. For example, the seller may wish to take the risk to open the listing to all potential bidders if the pre-approval restriction produces no bids or the bids amounts are low. In one embodiment, the seller may add and remove the pre-approval restriction multiple times during the auction.",
        "In one embodiment, the seller may remove a bidder from the pre-approved list after the seller has added the bidder to the pre-approved list. In one embodiment, the seller may add bidders to and remove bidders from the pre-approved list multiple times during the auction of the listing. In one embodiment, the seller may request the pre-approval of bidders for his/her listing without specifying any bidders initially, and then add the bidders to the pre-approved list from time to time. In one embodiment, the seller has the choice to apply the pre-approve bidders list from a prior or current listing to all ongoing listings with the auction facility and/or any future listings. In one embodiment, the seller may pre-approve the bidders individually or in a bulk. In one embodiment, the seller may view the list of the pre-approved bidders and their respective Usernames/email addresses by logging on to the auction facility web site and providing the listing identification number.",
        "In one embodiment, the bidders within the United States of America as well as international bidders may be pre-approved to bid on the listing. In one embodiment, only the predetermined currencies can be used to bid on a listing.",
        "In the following description, for purposes of explanation, numerous specific details are set forth in order to provide a thorough understanding of the present invention. It will be evident, however, to one skilled in the art that the present invention may be practiced without these specific details.",
        "Unauthorized bidders include bidders who are not pre-approved by the seller to bid on a particular item. Authorized bidders include bidders who are pre-approved to bid on a particular item by the seller. Items include auction listings. Bidders include bidders and potential bidder.",
        "FIG. 1 is block diagram illustrating an exemplary network-based commerce facility in the form of an Internet-based auction facility 10. While an exemplary embodiment of the present invention is described within the context of an auction facility, it will be appreciated by those skilled in the art that the invention will find application in many different types of computer-based, and network-based, commerce facilities.",
        "The auction facility includes an authorization module 40 and a communications module 42. The authorization module 40 includes the CGI servers 18 that provide an intelligent interface to the back-end of facility 10, database engine server 22 and database 23. The communications module 42 includes one or more of a number of types of front-end servers, namely the page servers 12 that deliver web pages (e.g., markup language documents), picture servers 14 that dynamically deliver images to be displayed within Web pages, listing servers 16, CGI servers 18, and search servers 20 that handle search requests to the facility 10. E-mail servers 21 provide, inter alia, automated e-mail communications to the users of the facility 10.",
        "The back-end servers include a database engine server 22, a search index server 24 and a credit card database server 26, each of which maintains and facilitates access to a respective database.",
        "The Internet-based auction facility 10 may be accessed by a client program 30, such as a browser (e.g., the Internet Explorer distributed by Microsoft Corp. of Redmond, Washington) that executes on a client machine 32 and accesses the facility 10 via a network such as, for example, the Internet 34. The sellers and the buyers (or bidders) access the auction facility through the client machines 32. Other examples of networks that a client may utilize to access the auction facility 10 include a wide area network (WAN), a local area network (LAN), a wireless network (e.g., a cellular network), or the Plain Old Telephone Service (POTS) network.",
        "FIG. 2 illustrates the web home page for an exemplary Internet-based auction facility. The home page 100 includes a “seller services” link 102, which provides access to the seller services page. The seller services page, in turn, includes a buying and selling tools link, which provides access to the buying and selling tools page. The buying and selling tools page, in turn, includes a pre-approve bidders link, which provides access to the pre-approve bidders logon web page.",
        "FIG. 3 illustrates the pre-approve bidders logon web page for an exemplary Internet-based auctions facility. The pre-approve logon page 200 prompts the seller to provide a proper username 202 and password 204. When the seller provides the proper username 202 and password 204, the logon page 200 provides access to the pre-approve bidders main web page.",
        "FIG. 4 illustrates the pre-approve bidders main web page for an exemplary Internet-based auction facility. The pre-approve bidders main page 300 displays the currently active 302 and the past 304 auction listings for the particular seller. The pre-approve bidders main page 300 includes an “edit” link 306, which allows the seller to edit the pre-approve bidders list for the corresponding listing 302. The editing can include adding bidders to or subtracting bidders from the pre-approve bidders list. The pre-approve bidders main page 300 also includes a “deactivate” link 308, which allows the seller to deactivate the pre-approve bidders list such that the shoppers need not seek the seller's authorization to bid on the listing. If the seller removes the pre-approval restriction during the auction, the auction facility 10 requests the seller to inform the pre-approved bidders that the listing is now available to all potential bidders. In one embodiment, the seller can inform the pre-approved bidders of the removal of the pre-approval restriction through email. The pre-approve bidders main page 300 also includes an “add a new item” link 310, which provides access to the pre-approve bidders form page.",
        "FIG. 5 illustrates the pre-approve bidders form web page for an exemplary Internet-based auction facility. The pre-approve bidders form page 400 prompts the seller to provide an item number 402. The item number 402 can be provided by the auction facility 10 and corresponds to the item for which the seller wishes to pre-approve the bidders. The form page 400 also prompts the seller to add or remove the identifiers 404 for the bidders whom the seller wishes to authorize to bid on the particular item. The identifier 404 can include the bidder Username. The bidders identifiers 404 that are added to the form page 400 are stored in the authorized bidders table described below with reference to FIG. 7. The view item web page described below with references to FIGS. 6A and 6B is updated to include the information submitted through the form page 400. In one embodiment, if the seller's username 302 does not match with the item number 402, the auction facility 10 prompts an error message asking the seller to recheck the item number 402. In one embodiment, if the Username for the bidder does not match with a Username in the bidder table in the database 23, the auction facility 10 prompts an error message indicating that the bidder is not registered, suspended, terminated or merged.",
        "FIGS. 6A and 6B illustrate the view item web page for an exemplary Internet-based auction facility. If the seller has requested pre-approval restriction for the item, the auction facility 10 flashes an error message 520 when the unauthorized bidders attempt to bid on the item. An exemplary error message 520 is illustrated in FIG. 6C. The error message 520 informs the unauthorized bidder to contact the seller to seek the pre-approval to bid. The error message 520 can appear in the bidder box area 510. In one embodiment, if the potential bidder is on the pre-approve bidders list to bid on this item, the auction facility 10 prompts him/her with a message to continue with the bidding process.",
        "The view item page 500 includes an “about me” page link 502, which provides access to the about me web page. The unauthorized bidders may visit the about me page for more details regarding the seller including the seller's vetting process/guidelines. In one embodiment, the “about me” page link 502 is added in the item description area 504. In one embodiment, when the seller removes the pre-approval restriction, the restricted message is removed from the bid box area. In one embodiment, the seller can request pre-approval restriction after the auction has begun for the remaining time on the auction. In such a case, in one embodiment, the seller can manually cancel the bids made prior to the implementation of the pre-approval restriction.",
        "The auction facility 10 provides the seller with information regarding the potential bidder such that the seller can make an informed determination regarding whether to pre-approve the bidder. The information may include the bidder's bidding history and feedback profile. The information is included in the database 23. In one embodiment, the seller provides the auction facility 10 with the bidder contact information to obtain information regarding the bidder. The bidder contact information can include the bidder Username or email address. The seller may obtain the bidder contact information through the bidder or the auction facility 10. In one embodiment, the auction facility 10 matches the contact information provided by the seller with the contact information stored in the database 23 to provide the seller with user information.",
        "FIG. 7 is a database diagram illustrating an exemplary database 23, maintained by and accessed via the database engine server 22, which at least partially implements and supports the auction facility 10. The database 23 may, in one embodiment, be implemented as a relational database, and includes a number of tables having entries, or records, that are linked by indices and keys. In an alternative embodiment, the database 23 may be implemented as a collection of objects in an object-oriented database.",
        "The database 23 includes a bidder table 602, which contains a listing of the registered bidders of the auction facility 10. The bidder table 602 can also be referred to as the user table because each user may operate as both a bidder and a seller within the auction facility 10. The bidder table includes a link to a bidding history table 604 for each registered bidder. Each bidding history table 604 is populated with the particular bidder's bidding history records. Each bidding history record may include, inter alia, the title of a listing that was/is being auctioned via the auction facility 10, the bidder's bidding amount, and bid retraction information. The bid retraction information indicates whether the bidder retracted his/her bid on a particular item. Two other tables are also shown linked to the bidder table 602, namely a bidder feedback profile summary table 606 and a bidder feedback profile details table 608. The database 23 also includes an authorized bidders table 610 for each item for which the seller has requested the pre-approval of the bidders. The authorized bidders table 610 includes the list of bidders identifiers 404 that are authorized to bid on the particular item. The bidder identifier 404 can include the bidder Username.",
        "FIG. 8 is a diagrammatic representation of an exemplary embodiment of the bidder feedback profile summary table 606. The summary table 606 stores a summary of the feedback information regarding the bidders. Sellers and bidders that have experienced a particular bidder's behavior during the past auctions provide the feedback information (or comments) regarding to the bidder. The summary table 606 includes a bidder identifier column 702 that stores, for each bidder, a bidder identifier providing a pointer to the bidder table 602. The total score column 704 stores the total number of feedback comments (e.g., negative, positive and neutral) received for each bidder. The total negative column 706 stores the total number of negative feedback comments received for each bidder, and the total positive column 708 similarly stores the total number of positive feedback comments received for each bidder. The number of retractions column 710 stores the total number of threads that each bidder has retracted from auctions.",
        "The summary table 606 provides a good summary of the impressions of the users of the auction facility 10 regarding a particular bidder. Each bidder of the summary table 606 is linked to a bidder feedback profile details table 608. It is contemplated that other embodiments of the summary table 606 can include additional information such as whether the bidder has a credit card on file with the auction facility and whether the bidder is agreeable to use an online payment service (e.g., Billpoint).",
        "FIG. 9 is a diagrammatic representation of one embodiment of the bidder feedback profile details table 608. The details table 608 is populated with entries reflecting the details of each feedback comment or opinion submitted by a user to the auction facility 10 regarding a particular bidder. Typically, the users submitting the comments include sellers on whose auction listings the bidder has bid in the past. In one exemplary embodiment, the users are only permitted to provide feedback pertaining to a transaction upon conclusion of that transaction. The feedback details table 608 includes the item number column 802 that identifies the items for which the comments were submitted. The comment column 804 stores the actual texts of the feedbacks, comments, or opinions. The type column 806 stores the indications as to whether the comments are positive, negative or neutral. The date column 808 stores the dates on which the feedbacks, comments or opinions were received. The response column 810 stores the texts of the responses submitted by the bidder in response to the comments texts stored in column 804. Similarly, the rebuttal column 812 stores the texts of the rebuttals to such responses. The commentator column 814 stores the identifiers of the users that submitted the original comments stored in column 804. It is appreciated that further dates and other descriptive information may also populate the details table 608.",
        "The tables 602, 604, 606 and 608 include information that can provide the seller with valuable insights to evaluate the potential bidders. In one embodiment, the information contained in the tables 602, 604, 606 and 608 is easily accessible to the sellers. In one embodiment, the seller can provide the bidder's identifier such as the Username or email address to access the information stored in the tables 602, 604, 606 and 608. It is contemplated that the databases of alternate embodiments can include additional tables that provide additional bidders related information.",
        "FIG. 10 illustrates the flow chart of one embodiment of the method for seller authorized bidding through an Internet-based auction facility. It will be appreciated by those skilled in the art that with certain modifications the method is applicable in many different types of computer-based, and network-based, commerce facilities.",
        "At block 902, a seller registered with the auction web site logs on to the site. If the seller were already logged on, then he/she need not logon again to use request the pre-approval restriction. The suspended, merged, or terminated seller who cannot use any other feature on the auction site is prohibited from using the seller authorized bidding feature. At block 904, the seller identifies the item for which he wishes to add the pre-approval restriction. At block 906, an alert text appears on the item web page to alert the potential bidders to get a pre-approval from the seller to bid on the item. The item web page or another web page linked to the item web page provides the potential bidder with the seller contact information and vetting process information. At block 908, the potential bidder contacts the seller and requests permission to bid on the item. It is understood that the bidder must be registered with and logged on to the auction web site. The bidder provides the seller with the bidder auction site identifier such as the Username or email address. At block 910, the seller uses the bidder's auction site identifier to retrieve the bidder's bidding history and profile information. At block 912, the seller determines whether to add the bidder to the pre-approve bidders list. At block 914, if the determination is positive, the seller adds the potential bidder identifier to the pre-approve bidders list. The bidder identifier is then added to an appropriate authorization table. At block 916, if the determination is negative, the bidder identifier is not added to the authorization table. In one embodiment, the potential bidder is informed through email that the seller has rejected his/her request for pre-approval. At block 918, the seller may edit the pre-approve bidder list. The editing can include the addition of the potential bidder to the list that was rejected at block 912. The editing can also include the removal of a bidder from the list.",
        "When a bidder tried to bid on an item, the authorization module checks whether the bidder identifier is included in the item authorization table. If the bidder identifier is included in the authorization table, the bidder is allowed to bid on the item. If the bidder identifier is not included in the item authorization table, the bidder receives an error message.",
        "Thus, a method and system to implement seller authorized bidding within a network-based auction facility have been described. Although the present invention has been described with reference to specific exemplary embodiments, it will be evident that various modifications and changes may be made to these embodiments without departing from the broader spirit and scope of the invention. Accordingly, the specification and drawings are to be regarded in an illustrative rather than a restrictive sense.",
        "In addition, the methods as described above can be stored in memory of a computer system as a set of instructions to be executed. Also, the instructions to perform the methods as described above could alternatively be stored on other forms of computer-readable mediums, including magnetic and optical disks. For example, the method of the present invention can be stored on computer-readable mediums, such as magnetic disks or optical disks that are accessible via a disk drive (or computer-readable medium drive)."
    ],
    "citations": [
        "3573747",
        "3581072",
        "4412287",
        "4674044",
        "4677552",
        "4789928",
        "4799156",
        "4823265",
        "4864516",
        "4903201",
        "5063507",
        "5077665",
        "5101353",
        "5136501",
        "5168446",
        "5205200",
        "5243515",
        "5258908",
        "5280422",
        "5297031",
        "5297032",
        "5305200",
        "5325297",
        "5329589",
        "5375055",
        "5394324",
        "5426281",
        "5485510",
        "5553145",
        "5557728",
        "5596994",
        "5598557",
        "5640569",
        "5657389",
        "5664115",
        "5689652",
        "5694546",
        "5706457",
        "5710889",
        "5715314",
        "5715402",
        "5717989",
        "5722418",
        "5727165",
        "5771291",
        "5771380",
        "5790790",
        "5794219",
        "5799285",
        "5803500",
        "5818914",
        "5826244",
        "5835896",
        "5845265",
        "5845266",
        "5850442",
        "5872848",
        "5873069",
        "5884056",
        "5890138",
        "5905974",
        "5905975",
        "5922074",
        "5924072",
        "5926794",
        "5974412",
        "5991739",
        "6012045",
        "6035288",
        "6035402",
        "6044363",
        "6047264",
        "6055518",
        "6058417",
        "6061448",
        "6073117",
        "6081789",
        "6085176",
        "6104815",
        "6119137",
        "6178408",
        "6192407",
        "6202051",
        "6240396",
        "6243691",
        "6578014",
        "2001/0049634",
        "2002/0007338",
        "2002/0042755",
        "2002/0049961",
        "2002/0174060",
        "2253543",
        "2658635",
        "9300266",
        "WO92/15174",
        "WO95/17711",
        "WO-9517711",
        "WO96/34356",
        "WO97/37315",
        "WO99/63461",
        "WO-9963461"
    ],
    "us_classification": "705 37",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "06",
            "subclass": "Q",
            "main_group": "40",
            "subgroup": "00"
        }
    ]
}