{
    "title": "Direct cooling pallet tray for temperature stability for deep ion mill etch process",
    "abstract": "Embodiments of the present invention are directed to a pallet assembly which facilitates direct cooling of the wafer carrier. In one embodiment, the pallet assembly comprises a frame which holds at least one carrier of a component. The pallet assembly further comprises a tray which is operable for being mechanically coupled with the frame. The tray comprises at least one discreet region which corresponds with the carrier when the tray is coupled with the frame. In embodiments of the present invention, the discreet region comprises at least one hole extending through the tray for permitting a coolant medium to dissipate heat from the carrier.",
    "inventors": [
        "Chen",
        "Goitia",
        "Hwang",
        "Leung",
        "Perez",
        "Sun"
    ],
    "document_number": "07296420",
    "publication_date": "20071120",
    "assignees": [
        "Hitachi Global Storage Technologies Amsterdam, B.V."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A pallet tray comprising:",
            "components": [
                {
                    "component": "a discreet region for defining a chamber when said pallet tray is coupled with a frame, said frame configured for holding at least one carrier having at least one component to be fabricated thereon;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of holes extending through said pallet tray for conveying a coolant medium into said chamber, said coolant medium for dissipating heat from said carrier by directly contacting said carrier during a fabrication process that heats said component whereby dissipating said heat from said carrier cools said component during said fabrication process.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The pallet tray of claim 1 wherein said coolant medium dissipates heat from said carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The pallet tray of claim 1 wherein said coolant medium is conveyed through said chamber via a convective flow past said carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The pallet tray of claim 1 further comprising:",
            "components": [
                {
                    "component": "a gasket disposed between said pallet tray and said carrier when said pallet tray is coupled with said frame, and wherein said chamber is defined by said gasket, said pallet tray, and said carrier.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The pallet tray of claim 1 further comprising:",
            "components": [
                {
                    "component": "a chamber maintaining device for preventing said carrier from contacting said tray when said frame is coupled with said tray.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The pallet tray of claim 1 wherein said coolant medium comprises helium.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A pallet assembly comprising:",
            "components": [
                {
                    "component": "a carrier for holding a component;",
                    "subcomponents": []
                },
                {
                    "component": "a frame for holding at least one of said carriers; and",
                    "subcomponents": []
                },
                {
                    "component": "a tray operable for being mechanically coupled with said frame, said tray comprising at least one discreet region corresponding with said carrier when coupled with said frame, wherein said discreet region comprises at least one hole extending through said tray for permitting a coolant medium for dissipating heat from said carrier by directly contacting said carrier during a fabrication process that heats said component whereby dissipating said heat from said carrier cools said component during said fabrication process.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The pallet assembly of claim 7 wherein said component comprises at least one magnetic head element.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The pallet assembly of claim 7 wherein said tray further comprises:",
            "components": [
                {
                    "component": "a gasket for defining said discreet region and wherein said gasket contacts said carrier when said tray is mechanically coupled with said frame.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The pallet assembly of claim 7 wherein said tray further comprises:",
            "components": [
                {
                    "component": "a chamber maintaining device for maintaining a chamber corresponding with said discreet region when said frame is coupled with said tray.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The pallet assembly of claim 10 wherein said coolant medium comprises helium.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The pallet assembly of claim 10 wherein said discreet region comprises:",
            "components": [
                {
                    "component": "a plurality of said holes extending through said tray.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The pallet assembly of claim 12 wherein said coolant medium is conveyed through said chamber via a convective flow past said carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A pallet assembly comprising:",
            "components": [
                {
                    "component": "a carrier for holding a component;",
                    "subcomponents": []
                },
                {
                    "component": "a frame for holding at least one of said carriers; and",
                    "subcomponents": []
                },
                {
                    "component": "a tray operable for being mechanically coupled with said frame, said tray comprising at least one discreet region corresponding with said carrier when coupled with said frame, wherein said discreet region comprises at least one chamber for permitting a coolant medium to dissipate heat from said carrier, said coolant medium for dissipating heat from said carrier by directly contacting said carrier during a fabrication process that heats said component whereby dissipating said heat from said carrier cools said component during said fabrication process.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The pallet assembly of claim 14 wherein said component comprises at least one magnetic head element.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The pallet assembly of claim 14 wherein said tray further comprises:",
            "components": [
                {
                    "component": "a gasket for defining said discreet region and wherein said gasket contacts said carrier when said tray is mechanically coupled with said frame.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The pallet assembly of claim 14 wherein said tray further comprises:",
            "components": [
                {
                    "component": "a chamber maintaining device for preventing said carrier from contacting said tray when said frame is coupled with said tray.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The pallet assembly of claim 14 wherein said coolant medium comprises helium.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The pallet assembly of claim 14 wherein said tray further comprises:",
            "components": [
                {
                    "component": "at least one hole extending through said tray for allowing said coolant medium to enter said chamber.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The pallet assembly of claim 19 wherein said coolant medium is conveyed via a convective flow past said carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. A method for providing direct cooling of a pallet component, said method comprising:",
            "components": [
                {
                    "component": "coupling a carrier of a component with a frame;",
                    "subcomponents": []
                },
                {
                    "component": "coupling said frame with a tray, said tray comprising at least one discreet region corresponding with said carrier when coupled with said frame, and wherein said discreet region comprises at least one hole extending through said tray; and",
                    "subcomponents": []
                },
                {
                    "component": "using a coolant medium for dissipating heat from said carrier by directly contacting said carrier during a fabrication process that heats said component whereby dissipating said heat from said carrier cools said component during said fabrication process.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The method as recited in claim 21 further comprising:",
            "components": [
                {
                    "component": "defining the perimeter of said at least one discreet region with a gasket.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The method as recited in claim 22 further comprising:",
            "components": [
                {
                    "component": "creating a chamber proximate with said discreet region when said frame is coupled with said tray.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The method as recited in claim 23 wherein said chamber is defined by said gasket, said carrier, and said tray.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The method as recited in claim 23 further comprising:",
            "components": [
                {
                    "component": "introducing a coolant medium into said chamber via said at least one hole.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The method as recited in claim 23 further comprising:",
            "components": [
                {
                    "component": "maintaining said chamber using a chamber maintaining device disposed in said discreet region.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The method as recited in claim 21 wherein said component comprises a magnetic head component.",
            "components": []
        }
    ],
    "description": [
        "Embodiments of the present invention relate to the fabrication of magnetic storage devices. More specifically, embodiments of the present invention are directed to the removal of heat generated during the fabrication of magnetic storage devices.",
        "Etching processes are often used when shaping the components of magnetic storage devices such as the rails or other air bearing surfaces. An exemplary pallet assembly 100 used for shaping these components is shown in the exploded perspective view of FIG. 1. Pallet assembly 100 comprises a carrier 101 which holds a wafer or other component being etched. During use, a plurality of carriers 101 are slid between arms (e.g., 102a and 102b) of frame 102 which is then coupled with tray 103 using, for example, screws inserted into holes 104.",
        "FIG. 2 shows a section view of pallet assembly 100. During use, a wafer 201 is coupled with carrier 101. As shown in FIG. 2, carrier 101 is held between arms 102a and 10b due to the dovetail configuration of the back side of carrier 101. Carrier 101 is in direct contact with tray 103 in region 203, thus facilitating heat dissipation from carrier 101 via conduction to tray 103. A plurality of fasteners (e.g., 210) couple tray 103 with frame 102. Often, to improve the thermal transfer characteristics of the pallet assembly, carrier 101 is thermally coupled with frame 102 using a thermally conductive epoxy. This heat is then conveyed to tray 103 via fasteners 210.",
        "Pallet assemblies such as 101 can be used in the fabrication of components used in, for example, magnetic data storage devices. For example, a reactive ion etching (RIE) process or an ion milling process may be used to perform a shallow etch (e.g., approximately 0.18μ) of these components. However, when performing a deeper etch (e.g., approximately 1.32 μ using an ion milling process) current pallet designs cannot dissipate the heat quickly enough. As a result, the carrier and/or wafer can get burned. Thus, conventional pallet assemblies are inadequate in removing heat during deep etch operations.",
        "Embodiments of the present invention are directed to a pallet assembly which facilitates direct cooling of the wafer carrier. In one embodiment, the pallet assembly comprises a frame which holds at least one carrier of a component. The pallet assembly further comprises a tray which is operable for being mechanically coupled with the frame. The tray comprises at least one discreet region which corresponds with the carrier when the tray is coupled with the frame. In embodiments of the present invention, the discreet region comprises at least one hole extending through the tray for permitting a coolant medium to dissipate heat from the carrier.",
        "In one embodiment, a chamber, which corresponds with the discreet region, is defined by a gasket coupled with the tray, the carrier, and the tray. A plurality of holes extending through the tray permit a convective flow of the coolant medium into the chamber, thus facilitating the dissipation of heat from the carrier via convection.",
        "The accompanying drawings, which are incorporated in and form a part of this specification, illustrate embodiments of the present invention and, together with the description, serve to explain the principles of the invention. Unless specifically noted, the drawings referred to in this description should be understood as not being drawn to scale.",
        "FIG. 1 is an exploded perspective view of an exemplary prior art pallet assembly.",
        "FIG. 2 is a cross section view of an exemplary prior art pallet assembly.",
        "FIG. 3 is an exploded perspective view of an exemplary pallet assembly in accordance with embodiments of the present invention.",
        "FIG. 4 is a front view of a discreet region of an exemplary pallet tray in accordance with embodiments of the present invention.",
        "FIG. 5 is a section view of an exemplary pallet tray in accordance with embodiments of the present invention.",
        "FIG. 6 is a section view of an exemplary pallet assembly in accordance with embodiments of the present invention.",
        "FIG. 7 is a flowchart of a method for providing direct cooling of a pallet component in accordance with embodiments of the present invention.",
        "Reference will now be made in detail to embodiments of the present invention, examples of which are illustrated in the accompanying drawings. While the present invention will be described in conjunction with the following embodiments, it will be understood that they are not intended to limit the present invention to these embodiments alone. On the contrary, the present invention is intended to cover alternatives, modifications, and equivalents which may be included within the spirit and scope of the present invention as defined by the appended claims. Furthermore, in the following detailed description of the present invention, numerous specific details are set forth in order to provide a thorough understanding of the present invention. However, embodiments of the present invention may be practiced without these specific details. In other instances, well-known methods, procedures, components, and circuits have not been described in detail so as not to unnecessarily obscure aspects of the present invention.",
        "FIG. 3 is an exploded perspective view of an exemplary pallet assembly 300 in accordance with embodiments of the present invention. In FIG. 3, a carrier 301 which holds a wafer or other component being etched. Typically, a plurality of carriers 301 are slid between arms (e.g., 302a and 302b) of frame 302 which is then coupled with tray 303 using, for example, screws inserted into holes 304.",
        "Tray 303 further comprises a plurality of discreet regions (e.g., 305a-305e) which correspond with a respective carrier 301 when tray 303 is coupled with frame 302. For purposes of clarity, the side of tray 303 shown in FIG. 3 upon which the discreet regions are disposed will be referred to as the “front side.” In the embodiment of FIG. 3, each of the discreet regions 305a-305e is defined by a gasket (e.g., 306a-306e) which surrounds the corresponding discreet area. Furthermore, each of the discreet regions 305a-305e comprises at least one hole extending through tray 303. In embodiments of the present invention, holes 307a-307e are for permitting a coolant medium to pass through tray 303 and dissipate heat from carrier 301. In embodiments of the present invention, a convective flow of the coolant medium permits direct cooling of carrier 302.",
        "FIG. 4 is a front view of an exemplary discreet region 305a of a pallet tray in accordance with embodiments of the present invention. In embodiments of the present invention, discreet region 305a comprises a plurality of holes (e.g., 401a-410h) which extend through the pallet tray (e.g., 303). Gasket 306a defines the perimeter of discreet region 305a. Discreet region 305a further comprises a chamber maintaining device 402 which, in the embodiment of FIG. 4, is disposed in the center of discreet region 305a. In embodiments of the present invention, when frame 302 is coupled with tray 303, a chamber, corresponding to a given discreet region, is created behind each of the carriers in the frame. In embodiments of the present invention, the chamber is defined by the back side of carrier 301, the front side of tray 303, and along the inner edges of a corresponding gasket (e.g., 306a). A coolant medium can enter the chamber (e.g., via holes 401a-401h) to dissipate heat from the back side of carrier 302. Chamber maintaining device 402 is for preventing carrier 301 from compressing gasket 306a such that the flow of a cooling medium would be impeded when frame 302 is coupled with tray 303. In embodiments of the present invention, chamber maintaining device 402 comprises a heat resistant material such as heat resistant tape. While FIG. 4 shows one chamber maintaining device 402 embodiments of the present invention are well suited for using a plurality of these devices disposed in various locations of discreet region 305a. Furthermore, while FIG. 4 shows discreet region 305a comprising eight holes, it is appreciated that in embodiments of the present invention the number of holes in the discreet region may be one or more holes.",
        "FIG. 5 is a section view of an exemplary pallet tray 303 in accordance with embodiments of the present invention. As shown in FIG. 5, tray 303 has not been coupled with frame 302. Holes 501a and 501b are screw holes for mechanically coupling tray 303 with frame 302. While the present embodiment recites mechanically coupling tray 303 with frame 302, other methods (e.g., a thermally conductive epoxy) may be used as well. Furthermore, gasket 306a is shown in an un-compressed state prior to coupling with frame 302. Holes 401c, 401e, 401h, and 401d are also shown extending through tray 303. Chamber maintaining device 402 is again shown disposed in the center of discreet region 305a.",
        "FIG. 6 is a section view of an exemplary pallet assembly in accordance with embodiments of the present invention. As shown in FIG. 6, frame 302 has been coupled with tray 303 using screws 602a and 602b. Carrier 301 is now disposed between arms 302a and 302b of frame 302. Furthermore, chamber maintaining device 402 now contacts the back side of carrier 301 to prevent further compression of gasket 306a. In so doing, chamber 605 is formed which allows a coolant medium 606 to enter chamber 605 (e.g., via hole 401c) and dissipate heat from carrier 301. As a result, carrier 301 is now directly cooled by coolant medium 606 rather than relying upon tray 303 to conduct the heat away. Coolant medium 606 can also exit chamber 605 (e.g., via hole 401d) and convey the heat away from pallet assembly 600. In one embodiment, coolant medium 606 is helium gas.",
        "As a result, when fabricating component 601 (e.g., a magnetic head element) heat is conveyed to carrier 301 and is then dissipated by the convective flow of coolant medium 606 past carrier 301. Embodiments of the present invention are more efficient than conventional pallet assemblies in conveying heat away during the fabrication of component 601. As a result, a deep etch using, for example, the ion milling process can be achieved using embodiments of the present invention. Additionally, embodiments of the present invention are more efficient than conventional pallet assemblies in dissipating heat during other etch processes such as reactive ion etching.",
        "FIG. 7 is a flowchart of a method 700 for providing direct cooling of a pallet component in accordance with embodiments of the present invention. In step 710 of FIG. 7, a carrier of a component is coupled with a frame. As discussed above with reference to FIG. 3, carrier 301 can be coupled with frame 302 by, for example, sliding the dovetail portion on the back side of carrier 310 between arms 302a and 302b of carrier 302. In embodiments of the present invention, carrier 301 may be used to hold a magnetic head component (e.g., 601 of FIG. 6).",
        "In step 720 of FIG. 7, the frame is coupled with a tray. As described above with reference to FIG. 3, frame 302 may be coupled with tray 303 using, for example, screws 602a and 602b.",
        "In step 730 of FIG. 7, a coolant medium is used to dissipate heat from the carrier. As described above with reference to FIG. 6, coolant medium 606 may enter chamber 605 via one or more holes which extend through tray 303. In chamber 605, coolant medium 606 directly contacts carrier 302 and dissipates heat it. Coolant medium 606 can also leave chamber 605 via one or more of the holes extending through tray 303 and convey heat away from carrier 302. In so doing, embodiments of the present invention provide a method for directly cooling a pallet component which is more efficient than convention pallet designs in dissipating heat.",
        "The preferred embodiment of the present invention, direct cooling pallet tray for temperature stability for deep ion mill etch process, is thus described. While the present invention has been described in particular embodiments, it should be appreciated that the present invention should not be construed as limited by such embodiments, but rather construed according to the following claims."
    ],
    "citations": [
        "4457359",
        "4508161",
        "4512391",
        "4564585",
        "4949783",
        "5177878",
        "5744400",
        "5745983",
        "5970603",
        "6007635",
        "6072163",
        "6108937",
        "6198601",
        "6388861",
        "6423947",
        "6432259",
        "6442026",
        "6498724",
        "6556380",
        "2003/0133227",
        "10112448",
        "2002-372351"
    ],
    "us_classification": "62 62",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "F",
            "classification_class": "25",
            "subclass": "D",
            "main_group": "25",
            "subgroup": "00"
        }
    ]
}