{
    "title": "Glass laminates for reduction of sound transmission",
    "abstract": "The present invention is a glass laminate having sound attenuation properties that make it suitable for use as acoustic glazing in architectural applications and/or in vehicles.",
    "inventors": [
        "Anderson"
    ],
    "document_number": "07297407",
    "publication_date": "20071120",
    "assignees": [
        "E. I. du Pont de Nemours and Company"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A sound-damping laminate comprising a polyester polymer layer positioned between polymer layer",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The laminate of claim 1 wherein the polyester layer contains a surface coated with a polyallylamine-based primer in contract with the ionoplast resin (ionomer) layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The laminate of claim 2 further comprising a glass layer on the outside of the polyvinyl butyral layer or the ionoplast resin (ionomer) layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The laminate of claim 1 wherein the polyester layer is coated on both surfaces with a polyallylamine-based primer and is in contract with the polyvinyl butyral layer and the ionoplast resin (ionomer) layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The laminate of claim 4 further comprising a glass layer on the outside of the polyvinyl butyral layer and a second glass layer on the outside of the ionoplast resin (ionomer) layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The laminate of claim 1 wherein the laminate has an adhesive strength of at least about 10 lb/in",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The laminate of claim 6 wherein the laminate has not been flame treated.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The laminate of claim 7 wherein the polyester layer contains a surface coated with a polyallylamine-based primer in contract with either the polymer layer",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The sound-damping laminate of claim 8 wherein the laminate further comprise a glass layer adhered to the outside of the polyvinyl butyral layer and a second glass layer adhered to the outside of the ionoplast resin (ionomer) layer, and wherein the laminate has a loss factor of at least about 0.080 measured at 20° C. in the range of 50 to 10,000 Hz.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The laminate of claim 9 further comprising a glass layer on the outside of the polyvinyl butyral layer and a second glass layer on the outside of the ionoplast resin (ionomer) layer, and wherein the polyester layer contains a surface coated with a polyallylamine-based primer in contract with the ionoplast resin (ionomer) layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The laminate of claim 9 wherein the loss factor is at least about 0.15 throughout the range of from 50 to 10000 Hz.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. An article comprising the laminate of claim 1 .",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The article of claim 12 wherein the article is an automobile.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The article of claim 13 wherein the laminate is a windshield, a side-lite, a moon-roof, or a sun-roof.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The article of claim 12 wherein the article is a building.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The article of claim 15 wherein the laminate is a window, door, floor, ceiling, stairs, wall, partition, or other structural building component.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The laminate of claim 1 further comprising a glass layer adhered to at least one of the outside of the polyvinyl butyral layer and the ionoplast resin (ionomer) layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The laminate of claim 1 further comprising a glass layer on the outside of the polyvinyl butyral layer and a second glass layer on the outside of the ionoplast resin (ionomer) layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The laminate of claim 1 wherein the polyvinyl butyral layer is a sound-damping polyvinyl butyral layer having a plasticizer content of from about 40 pph to about 50 pph per parts polyvinyl butyral.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The laminate of claim 19 wherein the polymer layer",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The laminate of claim 20 wherein the sound-damping polyvinyl butyral layer having a plasticizer content of from about 44 pph to about 47 pph per parts polyvinyl butyral.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The laminate of claim 20 wherein the plasticizer is selected from the group consisting of triethylene glycol di(2-ethylhexanoate), tetraethylene glycol di-heptanoate, triethyleneglycol di(2-ethylbutyrate), and di-hexyl adipate.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The laminate of claim 20 further comprising a glass layer on the outside of the polyvinyl butyral layer and a second glass layer on the outside of the ionoplast resin (ionomer) layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The laminate of claim 23 wherein the polyvinyl butyral layer has a plasticizer content of from about 44 pph to about 47 pph per parts polyvinyl butyral, and wherein the plasticizer is selected from the group consisting of triethylene glycol di(2-ethylhexanoate), tetraethylene glycol di-heptanoate, triethyleneglycol di(2-ethylbutyrate), and di-hexyl adipate.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The laminate of claim 19 wherein the sound-damping polyvinyl butyral layer having a plasticizer content of from about 42 pph to about 49 pph per parts polyvinyl butyral.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The laminate of claim 19 wherein the sound-damping polyvinyl butyral layer having a plasticizer content of from about 44 pph to about 47 pph per parts polyvinyl butyral.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The laminate of claim 19 wherein the plasticizer for the sound-damping polyvinyl butyral layer is selected from the group consisting of diesters of polyethylene glycol.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The laminate of claim 19 wherein the plasticizer for the sound-damping polyvinyl butyral layer is selected from the group consisting of triethylene glycol di(2-ethylhexanoate), tetraethylene glycol di-heptanoate, triethyleneglycol di(2-ethylbutyrate), and di-hexyl adipate.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The laminate of claim 19 wherein the plasticizer for the sound-damping polyvinyl butyral layer is tetraethylene glycol di-heptanoate.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The laminate of claim 19 further comprising a glass layer adhered to the outside of the sound-damping polyvinyl butyral layer.",
            "components": []
        }
    ],
    "description": [
        "This application claims the benefit of U.S. Provisional Application No. 60/611,596, filed Sep. 20, 2004.",
        "1. Field of the Invention",
        "This invention relates to laminates used in glazing applications. This invention particularly relates to laminates useful as acoustic glazing for sound dampening.",
        "2. Description of the Related Art",
        "Glass laminates having sound-damping properties have found use in architectural applications as well as in vehicles. Such acoustic laminates are desirable to reduce sound transmission from external sources to the interior of a building or an automobile, for example.",
        "Plasticized polyvinyl butyral (PVB) sheet is used in the manufacture of transparent laminate structures such as, for example: windshields for vehicles including automobiles, motorcycles, boats and airplanes, windows in buildings such as office buildings, apartment buildings, houses, and/or commercial buildings, for example.",
        "In modern vehicles—particularly in trains, planes and automobiles—passenger comfort has become an important selling point in commercial transactions involving same. One important feature in a modern vehicle is the ability to minimize noise that originates from outside of the passenger compartment of the vehicle. Automobiles are particularly targeted for improving the acoustic quality of the passenger's ride. Noises coming from the engine compartment, from the sound of tires rolling across a road or the ground, and wind noise created as a car moves at rapid speed through air are all contributors to the noise generated as a car is used as it was intended.",
        "Various improvements and modifications have been made to cars in order to improve the quietness of a passenger's travel. However, one major source of noise is sound that passes through the windows of a vehicle. The windows of a car are typically good conductors of sound waves—particularly at critical sound frequencies, that is, at sound frequencies that are perceptible to the human ear. Moreover, sound reduction in office and other buildings from noise emanating from outside of the building can be desirable in settings where outside noises can reach the level of distraction inside of a building.",
        "Various patents describe inventive attempts to address the problem of noise reduction in vehicles and/or in buildings. U.S. Pat. No. 5,368,917 and U.S. Pat. No. 5,478,615 describe acoustic laminated glazings for vehicles comprising conventional polyvinyl butyral (PVB). U.S. Pat. No. 6,132,882 describes a sound-damping laminate comprising a vibration-damping layer such as a polyacrylate, at least one flexible plastic layer such as PVB, and a rigid glass or plastic sheet. U.S. Pat. No. 5,773,102 describes a soundproofing laminated glass pane wherein a high-performance acoustic film is combined with at least one film having ordinary acoustic performance, such as PVB. U.S. Pat. No. 5,190,826 describes interlayers for use in sound-insulating laminated glass. U.S. Pat. No. 6,074,732 describes a soundproofing laminated window made of two glass sheets between which are polymer layers in the order of PVB/PET/acrylate/PET/PVB. The PVB layers are conventional (that is, non-acoustic) PVB. U.S. Pat. No. 6,432,522 describes transparent laminates having sound attenuation properties comprising an interlayer film having at least two layers. WO 01/19747 A1 describes glass laminates wherein PVB is softened (plasticized) with 20 to 50 wt % of a two-component plasticizer mixture comprising 30 to 70 wt % of a polyalkylene glycol as one of the components. However, impact resistance of a laminate using softened PVB can be detrimentally affected.",
        "Use of ethylene acid copolymers or salts thereof produce rigid interlayers which can be particularly useful as threat-resistant glazing units in automobiles and buildings. Imparting sound-dampening properties to such interlayers can be difficult because of the rigidity of these materials, and relative lack of adhesion to other interlayer materials with known acoustic properties such as, for example, PVB.",
        "It can be desirable to have a laminate with sound dampening (sound-damping) properties that retains its impact resistance and resistance to penetration. It can be particularly desirable to have such properties in a threat-resistant glazing unit.",
        "In one aspect the present invention is a sound-damping laminate article comprising: at least 3-layers of composite interlayer, wherein one layer of the composite interlayer is a polyester (PET) polymer positioned between two dis-similar polymer layers, and wherein the dis-similar polymers are polymers selected from the group consisting of: polyvinylbutyrals (PVB); ionoplast resins (ionomers); polyurethanes (PU); polyvinyl chlorides; polycarbonates; polyacetals; ethylene acid copolymers, including ethylene acid terpolymers (acid copolymers); and polyolefins, including polyethylenes and polypropylenes.",
        "In one embodiment, the present invention is a laminate having sound-dampening properties. A laminate of the present invention has sound-damping properties in the frequency range of from about 10 Hz to about 10,000 Hz at a temperature in the range of from about 10° C. to about 30° C. A laminate of the present invention comprises a multilayer composite interlayer which comprises at least three polymer layers. Preferably the composite interlayer imparts to the laminate sound-damping properties in the range of from about 1,000 Hz to about 5,000 Hz at a temperature in the range of from about 10° C. to about 30° C. More preferably, the interlayer provides the above sound-damping properties at a temperature in the range of from about 15° C. to about 25° C.",
        "Sound-damping, as the term is used in the present application, refers to the sound loss that occurs on the transmission of sound from an incident surface of a laminate (the surface exposed to a sound wave) to an interior surface of the laminate (the side opposite the incident surface). Individual laminate glazing constructions have a loss factor and an equivalent bending rigidity modulus that can be determined for each construction, and which can be related to Sound Transmission Loss for the glazing. Laminate glazing constructions of the present invention comprise three-layer interlayer laminate constructions having loss factors greater than about 0.05, measured at 20° C. by the method described herein throughout the range of from 50 to 10000 Hz. Preferably, laminates of the present invention have loss factors of at least about 0.08 throughout the range of from 50 to 10000 Hz, and more preferably the loss factor is at least about 0.15 throughout the range of from 50 to 10000 Hz.",
        "In the practice of the present invention, an equivalent bending rigidity modulus can be determined to provide Sound Transmission Loss of the laminate glazing of the present invention.",
        "A sound-damping laminate of the present invention comprises, or consists essentially of, a polyester (PET) layer positioned between at least two other polymeric interlayers that are chemically distinct from the PET layer such that the laminate structure can be described as comprising the structure: polymer 1/PET/polymer 2. Polymer 1 and polymer 2 can either be the same or can be different materials. While there is no strict order to the laminate construction of the composite interlayer, it can be preferred to position the PET layer directly between the at least two other layers such that polymer 1 and polymer 2 each contact opposite surfaces of the intervening PET layer. Other laminate structures can be envisioned utilizing multiple layers of any of the layers, or combining chemically distinct interlayers described herein in any combination that can provide the desirable acoustic effect. It is particularly preferred that the laminate have adhesion between the that is suitable for placing the laminate into typical glazing applications. Suitable adhesion can be inherent between the polymer layers, or can be the result of a process treatment, or a coating on at least one surface of the layers.",
        "In one embodiment, the PET layer can be flame-treated to enhance adhesion to a dissimilar polymer layer. In a particularly preferred embodiment, the PET layer has a coating of a polyallylamine-based primer applied to at least one of its surfaces, preferably to both surfaces of the PET. PET coated with primer as described herein can provide a means for laminating two dissimilar polymeric interlayers that otherwise cannot be laminated conventionally. The primer and its application to the PET polymeric layer are described in U.S. Pat. Nos. 5,411,845; 5,770,312; 5,690,994; and 5,698,329. Generally, the PET film is extruded and cast as a film by conventional methods, and the polyallylamine coating is applied to the PET film either (i) before stretching or (ii) between the machine direction stretching and transverse direction stretching operations, and/or after the two stretching operations and heat setting in the stenter oven. It is preferable that the coating be applied before the transverse stretching operation so that the coated PET web is heated under restraint to a temperature of about 220° C. in the stenter oven in order to cure the polyallylamine to the PET surface. In addition to this cured coating, an additional polyallylamine coating can be applied on it after the stretching and stenter oven heat setting in order to obtain a thicker overall coating. The coated PET treated in this general manner is the primer (PRIMER) used herein to enhance the adhesion between dissimilar polymeric layers in a laminate construction. The coated PET layer can be required, for example, in producing a laminate construction wherein polymer 1 and polymer 2 referenced hereinabove are selected from ionomeric copolymers and polyvinylbutyrals. PVB and ionoplast interlayers do not normally adhere to each other satisfactorily without, for example, flame treatment of an intermediary adhesive layer.",
        "Adhesive strength in a laminate of the present invention is determined by the 90° peel test. The adhesive strength between dissimilar polymer layers in the present invention can be about zero (0) to about less than 10 lb/inch without any treatment to enhance adhesion, and with flame treatment the adhesive strength can be improved to about 10 lb/inch. Using a PRIMER as described herein can improve the peel strength to at least about 10 lb/in, and preferably to at least 15 lb/inch. Peel strength can give indication of the integrity of the multilayer laminate, and high peel strength can be an indicator of good resistance to delamination in the fully constructed laminate.",
        "Suitable polymers useful in a laminate of the present invention include, for example: PET; PVB (standard non-acoustic PVB and/or “acoustic” PVB wherein acoustic PVB is highly plasticized PVB, as described herein); ionoplast resins, which are ethylene acid copolymer ionomers (that is, at least partially neutralized acid copolymers); ethylene vinyl acetates (EVA); polyurethanes; polyvinyl chlorides; polycarbonates; polyacetals; ethylene acid copolymers (which are inclusive of ethylene acid terpolymers); polyolefins, including polyethylenes and polypropylenes. Preferred for use herein are polymers that are transparent, or that can be made to be transparent, such that they are suitable for use in glazing end-use applications. Particularly preferred for use herein are PET, PVB, and ionoplast resins.",
        "Non-acoustic PVB is a commercially available product that can be obtained from E.I. DuPont de Nemours and Company (DuPont) under the tradename of Butacite®. Ionoplast resins suitable for use herein are copolymers (inclusive of terpolymers) of ethylene and unsaturated carboxylic acids wherein at least a portion of the acid groups in the copolymer have been neutralized to the salt form of the acid. Extruded sheets of ionoplast resin suitable for use in the present invention can be obtained from DuPont under the trade name of SentryGlas® Plus (SGP).",
        "Polyester films (PET) are well-known polymer films that can also be obtained commercially. PET suitable for use herein can additionally comprise a hardcoat such as an abrasion resistant polysiloxane material or an oligomeric coating as described in U.S. application Ser. No. 10/925,842 (published as US 2005-0077002 A 1 on Apr. 14, 2005) on one of its surfaces. The polysiloxane coated PET can be obtained commercially from DuPont. In laminates of PET and other polymers such as PVB and SGP, it can be conventional to enhance the adhesion of the PET to the other polymers by some treatment step such as a flame treatment. In the practice of the present invention, adhesion of PET to any of the other polymers can be improved by either flame treating the PET or by applying PRIMER to either surface of the dissimilar polymers prior to laminating the layers using conventional laminating methods. Use of the PRIMER to improve the adhesion of PET to PVB can eliminate the need for a flame treatment to obtain suitable adhesion between these polymers.",
        "In one embodiment, the PET can be used to adhere stiff PVB having a low plasticizer content (less than 15 pph parts)—and thus higher modulus—to “normal” PVB and/or to other polymeric interlayer materials as defined herein.",
        "In a particularly preferred embodiment the sound-damping laminate of the present invention comprises at least one layer of a sound-damping (acoustic) PVB that is highly plasticized with at Least one plasticizer or a mixture of plasticizers. In this embodiment the plasticizer is included in an amount of from about 40 parts per hundred (pph) to about 50 pph parts PVB. Preferably, the interlayer is plasticized with from about 41 pph to about 49 pph, more preferably from about 42 pph to about 49 pph. and most preferably from about 44 to about 47 pph. In a much preferred embodiment, the sound-damping PYB is highly plasticized with one plasticizer. PVB useful in the practice of the present invention is described in U.S. application Ser. No. 10/519,661, fully incorporated herein by reference (published as US 2005-0288429 A 1 on Dec. 29, 2005).",
        "Sound-damping (acoustic) PVB as used in the practice of the present invention can be used in any thickness that provides the desired acoustic effect when combined with the other components of the laminate. Preferably, however, the PVB used has a thickness in the range of from about 15 mils to about 90 mils. More preferably, the sound-damping PVB has a thickness in the range of from about 1 mil to about 60 mils, and even more preferably in the range of from about 10 mils to about 40 mils. Most preferably, the thickness of the sound-damping PVB is in the range of from about 15 mils to about 40 mils. Multiple PVB sheets of various thicknesses can be stacked to obtain a sound-damping PVB stack having a desirable thickness.",
        "Plasticizer suitable for use in the practice of the present invention is any plasticizer that is used conventionally with PVB. For example, conventional plasticizers useful in the preparation of plasticized PVB include such plasticizers as: diesters of polyethylene glycol such as triethylene glycol di(2-ethylhexanoate) (3GO), tetraethylene glycol di-heptanoate (4G7), triethyleneglycol di(2-ethylbutyrate), and di-hexyl adipate. Most preferred for use in highly plasticized PVB is 4G7.",
        "Preferably, the plasticizer is one that is compatible (that is, forms a single phase with the interlayer) in the amounts described hereinabove, with regard to acoustic PVB, with PVB having a hydroxyl number (OH number) of from about 17 to about 23. Preferably the PVB of the present invention has an OH number of from about 18 to about 21, more preferably the OH number is from about 18 to about 19.5, and most preferably from about 18 to about 19. A particularly preferred plasticizer for use in the practice of the present invention is one which is compatible with the PVB in any of the preferred ranges for hydroxyl number.",
        "Generally, laminates of the present invention can be useful in architectural as well as in vehicular applications. For example, the laminates of the present invention can be useful as: windows in buildings; doors; partitions; hurricane windows; bullet-resistant glazings; sidelites, moonroofs, sunroofs and windshields in automobiles; windows in planes and trains; and other applications where sound-dampening laminated glazings can be desirable.",
        "Acoustic laminates of the present invention can be combined with decorative interlayers to produce glazings that reduce sound transmission in addition to incorporating designs, graphics, colors, or other decorative images.",
        "The Examples and Comparative Examples are presented for illustrative purposes only, and are not intended to limit the scope of the present invention in any manner that is inconsistent with the teachings provided of the specification.",
        "Laminates having the structures given below were made using an autoclave cycle of 135° C. at 200 psi for 30 minutes using a conventional vacuum bagging process.",
        "Test Methods",
        "Loss Factor (η) Determination",
        "Loss factor is determined from the measurement of the input impedence of a glass beam sample. A glass laminate specimen (25 mm×300 mm) is placed at its center onto an impact button (15 mm diameter), and affixed thereto with a cyanoacrylic glue. The impact button is supported on an impedence head, which is used to inject a measured force into the specimen via the impact button. A white noise type force between 0 and 5000 Hz is used to inject the specimen. The loss factor is then calculated using the formula:\n\nη=Δfi/fresi,\n\nwhere Δfi is the frequency difference between the frequencies on the resonance curve (fresi) having an impedence of 3 dB less than the maximum impedence. The specimen held in an environmental chamber at the desired set temperature before and during the determination. The impedence head is connected to a dash pot, which is connected to a power amplifier, which is connected to a noise generator. The impedence is measured by a FFT analyzer/computer set-up. A detailed description of the method and apparatus are described in ISO/PDPAS 16940 (published Jul. 16, 2002): “Glass in Building—Glazing and Airborne Sound Insulation—Measurement of the Mechanical Impedance of Laminated Glass”, herein incorporated by reference.",
        "GLASS/ionomer/PET/PVB/GLASS laminates were prepared using PET coated on both sides with a polyallylamine primer coating. Laminated to opposite surfaces of the PET were one sheet each of 30 mil thick PVB interlayer (BE-1028 Butacite®, available from DuPont) and 60 mil thick SentryGlas®) Plus ionoplast interlayer (available from DuPont). The PET sheet was 6.5-7.0 mils thick. The loss factor was calculated and is reported in Table 1.",
        "The procedure of Example 1 was followed with the exception that the laminate of this example included two layers of ionomer interlayer with the PET layer. The loss factor was calculated and is reported in Table 1.",
        "A laminate having a structure Glass/90 mil ionomer/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "A laminate having a structure Glass/90 mil PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "A laminate having a structure Glass/90 mil acoustic PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "The procedure of Example 1 was followed with the exception that a laminate having the structure Glass/60 mil ionomer/PET/40 mil acoustic PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "The procedure of Example 2 was followed with the exception that a laminate having the structure Glass/60 mil ionomer/PET/30 mil acoustic PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "The procedure of Example 3 was followed with the exception that a laminate having the structure Glass/60 mil PVB/PET/30 mil PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "The procedure of Example 4 was followed with the exception that a laminate having the structure Glass/60 mil acoustic PVB/PET/30 mil acoustic PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "The procedure of Example 5 was followed with the exception that a laminate having the structure Glass/60 mil PVB/PET/30 mil acoustic PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "The procedure of Example 6 was followed with the exception that a laminate having the structure Glass/60 mil colored PVB/PET/40 mil acoustic PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "A laminate having a structure Glass/40 mil acoustic PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "A laminate having a structure Glass/30 mil acoustic PVB/Glass was constructed and measured for loss factor. The results are reported in Table 1.",
        "TABLE 1\n\n\n\n\n\n\n\n\n\nLoss Factor (20° C.) @ Frequency (Hz)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx.\n260\n1000\n1500\n2500\n3500\n4500\n5000\n5500\n6000\n6500\n\n\n\n\n\n1\n0.058\n0.062\n0.064\n0.074\n0.077\n0.072\n0.070\n\n\n\n\n\n2\n0.109\n0.151\n0.166\n0.174\n0.170\n0.163\n0.163\n0.163\n0.162\n0.162\n\n\n3\n0.088\n0.121\n0.138\n0.159\n0.159\n0.146\n\n\n4\n0.084\n0.130\n0.150\n0.170\n0.178\n0.178\n\n\n5\n0.332\n0.323\n0.329\n0.321\n0.290\n0.247\n0.219\n\n\n6\n0.194\n0.269\n0.279\n0.285\n0.271\n0.260\n0.255\n0.252\n0.248\n\n\n7\n0.204\n0.272\n0.272\n0.270\n0.262\n0.260\n0.255\n0.246\n0.240\n\n\nC1\n0.048\n0.028\n0.018\n0.021\n0.028\n0.038\n0.043\n\n\nC2\n0.044\n0.029\n0.021\n0.024\n0.028\n0.026\n0.024\n0.025\n0.027\n0.028\n\n\nC3\n0.096\n0.134\n0.153\n0.181\n0.189\n0.184\n\n\nC4\n0.255\n0.294\n0.291\n0.283\n0.275\n0.253\n0.243\n0.232\n\n\nC5\n0.204\n0.270\n0.270\n0.269\n0.264\n0.252\n0.243\n0.237\n\n\nC6\n0.185\n0.260\n0.260\n0.261\n0.270\n0.269\n0.266\n0.261"
    ],
    "citations": [
        "3816201",
        "4059469",
        "4614676",
        "4619973",
        "4663228",
        "4742107",
        "5002820",
        "5190826",
        "5368917",
        "5411845",
        "5415942",
        "5427842",
        "5478615",
        "5690994",
        "5698329",
        "5770312",
        "5773102",
        "5796055",
        "5979932",
        "6074732",
        "6074932",
        "6119807",
        "6132882",
        "6352754",
        "6432522",
        "6436219",
        "6903152",
        "2001/0046595",
        "2002/0006504",
        "2003/0054160",
        "2005/0077002",
        "2005/0089692",
        "2005/0129954",
        "2005/0288429",
        "2006/0008648",
        "2006/0070694",
        "2006/0182983",
        "2006/0210776",
        "2006/0210782",
        "0852999",
        "WO01/19747",
        "WO2005/058598"
    ],
    "us_classification": "428441",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "32",
            "subclass": "B",
            "main_group": "17",
            "subgroup": "06"
        }
    ]
}