{
    "title": "Leak proof shower enclosure support structure",
    "abstract": "A method of constructing shower enclosure support structures which decreases the probability of mold growth by utilizing interior and/or exterior corner directional flow flashings between the joints of the sheets of synthetic marble, tile or other porous or non-porous material which cover the interior of the shower enclosure support structure and the material comprising the vertical walls of the shower enclosure support structure, a shower pan floor sloped downwardly toward the shower drain, a shower floor supported above the shower pan floor by spacers or mortar piers creating a void for air circulation between the shower floor and the shower pan floor, spacing between the shower floor periphery and the vertical walls of the shower pan to provide additional air circulation between the shower floor and the shower pan floor, shower enclosure support structure horizontal framing members that are sloped toward the shower drain, shower enclosure support structure horizontal framing members that are covered by the shower pan, a void, to increase air circulation, between the top of the shower pan vertical walls and air space between the framing members behind the sheetrock used to enclose the shower enclosure support structure, and a weep line positioned between the shower pan floor and the shower floor to permit insertion of mold inhibiting chemicals. Also disclosed is the shower enclosure support structure so constructed.",
    "inventors": [
        "Nehring"
    ],
    "document_number": "07296309",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A shower enclosure support structure comprising",
            "components": [
                {
                    "component": "vertical framing members,",
                    "subcomponents": []
                },
                {
                    "component": "horizontal framing members,",
                    "subcomponents": []
                },
                {
                    "component": "shower pan support material,",
                    "subcomponents": []
                },
                {
                    "component": "a shower pan,",
                    "subcomponents": []
                },
                {
                    "component": "spacing material suitable for support of interior enclosure structure material, and",
                    "subcomponents": []
                },
                {
                    "component": "mortar piers or other spacer materials to support the interior enclosure structure material over the shower pan floor;",
                    "subcomponents": []
                },
                {
                    "component": "wherein",
                    "subcomponents": []
                },
                {
                    "component": "said vertical framing members and said horizontal framing members are installed around a shower drain located within the structure of the building to define the shape of the finished shower enclosure,",
                    "subcomponents": []
                },
                {
                    "component": "said shower pan support material is installed upon the foundation of said building wherein the enclosure defined by said installed vertical framing members and said installed horizontal framing members,",
                    "subcomponents": []
                },
                {
                    "component": "said shower pan support material is installed such that the upper surface of said shower pan support material slopes toward said shower drain,",
                    "subcomponents": []
                },
                {
                    "component": "said shower pan is installed over all surfaces of said shower enclosure support structure up to and including all horizontal surfaces that are within the expected wet area of said finished shower enclosure, said mortar piers or other spacer materials to support the interior enclosure structure material are installed on the floor of said shower pan,",
                    "subcomponents": []
                },
                {
                    "component": "said spacing material suitable for support of interior enclosure structure material is installed on the inside of said vertical framing members, and said shower pan is connected to said shower drain, wherein said spacer materials are installed between said vertical framing members and said interior enclosure structure material creating an air space above said shower pan contiguous with the air space between said vertical framing members.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The shower enclosure support structure of claim 1 wherein said spacer materials are installed between said vertical framing members and said interior enclosure structure material creating an air space between said shower pan and said interior enclosure structure material contiguous with the air space between said vertical framing members.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The shower enclosure support structure of claim 1 wherein the shower floor portion of said interior enclosure structure materials is installed creating an air space between the walls of said shower pan and the periphery of said interior enclosure structure material which air space is contiguous with the air space between said vertical framing members.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The shower enclosure support structure of claim 1 wherein said spacer materials are installed between said shower pan floor and said interior enclosure structure material creating an air space between said shower pan floor and said interior enclosure structure material contiguous with the air space between said vertical framing members.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The shower enclosure support structure of claim 1 wherein a directional flow flashing is installed behind the joints of the sheets of said interior enclosure structure material.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The shower enclosure support structure of claim 1 wherein a weep line is installed between said shower pan floor and the shower floor portion of said interior enclosure structure material to permit injection of mold inhibiting chemicals.",
            "components": []
        }
    ],
    "description": [
        "The instant application is a continuation in part of application Ser. No. 10/316,465 filed Dec. 11, 2002 which was entitled “Mold resistant shower enclosure”, now U.S. Pat. No. 6,851,133 issued Feb. 8, 2005.",
        "The instant application makes a distinction not found in the parent application between the shower enclosure support structure and the shower enclosure. The phrase “shower enclosure” is deemed herein to refer only to the shower floor and the sheets of synthetic marble, tile or other porous or non-porous material which are attached to the shower enclosure support structure and form the interior of a shower stall.",
        "a. Field of the Invention",
        "The present invention is related generally to the field of methods of constructing shower enclosures. Growth of molds in and about shower enclosures has been identified as a substantial health problem in certain parts of the country. Growth of molds in and about shower enclosures can be substantially eliminated by use of the instant inventive method of constructing the shower enclosure support structure.",
        "The instant inventive method requires the use of several novel shower enclosure support structure features and apparatus, each of which contributes to the reduction of moisture leakage and accumulation in and around the shower enclosure support structure and therefore of the shower enclosure itself, thereby reducing the potential for mold growth.",
        "Accordingly, and more particularly, the instant invention is related to shower enclosures support structures that are constructed utilizing interior and/or exterior corner directional flow flashings.",
        "Yet more particularly, the instant invention is related to shower enclosure support structures that are constructed utilizing a shower pan floor sloped downwardly toward the shower drain.",
        "Yet more particularly, the instant invention is related to shower enclosure support structures that are constructed such that the shower floor is supported above the shower pan floor creating a void for air circulation and water drainage between the shower floor and the shower pan floor.",
        "Yet more particularly, the instant invention is related to shower enclosure support structures that are constructed such that spacing exists between the shower floor periphery and the vertical walls of the shower pan.",
        "Yet more particularly, the instant invention is related to shower enclosure support structures that are constructed such that horizontal members framing the shower enclosure support structure are sloped toward the shower drain.",
        "Yet more particularly, the instant invention is related to shower enclosure support structures that are constructed such that horizontal members framing the shower enclosure support structure are covered by the shower pan.",
        "Yet more particularly, the instant invention is related to shower enclosure support structures that are constructed such that a void, for ventilation, is created above the top of the shower pan vertical walls by use of spacers between the frame of the shower enclosure support structure and the sheets of porous or non-porous material comprising the vertical walls of the interior of the shower enclosure.",
        "Even yet more particularly, the instant invention is related to shower enclosure support structures that are constructed with a weep line positioned between the shower pan floor and the shower floor to permit insertion of mold inhibiting chemicals.",
        "b. Description of the Prior Art",
        "There are numerous shower enclosure designs in common usage. Certain of the individual features of the instant invention are well known. Other individual features of the instant invention are subject to the on sale bar. However, no shower enclosure design or method of construction or shower enclosure support structure design or method of construction encompasses or embodies all of the features of the instant invention or encompasses the use of such features as hereinafter disclosed.",
        "Accordingly, the prior art relevant to the instant invention is known to applicant to include the following features:",
        "It is known in the prior art to construct a shower enclosure to support a shower pan providing a shower pan floor which slopes toward a drain.",
        "It is known in the prior art to construct a shower enclosure having a shower floor which rests upon a mortar bed on top of the shower pan floor where the shower pan floor is sloped toward the drain strainer receiver which provides weep holes for the flow of moisture into the shower drain.",
        "It is known in the prior art to construct a shower enclosure whose horizontal members are coated or treated with water-proof material to prevent moisture from penetrating into such members and thereby serving as a growth medium for mold.",
        "It is known in the prior art to construct a shower enclosure which utilizes flashings to back corners of the finished shower to prevent moisture seepage into the shower enclosures supporting members.",
        "It is known in the prior art to construct a shower enclosure which provides for spacing between the shower pan floor and the shower floor.",
        "It is known in the prior art to construct a shower enclosure which incorporates any or all of the above-stated well-known prior art features.",
        "It is, finally, well-known and understood that the accumulation of moisture in and around a shower enclosure will provide a medium for the growth of mold and that mold is potentially harmful to the health of the inhabitants of that building, home, or structure in which the shower enclosure is constructed.",
        "Accordingly, it is seen that the prior art of constructing shower enclosure support structures and therefor shower enclosures is deficient in that mold growth is common in and around current, state of the art shower enclosures.",
        "The instant invention is of a method of constructing a shower enclosure support structure, and of the shower enclosure support structure so constructed, which incorporates certain novel features to reduce the leakage or accumulation of moisture in and around the shower enclosure support structure and thereby reduces the probability of mold growth in both the shower enclosure support structure and the shower enclosure.",
        "The usual method of constructing a shower enclosure is to begin by constructing a shower enclosure support structure. A shower enclosure support structure is usually constructed by first fastening into position certain vertical and horizontal members, commonly referred to as framing members, to support the shower pan and create the framework or outline of the shower being constructed above the drain. The drain is typically a through the foundation pipe connecting the interior of the shower enclosure to the building structure's plumbing drainage. Usually, following construction of the framing of the shower enclosure support structure, a shower pan is then installed into the shower enclosure support structure. It is also known to position the framing members after placement of the shower pan over the drain. A shower pan will, at a minimum, provide a shower pan floor and shower pan vertical walls. Such vertical walls may, in the current state of the art be merely a matter of inches in height, or may extend the entire height of the vertical wall of the finished shower enclosure.",
        "Continuing description of the usual method of construction of a shower enclosure support structure, after the shower pan is installed, sheetrock is commonly attached to the shower enclosure support structure framing members to complete the shower enclosure support structure. Window frames are also commonly attached to the shower enclosure support structure framing members in order to create currently fashionable “garden showers.” After completion of the construction of the shower enclosure support structure, the shower enclosure is defined by the installation of sheetrock and/or window frames, sheets of synthetic marble, tile or other porous or non-porous material are placed upon a mortar bed on top of the floor of the shower pan and adhered to the interior of the vertical walls of the shower enclosure support structure. A shower door is then installed by sealed connection to the shower enclosure support structure framing members to provide for ingress and egress to the shower enclosure. Grout or one of several shower enclosure sealant materials, commonly silicon glue compounds, are then used to fill the spaces between the sheets of synthetic marble, tile or other porous or non-porous material on the vertical portions of the shower enclosure and between the sheet of synthetic marble, tile or other porous or non-porous material forming the shower floor and the drain strainer in order to attempt to create a shower enclosure which is watertight excepting water flow out the drain.",
        "The primary problem in the prior art addressed by the instant invention is that of directing the flow of moisture in and around the shower enclosure support structure and the shower enclosure into and toward the shower drain such that moisture is not permitted to accumulate and serve as a medium for the growth of mold. The instant invention improves substantially upon the above-described common method of constructing a shower. Each of the instant invention's improvements is calculated to prevent moisture leakage from the shower enclosure support structure and shower enclosure into the surrounding shower enclosure support structure framing members, to reduce moisture accumulation in and around the shower enclosure support structure, or to provide means to kill such mold as does grow.",
        "Accordingly, it is an object of the instant invention to provide a method of constructing shower enclosure support structures utilizing interior and/or exterior corner directional flow flashings between the sheets of synthetic marble, tile or other porous or non-porous material comprising the vertical walls of the interior of the shower enclosure.",
        "It is another object of the instant invention to provide a method of constructing shower enclosure support structures utilizing a shower pan floor sloped downwardly toward the shower drain.",
        "It is yet another object of the instant invention to provide a method of constructing shower enclosure support structures that utilize a shower floor supported above the shower pan floor creating a void for air circulation and water drainage between the shower floor and the shower pan floor.",
        "It is yet another object of the instant invention to provide a method of constructing shower enclosure support structures that inserts spacing between the shower floor periphery and the vertical walls of the shower pan.",
        "It is yet another object of the instant invention to provide a method of constructing shower enclosure support structures such that the horizontal surfaces of members framing the shower enclosure are sloped toward the shower drain.",
        "It is yet another object of the instant invention to provide a method of constructing shower enclosure support structures such that the horizontal surfaces of members framing the shower enclosure are covered by the shower pan.",
        "It is yet another object of the instant invention to provide a method of constructing shower enclosure support structures such that a void, for ventilation, is created between the top of the shower pan vertical walls by use of spacers between the frame of the shower enclosure support structure and the sheets of porous or non-porous material comprising the vertical walls of the interior of the shower enclosure.",
        "It is yet another object of the instant invention to provide a method of constructing shower enclosure support structures with a weep line positioned between the shower pan floor and the shower floor to permit insertion of mold inhibiting chemicals.",
        "It is yet another and final object of the instant invention to provide a shower enclosure support structure that permits the creation of a finished shower enclosure that does not require the use of grout and/or caulking or the maintenance of grout and/or caulking to prevent leakage of moisture from the interior of the shower enclosure out into the surrounding building structure.",
        "10. Interior corner directional flow flashing\n    11. not used\n    12. Drain strainer receiver\n    13. Drain strainer\n    14. Floor of shower pan\n    15. Working surface of left panel of interior corner directional flow flashing\n    16. Top edge of left panel of interior corner directional flow flashing\n    17. Outer edge of left panel of interior corner directional flow flashing\n    18. Bottom edge of left panel of interior corner directional flaow flashing\n    19. not used\n    20. Working surface of right panel of interior corner directional flow flashing\n    21. Top edge of right panel of interior corner directional flow flashing\n    22. Outer edge of right panel of interior corner directional flow flashing\n    23. Bottom edge of right panel of interior corner directional flow flashing\n    24. Center fold of interior corner directional flow flashing\n    25. Left hand upper-most directional vane, ribbing, scoring or etching on interior corner directional flow flashing\n    26. Left hand second upper-most directional vane, ribbing, scoring or etching on interior corner directional flow flashing\n    27. Left hand third upper-most directional vane, ribbing, scoring or etching on interior corner directional flow flashing\n    28. Left hand fourth upper-most directional vane, ribbing, scoring or etching on interior corner directional flow flashing\n    29. Right hand upper-most directional vane, ribbing, scoring or etching on interior corner directional flow flashing\n    30. Right hand second upper-most directional vane, ribbing, scoring or etching on interior corner directional flow flashing\n    31. Right hand third upper-most directional vane, ribbing, scoring or etching on interior corner directional flow flashing\n    32. not used\n    33. not used\n    34. not used\n    35. Interior of left hand wall of shower pan\n    36. Interior of right hand wall of shower pan\n    37. Top surface of left hand wall of shower pan\n    38. Top surface of right hand wall of shower pan\n    39. not used\n    40. Exterior corner directional flow flashing\n    41. Outer edge of right panel of exterior corner directional flow flashing\n    42. Outer edge of left panel of exterior corner directional flow flashing\n    43. Right hand directional vane, ribbing, scoring or etching on exterior corner directional flow flashing\n    44. Second right hand directional vane, ribbing, scoring or etching on exterior corner directional flow flashing\n    45. Center fold of exterior corner directional flow flashing\n    46. Left hand directional vane, ribbing, scoring or etching on exterior corner directional flow flashing\n    47. Second left hand directional vane, ribbing, scoring or etching on exterior corner directional flow flashing\n    48. not used\n    49. not used\n    50. First sheet of sheetrock wall material\n    51. not used\n    52. not used\n    53. not used\n    54. Fifth sheet of sheetrock wall material\n    55. Second sheet of sheetrock wall material\n    56. Third sheet of sheetrock wall material\n    57. First nail in third sheet of sheetrock wall material\n    58. Second nail in third sheet of sheetrock wall material\n    59. Third nail in third sheet of sheetrock wall material\n    60. Vertical shower pan surface\n    61. Sloped shower pan surface over second horizontal framing member\n    62. First vertical wall of shower pan\n    63. First horizontal framing member\n    64. Second vertical wall of shower pan\n    65. Airway\n    66. Vertical framing member\n    67. Second horizontal framing member\n    68. Sloped shower pan surface over first horizontal framing member\n    69. Second vertical framing member\n    70. Fourth sheet of sheetrock material\n    71. Third vertical framing member\n    72. Fourth vertical framing member\n    73. First nail in fourth sheet of sheetrock material\n    74. Second nail in fourth sheet of sheetrock material\n    75. Third nail in fourth sheet of sheetrock material\n    76. Fourth nail in fourth sheet of sheetrock material\n    77. Fifth nail in fourth sheet of sheetrock material\n    78. Sixth nail in fourth sheet of sheetrock material\n    79. not used\n    80. Fifth vertical framing member\n    81. not used\n    82. Sloped mortar bed\n    83. Third vertical wall of shower pan\n    84. Third horizontal framing member\n    85. Sloped shower pan surface over third horizontal framing member\n    86. Space between shower floor and drain strainer\n    87. not used\n    88. not used\n    89. not used\n    90. Sloped shower pan floor\n    91. Mortar piers\n    92. Void\n    93. Space between periphery of shower floor and vertical sidewalls of shower pan\n    94. not used\n    95. Building foundation\n    96. Drain pipe connector\n    97. Drain pipe\n    98. not used\n    99. not used\n    100. Weep line\n    101. First aperture in weep line\n    102. Second aperture in weep line\n    103. Third aperture in weep line",
        "While the novel features of the instant invention are set forth with particularity in the appended claims, a full and complete understanding of the invention can be had by referring to the detailed description of the preferred embodiment which is set forth subsequently, and which is as illustrated in the accompanying drawings, in which:",
        "FIG. 1 is a perspective view of the interior corner directional flow flashing of the instant invention positioned vertically in the corner of a shower pan.",
        "FIG. 2 is a perspective view of a cut-away portion of the shower enclosure support structure of the instant invention without the sheets of synthetic marble, tile or other porous or non-porous material covering the interior of the shower enclosure installed.",
        "FIG. 3 is a vertical plane view of the shower enclosure support structure of the instant invention without the sheets of synthetic marble, tile or other porous or non-porous material covering the interior of the shower enclosure installed.",
        "FIG. 4 is a horizontal plane view of the shower pan floor of the instant invention without the sheets of synthetic marble, tile or other porous or non-porous material covering the interior of the shower enclosure installed.",
        "FIG. 5 is a vertical plane view of the shower pan floor of the instant invention without the sheets of synthetic marble, tile or other porous or non-porous material covering the interior of the shower enclosure installed.",
        "The instant application is a continuation in part of application Ser. No. 10/316,465 filed Dec. 11, 2002 which was entitled “MOLD RESISTANT SHOWER ENCLOSURE”. The instant application makes a distinction not found in the parent application between the shower enclosure support structure and the shower enclosure. The phrase “shower enclosure” is deemed herein to refer only to the shower floor and the sheets of synthetic marble, tile or other porous or non-porous material which are attached to the shower enclosure support structure and form the interior of a shower stall.",
        "The instant invention is of a method of constructing a shower enclosure support structure and of the shower enclosure support structure so constructed, the most complete view of which is available as FIG. 2. The shower enclosure support structure of the instant invention incorporates certain novel features to reduce the leakage out of or accumulation of moisture in and around the shower enclosure support structure and thereby reduces the probability of mold growth.",
        "As shown in FIG. 2, a shower enclosure support structure is constructed by fastening into position what is commonly and hereinafter referred to as framing members comprising certain vertical members 66 and 69 and certain horizontal members 67, and 63, together with additional horizontal and vertical members not shown in FIG. 2 because they are behind either the shower pan 14, 61, 62, 64, and 68 or the sheetrock 50, 54, 55, and 56. The purpose of fastening together the framing members, which are commonly comprised of cut lumber, is to support the shower pan 14, 61, 62, 64, and 68 and create the framework or outline of the shower being constructed above the drain, the drain strainer 13 being depicted centrally to the shower pan floor 14 in FIG. 2. The drain, depicted in greater detail in FIG. 3, typically comprises a through the foundation 95 drain pipe 97 connecting the shower to the building structure's plumbing drainage. The components of the drain are a drain pipe 97, a drain pipe connector 96, a drain strainer receiver 12, and a drain strainer 13. Referring back to FIG. 2, usually the next step following fastening together of the framing members of the shower enclosure support structure, a shower pan 14, 61, 62, 64, and 68 is then installed into the shower enclosure support structure. Alternatively, the framing members may be positioned and fastened together after placement of the shower pan 14, 61, 62, 64, and 68 over the drain pipe 97. In either event, the shower pan 14, 61, 62, 64, and 68 is installed after installation of the drain pipe connector 96, the creation of a sloped mortar bed 82, as depicted in FIG. 3, and the installation of mortar piers 91 on the sloped upper surface of the mortar bed 82. A shower pan 14, 61, 62, 64, and 68 (including elements 61 and 85 in the configuration of FIG. 3) will, at a minimum, provide a shower pan floor 14 and shower pan vertical walls 62 and 64. Such shower pan vertical walls 62 and 64 may, in the current state of the art be merely a matter of inches in height, or may extend the entire height of the vertical wall of the finished shower stall.",
        "After the shower pan 14, 61, 62, 64, and 68, as depicted in FIG. 2, is installed, spacer material or sheetrock 50, 54, 55, and 56 is commonly attached to the shower enclosure support structure framing members to complete construction of a shower enclosure support structure. Window frames, not depicted, are also commonly attached to the shower enclosure support structure framing members in order to create currently fashionable “garden showers.” After the shower enclosure support structure is defined by the installation of the spacer material or sheetrock 50, 54, 55, and 56 and/or window frames, not depicted, the sheets of synthetic marble, tile or other porous or non-porous material, depicted as the shower floor 90 in FIG. 3 only, comprising the interior shower stall enclosure structure material covering the interior of the shower enclosure support structure are placed upon a mortar bed on top of the shower pan floor 14 and adhered to the interior of the vertical walls of the shower enclosure support structure. A shower door, not depicted, is then installed by sealed connection to the shower enclosure support structure framing members to provide for ingress and egress to the shower enclosure. Grout or one of several shower enclosure sealant materials, commonly silicon glue compounds, are then used to fill the spaces between the sheets of synthetic marble, tile or other porous or non-porous material comprising the walls of the finished interior of the shower enclosure, between the sheets of synthetic marble, tile or other porous or non-porous material comprising the shower floor 90 of the finished interior of the shower enclosure, and between the sheets of synthetic marble, tile or other porous or non-porous material comprising the shower floor 90 and the drain strainer 13 in order to attempt to create a watertight shower enclosure.",
        "The primary problem in the prior art addressed by the instant invention is that of directing the flow of moisture in and around the shower enclosure support structure and the shower enclosure into and toward the shower drain such that moisture is not permitted to accumulate and serve as a medium for the growth of mold. The instant invention improves substantially upon the above-described common method of constructing a shower enclosure. Each of the instant invention's improvements is calculated to prevent moisture leakage from the shower into the surrounding shower enclosure support structure's framing members, to reduce moisture accumulation in and around the shower enclosure support structure, or to provide means to kill such mold as does grow within the shower enclosure support structure.",
        "The first improvement to the method and art of constructing shower enclosure support structures is the use of interior corner directional flow flashings 10, depicted in FIGS. 1 and 2, and exterior corner directional flow flashings 40, depicted in FIG. 2.",
        "As seen in FIG. 1, the interior corner directional flow flashing 10 comprises a left hand working surface 15 and a right hand working surface 20. The interior corner directional flow flashing 10 is installed in the shower enclosure support structure such that each working surface 15 and 20 is facing the interior of the shower enclosure support structure, toward the drain strainer 13. Further, as depicted in both FIGS. 1 and 2, the interior corner directional flow flashing 10 is installed in the shower enclosure support structure such the bottom of the interior corner directional flow flashing 10 is located within the shower pan 14, 61, 62, 64, and 68. Each of the working surfaces 15 and 20 provides directional vanes, ribbing, scoring or etchings; 25, 26, 27, and 28 on the left hand working surface 15, and 29 30, and 31 on the right hand working surface 20.",
        "In FIG. 1, the flashing 10 of the instant invention is of a single piece construction, metal or plastic, with a center fold line 24, whereby two interior surface panels 15 and 20 are discernable. While no specific angle exists between the two working surface panels 15 and 20, where the flashing 10 is standing vertically in a corner of a shower enclosure support structure such angle approximates 90°. In FIG. 1, the center fold line 24 is depicted as a crisp line approximately midway between the left vertical edge 17 and the right vertical edge 22 of the interior corner directional flow flashing 10. No such limitation exists in the invention as the directional vanes, ribbing, scoring or etchings 25, 26, 27, 28, 29, 30, and 31 on the working surfaces, 15 and 20, of the interior corner directional flow flashing 10 will effectively direct the flow of accumulated moisture even if the interior corner directional flow flashing 10 is semi-circular, in which case no center fold line 24 would exist. The novelty of such interior corner directional flow flashing 10 being the placement of the directional vanes, ribbing, scoring or etchings 25, 26, 27, 28, 29, 30, and 31 on the working surface or surfaces 15 and 20 of the interior corner directional flow flashing 10 such that the flow of accumulated moisture on such working surface or surfaces 15 and 20 is directed inwardly toward the interior of the interior corner directional flow flashing 10 and toward a moisture discharge point or points rather than toward the left vertical edge 17 and the right vertical edge 22 of the interior corner directional flow flashing 10. Where the moisture discharge points of the interior corner directional flow flashing 10, as depicted in FIG. 1, is along the bottom edges 18 and 23 of the interior corner directional flow flashing 10 so that accumulated moisture on the working surfaces 15 and 20 will flow toward the center line 24 of the interior corner directional flow flashing 10, down the center line 24 to the bottom edges 18 and 23 which extend into the interior of the shower pan 14, 35, 36, 37, and 38, as configured and depicted in FIG. 1, and subsequently flow down the sloped shower pan floor 14, through weepholes in the drain strainer receiver 12, and down the drain pipe 97, see FIG. 3, and not into the surrounding building structure.",
        "The value of the directional vanes, ribbing, scoring or etchings 25, 26, 27, 28, 29, 30, and 31 is readily understood when it is considered that when placed in the vertical position the interior corner directional flow flashing 10, as depicted in FIG. 1, may be considered as simply two flat panels joined at the center fold line 24. The natural action of accumulated moisture on a flat vertical panel is to form rivulets or streams flowing downwardly, but randomly taking direction to the right or left. The random change of direction of the rivulets of accumulated moisture to the right or left is, in the absence of the application of external forces, controlled by the random occurrence of imperfections in the surface of the flat vertical panel. The directional vanes, ribbing, scoring or etchings 25, 26, 27, 28, 29, 30, and 31 may be considered as non-random, intentionally created imperfections in the surface of the flat vertical panel. Thus, accumulated moisture flow is intentionally directed toward a discharge point or points on the interior corner directional flow flashing 10 by the directional vanes, ribbing, scoring or etchings 25, 26, 27, 28, 29, 30, and 31 on the working surfaces 15 and 20.",
        "In FIG. 2, an exterior corner directional flow flashing 40 is depicted. The exterior corner directional flow flashing 40 is depicted as providing a center fold line 45, a left hand vertical edge 42, a right hand vertical edge 41, and directional vanes, ribbing, scoring or etchings 46, 47, 43, and 44, together with other depicted but un-numbered directional vanes, ribbing, scoring or etchings on its working surfaces. Operation of the exterior corner directional flow flashing 40 is as previously described for the interior corner directional flow flashing 10, excepting that the moisture discharge points for the exterior corner directional flow flashing 40 are along its bottom edge which rests upon the sloped horizontal wall 61 and the vertical wall 62 of the shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, whereby the moisture discharges into the shower pan 14, 61, 62, 64, and 68.",
        "Also, as can be seen by examination of FIG. 2, the directed flow flashings, 10 and 40, of the instant invention are installed in the shower enclosure support structure such that their moisture discharge points are within the shower pan 14, 61, 62, 64, and 68, and such that the directed flow flashings, 10 and 40, are between the spacer material or sheetrock 54, 50, 55, and 56, forming the vertical walls of the shower enclosure support structure and the sheets of synthetic marble, tile or other porous or non-porous material, not depicted, which would be installed on the interior of the vertical walls of the shower enclosure support structure and would define the shower enclosure. The directional flow flashings, 10 and 40, when installed vertically, should be installed so that either their working surfaces, 15 and 20 and un-numbered on the external corner directional flow flashing 40, or the ribs 26, 27, 28, 29, 30, 31, 43, 44, 46, 47, and other un-numbered as depicted in FIG. 2, contact the back side of the sheet of porous or non-porous material comprising a part of the shower enclosure.",
        "The function of the sheetrock 54, 50, 55, and 56, is to provide adhesive backing for and spacing between the back side of the sheets of synthetic marble, tile or other porous or non-porous material used to line the interior of the shower enclosure and the shower enclosure support structure framing members 61, 63, 66, 67 and 69 or shower pan vertical walls 60, 62, and 64. Accordingly, the instant invention may be practiced with spacers, not depicted, rather than sheetrock.",
        "The second improvement to the method and art of constructing shower enclosure support structures is the use of spacers or mortar piers 91, instead of a mortar bed, between the shower floor 90 and the shower pan floor 14, depicted in FIG. 3, which is sloped downwardly toward the shower strainer receiver 12, such that the flow of water into the weepholes of the drain strainer receiver 12 is not impeded. The use of the mortar piers 91 or spacers creates a void between the shower floor 90 and the shower pan floor 14 which improves water flow and increases air circulation and thus moisture drying between the shower floor 90 and the shower pan floor 14. The shower floor 90 is typically comprised of a sheet of synthetic marble or other non-porous material placed on mortar piers 91 or spacers which rest on the upper surface of the shower pan floor 14. Accordingly, the slope of the shower pan floor 14 closely follows the slope of the shower floor 90. The shower pan floor 14 is typically the bottom portion of a pre-formed fiberglass, plastic or similar material, shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3, which is supported above the building or structure floor by a sloped mortar bed 82. The sloped mortar bed 82 is usually formed to provide even support to all of the shower pan floor 14, and thus the sloped mortar bed 82 is also sloped toward the shower drain. Necessarily, the drain strainer receiver 12 provides apertures through which moisture can enter the drainpipe 97 and be discharged from the shower enclosure support structure.",
        "The sloped shower floor 90 of the instant invention, as depicted in FIG. 3, provides for spacing 93 around its periphery between the sheet of synthetic marble, tile or other porous or non-porous material comprising the shower floor 90 and the shower pan vertical walls 62 and 83. Additionally, the sheet of synthetic marble, tile or other porous or non-porous material comprising the shower floor 90 is supported above the shower pan floor 14 by mortar piers 91 or spacers. By placing the sheet of synthetic marble, tile or other porous or non-porous material comprising the shower floor 90 on mortar piers 91 or spacers, a void 92 is created between the shower pan floor 14 and the shower floor 90. The void 92, in conjunction with the spacing 93 serves to define an airway, a ventilation path, between the shower pan floor 14 and the shower floor 90. This airway or ventilation path serves to permit air circulation within and final drying of the spacing, the void 92, between the shower pan floor 14 and the shower floor 90. The sheet of synthetic marble, tile or other porous or non-porous material comprising the shower floor 90 depicted in FIG. 3 are adhered to the tops of the mortar piers 91 or spacers which provide spacing from the shower pan floor 14 and thereby create the void 92.",
        "The third improvement to the method and art of constructing shower enclosure support structures is the use of sloped horizontal surfaces on the shower enclosure support structure members that frame the shower enclosure. For example, in FIG. 2 the horizontal member 67 provides a sloped upper surface and the horizontal member 63 which forms the threshold or step into the shower enclosure provides a sloped upper surface, in FIG. 3, which is a different configuration shower enclosure than that depicted in FIG. 2, the vertical member 80 provides a sloped upper surface and the horizontal member 84, with is the threshold or step in the configuration of FIG. 3, provides a sloped upper surface. All sloped upper surfaces slope toward the shower drain. It is common that the upper surfaces of shower enclosure support structure members used to frame the shower enclosure will be coated with fiberglass or other water repellant material in order to keep moisture from seeping into the shower enclosure support structure member and providing a nutrient source for mold growth. However, such common coating of the shower enclosure support structure member surfaces is not completely effective as the moisture pools on top of the water repellant material and mold tends to grow on top of the shower enclosure support structure member surface being so protected. The instant invention avoids this source of mold growth by deliberately sloping the tops of the shower enclosure support structure member surfaces toward the shower drain so that moisture accumulation will run off the shower enclosure support structure member and into the shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3, so that the moisture will either evaporate or be discharged through the shower drain from the shower enclosure support structure.",
        "The fourth improvement to the method and art of constructing shower enclosure support structures is that the shape of the shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3, is such that all horizontal surfaces created by the shower enclosure support structure framing members are covered with sloped surfaces 61, 68, and 85, of the shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3, which are sloped toward the shower drain. Commonly, shower pans are either simple box-like constructs providing a floor and four vertical walls, or are elaborate pre-fabricated units defining the entirety of the shower enclosure. There is a growing trend toward hand-laying fiberglass to form a shower pan. This is necessitated by the trend toward design of custom shower enclosures. The novelty of the instant shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3, is that it extends up to and over the sloped horizontal shower enclosure support structure framing member surfaces, 61, 68, and 85, thereby preventing moisture accumulation on what would normally be horizontal surfaces and directing the accumulated moisture flow toward the shower drain.",
        "The fifth improvement to the method and art of constructing shower enclosure support structures is that a void 65, for ventilation, is created between the top of the shower pan vertical walls 62 and 64 and the spacer materials or bottom of the sheetrock 50, 55, 56, and 70 used to enclose the shower stall. This void 65 permits air circulation between the top of the shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3, and the bottom of the sheetrock 50, 55, 56, and 70, and this air circulation dries the moisture which normally accumulates and nourishes mold growth along the line where the top of the shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3, and the bottom of the sheetrock 50, 55, 56, and 70. In FIG. 2, the airway or void 65 is depicted, from left to right, as being above the shower pan vertical wall 60, below the sheetrock 54, continuing behind the exterior corner directional flow flashing 40, above the shower pan vertical wall 62 and below the sheetrock 50, continuing behind the interior corner directional flow flashing 10, above the shower pan vertical wall 64 and beneath the two panels of sheetrock 55 and 56. Reference numeral 69 depicts the presence of a shower enclosure support structure vertical support member, and nail heads 57, 58, and 59, together with others un-numbered, indicate attachment means of the sheetrock 55 and 56 to the shower enclosure support structure vertical member 69. In FIG. 3, the airway or void 65 is depicted, from left to right, as being above the shower pan vertical wall 64, below the sheetrock panel 70. Reference numerals 71 and 72 depict the presence of shower enclosure support structure vertical support members, and nail heads 73, 74, 75, 76, 77, and 78 indicate attachment means of the sheetrock panel 70 to the shower enclosure support structure vertical members 71 and 72.",
        "The sixth improvement to the method and art of constructing shower enclosure support structures is that a weep line 100, see FIGS. 4 and 5, is installed and positioned between the shower pan floor 14 and the shower floor 90 to permit injection and insertion of mold inhibiting chemicals into the airway or void 92. Commonly used mold inhibiting chemicals include household bleach. The weep line 100 depicted in FIGS. 4 and 5 is a flexible hose, closed on one end, which provides small apertures 101, 102, 103, and numerous other un-numbered, in its surface through which mold inhibiting chemicals injected in the weep line's 100 non-closed end can seep or weep out into the void 92. The shower pan floor 14 being sloped downwardly toward the shower drain, such mold inhibiting chemicals will serve to fully and finally kill any small pockets of mold as have begun growth, particularly in and around the drain strainer receiver 12 or the drain pipe connector 96, or the mortar piers 91 or spacers between the shower floor 90 and the shower pan floor 14.",
        "While each of the above-described improvements to the method and art of constructing shower enclosure support structures s is independently important, the synergistic impact of all such improvements taken in unison is to create a shower enclosure support structure where not only at the level of the sheets of synthetic marble, tile or other; porous or non-porous material comprising the interior of the shower enclosure, normally all that is seen by the shower user, but at the structural level, the level of the shower enclosure support structure's structural members, all water and moisture accumulation is directed toward the shower's drain by horizontal surfaces that are sloped toward the drain and are covered by sloped horizontal surfaces 61, 68, and 85, of the shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3.",
        "The method of the instant invention is to construct a shower enclosure support structure, as hereinabove previously and commonly described, which additionally incorporates one or more of the above-identified improvements, each of which will separately and independently have a salutary effect upon the inhibition of mold growth in and around the shower enclosure.",
        "In practice, before construction of a leak proof shower enclosure support structure may begin, a shower drain strainer receiver 12, shower drain strainer 13, and drain pipe connector 96, that are compatible with the use of the selected underlying shower pan, must be installed upon the foundation 95 and connected to the drain pipe 97. The shower pan, not given a unique reference number in the drawings, comprises in the depicted preferred embodiments the shower pan floor 14, and such of the shower pan walls 35, 36, 62, 64, 83, and shower pan sloped horizontal surfaces 61, 68, 85, as are part of the particular design of the shower pan selected. An underlying shower pan is a water proof membrane which is usually, according the current state of the art methods of shower enclosure support structure construction, placed behind the lower portion of the shower enclosure walls (not depicted in the drawings) and under the shower enclosure floor 90 which has as its purpose the capture of moisture that may seep or otherwise pass through the sealant or grout of the finished shower enclosure (not depicted in the drawings).",
        "The first step in the construction of a leak proof shower enclosure support structure is to install in the usual fashion the vertical framing members 66, 69, 71, 72, and 80, of the shower enclosure support structure that define the design and shape of the finished shower enclosure. Then, all horizontal members 63, 67, and 84, of the shower enclosure support structure that are located within the expected wet area (that portion of the interior of the finished shower enclosure that is lower than the shower head) of the finished shower enclosure must be installed with the tops of all horizontal members sloped toward the shower drain 13.",
        "The foundation 95 of the structure (not depicted) within which the shower enclosure support structure is to be constructed (also herein “superstructure”) is normally level. The next step in the construction of the shower enclosure support structure is to construct a sloped upper surface 82a of shower pan support material 82 above the foundation 95 and below the shower pan so that the upper surface 82a of shower pan support material 82 beneath the shower pan slopes downwardly toward the drainpipe connector 96 and the drain strainer receiver 12. The required construction of the sloped upper surface 82a of shower pan support material 82 is accomplished by the application of a structurally sound material such as mortar to the upper surface of the foundation 95.",
        "After all sloped horizontal members of the shower enclosure support structure have been installed and the sloped upper surface 82a of shower pan support material 82 has been constructed, the next step in the construction of the shower enclosure support structure is to install the shower pan material over all surfaces of the shower enclosure support structure, up to a level higher than the sloped horizontal surfaces 61 and 85 of the shower enclosure support structure that are within the expected wet area of the finished shower enclosure. This installation of shower pan material over the sloped horizontal surfaces and the flashings and the shower pan walls creates a liner that positively directs moisture collected within the shower enclosure support structure to the weep holes located in the shower drain strainer receiver 12 and prevents the flow of moisture out of the shower pan.",
        "Following the installation of the shower pan material over all horizontal surfaces, sheetrock or other spacing material suitable for support of the sheets of interior enclosure structure material, which may be either finished (such as sheet marble, Corian™, or the like) or unfinished (such as hardy backer, concrete board, or other surfaces suitable for tile installation), should be installed on all vertical framing members, in the preferred embodiments depicted in the drawings see vertical framing members 66, 69, 71, and 72. Air space for ventilation between the sheets of interior enclosure structure material and the shower enclosure support structure is created by the above-mentioned spacing material. In the preferred embodiment, the air space 65 is left for ventilation between the top of the shower pan material 64, 62, and 60 and the spacer material 50, 54, 55, 56, and 70. Thin spacers (not depicted in the drawings) that compensate for the thickness of the walls of the shower pan should be placed between the interior of the shower pan walls and the sheets of interior enclosure structure material for additional support of the sheets of interior enclosure structure material provided that there is no restriction of the flow of moisture or of ventilation between the shower pan and the sheets of interior enclosure structure material. In the case of an unfinished sheet of enclosure structural material (such as hardy backer, concrete board, or other surfaces suitable for tile installation) the spacer material should be added as a furring strip to the vertical framing members. The exposure of the back side of the sheets of interior enclosure structure material to the air spaces within the structure of the surrounding building or superstructure aid in the evaporation of moisture that may penetrate the sheets of interior enclosure structure material. Directional flow flashings which extend downwardly into the shower pan may be attached to the above-mentioned furring strips to avoid moisture accumulation on the spacers.",
        "Following installation of spacing material suitable for support of the sheets of interior enclosure structure material on all vertical framing members, directional flow flashings (in the preferred embodiments and depicted in the drawings as 10 and 40) should be placed on all interior and exterior corners within the wet area of the shower enclosure support structure with the gravitational direction of the veins downward and toward the center of each of the directional flow flashings. All directional flow flashings must extend down to a point below the upper edge of the adjacent portion of the shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3, so that moisture discharge from the directional flow flashings will be into the shower pan 14, 61, 62, 64, and 68, as configured and depicted in FIG. 2, and 14, 61, 62, 64, and 85 as configured and depicted in FIG. 3.",
        "Following installation of directional flow flashings on all interior and exterior corners within the wet area of the shower enclosure support structure, the weep line 100 should be installed around the perimeter of the shower pan floor 14. The receiving end of the weep line 100 should be routed to a location that is accessible to an injector mechanism (not depicted in the drawings) for the automatic or mechanical feed of mold inhibiting chemicals. Care must be taken that all holes in the weep line 100 are located within the shower pan and direct the flow of the mold inhibiting chemicals into the shower pan.",
        "After installation of the weep line 100, mortar piers or other spacer materials 91 are used to support the interior enclosure structure material (only the shower enclosure floor 14 is depicted) over the shower pan floor 90. All spacer materials 91 must be themselves spaced such that they do not obstruct air or moisture flow. Air space 92 is left between the shower pan floor 90 and the interior enclosure structure material for free flow of moisture to drain weep holes and ventilation. Air space 93 must also be left between the outer edges of the interior enclosure structure material (not depicted in the drawings), installed over the shower pan floor 90, and the shower pan walls 35, 36, 62, 64, and 83. All of these air spaces should contiguous with the air spaces within the building structure or superstructure which are accessed between the top 37, 38 of the shower pan walls 35, 36, and the bottom of the sheet rock 50, 54, 55, 56, 70 or spacer materials and thereby provide continuous air flow between the interior enclosure structure material installed over the shower pan floor 90 and the top of the shower pan walls 35, 36, 62, 64, and 83. Ideally, these air spaces should be in air flow communication with the atmosphere; however, any additional air space that exists within the superstructure will help dissipate the humidity caused by small amounts of moisture remaining in the leak proof shower enclosure support structure of the instant invention.",
        "The product or device of the instant invention is a shower enclosure support structure constructed to incorporate one or more of the above-identified improvements.",
        "While the preferred embodiments of the instant invention have been described in substantial detail and fully and completely hereinabove, it will be apparent to one skilled in the art that numerous variations of the instant invention may be made without departing from the spirit and scope of the instant invention, and accordingly the instant invention is to be limited only by the following claims."
    ],
    "citations": [
        "2859452",
        "3501879",
        "3606617",
        "4198715",
        "4551870",
        "5913777",
        "6155015",
        "6298620",
        "6851133"
    ],
    "us_classification": "4613",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "47",
            "subclass": "K",
            "main_group": "3",
            "subgroup": "40"
        }
    ]
}