{
    "title": "Method and device for producing filter cigarettes",
    "abstract": "In the production of filter-tipped cigarettes (",
    "inventors": [
        "Focke",
        "Beckmann",
        "Kunig"
    ],
    "document_number": "07296579",
    "publication_date": "20071120",
    "assignees": [
        "Focke & Co. (GmbH & Co.)"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. Method for the production of filter-tipped cigarettes (",
            "components": [
                {
                    "component": "a) the tobacco rods (",
                    "subcomponents": []
                },
                {
                    "component": "b) the part-rods (",
                    "subcomponents": []
                },
                {
                    "component": "c) filter pieces (",
                    "subcomponents": []
                },
                {
                    "component": "d) the two mutually assigned part-rods (",
                    "subcomponents": []
                },
                {
                    "component": "e) cigarette units (",
                    "subcomponents": []
                },
                {
                    "component": "f) the filter-tipped cigarettes (",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. Method for the production of filter-tipped cigarettes (",
            "components": [
                {
                    "component": "a) feeding the tobacco rods (",
                    "subcomponents": []
                },
                {
                    "component": "b) moving the two part-rods (",
                    "subcomponents": []
                },
                {
                    "component": "c) feeding the filter pieces (",
                    "subcomponents": []
                },
                {
                    "component": "d) removing the two part-rods (",
                    "subcomponents": []
                },
                {
                    "component": "e) returning the cigarette units (",
                    "subcomponents": []
                },
                {
                    "component": "f) displacing the filter-tipped cigarettes (",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. Apparatus for the production of filter-tipped cigarettes (",
            "components": [
                {
                    "component": "a) a main cylinder (",
                    "subcomponents": [
                        "a plurality of the segment troughs (",
                        "the tobacco rods (",
                        "after the rods (",
                        "the main cylinder ("
                    ]
                },
                {
                    "component": "a plurality of the segment troughs (",
                    "subcomponents": []
                },
                {
                    "component": "the tobacco rods (",
                    "subcomponents": []
                },
                {
                    "component": "after the rods (",
                    "subcomponents": []
                },
                {
                    "component": "the main cylinder (",
                    "subcomponents": []
                },
                {
                    "component": "b) a filter cylinder (",
                    "subcomponents": [
                        "removing the two part-rods (",
                        "bringing together the two part-rods ("
                    ]
                },
                {
                    "component": "removing the two part-rods (",
                    "subcomponents": []
                },
                {
                    "component": "bringing together the two part-rods (",
                    "subcomponents": []
                },
                {
                    "component": "joining together the two part-rods (",
                    "subcomponents": []
                },
                {
                    "component": "c) a return cylinder (",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. Apparatus according to claim 3 , wherein the part-rods (",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. Apparatus according to claim 4 , wherein he sideways movement, parallel to the axis, of the sliding segments (",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. Apparatus according to claim 5 , wherein each of the segment troughs (",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. Apparatus according to claim 6 , wherein the spaces between the segment troughs (",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. Apparatus according to claim 5 , wherein the position of the stops is adjustable in a manner such that a displaceable support for the spacer bolts (",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. Apparatus according to claim 4 , wherein the amplitude of movement of the sliding segments (",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. Apparatus according to claim 9 , wherein the actuating member is connected via an adjustable connection to the assigned sliding segment (",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. Apparatus according to claim 10 , wherein, in order to change the position of the sliding segments (",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. Apparatus according to claim 3 , wherein the part-rods (",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. Apparatus according to claim 12 , wherein the sideways movement, parallel to the axis, of the sliding segments (",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. Apparatus according to claim 13 , wherein each of the segment troughs (",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. Apparatus according to claim 14 , wherein the spaces between the segment troughs (",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. Apparatus according to claim 13 , wherein the position of the stops is adjustable in a manner such that a displaceable support for the spacer bolts (",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. Apparatus according to claim 12 , wherein the amplitude of movement of the sliding segments (",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. Apparatus according to claim 17 , wherein the actuating member is connected via an adjustable connection to the assigned sliding segment (",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. Apparatus according to claim 17 , wherein, in order to change the position of the sliding segments (",
            "components": []
        }
    ],
    "description": [
        "1. Technical Field",
        "The invention relates to a method for the production of filter-tipped cigarettes from tobacco rods, which are severed centrally during transportation to produce part-rods, the part-rods being moved apart, and being connected by means of wrapping paper to a filter piece and cigarette units thus formed being severed centrally in the region of the filter piece. The invention also relates to an apparatus for carrying out the method.",
        "2. Prior Art",
        "The production or finishing of filter-tipped cigarettes takes place in the area of a filter attachment machine. The latter comprises a number of cylinders with troughs arranged on the circumference. The abovementioned process steps for the production of the filter-tipped cigarettes are performed in the area of these troughed cylinders.",
        "It is an object of the present invention to improve the production of filter-tipped cigarettes in the area of the filter attachment machine by simplifying the design of the said machine and by increasing output.",
        "In order to achieve this object, the method according to the invention is characterized by the following features:\n\n    \n    \n        a) the tobacco rods or the part-rods are fed to a main cylinder and transported by the latter,\n        b) the part-rods are moved to a distance apart from one another by axial displacement during transportation on the main cylinder,\n        c) filter pieces are fed to the main cylinder by a filter cylinder disposed adjacently to the main cylinder and are inserted into a gap formed between the part-rods,\n        d) the (two) mutually assigned part-rods, each with one filter piece, are removed from the main cylinder and transported outside the region thereof, during which they are joined together and connected to one another by means of wrapping paper, and\n        e) cigarette units thus formed are returned to the main cylinder and, during further transportation on the main cylinder, are severed centrally in the region of the filter pieces to form filter-tipped cigarettes.",
        "In accordance with this method according to the invention, the central main cylinder is the conveyor member for the parts of the filter-tipped cigarettes until the completion thereof, with the proviso that the joining of the tobacco rods to, in each case, one (double-length) filter piece takes place outside the area of the main cylinder.",
        "The apparatus according to the invention for the production of filter-tipped cigarettes comprises, in the area of the main cylinder, supports for a number of troughs, specifically segments or sliding segments. These can be moved with the troughs and the tobacco rods or filter-tipped cigarettes disposed therein in a direction parallel to the axis, in particular moved apart, in order to move parts of the filter-tipped cigarettes or pairs of filter-tipped cigarettes to a distance apart from one another. Therefore, according to the invention, every two coinciding sliding segments are assigned to one another in the axial direction of the main drum and can be moved (simultaneously) in one or other direction parallel to the axis. The entire circumference, or a shell, of the main cylinder consists of such sliding segments, in each case having a number of troughs to receive the parts of the filter-tipped cigarettes.",
        "An important special feature resides in measures for the simple adjustment of the apparatus, specifically of the main cylinder in particular, for the production of filter-tipped cigarettes of different dimensions, especially with filters or filter pieces of different lengths.",
        "Adjustment to such changes of format takes place, according to the invention, by a simple adjustment of members or the insertion of spacers, stops or the like, which—independently of predetermined amplitudes of movement of the sliding segments—determine the gap to be created between two mutually assigned tobacco rods in accordance with the length of the filter piece to be inserted.",
        "Further advantages and special features of the invention are explained in detail below with reference to an example of embodiment of the apparatus. In the drawings:",
        "FIG. 1 shows a part-area of the apparatus with a main cylinder in a diagrammatic lateral view,",
        "FIG. 2 shows a cross section through a detail in a plane of section II-II in FIG. 6, on a larger scale,",
        "FIG. 3 shows a circumferential region of the main cylinder in a radial plan view, III-III in FIG. 1, on a larger scale,",
        "FIG. 4 shows a transverse or radial section in the plane of section IV-IV in FIG. 3,",
        "FIG. 5 shows a view analogous to FIG. 4, with offset members, corresponding to the plane of section V-V in FIG. 3,",
        "FIG. 6 shows a further view analogous to FIG. 4 and FIG. 5, specifically in the plane of section VI-VI in FIG. 3,",
        "FIG. 7 shows a view analogous to FIG. 3 for another circumferential area of the main cylinder corresponding to the line of sight VII-VII in FIG. 1,",
        "FIG. 8a to FIG. 13b show different positions of trough supports or sliding segments of the main cylinder in radial section, in each case comparing filter-tipped cigarettes with filters of different lengths and a symbolic representation of the current phase of production, in the region of the main cylinder, and",
        "FIG. 14 to FIG. 17 show illustrations of areas in which tobacco rods on the one hand and cigarette units on the other are delivered to the main cylinder, FIG. 14 and FIG. 15 on the one hand and FIG. 16 and FIG. 17 on the other showing different embodiments.",
        "The apparatus diagrammatically shown in FIG. 1 forms part of a cigarette production machine. The central element is a main cylinder 10. Assigned to this are a plurality of secondary cylinders, which lead, in a direction parallel to the axis, to the circumference of the main cylinder 10. They are a feed cylinder 11, a filter cylinder 12, a return cylinder 13 and a removal cylinder 14. The individual production phases are shown symbolically and assigned to the appropriate areas of the main cylinder 10 and/or other conveying members.",
        "According to the illustration, tobacco rods 15 cut from a tobacco tow are passed to the main cylinder 10 by the feed cylinder 11. In the present example of embodiment, the tobacco rods 15 have already been severed centrally in a previous working stroke, two part-rods 16, 17 of the same length being formed. These are initially transported in troughs 18 of the feed cylinder 11 and then received by troughs of the main cylinder 10, specifically segment troughs 19, 20.",
        "During the transportation of the tobacco rods 15 by the main cylinder 10 to the filter cylinder 12, the part-rods 16, 17 are moved apart in the axial direction, forming a gap between the two part-rods 16, 17 (FIG. 5, FIG. 6). A (double-length) filter piece 21 is inserted into this gap. This is prepared separately and fed in by the filter cylinder 12, which is likewise equipped with troughs 18, to the circumference of the main cylinder 10.",
        "A special feature of the apparatus resides in the fact that it is only in the region where the main cylinder 10 and filter cylinder 12 are adjacent that the filter pieces 21 enter the segment troughs 19, 20 of the main cylinder 10. Immediately thereafter, the filter cylinder 12 again picks up each pair of mutually assigned part-rods 16, 17, together with a filter piece 21, from the main cylinder 10, and transports these parts until they are delivered to a conveyor (not shown in detail). In the region of the latter, the part-rods 16, 17 are initially brought into contact with the assigned filter piece 21. Thereafter, during transportation outside the main cylinder 10, the connection between these elements is formed, this being done by a wrapping paper 22, which is laid around the parts to be connected to one another. The cigarette units 23 thus formed are conveyed back by the return cylinder into the main cylinder 10 and laid down in the segment troughs 19, 20.",
        "During the transportation of the cigarette units 23 on the main cylinder 10, which now follows, a severing cut is made centrally in the region of the filter pieces 21, this being done by a severing blade 24 assigned to the main cylinder 10. As a result, (finished) filter-tipped cigarettes 25 are formed, with filters 26 facing one another. The filter-tipped cigarettes 25 are transported onwards—the distance between them being increased—by the main cylinder 10 to the removal cylinder 14, which takes over and removes the filter-tipped cigarettes 25 in pairs. The emptied segment troughs 19, 20 are now free to receive the tobacco rods 15.",
        "The main cylinder 10 is configured in a special manner, specifically with supports for the troughs, these being sliding segments 27, 28, disposed on the outer circumference, movable parallel to the axis and assigned to one another in pairs. The sliding segments are displaceably mounted on support bars 29 and are controlled, in particular, by cams disposed within the main cylinder 10.",
        "A circumferential segment ring 30 is attached as an immovable member between the mutually assigned sliding segments 27, 28. The support bars 29 are connected to the segment ring 30.",
        "The sliding segments 27, 28 comprise a number of segment troughs 19, 20 disposed side by side at a short distance apart from one another and oriented in the same direction. The segment troughs 19, 20 contain drilled holes 31, which are connected to a vacuum source, so that a vacuum prevails in the troughs or segment troughs 19, 20 to secure the tobacco rods 15 and cigarette units 23 or filter-tipped cigarettes 25. The segment troughs 19, 20 are continued by annular troughs 32 in the segment ring 30. When sliding segments 27, 28 lie against the segment ring 30, continuous troughs (FIG. 3, bottom) are formed, for example to receive tobacco rods 15 or part-rods 16, 17. The annular troughs 32 are also provided with drilled holes 33 which are connected to a vacuum source and—independently of the drilled holes 31—can be subjected to the action of suction air.",
        "The filter pieces 21 are laid against the circumference of the main cylinder 10 in the region of the segment ring 30 and are fixed. The severing cut is additionally made in the region of the segment ring 30 by the severing blade 24. For this purpose, the segment ring 30 has a central groove 34 into which the severing blade 24 enters when performing the severing cut.",
        "The sliding segments 27, 28 permit the displacement (by groups) of elements for the production of the filter-tipped cigarettes 25, specifically, first the movement apart of the part-rods 16, 17 (FIG. 3) and then the movement apart of the filter-tipped cigarettes (FIG. 7). The distance of the sliding segments 27, 28 from one another determines the gap between the part-rods 16, 17 and the filter-tipped cigarettes 25.",
        "A special feature resides in the fact that, during the transportation of the part-rods 16 and 17 with filter piece 21 and of the formed cigarette units 23 outside the area of the main cylinder 10, specifically above the latter, the moved-apart sliding segments 27 are moved back again to a lesser distance apart from one another or until they rest upon the segment ring 30, in other words in the position shown in FIG. 7, top. In this position, the finished cigarette units 23 can again be laid on the sliding segments 27, 28.",
        "A special feature is the adaptability of the apparatus to different dimensions of the filter pieces 21 or filters 26, or of the part-rods 16, 17, without any retooling of the main cylinder or of a transmission. In the example of embodiment shown in FIG. 1 to FIG. 7, the procedure followed is that the parts resting in the segment troughs 19, 20, especially part-rods 16, 17, are moved against stops which determine the relative position in accordance with the respective dimensions of the processed elements. The sliding segments 27, 28 are set by gearing to a format-independent amplitude of movement. This corresponds to a maximum dimension of filter-tipped cigarettes 25. The parts resting in the segment troughs 19, 20 are stopped by adjustable spacers at the correct position for the format, irrespective of the movement of the sliding segments 27, 28.",
        "The spacers in this example of embodiment are (cylindrical) spacer bolts 35, which enter from both sides into the troughs, specifically segment troughs 19, 20, of the sliding segments 27, 28. The spacer bolts 35, of equal length and disposed on both sides of the main cylinder 10, lie with their axes aligned with the axes of the segment troughs 19 and, on movement of the sliding segments 27, 28 outwards, enter into these segment troughs 19. End surfaces of the part-rods 16, 17 run against the ends of the spacer bolts 35 and are held in the desired relative position when the sliding segments 27, 28 continue moving (FIG. 3, top). This position of the part-rods 16, 17 produces a gap formed between them in accordance with the length of the filter piece 21.",
        "A format change is performed without replacement of the spacer bolts 35 themselves but by changing the relative position thereof in the direction parallel to the axis. For this purpose, the spacer bolts 35 are connected to support rings 36 on both sides of the main cylinder 10. These, in turn, are displaceably attached to outer fixed rings 37 as part of a support frame of the main cylinder 10. The support rings 36 can be adjusted. As a result of the insertion of a spacer 38 between support ring 36 and fixed ring 37, an axial displacement of the spacer bolts 35 takes place. FIG. 3, right, shows a position with shorter part-rods 16, 17 or shorter filter pieces 21, while FIG. 3, left, permits the longer embodiment, specifically larger gaps between the part-rods 16, 17.",
        "The spacer bolts 35 cause interference in the region in which filter-tipped cigarettes 25 are being conveyed in the segment troughs 19, 20, because the filter-tipped cigarettes 25 have to be moved to a relatively long distance apart from one another (FIG. 7, bottom). For this purpose, the segment troughs 19, 20 of the main cylinder 10 are disposed at a short, minimal distance from one another, which corresponds to half the distance between the troughs 18 of the feed cylinder 11, filter cylinder 12, return cylinder 13 and removal cylinder 14. The relative position of the conveying members is selected to be such that the tobacco rods 15 or part-rods 16, 17 are laid in first segment troughs 19. Spacer bolts 35 disposed at the appropriate distance apart from one another are assigned to these first segment troughs 19. The second segment troughs 20 remain free in this region of the main cylinder 10 (FIG. 3). When the cigarette units 23 are returned to the main cylinder by the return cylinder 13, the relative position of the troughs 18 on the return cylinder 13 ensures that the cigarette units 23 are laid in the (second) segment troughs 20 (FIG. 7). These lie in the region between the spacer bolts 35.",
        "The operations described are also shown in FIG. 14 and FIG. 15. It can be seen that, in each case, only every second (segment) trough of the main cylinder 10 is charged by the feed cylinder 11 and the return cylinder 13.",
        "The spacer bolts 35 expediently have a particular cross section, which can be seen in FIG. 2. The spacer bolts 35 of round cross section have a larger cross section than corresponds to the diameter of the segment troughs 19, 20, to provide better support for the part-rods 16, 17. The lower cross-sectional region, which enters into the troughs, is provided with a semi-circular cut-out 39, so that the spacer bolts 35 extend within the troughs at a distance apart from the circular-surface-shaped bases of the troughs.",
        "A special alternative for easier adaptability of the apparatus to different cigarette formats is shown in FIG. 8a to FIG. 13b. The aim here is to change the relative position of the sliding segments 27, 28 in their starting position, with the proviso that, with unchanged amplitudes of movement, different end positions of the sliding segments 27, 28 are obtained, with adaptation to the current cigarette format. The illustration in the drawing has been selected so that FIG. 8a, FIG. 9a, etc., each show comparative views of a sliding segment 27, 28 for cigarettes of different lengths in various positions, whereas FIG. 8b, FIG. 9b, etc. show diagrammatically the position on the main cylinder 10 corresponding to the selected position of the sliding segments 27, 28, in other words the current associated phase of production. The thick line here indicates the conveying path of the elements of the filter-tipped cigarettes 25 or of the cigarettes themselves. FIG. 8a to FIG. 10a show phases in the region between the feed cylinder 11 and the filter cylinder 12, while FIG. 11a to FIG. 13a refer to the production section following the return cylinder 13 as far as the provision of the sliding segments 27, 28 in the region of the feed cylinder 11.",
        "The sliding segments 27, 28 can be controlled in respect of their movement by a control curve or control groove 40. A sensor member, specifically a roller 41, connected to the sliding segment 27, 28 enters into the control groove 40, drawn in a simplified style as a continuous track. The roller 41 is connected to the sliding segment 27, 28 via a push-and-pull member, specifically via a bar 42. The sliding segment 27, 28 is adjustable relative to the bar 42, for the purpose of creating a different starting position. To this end, as is shown diagrammatically, a head 43 connected to the bar 42 in a recess 44 of the sliding segment 27, 28 is adjustable, specifically against the loading of a spring, specifically a compression spring 45.",
        "In the production of cigarettes of normal length, or with the conventional length of the filter piece 21, the compression spring 45 is relaxed. The head 43 lies against an end wall of the recess 44 (FIG. 8a, FIG. 9a, etc., bottom in each case). The sliding segments 27, 28, in the production of a cigarette of this type, lie against the fixed segment ring 30 in the starting position.",
        "The upper illustration in each of FIG. 8a, FIG. 9a, etc. shows an alternative for the processing of shorter filter pieces 21, in other words an alternative in which a smaller gap is created between the part-rods 16, 17. This is achieved in that, in the starting position (FIG. 8a, top), the sliding segments 27, 28 are already displaced towards the end position. This is brought about by the insertion of a spacer 46 between the sliding segment 27, 28 on the one hand and the segment ring 30 on the other. The effect of this is that the sliding segment 27, 28, in the starting position, is at a distance apart from the segment ring 30, in other words it has already completed a first section of its movement towards the lateral end position. In this case, the sliding segments 27, 28 are also displaced relative to the bar 42 of uniform length, this occurring with compression of the compression spring 45. The tobacco rods 15 or part-rods 16, 17 are—irrespective of the length of the filter piece 21—always laid in the same position, specifically centrally relative to the segment ring 30. In the course of the subsequent movement apart of the sliding segments 27, 28, the movement operation for the lower example in each of the drawings, in other words without a spacer 46, begins immediately because the movement of the bar 42 is transmitted directly to the sliding segment 27, 28. When the spacer 46 is used, the free space within the recess 44 is first overcome during the movement of the bar 42, until the head 43 rests on the end wall of the recess 44 (FIG. 9a, top). At this point, in this embodiment also, the displacement of the sliding segment 27, 28 parallel to the axis begins, this movement leading to the end position shown in FIG. 10a. This corresponds to the position of the part-rods 16, 17 for the insertion of the filter piece 21. As is apparent, a shorter distance is created in the upper illustration than in the lower embodiment without a spacer 46.",
        "The movements following the return of the cigarette units 23 to the main cylinder 10 take place in a similar manner. The upper illustration in each of FIG. 11a, FIG. 12a and FIG. 13a shows the embodiment with a spacer 46, in other words with a shorter filter piece 21 or shorter filter 26. In FIG. 11a, specifically in the region where the cigarette units 23 finished elsewhere are received, the sliding segments 27, 28 are located in the same position, this being caused by an appropriate configuration of the control groove 40. After the severing cut in the region of the filter piece 21, the filter-tipped cigarettes 25 formed are moved apart as far as the end position shown in FIG. 12a. In this case, the filter-tipped cigarettes 25 are at the same distance apart from one another—irrespective of the length of the filter 26. After the filter-tipped cigarettes 25 have been taken over by the removal cylinder 14, the sliding segments 27, 28 are moved back into the starting position to take over tobacco rods 15 or part-rods 16, 17, as shown in FIG. 13a. The sliding segments 27, 28 provided with the spacer 46 are in this case moved by the bar 42 only until the spacer 46 comes to rest on the segment ring 30. The further displacement of the bar 42 is absorbed by the compression spring 45 (FIG. 13a, top).",
        "In this solution for adaptation to different dimensions of cigarettes or filter pieces 21, the main cylinder 10 and the sliding segments 27, 28 are configured with the same trough division as the assigned cylinders, in other words the feed cylinder 11, the filter cylinder 12, etc. The sliding segments 27, 28 merely exhibit segment troughs 19 at the same distance apart as the troughs 18 (FIG. 16, FIG. 17).",
        "List of reference numerals:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10\nMain cylinder\n\n\n11\nFeed cylinder\n\n\n12\nFilter cylinder\n\n\n13\nReturn cylinder\n\n\n14\nRemoval cylinder\n\n\n15\nTobacco rod\n\n\n16\nPart-rod\n\n\n17\nPart-rod\n\n\n18\nTrough\n\n\n19\nSegment trough\n\n\n20\nSegment trough\n\n\n21\nFilter piece\n\n\n22\nWrapping paper\n\n\n23\nCigarette unit\n\n\n24\nSevering blade\n\n\n25\nFilter-tipped cigarette\n\n\n26\nFilter\n\n\n27\nSliding segment\n\n\n28\nSliding segment\n\n\n29\nSupport bar\n\n\n30\nSegment ring\n\n\n31\nDrilled hole\n\n\n32\nAnnular trough\n\n\n33\nDrilled hole\n\n\n34\nGroove\n\n\n35\nSpacer bolt\n\n\n36\nSupport ring\n\n\n37\nFixed ring\n\n\n38\nSpacer piece\n\n\n39\nCut-out\n\n\n40\nControl groove\n\n\n41\nRoller\n\n\n42\nBar\n\n\n43\nHead\n\n\n44\nRecess\n\n\n45\nCompression spring\n\n\n46\nSpacer"
    ],
    "citations": [
        "1824414",
        "3036581",
        "4531629",
        "5425383",
        "28 09 619",
        "26 55 790",
        "42 42 326",
        "1 013 181",
        "1 108 369",
        "1 138 215",
        "7-265051",
        "2000-189137"
    ],
    "us_classification": "131 94",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "24",
            "subclass": "C",
            "main_group": "5",
            "subgroup": "47"
        }
    ]
}