{
    "title": "Catalytic composition of organotin compounds",
    "abstract": "The present invention relates to catalytic compositions for esterification, transestrification and polycondensation reactions, a process for the catalysis of said reactions employing such catalytic compositions and polyesters for resins obtainable by this process.",
    "inventors": [
        "Röder",
        "Kapries",
        "Franke",
        "Schumacher",
        "Canisius"
    ],
    "document_number": "07297804",
    "publication_date": "20071120",
    "assignees": [
        "Chemtura Organometalics GmbH"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A catalytic composition for esterification, transesterification and polycondensation reactions of dicarboxylic acids, polycarboxylic acids and/or hydroxy carboxylic acids and alcohols, said catalytic composition containing a tin compound of the general formula (I):",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The catalytic composition according to claim 1 , wherein the anion A",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The catalytic composition according to claim 2 , wherein the anion A",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The catalytic composition according to claim 1 , wherein the anion A",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A process for the preparation of a catalytic composition according to claim 1 , said process comprising the step of reacting a metal alkoxide with a tin compound of the general formula:",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The process according to claim 5 , wherein said metal alkoxide and said tin compound are reacted in a mole proportion of 1:0.0001 up to 1:20, in particular 1:4 to 1:6, respectively.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The process according to claim 6 , wherein resultant metal oxides, metal hydroxides and/or alkoxy metal hydroxides remain in the catalytic composition.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The process according to claim 5 , wherein resultant metal oxides, metal hydroxides and/or alkoxy metal hydroxides remain in the catalytic composition.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A method for the continuous or batchwise production of esters or polycondensation products by esterification, transesterification, polyesterification or polytransesterification reaction, said method comprising using the catalytic composition as defined in claim 1 .",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method according to claim 9 , comprising a polyesterification reaction of a dicarboxylic acid derivative with a mono, divalent or polyvalent alcohol in the presence of the catalytic composition.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method according to claim 10 , employing derivatives of di or polycarboxylic acids selected from the group of esters or halogenides.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method according to claim 9 , employing derivatives of di or polycarboxylic acids selected from the group of esters or halogenides.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method according to claim 9 , employing derivatives of hydroxycarboxylic acids selected from esters.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method according to claim 9 , employing a metal concentration of said catalytic composition in the range of 0.1 ppm to 1 mole percent, in particular 10-100 ppm with reference to the acid or derivative to be reacted.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method according to claim 9 , employing a solvent or suspending agent for the manufacturing of the catalytic composition and/or said esterification, transesterification, polyesterification or polytransesterification reaction.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method according to claim 15 , employing the same solvent and/or suspending agent in the manufacturing of said catalytic composition and said esterification, transesterification, polyesterification or polytransesterification reaction.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method according to claim 15 , employing a solvent or suspending agent selected from the group consisting of mono-, di- or polyvalent alcohols being reacted in said esterification, transesterification, polyesterification or polytransesterification reaction.",
            "components": []
        }
    ],
    "description": [
        "The present invention relates to catalytic compositions for esterification, transesterification and polycondensation reactions, a process for the catalysis of said reactions employing such catalytic compositions and polyesters or resins obtainable by this process.",
        "Catalytic systems containing organotin compounds are widely known.",
        "E.g. compounds of the formula [(RSn)12O14(OH)6]2+ are described mainly in connection with their interesting structure in: H. Puff, H. Reuter, J. Organomet. Chem. 1989, 373, 173-184; D. Dakternieks, H. Zhu, E. R. T. Tiekink, R. Colton, J. Organomet. Chem. 1994, 476, 33-40; S. Durand, K. Sakamoto, T. Fukuyama, A. Orita, J. Otera, A. Duthie, D. Dakternieks, M. Schulte, K. Jurkschat, Organometallics 2000, 19, 3220-3223.",
        "Compounds of said type [(RSn)12O14(OH)6]2+ are further described to show a poor performance in catalyzing or activating reagents and compounds within the acetylation reaction of acetic anhydride with an alcohol (S. Durand, K. Sakamoto, T. Fukuyama, A. Orita, J. Otera, A. Duthie, D. Dakternieks, M. Schulte, K. Jurkschat, Organometallics 2000, 19, 3220-3223.)",
        "It is known for compounds of the formula [(BuSn)12O14(OH)6]2+ when stored in methanol, that a replacement of two structural important μ2-bridged OH groups of the cluster against OCH3 units can occur (D. Dakternieks, H. Zhu, E. R. T. Tiekink, R. Colton, J. Organomet. Chem. 1994, 476, 33-40).",
        "Furthermore is known that during the production of polyesters for some applications for example wrappings and technical yarns, a crystallization and polycondensation in the solid state is carried out (U.S. Pat. No. 4,064,112, U.S. Pat. No. 4,263,425, U.S. Pat. No. 5,362,844). In other applications, fibers or filaments are spun directly and direct preforms are produced in a process wherein an intermediate transfer into the solid state and a repeated remelting is not applied.",
        "Conventional polyester compositions are connected with a series of disadvantages (general summary in: Handbook of polyester thermoplastics, 1st edition, Wiley-VCH, Weinheim, 2002). Among these disadvantages are in particular:\n\n    Necessity of high temperatures for the synthesis\n    High catalyst concentration (100-500 ppm [as metal])\n    Degradation processes under processing and polycondensation conditions; for example formation of vinyl esters and due to the formation of acetic aldehyde in polyethylene terephthalate (PET), formation of acrolein in polypropylene terephthalate (PPT) and tetrahydrofuran formation in polybutylene terephthalate (PBT).\n    Limited use of the catalyst systems, dependent on the technology of the process and the chemical structure of the substrate; classic titanium based catalysts cannot be added for example during the esterification- and/or pre/condensation step, as these are readily hydrolyzed to inactivate titanium oxides.\n    Application of the catalyst system only in selected process stages for example only during the esterifications- or only during the transesterification- or only during the polycondensation stage.\n    Optical turbidity of the produced polyester for example by deposits of elementary metal impurities as this can occur by the use of antimony based catalyst systems.\n    Discoloration of the polyester by the catalyst itself, for example titanium based catalyst systems cause a yellow coloring of the polymer or formation of chromophor by-products, respectively.\n    Problematic metering and addition of catalysts and catalyst formulations.",
        "Object of the present invention is to provide a catalytic composition, suitable for catalyzing esterification, transesterification and polycondensation reactions, an improved process of catalyzed esterification, transesterification and polycondensation reactions and the production of improved polyesters for bottles, films, foils, yarn, molded padding, resins for powder coatings and technical synthetic materials, which avoid the disadvantages of the prior art.",
        "The problem is solved according to the invention by a catalytic composition, a process for the preparation of such catalytic compositions, their use and polyesters or resins as described herein.",
        "A first embodiment of the present invention refers to a catalytic composition for esterification, transesterification and polycondensation reactions of dicarboxylic acids, polycarboxylic acids, hydroxy carboxylic acids and/or their derivatives and alcohols containing at least one tin compound of the general formula (I):\n\n[(R1Sn)l(OH)m-n(OR2)nOo]p+ Aq−p/q  (formula I)\n\nwherein:",
        "R1 and R2 each independently is a linear, branched or cyclic alkyl group or aryl group having 1 to 12 carbon atoms,\n\n    Aq− is an anion,\n    l is at least 1,\n    m=0 to 20,\n    n=0 to 20,\n    p=0 to 6,\n    o=0 to 20 and\n    q=0 to 6.",
        "Preferred examples for R1 are methyl, ethyl, n-propyl, iso-propyl, n-butyl, 2-butyl, iso-butyl, tert-butyl, n-pentyl, iso-pentyl, neo pentyl radical, tert-pentyl, hexyl, heptyl, n-octyl, iso-octyl, 2-ethyl-1-hexyl, 2,2,4-trimethylpentyl, nonyl, decyl, dodecyl, n-dodecyl, cyclopentyl, cyclohexyl, cycloheptyl, methylcyclohexyl, vinyl, 1-propenyl, 2-propenyl, naphthyl, anthranyl, phenanthryl, o-tolyl, p-tolyl, m-tolyl, xylyl, ethyl phenyl, mesityl, phenyl, benzyl. Favored substituents for the invention are: Methyl, n-butyl, n-octyl and n-dodecyl.",
        "Examples for R2 are methyl, ethyl, n-propyl, iso-propyl, n-butyl, 2-butyl, iso-butyl, tert-butyl, n-pentyl, iso-pentyl, neo pentyl, tert-pentyl, hexyl, heptyl, n-octyl, iso-octyl, 2,2,4-trimethylpentyl, 2-hydroxy-1-ethylpentyl, hydroxy-neo-pentyl, 2-ethyl-1-hexyl, nonyl, decyl, dodecyl, n-dodecyl, cyclopentyl, cyclohexyl, cycloheptyl, methylcyclohexyl, vinyl, 1-propenyl, 2-propenyl, naphthyl, anthryl, phenanthryl, o-tolyl, p-tolyl, m-tolyl, xylyl, ethyl phenyl, mesityl, phenyl, benzyl. Favored substituents for the invention are: Methyl, ethyl, n-propyl, iso-propyl, n-butyl, 2-butyl, iso-butyl, tert-butyl.",
        "Preferred examples for A are: O, OH, methanolate, ethanolate, n-propanolate, iso-propanolate, n-butanolate, 2-butanolate, iso-butanolate, tert-butanolate, n-pentanolate, iso-pentanolate, neo-pentanolate, tert-pentanolate, 2-methyl-1-butanolate, hexanolate, heptanolate, n-octanolate, iso-octanolate, 2,2,4-trimethylpentanolate, nonanolate, decanolate, dodecanolate, n-dodecanolate, cyclopentanolate, cyclohexanolate, cycloheptanolate, methylcyclohexanolate, glycolate, glycerate, pinakolate neopentylglycolate, vinylalkoholate, propargylalkoholate, 2-ethyl-1-hexanolate, formiate, acetate, propionate, butyrate, valeriate, caprylate, caprinate, laurate, laureate, 2-ethyl-1-hexanoate, neodecanoate, palmitate, stearate, benzoate, terephthalate, phthalate, isoterephthalate, acrylate, methacrylate, crotonate, isocrotonate, vinylacetate, oleate, sorbate, linolate, linolenate, trifluoracetate, methansulphonate, ethanesulphonate, n-propanesulphonate, iso-propanesulphonate, n-butanesulphonate, 2-butanesulphonate, iso-butanesulphonate, tert-butanesulphonate, n-pentanesulphonate, iso-pentanesulphonate, neo-pentanesulphonate, tert-pentanesulphonate, 2-methyl-1-butanesulphonate, hexanesulphonate, heptanesulphonate, n-octanesulphonate, iso-octanesulphonate, 2,2,4-trimethylpentan sulphonate, nonansulphonate, decansulphonate, dodecanesulphonate, n-dodecanesulphonate, cyclopentanesulphonate, cyclohexane sulphonate, cycloheptanesulphonate, methylcyclohexanesulphonate p-toluolsulphonate, oxalate, malonate, succinate, glutarate, adipate, fumarate, maleinate, carboxylates of the following monoesters: methylmaleic acid monoester, ethylmaleic acid monoester, butylmaleic acid monoester, n-propylmaleic acid monoester, iso-propylmaleic acid monoester, n-butylmaleic acid monoester, 2-butylmaleic acid monoester, iso-butylmaleic acid monoester, tert-butylmaleic acid monoester, n-pentylmaleic acid monoester, isopentylmaleic acid monoester, neo-pentylmaleic acid monoester, tert-pentylmaleic acid monoester, 2-methyl-1-butylmaleic acid monoester, hexylmaleic acid monoester, heptylmaleic acid monoester, n-octylmaleic acid monoester, iso-octylmaleic acid monoester, 2,2,4-trimethylpentylmaleic acid monoester, nonylmaleic acid monoester, decylmaleic acid monoester, dodecylmaleic acid monoester, n-dodecylmaleic acid monoester, cyclopentylmaleic acid monoester, cyclohexylmaleic acid monoester, cycloheptylmaleic acid monoester, methylcyclohexylmaleic acid monoester, glycolmaleic acid monoester, glycerolmaleic acid monoester, pinakolmaleic acid monoester, neopentylglycolmaleic acid monoester, vinylmaleic acid monoester, propargylmaleic acid monoester and 2-ethyl-1-hexylmaleic acid monoester, citrate, lactate, tartrate, naphthenate, naphthalene-2,6-dlcarboxalate, naphthalene-1,6-dicarboxalate, F, Cl, ClO, ClO2, ClO3, ClO4, CO3, Br, J, CN, SCN, OCN, sulphate, hydrogensulphate, sulphite, hydrogensulphite, sulphide, phosphate, hydrogenphosphate, dlhydrogenphosphate, bis(2-ethyl-1-hexyl)phosphate, butylphosphate, dibutylphosphate, 3-phosphonopropionate, phenylphosphoic acid, benzylphosphoic acid, p-aminophosphoic acid, n-octylphosphoic acid. Favored substituents for the invention are: methanolate, ethanolate, n-propanolate, iso-propanolate, n-butanolate, 2-butanolate, iso-butanolate, tert-butanolate, bis(2-ethyl-1-hexyl)phosphate, neodecanoat, 2-ethylhexanoat, and 2-ethyl-1-hexylmaleic acid monoester, trifluoracetate, p-toluolsulphonate, Cl, Br, J, sulphate, hydrogen sulphate, phosphate, hydrogen phosphate and dihydrogen phosphate.",
        "Said catalytic compositions proved highly effective in the catalysis of esterification, transesterification, polycondensation, polyesterification and polytransesterification reactions. These derivatives of dicarboxylic acids, polycarboxylic acids and/or hydroxy carboxylic acids according to the invention include e.g. esters and halogenides, but not anhydrides.",
        "In a preferred embodiment of the invention, said catalytic composition is characterized in that the anion Aq− is O2−, —OH−, a linear, branched or cyclic alkyl carboxy or aryl carboxy group or linear, branched or cyclic alkoxy group each having 1 to 12 carbon atoms, the anion of a mineral acid or a metalate.",
        "In particular, said anion Aq− is a sulphate, sulphite, phosphate, halogenide or pseudo-halogenide, titanate, zirconate, aluminate or zincate anion.",
        "According to a particularly preferred embodiment of the invention, said catalytic composition is characterized in that n=1 to 20.",
        "In this case a specific structure within the [(R1Sn)l(OH)m-n(OR2)nOo]p+Aq−p/q—unit is created by introduction of 1 to 20 alkoxy groups (OR2).",
        "Most preferred catalytic compositions according to the invention are characterized in that l=12, m=6, n=0 to 6, o=14 and p=2.",
        "Since the chemical composition containing a tin compound according to formula I, having R1=butyl, R2=methyl, l=12, m=6, n=2, o=14, p=2, A=Cl, q=1, as such is known but is described to be used for different purposes than that of the present invention, the catalytic composition according to the present invention does not encompass the protection of said species as such.",
        "According to the invention the specific structure within [(R1Sn)l(OH)m-n(OR2)nOo]p+ Aq−p/q—unit is achieved by introduction of 1 to 20, preferably 1 to 6 alkoxy groups (OR2) into the unit [(R1Sn)l(OH)mOo]p+ Aq−p/q—by conversion with suitable metal alkoxides (metal alcoholates).",
        "Preferred examples for said metal alkoxides are: Li, Na, K, Rb, Mg, Ca, Sr, Ba, Sc, Ti, Zr, Hf, Zn or Al-methanolate-ethanolate, -n-propanolate, -iso-propanolate, -n-butanolate, -2-butanolate, -iso-butanolate, -tert-butanolate, -neo-pentanolate, -isopentanolate, -neo-pentanolate, -tert-pentanolate, -2-methyl-1-butanolate, -hexanolate, -heptanolate, -n-octanolate, -iso-octanolate, -2,2,4-trimethylpentanolate, -nonanolate, -decanolate, -dodecanolate, -n-dodecanolate, -cyclopentanolate, -cyclohexanolate, -cycloheptanolate, -methylcyclohexanolate, -glycolate, -glycerate, -pinakolate, -neopentylglycolate, -vinylalcoholate, -propargylalcoholate, -2-ethyl-1-hexanolate. Favored metal alcoholates are: Sodium methanolate, potassium t-butylate, aluminium methanolate-ethanolate, -n-propanolate, -iso-propanolate, -n-butanolate, -2-butanolate, -iso-butanolate, -tert-butanolate, -neo-pentanolate and -iso-pentanolate, titan tetra-butanolate.",
        "According to the invention the conversion of the units [(R1Sn)l(OH)mOo]p+ Aq−p/q with a metal alkoxide is preferably carried out using said metal alkoxide in a proportion of 1:0.0001 up to 1:20 by mole, in particular 1:4 to 1:6.",
        "It is furthermore preferred that the side products resulting from said conversion of the metal alkoxides with [(R1Sn)l(OH)mOo]p+ Aq−p/q—units remain in the reaction mixture. These side products include e.g. metallic oxides, metal hydroxides and alkoxy metal hydroxides further to the catalytically active compounds [(R1Sn)l(OH)m-n(OR2)nOo]p+ Aq−p/q. The side products of the metal alkoxides do not affect the activity of the desired compounds [(R1Sn)l(OH)m-n(OR2)nOo]p+ Aq−p/q.",
        "In a further embodiment of the invention, the catalytic composition as defined above is used for the continuous or batchwise production of esters or polycondensation products by esterification, transesterification, polyesterification or polytransesterification reaction.",
        "Esterification, transesterification, polycondensation, polyesterification and polytransesterification reactions are catalyzed and accelerated by the catalytic compositions according to the invention. The inventors have shown that in comparison to conventional methods lesser amounts of catalyst and lesser amounts of stabilizer lead to comparable results. In addition, even high-viscous polyesters may be produced in a direct process in by far shorter reaction times. The novel catalytic composition of the invention is further resistant to hydrolysis and may be added already during the esterification phase and the precondensation phase or later as an active component.",
        "Preferably, the catalytic composition according to the invention may be used for a polyesterification reaction of a dicarboxylic acid derivative with a mono, divalent or polyvalent alcohol.",
        "It is particularly preferred to employ derivatives of di, or polycarboxylic acids being selected from the group of esters or halogenides.",
        "Dicarboxylic acids (carboxylic acids, containing at least two carboxyl groups), e.g. terephthalic acid, 2,6-naphthalene dicarboxylic acid, isophthalic acid, 1,4-cyclohexanedicarboxylic acid, 1,6-naphthalene dicarboxylic acid, 4,4-bisphenyl dicarboxylic acids, adipic acid, phthalic acid, alkane dicarboxylic acids, halogen derivates of the mentioned dicarboxylic acids for example tetrabromophthalic acid, and copolymers of the mentioned dicarboxylic acids or the esters of the mentioned carboxylic acids for example dimethyl terephthalate, bis(hydroxyethyl)terephthalate, 2,6-dimethylnaphthalate, 1,6-dimethylnaphthalate and others are preferred according to the invention.",
        "Polyvalent alcohols, such as ethylene glycol, 1,3-propane diol, 1,4-butane diol and/or 1,4-cyclohexane dimethanol, di-, triethylene glycol, polyglycols with a molecular weight below 1000 or neopentyl glycol, are preferably employed.",
        "The catalytic compositions of the invention may further advantageously be used for the production of polyesters from hydroxycarboxylic acids such as p-hydroxybenzoic acid, salicylic acid, lactic acid, glycol acid and their co-polyesters with the dicarboxylic acids and/or diols described above.",
        "It is also preferred to employ derivatives of hydroxycarboxylic acids being preferentially selected from esters.",
        "Further recycled polyester material might be used as co/monomer within the scope of the invention.",
        "The metal concentration of the catalytically effective metal compound is preferably 0.1 ppm to 1 mole-%, in particular 10 ppm to 100 ppm, most preferred 20 to 50 ppm with reference to the acid or derivative to be reacted.",
        "The catalytic composition used for the production of polyester may be added during the period before the beginning of the esterification and/or transesterification until shortly before the end of the polycondensation, favored during the esterification and/or transesterification or before the precondensation steps of the production process.",
        "A solvent or suspending agent can be added to the tin compound prior or during the manufacturing of the catalytic composition and/or said esterification, transesterification, polyesterification or polytransesterification reaction.",
        "As solvents or suspending agents for the catalyst an alcohol and/or an alkane diol can be employed, favored are 1,2-ethane diol, 1,3-propane diol, 1,4-butane diol, 2,2-dimethylpropane-1,3-diol.",
        "The solvent or suspending agent used according to the invention may be different or the same in the manufacturing of said catalytic composition and said esterification, transesterification, polyesterification or polytransesterification reaction.",
        "A preferred solvent or suspending agent employed in the invention is being selected from the group of mono-, di- or polyvalent alcohols being reacted in said esterification, transesterification, polyesterification or polytransesterification reaction.",
        "Further preferred solvent or suspending agents include an organic liquid that is indifferent with respect to the polyester production process. Examples for such indifferent organic liquids are alkanes, cycloalkanes or benzene derivatives such as benzene, toluene or xylenes. Moreover, water or a mixture of water with an alcohol or a polyvalent may be employed as solvent and/or suspending agent.",
        "Further additives for a color correction such as cobalt salts or organic dyes or pigments may be added to the reaction mixture, preferably in amounts of 0.0001-5% by weight, in relation to the acid or derivative to be reacted.",
        "The polyester available by the process using the catalytic compositions of the invention shows at least comparable qualities with respect to processibility as traditional polyesters, e.g. catalyzed with antimony. In comparison to conventional high-viscosity melt polymerisations, resins produced using the catalytic compositions described by the invention show a relatively low content of acetic aldehyde. In particular the polyesters synthesized with the process described by the invention show a narrow molecular weight distribution, a high translucency and give a polymer with a high, desired blue shift. A polymer of high viscosities, unlike the state of the art using Sb catalysts, obtained without difficulty.",
        "The polymers, produced using catalytic compositions of the invention show a high blue shift (negative b-values; color values determined by using the CIE-Lab 100 color system with spectral reference beam color measuring instrument LUCI 100, Dr. Lange).",
        "The polyesters manufactured by a process using the catalytic compositions of the invention are made by esterification and, optionally, subsequent polycondensation. These polyesters are especially suited for bottles, films, foils, yarn and/or molded padding, or resins for powder coatings or technical synthetic materials,",
        "Preferred polyesters according to the invention include:\n\n    a) polyethylene terephthalate (PET), containing 0.1-10 mass % diethylene glycol and 0-10 mass % of isophthalic acid, 2-hydroxy-isophthalic acid, p-hydroxyisophthalic acid, 2,6-naphthalenedicarboxylic acid and/or 1,4-cyclohexane dimethanol as co-monomer;\n    b) polyester for powder coatings mainly poly-2,2-dimethylpropyl-1,3-terephthalate;\n    c) polypropylene terephthalate (PPT);\n    d) polyester polyols as for example polydiethyleneglycol terephthalate;\n    e) polybutylene terephthalates (PBT);\n    f) polynaphthalene terephthalates (PNT)\n    g) polyethylene naphthalate (PEN).",
        "The following examples illustrate the invention further without, however, limiting the invention. Unless otherwise indicated, parts and percentages relate to the weight, as in the remainder of the description.",
        "Further subjects of the invention are described by the claims and are in total part of the description of the present invention.",
        "Apparatus:",
        "250 ml three necked round bottom flask, tap funnel, magnetic stirrer, water separator, rotary evaporator.",
        "Starting Materials, Quantities:",
        "monobutyltin oxide\n20.88 g\n [0.10 mol]\n\n\n\nbis(2-ethylhexyl) phosphate\n 5.15 g\n [0.016 mol]\n\n\n\n1a) without alcoholate\n\n\n\n1b) titanium tetrabutanolate\n 4.25 g\n[0.0125 mol]\n\n\n\n1c) sodium methanolate\n 2.70 g\n [0.05 mol]\n\n\n\n1d) aluminum triethoxide\n 2.60 g\n [0.016 mol]\n\n\n\n1e) aluminum tri(sec-butoxide)\n 4.40 g\n [0.016 mol]\n\n\n\n1f) aluminum tri(isopropoxide)\n 3.39 g\n [0.016 mol]\n\n\n\n\n\n\n\n\n\n\nSynthesis:",
        "Monobutyltin oxide was suspended In xylene (150 ml), bis(2-ethylhexyl)phosphate was added within 10 min and the suspension is heated under reflux until the water formation stopped. After reaching room temperature the reaction was filtered. The metal alcoholate was added to the filtrate, which was then heated under reflux for an additional hour. The product was received after removal of the solvent under reduced pressure.",
        "Further Alkyltin Catalysts:",
        "A three-necked flask equipped with mechanical mixer, heating, thermometer and vacuum distillation bridge was, under nitrogen protective atmosphere, filled with 149 (0.25 Mol) hexabutyidistannoxane and 72.1 g (0.5 Mol) 2-ethylhexanoic acid. The reaction mixture was heated up on 80° C. To separate from the reaction water a vacuum of 1 mbar was applied, and the reaction mixture was stirred another 1 h at this temperature.",
        "Yield: 209.8 g (theoretical. 212.1 g) a clear, bright liquid. Elemental analysis: Sn content =27.8%.",
        "The production of the examples and comparative examples 1 h to 1 n followed the same procedure.",
        "Starting Materials, Quantities:",
        "terephthalic acid\n 83.07 g\n[0.50 mol]\n\n\n\n\n\n\n\n\n\n\nneopentyl glycol\n(2,2-dimethyl-1,3-propandiol)\n\n\n\n\n\n\n\n\n\n\n104.15 g\n[1.00 mol]\n\n\n\n\n\n\n\n\n\n\ncatalyst:\n0.05% [m/m] (as metal)\n\n\n\n\n\n\n\n\n\n\nSynthesis:",
        "Catalyst, neopentyl glycol and terephthalic acid were given Into a 250 ml three necked round bottom flask. The mixture was heated to a maximum by the means of a heating mantel and the reaction water was distilled off and the amount was measured.",
        "The reaction time equals the time between the first water formation and the “clear point” of the reaction.",
        "Table 1 shows the acceleration of the reaction time In the described resin synthesis with the mixtures of examples 1a, 1b, 1c, 1d, 1e, 1f In comparison with the uncatalized reaction or with monobutyltin oxide (0.05% [m/m]) as catalyst.",
        "TABLE 1\n\n\n\n\n\n\n\nReaction time of the mixtures a-f in comparison.\n\n\n\n\n\n\n\n\n\n\n\n\n[min]\n\n\n\nCatalyst\nVolume H2O [ml]:\nReac-\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(0.05% as\n15\n30\n45\n60\n75\n90\n105\n120\n135\n150\n165\n180\ntion\n\n\n\nSn)\nmin\nmin\nmin\nmin\nmin\nmin\nmin\nmin\nmin\nmin\nmin\nmin\ntime\nRemarks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWithout\n\n\n\n1\n\n1\n\n2\n\n3\n\n4\n300\naborted\n\n\ncatalyst\n\n\nmonobutyl-\n\n7\n\n9\n\n12\n\n15\n\n17\n\n19\n180\nClear,\n\n\ntinoxide\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolorless\n\n\n1a\n\n7\n\n10\n\n18\n\n\n\n\n\n\n90\nClear,\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolorless\n\n\n1b\n3\n6\n5\n9\n11\n14\n\n\n\n\n\n\n90\nHazy,\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolorless\n\n\n1c\n4\n4\n10\n14\n16\n\n\n\n\n\n\n\n75\nClear,\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolorless\n\n\n1d\n3\n6\n10\n12\n14\n16\n\n\n\n\n\n\n90\nClear,\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolorless\n\n\ne\n3\n5\n6\n8\n9\n10\n13\n15\n18\n\n\n\n135\nClear,\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolorless\n\n\nf\n3\n5\n7\n10\n12\n14\n15\n16\n18\n\n\n\n135\nClear,\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolorless",
        "51.1 g (0.15 mol) TI(OBu)4 and 25.3 9 (0.60 mol) monobutyl stannic acid were dissolved In xylene (250 ml) and refluxed under a nitrogen atmosphere In a 500 ml three necked round bottom flask for 4 hours. The product was obtained after the solvent was removed under reduced pressure in an amount of 149.6 g (theoretical. 131.9 g) as a yellow solid (Elemental analysis: Sn content=46.5%, Ti content=4.9%).",
        "Product of the reaction of monooctyl stannic acid with Ti(OBU)4 (molar ratio 1:1), synthesis in analogy to catalyst o.",
        "Product from monooctylstannoic acid with tetrabutyl titanate (amount of substance ratio 4:1), synthesis In analogy to Example 3o.",
        "Product from monobutylstannoic acid with tetrabutyl titanate (molar ratio 2:1), synthesis In analogy to Example 3o.",
        "Experimental Method",
        "Polycondensation equipment 1 (glass equipment) for the melt polycondensation of BHET",
        "Tempering-bath (salt bath), polycondensatlon vessel (glass), screw mixer (glass), vacuum pump, pressure gauge",
        "As a polycondensation equipment a round glass flask with round bottom was used, (internal diameter 2.6 cm, and 35 cm height, described in T. Johnson, Chem. Fibers International 46 (1996) 280; 49 (1999) 455). A horizontal vapor outlet Is integrated into the upper third of the flask wall. A further extension tube near the bottom of the vessel allowed sampling from the polymer melt. The stirrer was a glassware screw mixer, reaching down to the ground (1.8 cm diameters). The mixer was operated with a rotation speed of 100 min−1 and Intermixed the melt with axially downward direction.",
        "25.4 g (0.1 mol) BHET were filled into the polycondensation vessel, the catalyst (5 to 200 ppm as metal) was added and the vessel locked. Then the polycondensation vessel filled with the reaction mixture was evacuated three times and flushed with dry nitrogen before It was immersed In the tempering-bath. The bath temperature was preset so that the desired Internal temperature of 280° C. was reached in the polycondensation vessel. After the reaction mixture was melted, the stirrer was started and the vessel evacuated within 15 min onto a vacuum of 2×10−1 mbar. The time of the first formation of glycol at the wall of the glass was regarded as t0. The attainable final pressure for this equipment of approximately 4 to 5×10−2 mbar, was reached after approx. 1 h experimental time, depending on the progress of the polycondensation. Through the sampling device samples could be taken by means of a VA steel wire, maintaining a nitrogen counter flow. At the end of the reaction up to 5 g could be taken from the vessel for further analysis. During the polycondensation, an average sampling required one minute, from breaking the vacuum to re-applying the vacuum. At the end of the polycondensation sampling was done within two minutes after aerating the vacuum.",
        "PET Characterization",
        "The determination of the intrinsic viscosities was performed as follows:",
        "The relative solution viscosities ηrel, for PET were determined in phenol (3 parts)/dichlorobenzene (2 parts) mixtures using 0.5 percent solutions at 25° C. The conversion of the relative solution viscosities into the intrinsic viscosity [η] was done according to BILLMEIER.",
        "η\n    intr\n  \n  =\n  \n    \n      1\n      4\n    \n    ⁢\n    \n      \n        \n          η\n          rel\n        \n        -\n        1\n      \n      \n        c\n        +\n        \n          3\n          /\n          4\n        \n      \n    \n    ×\n    \n      \n        ln\n        ⁢\n        \n          \n        \n        ⁢\n        \n          η\n          rel\n        \n      \n      c",
        "From the intrinsic viscosities (IV) the average molecular weights Mn (number average) as well as the degrees of polymerization Pn were calculated. For PET applies: Mn=(1000×IV)1,5186; Pn=Mn/192.",
        "The absolute viscosities were measured using the viscosimeter AVS 250 and the tempering-unit CT 1450 of Schott Geräte GmbH, Germany. Comparison measurements between different laboratories gave matching results.",
        "The color values were determined using the CIE-LAB-Farbsystem (color system) by the spectral reference beam color measuring instrument LUCI 100, Dr. Lange.",
        "The device STA 625 of Polymer Laboratories was used for TG and DSC-measurements.",
        "The COOH end groups were determined by potentiometric titration of the in cresol solution of the polymers with diluted aqueous NaOH.",
        "BHET and the catalyst were introduced Into the reaction vessel and rinsed well with nitrogen.",
        "The reaction vessel was placed into the salt bath. Recording of reaction time started now. Within 15 min the pressure was lowered from 100 mbar to 0.09 mbar. At the end of the reaction a pressure of 0.04 mbar was reached.",
        "The following table 2 shows the results of the polycondensation experiments for the catalysts of examples 1a, 3p and 3q in comparison to Sb- and Ti-based catalysts (table 3). Criteria for determining catalyst activity are the attainable molecular masses in specific time periods, the increasing influence of the thermal degradation, recognizable by the flattening of the Pn-t-function as well as the color values of the polyester. The amount of the evolved ethanal (acetaldehyde) that directly correlates with the degree of thermal ester group cleavage is a further essential criterion of the catalyst suitability. The color values In the tables show the discoloration of the product, the a-values representing green/red-gradients and the b-values representing blue/yellow-gradients. Negative a-values correspond to green, negative b-values correspond to blue gradients. Blue shift is favored technologically.",
        "The comparative Investigations for the catalytic activity of the selected tin compounds show that no noteworthy thermal decomposition is to be expected within 2 h of polycondensatlon time at temperatures of 280° C. Therefore it is absolutely possible to synthesize even higher molecular weight polyethylene terephthalates by prolongation of the polycondensation time.",
        "All examined tin compounds proved to be high-activity catalysts for the polycondensation of BHET which showed significantly higher activity than stiblous compounds. Their polytransesterification activity was superior to that of titanium alkoxides and titanium chelates. If required, they may alternatively be employed In higher concentrations.",
        "TABLE 2\n\n\n\n\n\n\n\nPolycondensation of BHET with the catalysts of examples 1a,\n\n\n3p and 3q.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolor values\n\n\ncatalyst\n\n\nconcentration\n\n\nusing the\n\n\nof\ntime\nmolar ratio\nSn/Ti\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nexample\n[min]\nTi/Sn\n[ppm]\n[g/mol]\nPn\nL\na\nb\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1a\n30\n0/1\n116\n2090\n9\n—\n—\n—\n\n\n1a\n60\n0/1\n116\n3812\n20\n—\n—\n—\n\n\n1a\n90\n0/1\n116\n6145\n32\n33.01\n−0.05\n1.18\n\n\n1a\n120\n0/1\n116\n16559\n86\n37.81\n−0.46\n2.64\n\n\n3p\n20\n1:1\n20/9  \n3839\n20\n\n\n3p\n42\n1:1\n20/9  \n15454\n80\n67.15\n−0.21\n1.30\n\n\n3p\n96\n1:1\n20/9  \n25733\n134\n72.79\n−1.03\n0.61\n\n\n3p\n120\n1:1\n20/9  \n28454\n148\n68.06\n−1.06\n2.76\n\n\n3q\n15\n1:4\n20/2.25\n1635\n8\n\n\n3q\n31\n1:4\n20/2.25\n4734\n24\n86.69\n−0.87\n−4.38\n\n\n3q\n60\n1:4\n20/2.25\n13499\n70\n70.38\n−0.38\n−0.31\n\n\n3q\n90\n1:4\n20/2.25\n18759\n97\n73.54\n−0.60\n1.43",
        "TABLE 3\n\n\n\n\n\n\n\nPolycondensation of BHET with Sb and Ti catalysts.\n\n\n\n\n\n\n\n\n\n\n\n\ntemperature\ntime\ncatalyst conc.\n\n\n\ncatalyst\n[° C.]\n[min]\n[ppm]\nPn\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nantimony triacetate\n270\n30\n190\n25\n\n\nantimony triacetate\n270\n60\n190\n45\n\n\nantimony triacetate\n270\n90\n190\n65\n\n\nantimony triacetate\n270\n120\n190\n85\n\n\nantimony triacetate\n270\n150\n190\n100\n\n\nantimony triacetate\n270\n180\n190\n115\n\n\nantimony triacetate\n280\n30\n190\n30\n\n\nantimony triacetate\n280\n60\n190\n55\n\n\nantimony triacetate\n280\n90\n190\n75\n\n\nantimony triacetate\n280\n120\n190\n95\n\n\nantimony triacetate\n280\n150\n190\n115\n\n\nantimony triacetate\n280\n180\n190\n135\n\n\ntetrabutyl titanate\n280\n30\n20\n45\n\n\ntetrabutyl titanate\n280\n60\n20\n65\n\n\ntetrabutyl titanate\n280\n90\n20\n85\n\n\ntetrabutyl titanate\n280\n120\n20\n105\n\n\ntetrabutyl titanate\n280\n150\n20\n125\n\n\ntetrabutyl titanate\n280\n180\n20\n150",
        "Further polycondensation reactions starting from bis-(2-hydroxyethyl)-terephthalate (BHET) were carried out in the glass equipment with screw mixer in presence of the catalysts 1 until 12.\n\n    Catalyst of comparative example 1g: tributyltin (2-ethylhexanoate)\n    Catalyst of comparative example 1h: dibutyltin bis(2-ethylhexanoate)\n    Catalyst of example 1f: monobutyltin tris (2-ethylhexanoate)\n    Catalyst of comparative example 1j: dibutyltin pinacolate\n    Catalyst of example 1k: monooctylstannoic acid\n    Catalyst of example 1l: monobutylstannoic acid\n    Catalyst of example 1m: monooctyltin tris(2-ethylhexanoate)\n    Catalyst of example 1n: monododecyltin tris(2-ethylhexanoate)\n    Catalyst of example 3o: conversion product from monobutylstannoic acid with tetrabutyl titanate (4 Mol: 1 Mol)\n    Catalyst of example 3p: conversion product from monooctylstannoic acid with tetrabutyl titanate (1 Mol: 1 Mol)\n    Catalyst of example 3q: conversion product from monooctylstannoic acid with tetrabutyl titanate (4 Mol: 1 Mol)\n    Catalyst of example 3r: conversion product from monobutylstannoic acid with tetrabutyl titanate (2 Mol: 1 Mol)",
        "For the determination of the catalyst activity at first two concentrations of 20 ppm and 100 ppm were compared. The catalysts of (comparative) examples 1g through 1j were dissolved in toluene.",
        "The catalysts were dissolved in dry toluene. The neat tin catalysts were used at a catalyst concentration of 40 ppm. The mixed catalysts (catalyst of examples 3o through 3q) were used at a tin content of 20 ppm. For the catalyst of example 3r the tin content of the catalyst was 22.9 ppm.",
        "The tables 4a and 4b show the tin content and dosed catalyst amounts of the respective experiments.",
        "BHET and the catalyst were introduced into the reaction vessel and rinsed well with nitrogen.",
        "The reaction vessel was placed Into the salt bath. Recording of reaction time started now. Within 15 min the pressure was lowered from 100 mbar to 0.09 mbar. At the end of the reaction a pressure of 0.04 mbar was reached.",
        "The results are shown in the tables 5 to 15.",
        "The following tables show the results of the polycondensation experiments. Criteria of the catalyst activity are the attainable molecular masses In specific time periods, the increasing Influence of the thermal degradation, recognizable by the flattening of the Pn-t-function as well as the color values of the polyester. The amount of the evolved ethanal that directly correlates with the degree of thermal ester group cleavage is a further essential criterion of the catalyst suitability. The color values in the tables show the discoloration of the product, the a-values representing green/red-gradients and the b-values representing blue/yellow-gradients. Negative a-values correspond to green, negative b-values correspond to blue gradients. Blue shift is favored technologically.",
        "The comparative Investigations for the catalytic activity of the selected tin compounds show that no noteworthy thermal decomposition is to be expected within 2 h of polycondensation. time at temperatures of 280° C. Therefore It is absolutely possibly to synthesize even higher molecular weight polyethylene terephthalates by prolongation of the polycondensation time.",
        "All examined tin compounds proved as high-activity catalysts for the polycondensation of BHET which show significantly higher activity than stiblous compounds. Their polytransesterificatlon activity is superior to titanium alkoxides and titanium chelates. If required, they can be employed also In higher concentrations.",
        "For the butyltin(2-ethylhexanoates) the activity sinks with increasing alkyl substitution. With regard to the achieved color values the monoalkyltin tricarboxylate are preferred to the di- and trialkyltin carboxylates.",
        "TABLE 4a\n\n\n\n\n\n\n\nTin content and added catalyst amounts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncatalyst in\n\n\ncatalyst of\n\namount in\n\nreaction\n\n\nexample/\ntin\n50 ml stock\ncatalyst in reaction\nmixture for\n\n\ncomparative\ncontent\nsolution\nmixture for 20 ppm\n100 ppm Sn\n\n\nexample\n[%]\n[mg]\nSn [mg]\n[mg]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1g\n27.8\n182.27\n1.8227\n9.137\n\n\n1h\n22.9\n221.8\n2.218\n11.09\n\n\n1i\n20.0\n254.0\n2.54\n12.7\n\n\n1j\n35.1\n144.7\n1.447\n7.24\n\n\n1k\n44.0\n\n\n5.780\n\n\n1l\n56.0\n\n\n4.535",
        "TABLE 4b\n\n\n\n\n\n\n\nTin content and added catalyst amounts\n\n\n\n\n\n\n\n\n\n\ncatalyst of\n\n\n\n\n\nexample/\ntin\namount of catalyst in 50\namount of catalyst in the\n\n\ncomp.\ncontent\nml stock solution\nreaction mixture\n\n\nexample\n[%]\n[mg]\n[mg]/[ppm] Sn\n\n\n\n\n\n\n\n\n\n\n\n\n\n1m\n17.5\n580.57\n5.8/40\n\n\n1n\n16.1\n631.06\n6.3/40\n\n\n3o\n21.0\n241.9\n2.4/20\n\n\n3p\n37.0\n137.3\n1.4/20\n\n\n3q\n37.5\n155.5\n  1.6/22.9\n\n\n3r\n46.5\n109.24\n1.1/20",
        "TABLE 5\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\ncomparative example 1g\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolor values using the\n\n\ntime\nconcentration\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n[min]\nSn [ppm]\n[g/Mol]\nPi\nL\na\na\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n15\n100\n3127\n16\n40.80\n−0.34\n−2.06\n\n\n30\n100\n5953\n31\n36.15\n−0.22\n0.04\n\n\n60\n100\n13943\n72\n29.68\n−0.03\n0.18\n\n\n90\n100\n20281\n105\n30.04\n0.04\n0.52\n\n\n120\n100\n23083\n120\n50.56\n−1.65\n1.36\n\n\n30\n20\n3046\n16\n\n\n60\n20\n5972\n31\n40.3\n−0.64\n−3.51\n\n\n90\n20\n9933\n51\n32.33\n−0.39\n−1.47\n\n\n120\n20\n13356\n69\n47.88\n−0.49\n−0.20",
        "TABLE 6\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\ncomparative example 1h\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolor values using the\n\n\ntime\nconcentration\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n[min]\nSn [ppm]\n[g/Mol]\nPn\nL\na\na\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n16\n100\n3563\n18\n111\n−2.89\n−12.29\n\n\n30\n100\n8099\n42\n71.9\n−0.57\n−1.11\n\n\n60\n100\n18585\n96\n73.3\n−0.48\n0.17\n\n\n90\n100\n22289\n116\n70.9\n−0.61\n1.46\n\n\n120\n100\n27090\n141\n74.4\n−0.71\n1.94\n\n\n30\n20\n5563\n29\n78.3\n−1.15\n−5.68\n\n\n60\n20\n9172\n47\n70.3\n−0.34\n−1.13\n\n\n90\n20\n13294\n69\n66.4\n−0.30\n1.07\n\n\n120\n20\n17636\n92\n72.1\n−0.3\n0.0",
        "TABLE 7\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\nexample 1i\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolor values using the\n\n\ntime\nconcentration\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n[min]\nSn [ppm]\n[g/Mol]\nPn\nL\na\na\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n15\n100\n4911\n25\n\n\n\n\n\n30\n100\n10779\n56\n82.4\n−1.85\n0.83\n\n\n60\n100\n19581\n102\n71.7\n−1.14\n3.94\n\n\n90\n100\n25191\n131\n65.9\n−1.32\n8.52\n\n\n120\n100\n28701\n149\n69.5\n−1.11\n7.69\n\n\n30\n20\n6218\n32\n\n\n60\n20\n11572\n60\n75.7\n−0.42\n−1.01\n\n\n90\n20\n14656\n76\n68.8\n−0.16\n0.57\n\n\n120\n20\n19130\n99\n83.58\n−1.00\n−0.29",
        "TABLE 8\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\ncomparative example 1j\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolor values using the\n\n\ntime\nconcentration\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n[min]\nSn [ppm]\n[g/Mol]\nPn\nL\na\na\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n15\n100\n1995\n10\n\n\n\n\n\n30\n100\n3238\n17\n\n\n60\n100\n14769\n77\n81.4\n−2.89\n−0.96\n\n\n90\n100\n20684\n107\n71\n−1.21\n4.13\n\n\n120\n100\n24106\n125\n73.8\n−1.52\n5.4",
        "TABLE 9\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\nexample 1k\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolor values using the\n\n\ntime\nconcentration\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n[min]\nSn [ppm]\n[g/Mol]\nPn\nL\na\nb\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n15\n100\n3066\n16\n\n\n\n\n\n30\n100\n9071\n47\n70.9\n−0.49\n0.68\n\n\n60\n100\n18234\n95\n69.3\n−1.12\n4.47\n\n\n90\n100\n25817\n134\n82.5\n−1.65\n13.4\n\n\n120\n100\n27261\n142\n79.2\n−1.09\n10.1",
        "TABLE 10\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\nexample 1l\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolor values using the\n\n\ntime\nconcentration\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n[min]\nSn [ppm]\n[g/Mol]\nPn\nL\na\nb\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n15\n100\n1932\n10\n\n\n\n\n\n30\n100\n7241\n37\n111.2\n−4.7\n−4.84\n\n\n60\n100\n16217\n84\n74.7\n−2\n5.07\n\n\n90\n100\n21936\n114\n70.3\n−1.2\n6.28\n\n\n120\n100\n24761\n129\n69.9\n−1.45\n9.92",
        "TABLE 11\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\nexample 1m\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolor values using the\n\n\ntime\nconcentration\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n[min]\nSn [ppm]\n[g/Mol]\nPn\nL\na\nb\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n15\n40\n2437\n12\n\n\n\n\n\n31\n40\n5494\n28\n81.07\n−1.86\n−7.12\n\n\n45\n40\n8602\n44\n71.80\n−0.31\n−0.23\n\n\n60\n40\n11282\n58\n71.52\n−0.40\n0.40\n\n\n90\n40\n16914\n88\n68.03\n−0.21\n2.70\n\n\n120\n40\n20107\n104\n75.86\n−0.83\n2.51",
        "TABLE 12\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\nexample 1n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncolor values using the\n\n\ntime\nconcentration\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n[min]\nSn [ppm]\n[g/Mol]\nPn\nL\na\nb\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n20\n40\n3317\n17\n\n\n\n\n\n40\n40\n7051\n36\n75.66\n−0.57\n−2.49\n\n\n60\n40\n11588\n60\n72.37\n−0.50\n−0.63\n\n\n90\n40\n16132\n84\n64.23\n−0.31\n1.49\n\n\n120\n40\n20633\n107\n69.23\n−0.66\n1.68\n\n\n160\n40\n24053\n125\n74.12\n−0.97\n2.59",
        "TABLE 13\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\nexample 3p and the catalyst of example 3q\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nconcen-\n\n\ncolor\n\n\n\n\nmolar\ntration\n\n\nvalues using the\n\n\ncatalyst of\ntime\nratio\nSn/Ti\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nexample\n[min]\nTi/Sn\n[ppm]\n[g/mol]\nPn\nL\na\nb\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3p\n20\n1:1\n20/9  \n3839\n20\n\n\n\n\n\n3p\n42\n1:1\n20/9  \n15454\n80\n67.15\n−0.21\n1.30\n\n\n3p\n96\n1:1\n20/9  \n25733\n134\n72.79\n−1.03\n0.61\n\n\n3p\n120\n1:1\n20/9  \n28454\n148\n68.06\n−1.06\n2.76\n\n\n3q\n15\n1:4\n20/2.25\n1635\n8\n\n\n3q\n31\n1:4\n20/2.25\n4734\n24\n86.69\n−0.87\n−4.38\n\n\n3q\n60\n1:4\n20/2.25\n13499\n70\n70.38\n−0.38\n−0.31\n\n\n3q\n90\n1:4\n20/2.25\n18759\n97\n73.54\n−0.60\n1.43\n\n\n3q\n120\n1:4\n20/2.25\n23273\n121\n71.45\n−0.77\n1.09",
        "TABLE 14\n\n\n\n\n\n\n\nPolycondensation of BHET in presence of the catalyst of\n\n\nexample 3r and the catalyst of example 3o\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nconcen-\n\n\nColor\n\n\ncatalyst\n\nmolar\ntration\n\n\nvalues using the\n\n\nof\ntime\nratio\nSn/Ti\nMn\n\nCIE-LAB-system\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nexample\n[min]\nTi/Sn\n[ppm]\n[g/mol]\nPn\nL\na\nb\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n3r\n20\n1:2\n20/4.5 \n1259\n6\n\n\n\n\n\n3r\n32\n1:2\n20/4.5 \n5043\n26\n111.81\n−2.42\n−4.93\n\n\n3r\n60\n1:2\n20/4.5 \n15788\n82\n78.13\n−0.93\n0.00\n\n\n3r\n90\n1:2\n20/4.5 \n19198\n100\n69.56\n−0.83\n1.88\n\n\n3r\n120\n1:2\n20/4.5 \n23098\n120\n87.40\n−2.06\n4.53\n\n\n3r\n20\n1:4\n20/2.25\n1687\n8\n\n\n3r\n40\n1:4\n20/2.25\n8181\n42\n71.67\n−0.16\n−0.64\n\n\n3o\n60\n1:4\n20/2.25\n14469\n75\n77.63\n−0.31\n−0.56\n\n\n3o\n90\n1:4\n20/2.25\n17388\n90\n82.78\n−0.63\n1.21\n\n\n3o\n120\n1:4\n20/2.25\n24460\n127\n78.06\n−0.74\n0.77",
        "Catalytic activity depending on the structure of the tin compounds",
        "TABLE 15\n\n\n\n\n\n\n\nEffective rate constants of the polycondensation of BHET in\n\n\npresence of tin compounds and/or tin-titanium mixed compounds\n\n\n\n\n\n\n\n\n\n\nCatalyst of\nk * 103\nk * 103\nk * 103\n\n\nexample/\n[mmol/g sec]\n[mmol/g sec]\n[mmol/g sec]\n\n\n[comparative\nSn 20 ppm resp.\nSn 40 ppm resp.\nSn 100 ppm resp.\n\n\nexample]\n4 * 10−5 mol/mol\n8 * 10−5 mol/mol\n2 * 10−4 mol/mol\n\n\n\n\n\n3p\n4.8\n\n\n\n\n3r\n4.0\n\n\n3q\n3.5\n\n\n3o\n3.5\n\n\n1I\n2.8\n3.1\n5.3\n\n\n1k\n\n3.4\n4.4\n\n\n1m\n\n3.1\n\n\n1n\n\n3.0\n\n\n[1h]\n2.5\n\n4.4\n\n\n[1j]\n\n\n4.2\n\n\n1l\n\n\n3.9\n\n\n[1g]\n1.7\n\n3.6",
        "Experimental Method",
        "Polycondensatlon equipment 2 (15 l lab reactor of the Co. Juchheim, Germany) for the direct esterification and polycondensation of direct esterification products.",
        "The equipment consisted of a stainless steel double jacket mixing tank reactor with 15 liters nominal volume and with conical bottom equipped with bottom discharge. The mixer was a double lever mixer, which fitted to the conical bottom, with speed control and torque measurement. A glide ring seal with ethylene glycol formed the mixer lock as a sealing-liquid. The preheating of the mixing tank reactor was performed through a liquid circulation heating. The control of the temperature of the heat carrier was performed through a high temperature controller depending on the preset temperature In the reactor Interior. At the lid of the reactor a feed hopper, gas dispersion tube, pressure gauge, thermometer (dipping tube), Inspection window, light, overflow valve, reflux condenser and a Liebig condenser were Installed next to the mixer. A pipe condenser and a condensate receiver were downstream to the reflux condenser, the Liebig condenser ended in a second condensate receiver. The condensate receiver had gassing/degassing valves, pressure gauge, overflow valve as well as a vacuum equipment at the lid next to the feeding means.",
        "For the generation of the primary vacuum of approx. 20 mbar a membrane pump was used and a rotary valve vacuum pump was used up to the final vacuum. The pressure control was done by means of vacuum controller in connection with a magnetic valve in front of the sucking-nozzle of the pump. The exits of the condensate receiver were combined at the pressure point of measurement and connected through two cold traps switched in series and filled with liquid nitrogen.",
        "By means of data printer following measuring data could be registered continuously:\n\n    \n    \n        temperature at the lower inside wall in the reactor\n        temperature in the melt (dipping tube in the lid)\n        reflux condenser head temperature\n        reactor internal pressure\n        torque at the mixer shaft",
        "Esterification, prepolycondensation and polycondensation were carried out in one experimental step. 20 mol terephthalic acid (TPA) were premixed intensely with 28 mol ethylene glycol (EG) until homogeneous. To this mixture the tin based catalysts were added. This mixture was filled into the reactor having been flushed with nitrogen before. The reactor was shut (time t0), a mixer rotation speed set to 60 min−1 and heated up to 230 to 240° C. internal temperature. The temperature rise was followed by an increase of pressure up to approx. 4.5 bar. The generated water was distilled off via the reflux condenser, which was tempered at 115° C. The head temperature in this case was kept between 170 and 190° C.",
        "The end of the esterification (time t1) was indicated by a drop of the head temperature and the internal pressure. For the catalyst dosing the esterification product was cooled to approx. 180° C. for a short moment. Then primary vacuum was applied and the reactor heated up to an internal temperature of 270 to 275° C. Upon reaching the primary vacuum (approx. 20 mbar) the rotary valve vacuum pump was started. At a final pressure <0.1 mbar the polycondensation started (time t2), recognizable by the Increasing torque. With high melt viscosities it was necessary to reduce the mixer rotation speed since the mixer shaft was equipped with a shear-pen with a 60 Nm upper limit to protect the shaft. At the end of the polycondensation (time t3) the mixer was disconnected and the evacuated vessel was flushed with nitrogen. The product was discharged from the reactor by the bottom discharge under nitrogen pressure. It was either poured onto a steel sheet to cool down in pellets, or the melt was led through a water bath, granulated and the product dried subsequently.",
        "The material was dried in a vacuum oven at 130° C. for 6 h, then examined with respect to the Intrinsic viscosities, and the color values were determined as described before.",
        "The polycondensation starting out from terephthalic acid and ethylene glycol were carried out in presence of the catalysts of examples 1l, 1n, and 3p.",
        "Test conditions and results are shown in tables 16a and 16b.",
        "TABLE 16a\n\n\n\n\n\n\n\nTest conditions and polycondensation experiment in the 15l\n\n\nmixing tank reactor\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nesteri-\n\n\n\n\n\ncatalyst\n\nconcen-\nfication\npolyconden-\n\n\n\nof\nT\ntration\ntime\nsation time\nintrinsic\n\n\nexample\nexample\n[° C.]\n[ppm]\n[min]\n[min]\nviscosity\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5a\n1i\n275\n53 Sn\n180\n105\n0.85\n\n\n5b\n1i\n275\n26.5 Sn\n180\n180\n0.87\n\n\n5c\n1l\n270\n53 Sn\n165\n170\n0.90\n\n\n5d\n1n\n270\n53 Sn\n160\n203\n0.80\n\n\n5e\n3p\n270\n26.5 Sn +\n135\n110\n0.92\n\n\n\n\n\n12 Ti",
        "TABLE 16b\n\n\n\n\n\n\n\nResults of the polycondensation experiment in the 15l\n\n\nmixing tank reactor\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nContent of\n\n\n\n\n\n\n\n\n\nend\nContent of\n\n\n\nAmount\n\n\n\n\ngroups ×\nCOOH ×\nColor\nColor\nColor\nof\n\n\n\nMn\n106\n106\nvalue\nvalue\nvalue\nethanal\n\n\nexample\n[g/Mol]\n[mol/g]\n[mol/g]\nL\na\nb\n[ppm]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5a\n28200\n79.9\n24.5\n59.02\n−1.19\n−3.21\n24\n\n\n5b\n29300\n68.6\n28\n72.04\n−2.08\n0.28\n15\n\n\n5c\n30700\n65.1\n25\n70.53\n−2.10\n−1.20\n28\n\n\n5d\n25600\n82.3\n23.5\n58.14\n−0.47\n0.79\n20\n\n\n5e\n31800\n62.9\n17\n78.03\n−2.62\n1.17\n16"
    ],
    "citations": [
        "4014858",
        "4064112",
        "4263425",
        "5362844",
        "5419936",
        "5663281",
        "6114496"
    ],
    "us_classification": "556  1",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "07",
            "subclass": "F",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}