{
    "title": "Method for extending shelf-life of constructs of semi-crystallizable polymers",
    "abstract": "This invention relates to a method of extending the shelf-life of constructs, in particular bioabsorbable stents, comprising semi-crystalline polymers by increasing the crystallinity of the polymers.",
    "inventors": [
        "Gale",
        "Hossainy",
        "Huang",
        "Kleine"
    ],
    "document_number": "07297758",
    "publication_date": "20071120",
    "assignees": [
        "Advanced Cardiovascular Systems, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of extending the shelf-life of a polymeric construct comprising:",
            "components": [
                {
                    "component": "providing a polymeric construct comprising at least one semi-crystalline polymer;",
                    "subcomponents": []
                },
                {
                    "component": "determining a glass transition temperature (T",
                    "subcomponents": []
                },
                {
                    "component": "determining a melting temperature (T",
                    "subcomponents": []
                },
                {
                    "component": "heating the polymeric construct to a temperature between T",
                    "subcomponents": []
                },
                {
                    "component": "holding the polymeric construct at the temperature until one or more of the polymers independently is above about 25% crystalline and,",
                    "subcomponents": []
                },
                {
                    "component": "removing the polymeric construct from the source of heat.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein the temperature is from about T",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 2 , wherein the temperature is from about T",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein the polymeric construct is held at the temperature until at least one of the semi-crystalline polymers comprising the polymeric construct is from about 40% to about 60% crystalline.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 , wherein the polymeric construct is held at the temperature until at least one of the semi-crystalline polymers comprising the polymeric construct is from about 45% to about 55% crystalline.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein one of the semi-crystalline polymers comprising the polymeric construct is poly(lactic acid).",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 6 , wherein the polymeric construct is heated at from about 70° C. to about 100° C.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 7 , wherein the polymeric construct is heated at from about 75° C. to about 95° C.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 8 , wherein the polymeric construct is held at from about 75° C. to about 95° C. for from about 5 minutes to about 15 minutes.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 9 , wherein the polymeric construct is held at from about 75° C. to about 95° C. for from about 4 to about 7 minutes.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of either claim 9 or claim 10 , wherein the poly(L-lactic acid) is from about 40% to about 45% crystalline after heating at.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 1 , wherein the construct is a medical device.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 12 , wherein the medical device is an implantable medical device.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 13 , wherein the implantable medical device is a stent.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 1 , wherein the polymeric construct comprises a layer of polymer(s), at least one of which is a semi-crystalline polymer, coated on an implantable medical device.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 15 , wherein one of the semi-crystalline polymers comprising the layer of polymer(s) is poly(lactic acid).",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 16 , wherein the implantable medical device is a stent.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 1 , wherein crystallinity is determined by differential scanning calorimetry.",
            "components": []
        }
    ],
    "description": [
        "This invention relates to the fields of polymer chemistry and materials science.",
        "Polymers are generally characterized by their bulk properties such as tensile strength, yield stress, modulus, hardness, stiffness, elongation, gas permeability, etc. It is these properties that manufacturers consult to determine whether a particular polymer would be suitable for a particular application. Thus, if a manufacturer requires a material that is hard and impact resistant for use in, say, motorcycle helmets, (s)he will select a type of polymer that exhibits those bulk properties whereas if the intended use requires flexibility, toughness and elongation, as might be case with expandable coronary stents, (s)he will choose a different type of polymer. The bulk properties of polymers can, however, change with time, a process known as aging. Aging can render a polymer no longer suitable for its originally intended purpose and possibly cause a construct comprising that polymer to fail in use with potentially disastrous consequences.",
        "What is needed is a method of mitigating the aging process of polymers so as to extend the useful life, including the shelf-life of constructs composed thereof. The present invention provides such a method with regard to physical aging of semi-crystalline polymers.",
        "Thus, an aspect of this invention is a method of mitigating physical aging of semi-crystalline polymers, immiscible blends comprising one or more semi-crystalline polymer(s) or constructs of such polymer or polymer blends, comprising:\n\n    \n    \n        determining a glass transition temperature (Tg) of each polymer;\n        determining a melting temperature (Tm) of each polymer;\n        heating the polymer, immiscible blend of polymers or construct of such polymer or blend of polymers to a temperature between Tg and Tm of the polymer or one or more of the polymers of the immiscible blend of polymers;\n        holding the polymer, immiscible blend of polymers or construct of such polymer or blend of polymers at the temperature until one or more of the polymers independently is above about 25% crystalline and,\n        removing the polymer, immiscible blend of polymers or construct of such polymer of blend of polymers from the source of heat.",
        "In an aspect of this invention, the temperature is from about Tg+0.05(Tm−Tg) to about Tg+0.4(Tm−Tg).",
        "In an aspect of this invention, the temperature is from about Tg+0.17(Tm−Tg) to about Tg+0.21(Tm−Tg).",
        "In an aspect of this invention, the polymer, immiscible blend of polymers or construct of which polymer or polymer blend is held at the temperature until the polymer or at least one of the immiscible blend of polymers or at least one of the polymers comprising the construct is from about 40% to about 60% crystalline.",
        "In an aspect of this invention, the polymer, immiscible blend of polymers or construct of which polymer or polymer blend is held at the temperature until the polymer or at least one of the immiscible blend of polymers or at least one of the polymers comprising the construct is from about 45% to about 55% crystalline.",
        "In an aspect of this invention, the polymer or a polymer of the blend of polymers is poly(lactic acid).",
        "In an aspect of this invention, the poly(lactic acid) is heated at from about 70° C. to about 100° C.",
        "In an aspect of this invention, the poly(lactic acid) is heated at from about 75° C. to about 95° C.",
        "In an aspect of this invention, the poly(lactic acid) is held at the selected temperature from about 5 minutes to about 15 minutes.",
        "In an aspect of this invention, the poly(lactic acid) is held at the selected temperature from about 4 to about 7 minutes.",
        "In an aspect of this invention, the poly(L-lactic acid) is from about 40% to about 45% crystalline after heating at a selected temperature for a selected time.",
        "In an aspect of this invention, the construct is a medical device.",
        "In an aspect of this invention, the medical device is an implantable medical device.",
        "In an aspect of this invention, the implantable medical device is a stent.",
        "In an aspect of this invention, the implantable medical device comprises a layer of poly(lactic acid).",
        "In an aspect of this invention, the stent comprises a layer of poly(lactic acid).",
        "In an aspect of this invention, crystallinity is determined by differential scanning calorimetry.",
        "FIG. 1A is a generic representative DSC thermogram showing the three normal thermal transitions usually seen in thermograms of un-aged semi-crystalline polymers.",
        "FIG. 1B is a generic representative DSC thermogram showing the peak indicating aging of a semicrystalline polymer.",
        "FIG. 2 is a DSC thermogram of a sample of PLA that has been stored at room temperature for approximately three months.",
        "FIG. 3 is a DCS thermogram of the above sample after storage at room temperature for 14 days.",
        "FIG. 4 is a DSC thermogram of the same sample of FIGS. 2 and 3 except that the sample was not aged at all before the run.",
        "FIG. 5 is a DSC thermogram of a sample of PLA tubing, 46% crystallinity, 3.4 draw ratio after one month a room temperature.",
        "FIG. 6 is a DCS thermogram of a 25% crystalline PLA stent after two weeks at room temperature.",
        "FIG. 7 is a DSC thermogram of the stent of FIG. 6 after it had been heated to 60° C. for approximately one hour.",
        "FIG. 8 is a DSC thermogram of a 50% crystalline PLA sample after storage at room temperature for approximately one month.",
        "As used herein, a “construct” refers to any useful article of manufacture made of a semi-crystalline polymer or immiscible blend of polymers of which at least one is semi-crystalline or any useful article of manufacture made of any material that is coated with a semi-crystalline polymer or immiscible blend of polymer blend of which at least one is semi-crystalline.",
        "As used herein, “semi-crystalline” refers to a polymer that, at temperatures below its melting point, is capable of containing, and under most conditions does contain, both amorphous and crystalline domains. Amorphous domains are those in which polymer chains are situated in an essentially random orientation. Crystalline domains are those in which polymer chains adopt an ordered orientation with segments of separate chains or of the same chain becoming essentially parallel to one another to form structures known as lamellae. Lamellae begin from a point of nucleation, which normally is a speck of impurity in the liquid polymer and then grow outward from the nucleation point to form larger, essentially spherical crystalline structures know as crystallites. Unless otherwise expressly described otherwise, any reference to a polymer in the context of the method herein refers to a semi-crystalline polymer.",
        "As used herein, an “immiscible blend” refers to a mixture of polymers in which the polymers form separate phases. If the blend constitutes more than one semi-crystalline polymer, the method herein may still be applied, most beneficially if a temperature can be found that is within the above parameters of this method for each, or as many as possible, of the semi-crystalline polymers in the blend. Furthermore, if a blend of polymers is being treated, it is presently preferred that at least one of the semi-crystalline polymer(s) to which the method herein is applied comprises the continuous phase of the blend.",
        "As used herein, “mitigating” means to eliminate, reduce the effects of, eliminate the recurrence of or increase the time to recurrence of physical aging due to densification in the amorphous regions of a semi-crystalline polymer.",
        "As used herein, “shelf-life” refers to the length of time a construct can be stored at room temperature before sufficient physical aging of the polymers of which it is comprised takes place to render the construct unfit for use for its intended purpose.",
        "Discussion",
        "Polymers age by physical, chemical and/or electrical processes. Chemical aging results from exposure of a polymer to such external factors as air (oxygen), moisture, solvents, radiation, heat and light. Electrical aging results from voltage-induced stress that occurs at voltages usually in excess of about 3 kilovolts. Physical aging, which is the primary focus of this invention, results from residual and applied stresses. As used herein, a “residual stress” includes, without limitation, stress in a bulk polymer that is in a non-equilibrium thermodynamic state.",
        "Physical aging of semi-crystalline polymers that have glass transition temperatures (Tg) above their normal storage temperature, which, for the purposes of this invention is room temperature, i.e., from about 15° C. to about 35° C., occurs primarily through the phenomenon known as densification.",
        "Densification occurs when a semi-crystalline polymer is cooled at a non-equilibrium rate from a temperature above its Tg to a temperature below its Tg. Such is in fact normally what will occur in most industrial settings in that equilibrium cooling is very slow and would be considered economically impractical. The non-equilibrium cooling rate results in the randomly oriented polymer chains of the amorphous domains being trapped at non-optimal separation distances in the glassy state that forms when the temperature goes below Tg. The chains then attempt to achieve optimal separation by coordinated localized chain motion. As the average distance between chains decreases, a decrease in polymer free volume occurs, that is, that space within the bulk polymer not physically inhabited by portions of polymer chains is reduced. The loss of free volume results in an increase in polymer density per unit volume, thus the term “densification.” As the polymer densifies, non-covalent chain-chain molecular interactions increase. Although the interactions do not result in chain ordering, that is, the formation of lamellae and crystallites, which would constitute crystallization, the effect on the bulk properties of the polymer is similar to that obtained when crystallization occurs: the modulus of the polymer increases and concomitantly the polymer becomes more brittle. Thus, densification of a polymer initially selected for toughness and elasticity could result in failure of a construct made of or coated with the polymer when the polymer ages or densifies and becomes brittle. Densification can occur relatively rapidly in reference to the desired shelf-life of constructs comprising semi-crystalline polymers such that control of densification can result in significantly extending the shelf-life of such constructs.",
        "Densification of a polymer can be observed and qualitatively tracked by differential scanning calorimetry (DSC). Briefly, DSC measures the thermal transitions that a polymer goes through on heating. For a semi-crystalline polymer, there are normally three such thermal transitions, the glass transition, Tg, the latent heat of crystallization, Tc, and melting, Tm. A typical DSC thermogram, as the resulting plot called, is shown in FIG. 1A with Tg, Tc and Tm labeled. One of the fundamental uses of DSC is to determine the percent crystallinity in a semi-crystalline polymer. In brief, this is accomplished by first calculating the area under the Tm peak. Melting is an endothermic process, that is, heat must be added to the system to melt the crystalline regions of the polymer. The area is then divided by the rate of heating to give the number of joules per gram of sample that was needed to melt all crystalline domains in the sample when the sample reached its melting point. Multiplying joules per gram by the size of the sample in grams gives the total amount of heat that was required to melt those crystalline regions, Ht. The exercise is repeated for the Tc peak to give Hc, the amount of heat given off by the system as crystallization was taking place, the latent heat of crystallization being exothermic. (Ht−Hc) gives the amount of heat, Hm, that was required to melt the crystalline domains that existed before the polymer was heated above Tg. The specific heat of melting, Hsm, of the polymer may generally be looked up in the literature since many are known in the art but, if not, it may be empirically obtained by repeating the above experiment using exactly one gram of polymer. Dividing Hm by Hsm provides the number of grams of the sample that were crystalline before the polymer was heated above Tg. (Hm/Hsm) X 100 gives the percent crystallinity of the polymer when it was below Tg.",
        "FIG. 1B shows a generic thermogram as it would appear for an aged semicrystalline polymer. In the region of Tg, as opposed to a smooth exothermic transition to higher heat capacity, a distinct peak, indicated by Td, for T-sub-densification, is observed. It is this peak that is presently thought to represent aging of the polymer. As will be seen in the examples that follow, this is supported by the fact that the peak disappears when the polymer sample is subjected to a second DSC run after the completion of the first, that is after the polymer has been melted, become completely. amorphous and, as a result, lost any characteristics that would be attributable to its temporal history. That is, the disappearance of the Td peak suggests that this peak is the result of the polymers temporal history and therefore is reasonably attributable to aging.",
        "FIG. 2 is a DSC thermogram of a sample of semi-crystalline poly(lactic acid) (PLA) which had been stored at room temperature for three months. The thermogram reveals five rather than three thermal transitions. Tg, Tc and Tm, as described with regard to FIG. 1, are labeled. Tc2, the exact origin of which has not been firmly established, is presently thought to be due to rearrangement of imperfections in crystalline domains to more regular ordered structures created during initial crystallization at Tc. More interesting is the peak, Td, seen in the vicinity of Tg because it is this peak which is presently thought to be due to densification of the polymer in the sample. To examine whether such is the case, a second DSC was run on the sample immediately after the first. Once the sample reached Tm during the first DSC run, all thermal history of the sample was eliminated. That is, the sample was returned to its liquid amorphous state in which no crystallinity nor any densification exists. If in fact Td were related to densification or physical aging, then it ought not be evident in the rerun thermogram of the polymer. That is exactly what is observed. In the thermogram on the freshly cooled sample was obtained, Tg, Tc, Tc2 and Tm were all still apparent in the plot but Td has disappeared.",
        "Additional DSCs exploring Td and the effects of various physical characteristics of the polymer thereon, namely draw ratio, radial expansion and initial degree of crystallinity on Td can be seen in FIGS. 3-8.",
        "In FIG. 3, a DSC of the same sample used to create the thermogram of FIG. 2 is shown, except that the PLA had been aged for 14 days rather than three months. As can be seen, Td is evident but the peak is smaller than that in FIG. 2. This suggests that the sample of FIG. 2 had undergone more densification and thus more aging than the sample of FIG. 3, which is exactly the case, further solidifying the assignment of Td to physical aging of the sample.",
        "FIG. 4 is a DSC of the same sample used to obtain the thermograms of FIGS. 2 and 3, except that it was run immediately after cooling the PLA from the melt, that is, with no aging at all. As can be seen, there is no Td peak, further confirming that this peak is indeed indicative of densification and physical aging.",
        "FIG. 5 shows a thermogram of a PLA sample that had been subject to a high draw ratio (3.4) and thereby exhibited a high degree of crystallinity (46%). After one month at room temperature, the initial thermogram and the immediate rerun thermogram show Tg and Tm but neither exhibits any Td. The absence of Tc in the initial thermogram may be attributed to the fact that the high draw ratio induced maximum crystallinity in the sample so that no further crystallization occurred between Tg and Tm. The appearance of Tc2 in the rerun thermogram suggests crystalline defects were introduced during the second run through Tc.",
        "FIG. 6 shows a thermogram run on a sample of a two-week old stent fabricated from PLA which had undergone a low draw ratio, 1.0, and had a relatively low degree of crystallization, 25%. As can be seen, the upper plot reveals a Tg, a Td, a Tc, a Tc2 and a Tm while the second rerun plot shows each of these except for Td. Thus, the DSC shows that the sample had undergone considerable physical aging in just two weeks.",
        "FIG. 7 show a thermogram of a sample of the same stent used to generate the plot in FIG. 6. Here, the sample had been heated to approximately 60° C. for about one hour prior to running the DSC. Td is completely absent from the plot. Thus, it appears that physical aging due to densification can be reversed by heating the polymer to a temperature between Tg (about 58° C. for PLA) and Tm; i.e., it is not necessary to completely melt the polymer.",
        "Since a polymer need not be melted to reverse densification, physical aging in constructs made of or coated with a semi-crystalline polymer should be reversible without damaging the constructs or coating, thus providing a means of extending the useful life, including the shelf-life, of such constructs. The question becomes, is there a way to control the rate of re-densification such that it would not be necessary to subject a construct to repeated heating and cooling which could exacerbate chemical aging and speed the demise of the construct? The answer lies in the fact that the rate of densification is related to the degree of crystallization.",
        "As pointed out previously, densification results from localized segmental movement of polymer chains in amorphous region of a polymer at temperatures below Tg as the chains attempt to achieve thermodynamic equilibrium with regard to chain separation distance. This is a slow process since in the glassy state below Tg very little thermal energy is available to effect chain motion. If the polymer chains are further involved in inter- or inner-chain crystalline structures, that is, lamellae and spherulites, that are dispersible only upon melting, the lengths of chain in the amorphous domains that are still capable of movement are reduced and the ability of the chains to densify is correspondingly lessened. That such is the case can be seen in FIG. 8 where a thermogram of a sample of a 50% crystalline PLA sample that was stored for approximately one month is shown. As can be seen, the first and second DSC runs appear substantially identical in the Tg region; i.e., there is no evidence of any densification as indicated by the absence of a Td. Thus, it would be expected that increasing the degree of crystallinity of a polymer should reduce or even eliminate physical aging. However, crystallization itself is an undesirable characteristic of polymers that are used to fabricate constructs that rely on toughness, durability, flexibility and elongation of the polymer for their utility because crystallinity confers increased modulus and brittleness on a polymer. Thus, it would be desirable to use polymers that are more crystalline in order to mitigate densification, i.e., physical aging, but that avoid the changes in bulk properties that accompany increased crystallinity. The answer to this conundrum lies in the thermodynamics of crystallization.",
        "As the temperature of a semi-crystalline polymer is raised from Tg the rate of crystallization increases logarithmically until the temperature reaches Tm at which point the crystal domains melt and the polymer chains resume a amorphous, completely random orientation. During the temperature run, several processes occur. Polymer crystallization begins with nucleation, the formation of small crystalline domains around specks of impurities in the sea of amorphous liquid polymer. Nucleation occurs most efficiently at temperatures near Tg. Crystal growth, the formation of lamellae and crystallites, on the other hand, occurs most rapidly at temperatures near Tm. Thus, at various temperatures between Tg and Tm it should be possible to control the relationship between degree of nucleation and associated crystal growth with the greatest amount of nucleation coupled with the least amount of crystal growth occurring at temperatures above but near Tg. The formation of large number of small crystalline domains should have the effect of drastically restricting polymer chain motion in the remaining amorphous domains of a polymer while not substantially affecting the desirable bulk properties of the polymer. Furthermore, the restricted motion of the polymer chains should reduce, even eliminate, densification and, thus, physical aging of the polymer.",
        "It has been found that heating a semi-crystalline polymer to a temperature that is above Tg by about 5% to about 40%, preferably from about 17% to about 21% of the difference between Tg and Tm for a relatively brief period of time, typically from about 1 minute to about 20 minutes, preferably about 3 minutes to about 10 minutes, followed by cooling the polymer to room temperature which may include forced cooling or simply removing the polymer from the source of heat and allowing it to cool naturally under ambient conditions to room temperature, will yield a polymer that has a relatively high degree of crystallinity, preferably from about 40% to about 60%, more preferably at present from about 45% to about 55% wherein the crystallinity is due primarily to a large number of small crystalline regions rather than fewer but larger crystallite-containing regions. The result is a polymer in which the propensity to densify is drastically curtailed if not virtually eliminated but that still retains the bulk properties required of it for its particular application.",
        "The above temperature can be calculated using the equation T=Tg+X(Tm−Tg) where X is about 0.05 to about 0.4 and more preferably, from about 0.17 to about 0.21. For example, without limitation, for PLA having a Tg of approximately 60° C. and a Tm of approximately 180° C., the temperature T to which it would be heated is from 60+0.05(180−60) to 60+0.4(180−60) or from 66° C. to about 108° C., preferably from 60+0.17(180−60) to 60+0.21(180−60) or from approximately 80° C. to approximately 85° C.",
        "The above process can be applied to a semi-crystalline polymer or immiscible blend in which at least one polymer is semi-crystalline prior to the polymer or blend being used in a construct. Thus, for example without limitation, extruded PLA can be treated using the method herein, cooled and laser-cut into balloon expandable stents.",
        "In addition to treating a semi-crystalline polymer or polymer blend prior to fabrication of a construct, the method herein may be applied to fully formed constructs. The only caveat is that the construct cannot contain any substance, such as a drug, that might be detrimentally affected at the requisite temperatures of this method. In this manner physical aging of existing constructs can be reversed, with the resulting construct being expected to have a much longer useful lifespan, including a substantially extended shelf-life, due to the resistance to re-aging imparted by the method herein.",
        "While the method of this invention can be applied to any semi-crystalline polymer or to any construct of such polymer or blend of polymers, it is presently a preferred embodiment of this invention that it be applied to polymers that are used for the fabrication of implantable medical devices or are coated onto such implantable medical devices. Implantable medical devices tend to be expensive and their required performance characteristics stringent. Physical aging can render such devices unusable in a relatively short period of time resulting in a potentially huge expense. Thus, it is anticipated that the method herein will find particular application both as a treatment for polymers used to make or coat such devices and as a treatment for devices already in existence and that have been stored for a period of time waiting to be used.",
        "An implantable medical device refers to any type of appliance that is totally or partly introduced, surgically or medically, into a patient's body or by medical intervention into a natural orifice, and which is intended to remain there after the procedure. The duration of implantation may be essentially permanent, i.e., intended to remain in place for the remaining lifespan of the patient; until the device biodegrades; or until it is physically removed. Examples of implantable medical devices include, without limitation, implantable cardiac pacemakers and defibrillators; leads and electrodes for the preceding; implantable organ stimulators such as nerve, bladder, sphincter and diaphragm stimulators, cochlear implants; prostheses, self-expandable stents, balloon-expandable stents, stent-grafts, grafts, artificial heart valves and cerebrospinal fluid shunts. In particular, the method herein should be useful in the fabrication and maintenance of stents for the purpose of extending their shelf-lives.",
        "The primary use of a stent is to maintain the patency of a vessel in a patient's body when the vessel is narrowed or closed due to diseases or disorders including, without limitation, tumors (in, for example, bile ducts, the esophagus, the trachea/bronchi, etc.), benign pancreatic disease, coronary artery disease, carotid artery disease and peripheral arterial disease such as atherosclerosis, re-stenosis and vulnerable plaque Vulnerable plaque (VP) is a type of fatty build-up in an artery thought to be caused by inflammation. The VP is covered by a thin fibrous cap that can rupture leading to blood clot formation and the stent acts as a shield against such rupture. A stent may, however, also be used for localized delivery of a bioactive agent to a selected treatment site in a patient's body.",
        "The stent may be self-expandable or balloon expandable. Any type of stent currently known to, or as such may become known to, those skilled in the art may be fabricated of or coated with a semi-crystalline polymer or blend of polymers that has been subjected to the method herein. In the alternative, a stent already so fabricated or coated may be subjected to the method herein to eliminate any densification that has taken place and inhibit or eliminate its recurrence.",
        "For implantable medical devices, in particular at present for stents, that have been or are to be coated with a semi-crystalline polymer or immiscible blend of polymers of which as least one is semi-crystalline, the device may be made of virtually any material that is amenable to such coating. Examples, without limitation of which materials include biocompatible metals or alloys such as, but not limited to, cobalt chromium alloy (ELGILOY), 316L stainless steel, high nitrogen stainless steel, e.g., BIODUR 108, nickel-titanium alloy (NITINOL), tantalum, platinum, platinum-iridium alloy, gold and combinations thereof.",
        "Alternatively, the implantable medical device or stent may be made of one or more biocompatible, relatively non-biodegradable polymers including, but not limited to, polyacrylates, polymethacryates, polyureas, polyurethanes, polyolefins, polyvinylhalides, polyvinylidenehalides, polyvinylethers, polyvinylaromatics, polyvinylesters, polyacrylonitriles, alkyd resins, polysiloxanes and epoxy resins. Any of these polymers that is semi-crystalline can, of course, be subjected to and expected to benefit from the method herein with regard to their physical aging by densification. It is presently preferred that the method of this invention be applied to stents made of bioabsorbable semi-crystalline polymer or polymers so as to extend their shelf-lives.",
        "As noted above, a stent may be used for the localized deliver of bioactive agent(s). As used herein, a bioactive agent refers any substance that is of medical or veterinary therapeutic, prophylactic or diagnostic utility. Therapeutic use refers to a bioactive agent that, when administered to a patient, will cure, or at least relieve to some extent one or more symptoms of, a disease or disorder. Prophylactic use refers to a bioactive agent that, when administered to a patient either prevents the occurrence of a disease or disorder or, if administered subsequent to a therapeutic agent, prevents or retards the recurrence of the disease or disorder. For the purposes of this invention, any such agent may be included in the construct that is subjected to the method of mitigating the effects of physical aging so long as the conditions of the method will not adversely affect the agent.",
        "This invention has been described in relation to certain examples of its application, in particular to its applicability to constructs comprising semi-crystalline PLA. The examples are not intended nor should they be construed as limiting this invention in any manner whatsoever. Those skilled in the art will recognize, based on the disclosures herein, other polymer and other constructs to which the invention herein may be applied. All such polymers and constructs are within the scope of this invention."
    ],
    "citations": [
        "3687135",
        "3839743",
        "3900632",
        "4104410",
        "4110497",
        "4321711",
        "4346028",
        "4596574",
        "4599085",
        "4612009",
        "4633873",
        "4656083",
        "4718907",
        "4722335",
        "4723549",
        "4732152",
        "4733665",
        "4739762",
        "4740207",
        "4743252",
        "4768507",
        "4776337",
        "4800882",
        "4816339",
        "4818559",
        "4850999",
        "4877030",
        "4878906",
        "4879135",
        "4886062",
        "4902289",
        "4977901",
        "4994298",
        "5019090",
        "5028597",
        "5059211",
        "5062829",
        "5084065",
        "5085629",
        "5100429",
        "5104410",
        "5108417",
        "5108755",
        "5112457",
        "5123917",
        "5156623",
        "5163951",
        "5163952",
        "5163958",
        "5167614",
        "5192311",
        "5197977",
        "5234456",
        "5234457",
        "5236447",
        "5279594",
        "5282860",
        "5289831",
        "5290271",
        "5306286",
        "5306294",
        "5328471",
        "5330500",
        "5342348",
        "5342395",
        "5342621",
        "5356433",
        "5383925",
        "5385580",
        "5389106",
        "5399666",
        "5423885",
        "5441515",
        "5443458",
        "5443500",
        "5455040",
        "5464650",
        "5502158",
        "5514379",
        "5527337",
        "5545408",
        "5554120",
        "5556413",
        "5578046",
        "5578073",
        "5591199",
        "5591607",
        "5593403",
        "5593434",
        "5599301",
        "5599922",
        "5605696",
        "5607442",
        "5607467",
        "5618299",
        "5629077",
        "5631135",
        "5632771",
        "5632840",
        "5637113",
        "5649977",
        "5667767",
        "5667796",
        "5670558",
        "5693085",
        "5700286",
        "5707385",
        "5711763",
        "5716981",
        "5725549",
        "5726297",
        "5728751",
        "5733326",
        "5733330",
        "5733564",
        "5733925",
        "5741881",
        "5756457",
        "5756476",
        "5765682",
        "5766204",
        "5766239",
        "5766710",
        "5769883",
        "5780807",
        "5800516",
        "5811447",
        "5824049",
        "5830178",
        "5830461",
        "5830879",
        "5833651",
        "5834582",
        "5836962",
        "5837313",
        "5837835",
        "5840083",
        "5851508",
        "5853408",
        "5854207",
        "5855612",
        "5855618",
        "5858746",
        "5865814",
        "5868781",
        "5873904",
        "5874101",
        "5874109",
        "5874165",
        "5876743",
        "5877263",
        "5879713",
        "5888533",
        "5891192",
        "5897955",
        "5906759",
        "5914182",
        "5916870",
        "5922005",
        "5942209",
        "5948428",
        "5954744",
        "5957975",
        "5965720",
        "5971954",
        "5976182",
        "5980564",
        "5980928",
        "5980972",
        "5981568",
        "5986169",
        "5997468",
        "6010445",
        "6015541",
        "6042875",
        "6048964",
        "6051648",
        "6056993",
        "6060451",
        "6066156",
        "6071266",
        "6074659",
        "6080177",
        "6080488",
        "6083258",
        "6093463",
        "6096070",
        "6096525",
        "6099562",
        "6103230",
        "6107416",
        "6110188",
        "6113629",
        "6117979",
        "6120536",
        "6120904",
        "6121027",
        "6125523",
        "6127173",
        "6129761",
        "6129928",
        "6150630",
        "6153252",
        "6159951",
        "6160084",
        "6165212",
        "6166130",
        "6169170",
        "6171609",
        "6174330",
        "6177523",
        "6183505",
        "6187045",
        "6210715",
        "6224626",
        "6228845",
        "6240616",
        "6245076",
        "6245103",
        "6248344",
        "6251135",
        "6251142",
        "6273913",
        "6281262",
        "6284333",
        "6287332",
        "6290721",
        "6293966",
        "6303901",
        "6312459",
        "6327772",
        "6375826",
        "6379381",
        "6387121",
        "6388043",
        "6395326",
        "6409761",
        "6423092",
        "6461632",
        "6464720",
        "6479565",
        "6485512",
        "6492615",
        "6494908",
        "6495156",
        "6511748",
        "6517888",
        "6527801",
        "6537589",
        "6539607",
        "6540777",
        "6554854",
        "6565599",
        "6569191",
        "6569193",
        "6572672",
        "6574851",
        "6585755",
        "6592614",
        "6592617",
        "6613072",
        "6626939",
        "6635269",
        "6645243",
        "6656162",
        "6664335",
        "6666214",
        "6667049",
        "6669723",
        "6676697",
        "6679980",
        "6689375",
        "6695920",
        "6706273",
        "6709379",
        "6719934",
        "6719989",
        "6720402",
        "6746773",
        "6752826",
        "6753007",
        "6764505",
        "6818063",
        "6846323",
        "2001/0044652",
        "2002/0002399",
        "2002/0004060",
        "2002/0004101",
        "2002/0062148",
        "2002/0065553",
        "2002/0111590",
        "2002/0116050",
        "2002/0138133",
        "2002/0161114",
        "2003/0033001",
        "2003/0093107",
        "2003/0100865",
        "2003/0105518",
        "2003/0105530",
        "2003/0171053",
        "2003/0187495",
        "2003/0208259",
        "2003/0209835",
        "2003/0226833",
        "2003/0236565",
        "2004/0093077",
        "2004/0098095",
        "2004/0111149",
        "2004/0127970",
        "2004/0143317",
        "2004/0167610",
        "2005/0004663",
        "44 07 079",
        "197 31 021",
        "198 56 983",
        "0 108 171",
        "0 144 534",
        "0 364 787",
        "0 397 500",
        "0 464 755",
        "0 493 788",
        "0 554 082",
        "0 578 998",
        "0 583 170",
        "0 604 022",
        "0 621 017",
        "0 623 354",
        "0 665 023",
        "0 709 068",
        "0 970 711",
        "2 247 696",
        "WO 89/03232",
        "WO 90/01969",
        "WO 90/04982",
        "WO 90/09094",
        "WO 91/17744",
        "WO 91/17789",
        "WO 92/10218",
        "WO 93/06792",
        "WO 94/21196",
        "WO 95/29647",
        "WO 98/04415",
        "WO 99/03515",
        "WO 99/16386",
        "WO 99/42147",
        "WO 00/12147",
        "WO 00/64506",
        "WO 01/01890",
        "WO 2004/023985"
    ],
    "us_classification": "528480",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "08",
            "subclass": "F",
            "main_group": "6",
            "subgroup": "00"
        }
    ]
}