{
    "title": "Arrangement for measuring the body temperature of a living organism",
    "abstract": "An arrangement for measuring the body temperature of a living organism includes a sensor housing containing a first temperature sensor for measuring the skin temperature of the living organism, a second temperature sensor and an evaluation unit. The first temperature sensor is placed on the skin of the body and the second temperature sensor is arranged thermally insulated on the side of the first temperature sensor facing away from the skin and is at a spacing relative to the first temperature sensor. The evaluation unit computes the body temperature in accordance with a pregiven temperature formula which contains a temperature difference from the temperatures measured by the first temperature sensor and the second temperature sensor. A compensation unit is provided in such a manner that a lost heat flow (q",
    "inventors": [
        "Koch"
    ],
    "document_number": "07299090",
    "publication_date": "20071120",
    "assignees": [
        "Draeger Safety AG & Co. KGaA"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An arrangement for measuring the body temperature of a living organism, the arrangement comprising:",
            "components": [
                {
                    "component": "a housing;",
                    "subcomponents": []
                },
                {
                    "component": "a first sensor mounted in said housing and disposed in contact engagement with the skin of the living organism for measuring a first temperature;",
                    "subcomponents": []
                },
                {
                    "component": "a second sensor mounted in said housing for measuring a second temperature;",
                    "subcomponents": []
                },
                {
                    "component": "said first sensor having a side facing away from said skin;",
                    "subcomponents": []
                },
                {
                    "component": "said second sensor being mounted at a distance from said side of said first sensor;",
                    "subcomponents": []
                },
                {
                    "component": "insulating means disposed between said first and second sensors for thermally insulating said first and second sensors from each other and conducting a thermal flow therebetween from which a thermal loss flow (q",
                    "subcomponents": []
                },
                {
                    "component": "compensation means for determining or estimating said thermal loss flow (q",
                    "subcomponents": []
                },
                {
                    "component": "an evaluation unit operatively connected to said compensation means so as to permit consideration of said thermal loss flow (q",
                    "subcomponents": []
                },
                {
                    "component": "wherein said evaluation unit determines said body temperature with the aid of a formula and said compensation means is a compensation term which expands said formula;",
                    "subcomponents": []
                },
                {
                    "component": "wherein said housing has an outer wall; and, said compensation term is dependent upon at least one of a boundary temperature (t",
                    "subcomponents": []
                },
                {
                    "component": "said arrangement further comprising a third sensor mounted in the region of said outer wall for measuring said boundary temperature and said compensation term being formed in dependence upon said boundary temperature (t",
                    "subcomponents": []
                },
                {
                    "component": "wherein said compensation term is formed exclusively by coupling of constant parameters (K",
                    "subcomponents": [
                        ""
                    ]
                },
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The arrangement of claim 1 , wherein said compensation term is dependent upon said thermal conductance constant (α).",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The arrangement of claim 1 , wherein said boundary temperature (t",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The arrangement of claim 1 , wherein said thermal conductance constant (α) is assigned a value in a range of 10 W/m",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The arrangement of claim 3 , wherein said boundary temperature formula is given by",
            "components": []
        }
    ],
    "description": [
        "This application claims priority of German patent application no. 10 2005 004 933.8, filed Feb. 3, 2005, the entire contents of which is incorporated herein by reference.",
        "The invention relates to an arrangement for measuring the body temperature of a living organism. The arrangement includes a sensor housing containing a first temperature sensor for detecting the skin temperature of the living organism and a second temperature sensor as well as an evaluation unit. The first temperature sensor can be applied to the skin of the body and the second temperature sensor is arranged on the side of the first temperature sensor facing away from the skin so as to be thermally insulated with respect thereto and is in spaced relationship to the first temperature sensor. In the evaluation unit, the body temperature is computed in accordance with a pregiven temperature formula which contains a temperature difference of the temperatures measured by the first temperature sensor and the second temperature sensor.",
        "German patent publication 100 38 247 discloses an arrangement for measuring the body temperature of a living organism wherein a first temperature sensor and a second temperature sensor are mounted in a housing. During the measuring operation, the first temperature sensor is applied directly to the skin of the body and detects the skin temperature. The second temperature sensor is arranged so as to be thermally insulated and spaced relative to the first temperature sensor. The second temperature sensor is disposed on a side of the first temperature sensor facing away from the skin. The second temperature sensor determines the temperature of the ambient air of the body.",
        "From U.S. Pat. No. 6,929,611, it is known to integrate in a protective helmet an arrangement for measuring the body temperature of a living organism with this arrangement being known from DE 100 38 247 C2. A first temperature sensor for detecting the skin temperature of a person and a second temperature sensor are integrally arranged in a headband of the protective helmet. The second temperature sensor is mounted thermally insulated on a side of the first temperature sensor which faces away from the skin and is arranged in spaced relationship to the first temperature sensor. An evaluation unit is provided to compute the instantaneous body temperature of the person in accordance with a pregiven temperature formula in dependence upon constant parameters and a temperature difference measured by the first temperature sensor and the second temperature sensor.",
        "With respect to the known arrangement, it is disadvantageous that an erroneous determination of the body temperature can occur in dependence upon ambient and geometric conditions.",
        "In view of the above, it is an object of the invention to provide an arrangement for measuring the body temperature of a living organism in such a manner that the accuracy of the measuring operation is improved.",
        "The arrangement of the invention is for measuring the body temperature of a living organism. The arrangement includes: a housing; a first sensor mounted in the housing and disposed in contact engagement with the skin of the living organism for measuring a first temperature; a second sensor mounted in the housing for measuring a second temperature; the first sensor having a side facing away from the skin; the second sensor being mounted at a distance from the side of the first sensor; insulating means disposed between the first and second sensors for thermally insulating the first and second sensors from each other and conducting a main thermal flow therebetween from which a thermal loss flow (qsa) branches off while measuring the body temperature; compensation means for determining or estimating the thermal loss flow (qsa); and, an evaluation unit operatively connected to the compensation means so as to permit consideration of the thermal loss flow (qsa) thereby increasing the accuracy of the measurement of the body temperature.",
        "According to the invention, a compensation unit is provided which makes it possible for the evaluation unit to compute a body temperature while considering a lost heat flow occurring within the sensor housing. The compensation unit considers especially the lost heat flow which results in that the heat flow, which is outputted from the body to the sensor housing of the arrangement, is not completely conducted over the first temperature sensor to the second temperature sensor. A more precise measurement result can be obtained from the determination or estimate of the lost heat flow.",
        "According to a preferred embodiment of the invention, the compensation unit is configured in that a compensation term is assigned to the temperature formula for computing the body temperature and this compensation term is dependent upon a boundary temperature and/or a heat transfer between the sensor housing and the ambient. The boundary temperature is measured at the outer wall of the sensor housing. In this way, the previous temperature formula can be hereby retained which is simply supplemented by the compensation term. The previous temperature formula therefore functions as a basis for the temperature formula of the invention which expands the hitherto existing temperature formula by the compensation term.",
        "According to a first variation of the invention, a third temperature sensor is provided which is mounted in the region of the outer wall of the sensor housing. The third temperature sensor measures the boundary temperature of the sensor housing at the transition to the ambient. In connection with the temperatures, which are measured by the first temperature sensor and the second temperature sensor, as well as additional geometry-dependent or material-dependent constant parameters, a precise body temperature determination can take place which is independent of the ambient conditions, especially, independent of the temperature conditions during the measuring operation. The compensation term can be determined relatively precisely because of the determination of the boundary temperature of the sensor housing.",
        "According to a second variation of the invention, the compensation term can be determined by estimating or computing the boundary temperature of the sensor housing. In this way, the boundary temperature is determined by means of a boundary temperature formula in dependence upon a heat transfer constant between the wall of the sensor housing and the ambient. A value in a pregiven range is assigned to the heat transfer constant. This value range is dependent upon the magnitude of an air flow in the region of the housing wall. By assuming a value of the heat transfer constant in the usual value range, a relatively precise measurement result can be obtained exclusively in dependence upon the measuring quantities of the temperatures determined by the first temperature sensor and the second temperature sensor.",
        "The invention will now be described with reference to the drawings wherein:",
        "FIG. 1 is a schematic longitudinal section view through a sensor housing of the arrangement of the invention with the arrangement being disposed in a mounting position on the skin of a person;",
        "FIG. 2 is a schematic representation showing the arrangement of FIG. 1;",
        "FIG. 3 is an error curve of the arrangement of a first embodiment of the invention in dependence upon the ambient temperature;",
        "FIG. 4 is an error curve of an arrangement of a second embodiment of the invention in dependence upon a heat transfer constant α; and,",
        "FIG. 5 is a schematic of a remote receiving unit to which measurement data are transmitted by a transmission/receiving unit of the evaluation unit in the sensor housing shown in FIG. 1.",
        "An arrangement of the invention for measuring the body temperature of a living organism, especially a person, includes a sensor housing 1 (measuring housing) which is integrated into a headband of a protective helmet for determining the body temperature of the person. The integration into a headband of a protective helmet is disclosed in U.S. Pat. No. 6,929,611 which is incorporated herein by reference.",
        "The sensor housing 1 is so positioned on the headband (not shown) that a first temperature sensor 2, which is mounted in the sensor housing 1, lies directly on the scalp 3 of the person as shown in FIG. 1. The first temperature sensor 2 detects a skin temperature Th1 of the head. On a side of the first temperature sensor 2 facing away from the skin 3, a second temperature sensor 4 is mounted within the sensor housing 1 and this second temperature sensor is mounted at a distance to the first temperature sensor 2. When the arrangement is mounted in a protective helmet, the second sensor 4 measures the ambient-near temperature within the helmet. On the other hand, the arrangement can be mounted in clothing and the second sensor 4 then measures the ambient-near temperature in the clothing.",
        "The intermediate space between the first temperature sensor 2 and the second temperature sensor 4 is filled with an insulating material 12 such as foam material or insulating wool. The second temperature sensor 4 is therefore mounted so as to be thermally insulated with respect to the first temperature sensor 2.",
        "An evaluation unit 5 is integrated into the sensor housing 1 and is an integral part of the arrangement of the invention. The evaluation unit 5 is electrically coupled to the first temperature sensor 2 and the second temperature sensor 4 as shown in the schematic of FIG. 2. The evaluation unit 5 essentially has a computing unit 22 provided with an amplifier, a transmission/receiving unit 24, a contact switch 26 and a current supply unit 28. The evaluation unit 5 can be switched on and off by means of the switch 26. For example, the switch 26 can be configured as a pressure switch as known per se so that, after applying the headband, the evaluation unit 5 and therefore the arrangement are automatically switched on.",
        "Measurement data are determined from temperature sensors 2 and 4 and are evaluated in the evaluation unit 5. These measurement data are transmitted to the remote receiving unit 20 shown in FIG. 5 by the transmission/receiving unit 24 of the evaluation unit 5. The remote receiving unit 20 includes a transmission/receiving unit 18, an evaluation circuit 15, a display device 16 and an alarm unit 17. The receiving unit 20 can be disposed on the body of the wearer of the headband so that the person, who carries the arrangement, can directly read off the measured body temperature. Alternatively, the receiving unit 18 can also be accommodated in a central monitoring station.",
        "It is known to compute the body temperature Tc of a person in the evaluation unit 5 in accordance with the temperature formula:",
        "T\n      c\n    \n    =\n    \n      \n        T\n        \n          h\n          ⁢\n          \n            \n          \n          ⁢\n          1\n        \n      \n      +\n      \n        \n          \n            K\n            s\n          \n          \n            K\n            g\n          \n        \n        ·\n        \n          (\n          \n            \n              T\n              \n                h\n                ⁢\n                \n                  \n                \n                ⁢\n                1\n              \n            \n            -\n            \n              T\n              \n                h\n                ⁢\n                \n                  \n                \n                ⁢\n                2\n              \n            \n          \n          )\n        \n      \n    \n  \n  ,\n\n\n\n\nwherein:",
        "Tc=core temperature, body temperature;",
        "Th1=skin temperature measured by the first temperature sensor 2;",
        "Th2=temperature measured by the second temperature sensor 4;",
        "Ks=thermal conductivity coefficient of the sensor housing;",
        "Kg=thermal conductivity coefficient of human tissue.",
        "To increase the accuracy of the measurement, a compensation unit 13 is provided in accordance with the invention which compensates especially measurement errors as a consequence of varying ambient conditions. In a first embodiment of the invention, the temperature compensation unit 13 is formed essentially by a third temperature sensor 6 which is mounted in the region of an outer wall 7 of the sensor housing 1. The third temperature sensor 6 is connected to the computer/amplifier unit 22 and detects a boundary temperature tsa of the sensor housing 1. Preferably, the third temperature sensor 6 is disposed in a side region 8 of the sensor housing 1. This side region 8 is arranged transversely of an imaginary connecting line 9 between the first temperature sensor 2 and the second temperature sensor 4. The imaginary connecting line 9 between the first temperature sensor 2 and the second temperature sensor 4 extends essentially orthogonally to a support surface 10 of the scalp 3. The side region 8 extends essentially at a spacing to the connecting line 9 and runs in a symmetry plane 11 of the insulating material 12 which lies between the first temperature sensor 2 and the second temperature sensor 4. In this way, the third temperature sensor 6 is in a position to measure the temperature tsa on the outer surface of the insulating material 12.",
        "By measuring the sensor housing outer temperature tsa by means of the third temperature sensor 6, the known temperature formula Tc can be expanded by a compensation term 14 which considers a lost heat flow qsa. The lost heat flow qsa is branched off from a main heat flow qs running perpendicularly to the support surface 10. This lost heat flow qsa flows in the mid region between the first temperature sensor 2 and the second temperature sensor 4 transversely to the connecting line 9 to the outer wall 7. By coupling the compensation term 14 to the known temperature formula Tc, an expanded temperature formula Tc′ results for measuring the body temperature of a person as follows:",
        "T\n    c\n    ′\n  \n  =\n  \n    \n      T\n      \n        h\n        ⁢\n        \n          \n        \n        ⁢\n        1\n      \n    \n    +\n    \n      \n        \n          K\n          s\n        \n        \n          K\n          g\n        \n      \n      ·\n      \n        (\n        \n          \n            T\n            \n              h\n              ⁢\n              \n                \n              \n              ⁢\n              1\n            \n          \n          -\n          \n            T\n            \n              h\n              ⁢\n              \n                \n              \n              ⁢\n              2\n            \n          \n        \n        )\n      \n    \n    +\n    \n      \n        \n          \n            \n              K\n              iso\n            \n            \n              K\n              g\n            \n          \n          ·\n          \n            \n              A\n              iso_m\n            \n            \n              A\n              s\n            \n          \n          ·\n          \n            (\n            \n              \n                \n                  \n                    T\n                    \n                      h\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      1\n                    \n                  \n                  +\n                  \n                    T\n                    \n                      h\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      2\n                    \n                  \n                \n                2\n              \n              -\n              \n                t\n                sa\n              \n            \n            )\n          \n        \n        ︸\n      \n      14\n    \n  \n\n\n\n\nwherein:",
        "Kiso=thermal conductivity coefficient of the outer insulation;",
        "Aiso—m=surface area of the outer insulation (same elevation as the insulation between the sensors);",
        "As=end face of the sensor having the diameter of the insulation;",
        "tsa=temperature at the outer surface of the insulation as measured by the third temperature sensor 6.",
        "The heat flow qsa flows off laterally transversely between the first temperature sensor 2 and the second temperature sensor 4 from the main heat flow qs. With the compensation term 14, this heat flow qsa can be considered. As shown in FIG. 3, the error can be compensated which results in dependence upon the ambient temperature tamb present in an ambient U.",
        "In FIG. 3, on the one hand, the deviation tc—diff is shown which results in dependence upon the ambient temperature tamb as the difference of the core temperature Tc′, which is computed by means of the known temperature formula, and the actual core temperature. On the other hand, the deviation tc′—diff is shown which results as a difference of the value, which is determined by the expanded temperature formula Tc′, to the actual core temperature.",
        "The known temperature formula Tc exhibits a correct value in the example only at an ambient temperature tamb of 37° C. At a higher ambient temperature tamb there results too high a body temperature value Tc and, at a lower ambient temperature tamb, too low a body temperature value Tc is computed. By considering the compensation term 14, the temperature error, that is, the temperature difference tc′—diff, is always zero.",
        "According to a second embodiment of the invention, the boundary temperature tsa, which represents the temperature at the outer wall 7, can be determined in accordance with the boundary temperature formula:",
        "t\n      sa\n    \n    =\n    \n      \n        \n          α\n          ·\n          \n            T\n            \n              h\n              ⁢\n              \n                \n              \n              ⁢\n              2\n            \n          \n        \n        -\n        \n          \n            K\n            s\n          \n          ·\n          \n            (\n            \n              \n                T\n                \n                  h\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  1\n                \n              \n              -\n              \n                T\n                \n                  h\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  2\n                \n              \n            \n            )\n          \n        \n        +\n        \n          \n            K\n            iso\n          \n          ·\n          \n            (\n            \n              \n                \n                  T\n                  \n                    h\n                    ⁢\n                    \n                      \n                    \n                    ⁢\n                    1\n                  \n                \n                +\n                \n                  T\n                  \n                    h\n                    ⁢\n                    \n                      \n                    \n                    ⁢\n                    2\n                  \n                \n              \n              2\n            \n            )\n          \n        \n      \n      \n        α\n        +\n        \n          K\n          iso\n        \n      \n    \n  \n  ,\n\n\n\n\nwherein: α=thermal conductive constant of the outer wall of the sensor housing 1 to the ambient U. In this second embodiment, the temperature tsa is determined without the third temperature sensor 6.",
        "The boundary temperature tsa is essentially dependent upon the skin temperature Th1, which is measured by means of a first temperature sensor 2, and the temperature Th2 which is determined by means of the second temperature sensor 4. The boundary temperature results by setting thermal flow equations equal to each other in accordance with the ambient temperature tamb. The constant parameters (Ks, Kiso) are known from the temperature formula Tc′ and are geometry-dependent and/or material-dependent. In the equation, a dependency is present from the thermal transfer constant α in addition to the constant parameters (Ks, Kiso). For the thermal transfer constant α, a value range between 10 W/m2·1/K and 30 W/m2·1/K is assumed. It can be assumed that, as a rule, in the measurement, the thermal transfer constant α lies in this value range. Also, for an assumed large deviation of the thermal transfer constant α in this region, there results no significant error deviation as shown in FIG. 4. There, the difference temperature tc* —diff is plotted, which results as the difference between the core temperature Tc′ to the actual core temperature tc′—diff. The core temperature Tc′ is determined by computation of the temperature tsa in accordance with the boundary temperature formula. The temperature deviation lies in a region of 0.2° C.",
        "In accordance with the second embodiment of the invention, the computation of the body temperature Tc′ takes place in the evaluation unit 5 of the sensor housing 1. The skin temperature values Th1 and the temperature values Th2 function as input values which are determined by the temperature sensors 2 and 4.",
        "In accordance with an embodiment of the invention not shown, the body temperature Tc′ can be computed in accordance with the first and second embodiment of the invention also in a remote evaluation unit, for example, in the receiving unit.",
        "It is understood that the foregoing description is that of the preferred embodiments of the invention and that various changes and modifications may be made thereto without departing from the spirit and scope of the invention as defined in the appended claims."
    ],
    "citations": [
        "5200736",
        "5735604",
        "6547745",
        "6847913",
        "6889559",
        "6929611",
        "2002/0173730",
        "2002/0191937",
        "100 38 247",
        "2 131 175"
    ],
    "us_classification": "600547",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "61",
            "subclass": "B",
            "main_group": "5",
            "subgroup": "05"
        }
    ]
}