{
    "title": "Texture tool",
    "abstract": "A texture tool comprising a body to which is coupled an upper cap and a lower cap. A ball holder fits in a socket defined by the body and the lower cap. The ball holder includes a plurality of balls which come into contact with a sheet of material to be embossed or imprinted.",
    "inventors": [
        "McLean",
        "Schmidt",
        "Werner",
        "Wolf",
        "Cornell",
        "Broecker"
    ],
    "document_number": "07296513",
    "publication_date": "20071120",
    "assignees": [
        "Fiskars Brands, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A texture tool comprising:",
            "components": [
                {
                    "component": "a body;",
                    "subcomponents": []
                },
                {
                    "component": "a cap coupled to the body, the cap and the body defining a socket therein; and",
                    "subcomponents": []
                },
                {
                    "component": "a ball holder positioned at least partially within the socket and having a substantially spherical shape, the ball holder including a plurality of balls mounted therein, the plurality of balls being positioned substantially opposite the body and outside of the socket,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the ball holder and the socket act as a ball-and-socket mechanism.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The texture tool of claim 1 , wherein the ball holder includes the plurality of balls as being mounted within a plurality of depressions on a substantially flat surface of the ball holder.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The texture tool of claim 2 , wherein the plurality of balls comprises three balls that are securely mounted within the depressions of the ball holder.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The texture tool of claim 1 , wherein the body also includes a plurality of grip portions.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The texture tool of claim 1 , further comprising a plane that is free to float and spin in order to remain in engagement with another surface even when the orientation of the rest of the texture tool is altered.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The texture tool of claim 1 , wherein the ball holder has a substantially sufficient clearance to permit the ball holder to rotate, whereby individual balls of the plurality of balls are enabled to fall into texture plate depressions on a surface and spin with the ball holder about a substantially vertical axis as the texture tool moves across the surface.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A system for forming a texture on a material comprising: a texture tool including:",
            "components": [
                {
                    "component": "a body,",
                    "subcomponents": []
                },
                {
                    "component": "a cap coupled to the body,",
                    "subcomponents": []
                },
                {
                    "component": "a socket being formed within a portion of the body and the cap, and",
                    "subcomponents": []
                },
                {
                    "component": "a ball holder at least partially disposable within the socket and including plurality of balls mounted therein, the plurality of balls being positioned outside of the socket contacting the material,",
                    "subcomponents": []
                },
                {
                    "component": "wherein a surface of the ball holder including the plurality of balls are free to float and spin in order for the plurality of balls to remain in contact with the material when the orientation of the texture tool is altered.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The system of claim 7 , wherein the ball holder comprises a substantially spherical shape and a flat portion positioned substantially opposite the body.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The system of claim 8 , wherein the plurality of balls are mounted within a plurality of depressions on the flat surface of the ball holder.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The system of claim 9 , wherein the plurality of balls comprises three balls that are securely mounted within the depressions of the ball holder.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The system of claim 10 , wherein the at least one plane comprises a single plane is defined by the three balls, the single plane being free to float and spin.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The system of claim 9 , wherein the ball holder has a substantially sufficient clearance to permit the ball holder to rotate, whereby individual balls of the plurality of balls fall into depressions within the material and spin with the ball holder about a substantially vertical axis.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A system for forming a texture on a material comprising: a texture tool including:",
            "components": [
                {
                    "component": "a body,",
                    "subcomponents": []
                },
                {
                    "component": "a cap coupled to the body,",
                    "subcomponents": []
                },
                {
                    "component": "a socket being formed within a portion of the body and the cap,",
                    "subcomponents": []
                },
                {
                    "component": "a ball holder at least partially disposable within the socket and including a flat surface for engaging the material, the ball holder comprising a substantially spherical shape and a flat portion positioned substantially opposite the body; and",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of balls mounted within a plurality of depressions on the flat surface of the ball holder,",
                    "subcomponents": []
                },
                {
                    "component": "wherein at least one plane defined by the flat surface is free to float and spin in order to engage the material when the orientation of the texture tool is altered.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The system of claim 13 , wherein the plurality of balls comprises three balls that are securely mounted within the depressions of the ball holder.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The system of claim 14 , wherein the at least one plane comprises a single plane defined by the three balls.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The system of claim 13 , wherein the ball holder has a substantially sufficient clearance to permit the ball holder to rotate, whereby individual balls of the plurality of balls fall into depressions within the material and spin with the ball holder about a substantially vertical axis.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. A texture tool comprising:",
            "components": [
                {
                    "component": "a body having a lower portion;",
                    "subcomponents": []
                },
                {
                    "component": "a cap coupled to the body, the cap and the body defining a socket therein; and",
                    "subcomponents": []
                },
                {
                    "component": "a ball holder positioned at least partially within the socket and having a substantially spherical shape, the ball holder including a substantially flat portion positioned substantially opposite the body,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the ball holder and the socket act as a ball-and-socket mechanism, and wherein the ball holder has a substantially sufficient clearance to permit the ball holder to rotate, whereby individual balls of a plurality of balls are enabled to fall into texture plate depressions on a surface and spin with the ball holder about a substantially vertical axis as the texture tool moves across the surface.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The texture tool of claim 17 , wherein the body includes a plurality of grip portions on an outer surface thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. A texture tool comprising:",
            "components": [
                {
                    "component": "a body having a lower portion;",
                    "subcomponents": []
                },
                {
                    "component": "a cap coupled to the body, the cap and the body defining a socket therein; and",
                    "subcomponents": []
                },
                {
                    "component": "a ball holder positioned at least partially within the socket and having a substantially spherical shape, the ball holder including a substantially flat portion positioned substantially opposite the body,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the ball holder and the socket act as a ball-and-socket mechanism, and wherein the ball holder includes a plurality of balls that are mounted within a plurality of depressions on the substantially flat surface of the ball holder.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The texture tool of claim 19 , wherein the plurality of balls comprises three balls that are securely mounted within the depressions of the ball holder.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The texture tool of claim 19 , wherein the body includes a plurality of grip portions on an outer surface thereof.",
            "components": []
        }
    ],
    "description": [
        "The present application claims priority to U.S. Provisional Patent Application No. 60/541,421, field on Feb. 3, 2004 and incorporated by reference in its entirety.",
        "The present invention relates generally to a tool for use in arts and crafts. More particularly, the present invention relates to a tool for use in creating a textured surface on a sheet of material.",
        "In the arts and crafts field, it is often necessary and/or desirable to add a specific texture to a piece of material, be it cardstock, paper, vellum or other materials. One conventional system for adding a texture to a material involves placing a “texture plate” under the sheet of material to be manipulated, after which the user uses a stylus or similar hard object to press the material against the texture plate. This action causes the material to obtain a texture substantially identical to the texture that exists on the texture plate.",
        "Although moderately useful, the above prior art method and others for adding a texture to a sheet of material have several significant drawbacks. First, using a stylus or similar implement can be difficult to control, resulting in the user inadvertently adding texture to portions of the material that he or she did not intend. Second, if the user presses too hard with the stylus against the sheet of material, the material could be torn, scratched or otherwise defaced in an undesirable manner. Additionally, a stylus or similar implement often results in an uneven texture being applied to the material, due to different pressures being applied in different locations. Furthermore, if the texture-inducing implement does not fall squarely into an individual crevice or dimple, the embossed texture will not be of an extremely high quality, resulting in an inferior overall appearance to the embossment.",
        "It is therefore an object of the present invention to provide an improved texture-creating device that provides for a uniform and consistent embossment of the texture on a sheet of material.",
        "It is another object of the present invention to provide an improved texture-creating device that is simple to use.",
        "It is yet another object of the present invention to provide an improved texture-creating tool that reduces the risk of inadvertently tearing or damaging the material to be manipulated.",
        "It is still another object of the present invention to provide an improved texture-creating tool that gives the user an increased level of accuracy in the portions of the material that are to be manipulated.",
        "In accordance with the above objects, a texture tool according to the present invention comprises a body coupled to an upper cap and a lower cap. A ball holder rests in a socket defined by the inside of the body and the lower cap. The ball holder includes a plurality of balls that are mounted within depressions on the ball holder along a flat surface. When a user desires to add a texture to a material, the user simply moves the texture tool along the material such that the plurality of the balls rub against the material in the desired location, creating a consistent and uniform texture in the desired area.",
        "Further advantages and features of the present invention will be apparent from the following specification and drawings illustrating the preferred embodiments of the present invention.",
        "FIG. 1 is a perspective view of the texture tool constructed according to the principals of the present invention;",
        "FIG. 2 is a right side view of the texture tool of FIG. 1;",
        "FIG. 3 is a left side view of the texture tool of FIG. 1;",
        "FIG. 4 is a top plan view of the texture tool of FIG. 1;",
        "FIG. 5 is a bottom plan view of the texture tool of FIG. 1;",
        "FIG. 6 is a sectional side view of the texture tool of FIG. 1; and",
        "FIG. 7 is a perspective view of the texture tool while in use;",
        "FIG. 8 is a sectional side view of a texture tool constructed according to a second embodiment of the invention; and",
        "FIG. 9 is a sectional side view of a texture tool constructed according to a third embodiment of the invention.",
        "A texture tool constructed according to the principals of the present invention is shown generally at 20 in FIGS. 1-7. The texture tool 20 comprises a body 22 to which is coupled an upper cap 24 and a lower cap 26. The lower portion 23 of the body 22 and the lower cap 26 combine to form a socket 30 on the inside thereof, as is shown more clearly in FIG. 6. A ball holder 28 partially fits within the socket 30. The ball holder 28 includes a plurality of balls 34 that are mounted within a plurality of depressions 36 (see FIG. 6) on a flat surface 38 of the ball holder 28. In a preferred embodiment of the invention, there are three balls 34 that are securely mounted within the depressions 36 of the ball holder 28, for reasons more specifically explained herein. In one embodiment of the invention, the body 22 also includes a plurality of grip portions 40 by which a user can securely hold onto the texture tool 20.",
        "The ball holder 28 is free to rotate within the socket 30, essentially creating a ball-and-socket joint and allowing the individual balls 34 to catch edges and/or texture plate depressions 44 and remain in the texture plate depressions 44, improving the quality of the overall embossment. The ball holder 26 is substantially spherical except for the flat surface 38. The ball holder 28 has enough clearance to permit it to rotate, allowing a neutral hand position and allowing the individual balls 34 to fall into the texture plate depressions 44 and spin with the ball holder 28 about a substantially vertical axis.",
        "Alternatively and as shown in FIG. 8, a plurality of independent spring-loaded pins 46 could be located within the texture tool 20 and press against a flat, rotating surface 48 to accomplish the same effect. It is also possible to use other arrangements, such as a flat washer 50 with a dimple 52 in the center for accepting a stylus ball 54, as shown in FIG. 9, to create a spinning and rotating flat surface. All of these arrangements and others have the effect of creating a plane that is free to float and spin in order to remain in contact with another surface even when the orientation of the rest of the tool is altered.",
        "As is shown in FIG. 7, the texture tool 20 is used to create a texture on a sheet of material 32 that is placed on top of a texture plate 42. To create the texture, the user simply positions the texture tool 20 with the flat surface 38 towards the material 32, causing the balls 34 to come into contact with the material 30. The user then moves the texture tool 20 back and forth in the desired locations on the material 32, causing the balls 34 and the texture plate 42 to create an impression, or imprint, on the material 32. This is accomplished as the plurality of balls 34 press against, and partially into, individual texture plate depressions 44, which in turn causes the material 32 to be embossed or imprinted.",
        "As discussed earlier, a preferred embodiment of the invention, shown in FIG. 3, includes three balls 34 positioned within the ball holder 28. This is important because three points define a plane. Four or more points, however, can define multiple planes. Therefore, if there are four or more balls 34 on the flat surface 38, there would not be sufficient support for one or more of the balls 34. This would prevent the contact points of all of the individual balls 34 from falling partially into the texture plate depressions 44. For those ball contact points that do not fall into the texture plate depressions 44, there will be an inferior embossed texture. If there are less than three ball contact points, however, the user will have significantly less control over the entire texture tool 20, since two points do not define a plane at all. This can lead to the user inadvertently dragging a portion of the texture tool 20 across the material 32 that was not intended to be embossed or imprinted.",
        "According to one highly preferred embodiment of the invention, the balls 34 are polished steel embossing balls having a diameter of about 0.125 inches. The body 22, the upper cap 24, the lower cap 26, the ball holder 28 and the grip portions 40 can all be made of various plastic materials.",
        "While preferred embodiments of the invention have been shown and described, it will be clear to those skilled in the art, that potential modifications can be made to the embodiments described above. For example, each of the individual components of the texture tool 20 could be formed from a variety of acceptable materials. It will therefore be well understood by those in the art that modifications can be made to the above embodiments without departing from the invention in its broader aspects."
    ],
    "citations": [
        "806111",
        "3063364",
        "5042382",
        "5419247",
        "5511472",
        "6446549",
        "6520081",
        "2003/0118689",
        "24 44 505"
    ],
    "us_classification": "101  31",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "44",
            "subclass": "B",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}