{
    "title": "Space-saving mounting table for use with an equipment rack",
    "abstract": "Components can be received within regions of limited access present in an equipment-supporting rack using an installation table including a pair of mounting plates which are pivotally connected to each other at a corner of the respective mounting plates. One mounting plate includes a bracket for fixed connection to the rack, and the other mounting plate includes a surface for receiving a desired component. Rotation of the mounting plate receiving the component relative to the mounting plate fixed to the rack permits the component to be conveniently accessed when servicing is desired, and returned to the region of limited access during normal system operations. A channel is preferably provided to guide and limit movement of the mounting plate which receives the component, and a locking mechanism is preferably provided for securing the mounting plate and the component it receives in desired position during normal system operations.",
    "inventors": [
        "Yoon"
    ],
    "document_number": "07296523",
    "publication_date": "20071120",
    "assignees": [
        "Unisys Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A fixture for mounting a component to a rack for supporting a plurality of components, comprising:",
            "components": [
                {
                    "component": "a first plate having a surface for receiving the component; and",
                    "subcomponents": []
                },
                {
                    "component": "a second plate having a surface for attachment to the rack and cooperating with the first plate to form a combination of mounting plates;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the first plate is pivotally connected to the second plate so that, in a first position, the first plate is adjacent to and in substantial alignment with the second plate and, in a second position, the first plate is rotated to an orientation which laterally projects from the second plate; and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the first plate is pivotally connected to the second plate by a connection including a single pivot pin extending from one of the mounting plates engaging an aperture formed in another one of the mounting plates;",
                    "subcomponents": []
                },
                {
                    "component": "a bearing plate separating the first plate and the second plate, wherein the bearing plate is formed of a friction-reducing plastic material; and",
                    "subcomponents": []
                },
                {
                    "component": "a locking mechanism fixed to the second plate and having a retractable tip extending through the second plate and selectively engaging the first plate.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The fixture of claim 1 wherein the connection including the pin and the aperture is positioned at a corner of the mounting plates.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The fixture of claim 1 wherein the second position of the first plate is substantially normal to the first position of the first plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The fixture of claim 1 wherein the first plate and the second plate have a substantially rectangular shape.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The fixture of claim 1 wherein the first plate includes a follower depending from the surface of the first plate, and wherein the bearing plate includes a channel formed in the bearing plate for receiving the follower depending from the first plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The fixture of claim 5 wherein the channel has an arcuate shape.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The fixture of claim 5 which further includes a guide slidingly received in the channel and between the first plate and the second plate, for limiting rotation of the first plate relative to the second plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The fixture of claim 7 wherein the guide is formed of a friction-reducing plastic material.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The fixture of claim 7 wherein the guide further includes at least one tab laterally projecting from the guide and slidingly received in the channel, and wherein the channel includes at least one detent for receiving the tab projecting from the guide.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The fixture of claim 9 wherein the guide includes an opposing pair of tabs laterally projecting from the guide and slidingly received in the channel, and wherein the channel includes an opposing pair of detents for receiving the tabs projecting from the guide.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The fixture of claim 10 wherein the pair of tabs engage first ends of the detents when the first plate is in the first position, and wherein the pair of tabs engage second ends of the detents opposite to the first ends when the first plate is in the second position.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The fixture of claim 5 wherein the retractable tip extends through the second plate and into the channel of the bearing plate, for selectively engaging the follower of the first plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The fixture of claim 1 wherein the second plate further includes a first bracket depending from a first edge of the second plate, and wherein the first bracket includes an aperture for receiving hardware for attaching the second plate to the rack.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The fixture of claim 13 wherein the first bracket includes a corner piece extending from an edge of the first bracket, for engaging portions of the rack to support the second plate in position.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The fixture of claim 13 wherein the second plate further includes a second bracket depending from a second edge of the second plate adjacent to the first edge, and wherein the second bracket includes a surface for engaging portions of the rack for supporting the second plate in position.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The fixture of claim 1 wherein the locking mechanism is fixed to a lower surface of the second plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. A fixture for mounting a component to a rack for supporting a plurality of components, consisting essentially of:",
            "components": [
                {
                    "component": "a first plate associated with the fixture having a surface for receiving the component; and",
                    "subcomponents": []
                },
                {
                    "component": "a second plate associated with the fixture having a surface for attachment to the rack and cooperating with the first plate to form a combination of mounting plates;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the first plate is pivotally connected to the second plate by a connection including a single pivot pin extending from a corner of one of the mounting plates engaging an aperture formed in a corner of another one of the mounting plates so that, in a first position, the first plate is adjacent to and in substantial alignment with the second plate and, in a second position, the first plate is rotated to an orientation which laterally projects from the second plate; and",
                    "subcomponents": []
                },
                {
                    "component": "a locking mechanism fixed to the second plate and having a retractable tip extending through the second plate and selectively engaging the first plate.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The fixture of claim 17 wherein the second position of the first plate is substantially normal to the first position of the first plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The fixture of claim 17 wherein the locking mechanism is fixed to a lower surface of the second plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. A fixture in combination with a component and a rack for supporting a plurality of components, for mounting the component to the rack, wherein the rack is comprised of a plurality of supports which combine to define a region for receiving the plurality of components which includes first portions for freely accessing the components, and second portions defining an area of limited access which is at least partially blocked by the supports of the rack, and wherein the fixture comprises:",
            "components": [
                {
                    "component": "a first plate associated with the fixture having a surface which receives the component; and",
                    "subcomponents": []
                },
                {
                    "component": "a second plate associated with the fixture having a surface attached to the rack and cooperating with the first plate to form a combination of mounting plates;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the first plate is pivotally connected to the second plate by a connection including a pivot pin extending from a corner of one of the mounting plates engaging an aperture formed in a corner of another one of the mounting plates so that, in a first position, the first plate is located within the second portions of the region defined by the plurality of supports, adjacent to and in substantial alignment with the second plate and, in a second position, the first plate is rotated to an orientation which laterally projects from the second plate and which is located within the first portions of the region defined by the plurality of supports.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The fixture of claim 20 wherein the second position of the first plate is substantially normal to the first position of the first plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The fixture of claim 20 which further includes a bearing plate separating the first plate and the second plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The fixture of claim 22 wherein the first plate includes a follower depending from the surface of the first plate, and wherein the bearing plate includes a channel formed in the bearing plate for receiving the follower depending from the first plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The fixture of claim 23 wherein the channel has an arcuate shape.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The fixture of claim 23 which further includes a guide slidingly received in the channel and between the first plate and the second plate, for limiting rotation of the first plate relative to the second plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The fixture of claim 25 wherein the guide is formed of a friction-reducing plastic material.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The fixture of claim 25 wherein the guide further includes at least one tab laterally projecting from the guide and slidingly received in the channel, and wherein the channel includes at least one detent for receiving the tab projecting from the guide.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The fixture of claim 27 wherein the guide includes an opposing pair of tabs laterally projecting from the guide and slidingly received in the channel, and wherein the channel includes an opposing pair of detents for receiving the tabs projecting from the guide.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The fixture of claim 28 wherein the pair of tabs engage first ends of the detents when the first plate is in the first position, and wherein the pair of tabs engage second ends of the detents opposite to the first ends when the first plate is in the second position.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The fixture of claim 23 which further includes a locking mechanism fixed to the second plate and having a tip extending through the second plate and into the channel of the bearing plate, for selectively engaging the follower of the first plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The fixture of claim 20 wherein the second plate further includes a first bracket depending from a first edge of the second plate, and wherein the first bracket includes an aperture which receives hardware attaching the second plate to the rack so that the second plate is located within the second portions of the region defined by the plurality of supports.",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. The fixture of claim 31 wherein the first bracket includes a corner piece extending from an edge of the first bracket which engages portions of the rack to support the second plate in position within the second portions of the region defined by the plurality of supports.",
            "components": []
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. The fixture of claim 31 wherein the second plate further includes a second bracket depending from a second edge of the second plate adjacent to the first edge, and wherein the second bracket includes a surface which engages portions of the rack for supporting the second plate in position within the second portions of the region defined by the plurality of supports.",
            "components": []
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The fixture of claim 20 which further includes a locking mechanism fixed to the second plate and having retractable portions extending through the second plate and selectively engaging the first plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. The fixture of claim 34 wherein the locking mechanism is fixed to a lower surface of the second plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. The fixture of claim 20 wherein the supports include brackets forming a right angle, wherein the first plate and the second plate have a substantially rectangular shaper and wherein the first plate and the second plate are located within the second portions of the region defined by the plurality of supports when the first plate is in the first position.",
            "components": []
        },
        {
            "claim_number": "CLM-00037",
            "preamble": "37. The fixture of claim 20 wherein an end of the component is connected to the first plate of the fixture.",
            "components": []
        },
        {
            "claim_number": "CLM-00038",
            "preamble": "38. A fixture for mounting a component to a rack for supporting a plurality of components, consisting essentially of:",
            "components": [
                {
                    "component": "a first plate associated with the fixture having a surface for receiving the component; and",
                    "subcomponents": []
                },
                {
                    "component": "a second plate associated with the fixture having a surface for attachment to the rack and cooperating with the first plate to form a combination of mounting plates;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the first plate is pivotally connected to the second plate by a connection including a single pivot pin extending from a corner of one of the mounting plates engaging an aperture formed in a corner of another one of the mounting plates so that, in a first position, the first plate is adjacent to and in substantial alignment with the second plate and, in a second position, the first plate is rotated to an orientation which laterally projects from the second plate;",
                    "subcomponents": []
                },
                {
                    "component": "a bearing plate separating the first plate and the second plate; and",
                    "subcomponents": []
                },
                {
                    "component": "a locking mechanism fixed to the second plate and having a retractable tip extending through the second plate and selectively engaging the first plate.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00039",
            "preamble": "39. The fixture of claim 38 wherein the first plate includes a follower depending from the surface of the first plate, and wherein the bearing plate includes a channel formed in the bearing plate for receiving the follower depending from the first plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00040",
            "preamble": "40. The fixture of claim 39 wherein the channel has an arcuate shape.",
            "components": []
        },
        {
            "claim_number": "CLM-00041",
            "preamble": "41. The fixture of claim 39 which further includes a guide slidingly received in the channel and between the first plate and the second plate, for limiting rotation of the first plate relative to the second plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00042",
            "preamble": "42. The fixture of claim 41 wherein the guide is formed of a friction-reducing plastic material.",
            "components": []
        },
        {
            "claim_number": "CLM-00043",
            "preamble": "43. The fixture of claim 41 wherein the guide further includes at least one tab laterally projecting from the guide and slidingly received in the channel, and wherein the channel includes at least one detent for receiving the tab projecting from the guide.",
            "components": []
        },
        {
            "claim_number": "CLM-00044",
            "preamble": "44. The fixture of claim 43 wherein the guide includes an opposing pair of tabs laterally projecting from the guide and slidingly received in the channel, and wherein the channel includes an opposing pair of detents for receiving the tabs projecting from the guide.",
            "components": []
        },
        {
            "claim_number": "CLM-00045",
            "preamble": "45. The fixture of claim 44 wherein the pair of tabs engage first ends of the detents when the first plate is in the first position, and wherein the pair of tabs engage second ends of the detents opposite to the first ends when the first plate is in the second position.",
            "components": []
        },
        {
            "claim_number": "CLM-00046",
            "preamble": "46. The fixture of claim 39 which further includes the retractable tip extending through the second plate and into the channel of the bearing plate, to selectively engage the follower of the first plate.",
            "components": []
        }
    ],
    "description": [
        "This invention generally relates to racks and other types of chassis for receiving equipment, including but not limited to electronic equipment and the like, and more particularly, to a fixture for mounting such equipment in regions which are difficult to access.",
        "Support frames, generally referred to in the industry as “racks”, are conventionally used to receive desired electrical components such as circuit boards, modules or similar equipment and to support the received electrical components in desired position. Such racks can either be open, or enclosed to develop a housing (or cabinet) for receiving desired equipment.",
        "Racks of this general type are conventionally comprised of a series of framing elements which are combined to develop an enclosure for the equipment which is to be received in the resulting structure. To this end, a series of brackets is generally connected between a pair of support plates to develop an open enclosure for receiving desired equipment. The brackets are then provided with a series of holes for cooperating with equipment which is to be received in the resulting rack.",
        "In use, electrical equipment which is to be mounted in the rack is positioned between the opposing brackets and is attached to the brackets using conventional hardware. Electrical connections between electrical components mounted in the rack and support components for interfacing with the mounted electrical components (for example, power strips, hub switches, firewalls, etc.) are then established, generally to the rear of the rack.",
        "To facilitate servicing of the electrical equipment mounted in the rack, including any system supporting components, it is often required to access such equipment and the electrical interconnections associated with such equipment through the rear of the rack, between the rearward brackets which comprise the rack. To permit free access to such equipment from the rear of the rack, it is generally necessary for such equipment to be located in regions of the rack where access will not be hampered by any interfering structures. This generally requires support components such as power strips, hub switches and firewalls to occupy regions of the rack which could otherwise be used to receive primary electrical components such as circuit boards, modules or similar electrical components.",
        "Regions exist within the confines of the rack which could otherwise accept the relatively small support components which are used to interface with the remainder of the system, but for the need to be able to conveniently access such components. For example, power strips have at times been placed along the upper and/or lower regions of the rack, regions which are often used to house ducting and fans for ventilating the rack and the equipment mounted in the rack. Such placement avoids the need to position the power strips in regions of the rack which could otherwise be used to receive primary electrical components. However, placement of the power strips along the upper and/or lower regions of the rack has the corresponding disadvantage that significantly longer power cables are then required to connect the power strips with the electrical components which are to be supplied with power for operation. Moreover, some of the more recent racks which have been developed already make use of such space, in such cases preventing components from being positioned in such regions.",
        "It would also be possible for relatively small support components such as power strips, hub switches and firewalls to be located in regions of the rack which are blocked by the support brackets which form the rack, but for the need to have to access the support components which are located in such “blind” spots, which will hereinafter be referred to as areas of “limited access”. This would then free remaining space, which is otherwise freely accessible, to receive primary electrical components such as circuit boards, modules and the like.",
        "In accordance with the present invention, relatively small components can be received within regions of limited access using an installation table including a pair of mounting plates which are pivotally connected to each other at a corner of the respective mounting plates. One of the mounting plates includes a mounting bracket for fixed connection to a framing element of the rack, and the other mounting plate includes a surface for receiving a desired component. Rotation of the mounting plate receiving the desired component relative to the mounting plate fixed to the framing element permits the component to be conveniently accessed when servicing is desired, and returned to the region of limited access during normal operations of the system.",
        "A channel is preferably provided to guide and limit movement of the mounting plate which receives the component. A locking mechanism is preferably provided for securing the mounting plate and the component it receives in desired position during normal operations of the system.",
        "FIG. 1 is an isometric view of a preferred installation table of the present invention, in a closed position.",
        "FIG. 2 is an isometric view of the installation table of FIG. 1 in an open position.",
        "FIG. 3 is an isometric view of the installation table of FIG. 2 from the bottom.",
        "FIG. 4 is an isometric view of an upper mounting plate of the installation table, viewed from the bottom.",
        "FIG. 5 is an isometric view of a lower mounting plate of the installation table, viewed from the bottom.",
        "FIG. 6 is an isometric view of an intermediate plate for the installation table, showing a guide associated with the intermediate plate in a retracted position.",
        "FIG. 7 is an isometric view of the intermediate plate, showing the guide in an extended position.",
        "FIG. 8 is an isometric view of an installation table mounted to the support bracket of a rack, with the upper mounting plate in a retracted position.",
        "FIG. 9 is an isometric view of an installation table mounted to the support bracket of a rack, with the upper mounting plate in an extended position.",
        "FIGS. 1 to 3 show a preferred embodiment of the installation table 1 of the present invention. In FIG. 1, the installation table 1 is shown in a closed, or retracted position. FIGS. 2 and 3 show the installation table 1 in an open, or deployed position. The installation table 1 is generally comprised of a pair of mounting plates 2, 3 which are separated by an intermediate, bearing plate 4.",
        "The upper mounting plate 2 includes a surface 5 for receiving desired components as will be described more fully below. In the configuration illustrated, the surface 5 is planar, with an overall rectangular shape, and one or more apertures 6 are provided in the surface 5 of the mounting plate 2 for securely receiving a component. Referring to FIG. 4, the underside 7 of the mounting plate 2 includes a pin 8 located in a corner 9 of the mounting plate 2, and a follower 10 on a side of the mounting plate 2 which opposes the pin 8.",
        "Referring to FIG. 5, the lower mounting plate 3 includes a surface 11 having a pair of apertures 12, 13, and a pair of flanges 14, 15 for use in mounting and support of the installation table 1 as will be described more fully below.",
        "In the configuration illustrated, the surface 11 is planar, with an overall rectangular shape, and preferably corresponds in shape to the overall configuration of the mounting plate 2. The surface 11 of the mounting plate 3, and the cooperating surface 5 of the mounting plate 2, are preferably planar in configuration to effectively mate with any of a variety of components. The surface 5 and/or the surface 11 can also have non-planar configurations, and additional openings (not shown) can also be provided, to facilitate the mating of components having irregular shapes with the installation table 1. The configuration of the surface 5 will ordinarily complement the configuration of the surface 11, although the use of surfaces 5, 11 having different configurations is equally possible if appropriate to receive a desired component.",
        "The aperture 12 is located, and is sized to slidingly receive the pin 8 associated with the upper mounting plate 2. In this way, the upper mounting plate 2 and the lower mounting plate 3 are pivotally connected to each other at the corner 9 of the respective mounting plates 2, 3. Pivotal connection at the corner 9 is preferred to develop a clockwise rotation of the upper mounting plate 2 relative to the lower mounting plate 3 as the mounting plate 2 is deployed. A pivotal connection at the opposing corner 16 is preferred to develop a counter-clockwise rotation of the upper mounting plate 2 relative to the lower mounting plate 3 as the mounting plate 2 is deployed. Other placements for the resulting pivot point are also possible, if desired for a particular application.",
        "The aperture 13 is provided to receive and cooperate with a locking mechanism 17, which is shown in FIG. 3. The locking mechanism 17 is itself known, and generally includes an outer barrel 18 and an inner plunger 19 separated by a spring 20. The outer barrel 18 is fixed to the surface 11 of the lower mounting plate 3 so that the plunger 19 extends through the aperture 13. Retraction of the plunger 19, for example, by grasping the cap 21 of the plunger 19, causes the tip 22 of the plunger 19 (see FIG. 2) to withdraw from the aperture 13 against the forces developed by the spring 20, establishing a position for releasing the upper mounting plate 2 for rotation as will be described more fully below. Release of the cap 21 of the plunger 19 permits the tip 22 to resume its passive position, once again extending through the aperture 13, and establishing a position for locking the upper mounting plate 2 in a closed position, as will be described more fully below.",
        "The flange 14 depends from an edge 23 of the lower mounting plate 3, and includes an aperture 24 for receiving conventional hardware for mounting the installation table 1 to a rack as will be described more fully below. A corner 25 preferably extends from an end 26 of the flange 14 to assist in stabilizing the installation table 1 against the rack which is to receive it, by preventing longitudinal rotation of the installation table 1 relative to the support structure which receives the installation table 1.",
        "The flange 15 depends from an edge 27 of the lower mounting plate 3, which is preferably adjacent to the edge 26 which receives the flange 14, to provide vertical support for the installation table 1 and the component which is to be mounted using the installation table 1. The shape and configuration of the flanges 13, 14 can be freely varied, as needed, to suit a particular rack configuration or to effectively receive and support a desired component.",
        "The upper mounting plate 2 and the lower mounting plate 3 can be directly combined to yield an effective structure for receiving components and for mounting the received components in a rack. It would also be possible to lubricate the interface between such components, to provide enhanced operation, or to separate such components with a friction-reducing (for example, a friction-reducing plastic) layer, if desired. In a particularly preferred embodiment, the intermediate, bearing plate 4 is positioned between the upper mounting plate 2 and the lower mounting plate 3 to enhance operations of the installation table 1.",
        "Referring to FIG. 6 (and FIG. 2), the surface 30 of the bearing plate 4 is similar in configuration to the surface 5 of the upper mounting plate 2 and the surface 11 of the lower mounting plate 3. To this end, the surface 30 is preferably planar, with an overall rectangular shape. As with the upper mounting plate 2 and the lower mounting plate 3, the configuration of the surface 30 of the bearing plate 4 can freely be varied to suit a particular application, as desired.",
        "The bearing plate 4 includes an aperture 31 and a channel 32. The aperture 31 is sized and positioned to cooperate with the pin 8 of the upper mounting plate 2 so that, following assembly, the aperture 31 is in general alignment with the pin 8 of the upper mounting plate 2 and the receiving aperture 12 of the lower mounting plate 3. The channel 32 preferably receives a guide 33 which operates to facilitate rotation of the upper mounting plate 2 relative to the lower mounting plate 3.",
        "The guide 33 and the channel 32 are complementary and are both generally arc-shaped in overall configuration.",
        "Central regions 34 of the guide 33 are open, and following assembly of the installation table 1, slidingly receive the follower 10 depending from the upper mounting plate 2 for movement along an arcuate path which is defined by the central regions 34. The guide 33 is in turn slidingly received within the channel 32, for movement along an arcuate path which is defined by the channel 32. A pair of tabs 35, 36 project from opposing sides of the guide 33, and are received in a corresponding pair of detents 37, 38 formed in the bearing plate 4. As is best shown in FIGS. 6 and 7, the tab 35 associated with the detent 37 is preferably smaller than the tab 36 associated with the detent 38 so that the tabs 35, 36 simultaneously contact the ends of the detents 37, 38 when the guide 33 assumes either its fully extended (FIG. 7) or fully retracted (FIG. 6) position.",
        "The plates 2, 3, 4 and the guide 33 can be formed of any of a variety of materials. Plates 2, 3, 4 formed of metal are preferred, although plastic materials could also be used, if desired. The guide is preferably formed of a plastic material, to facilitate movement of the upper plate 2 relative to the lower plate 3, although the guide 33 could also be formed of a metal if desired. A particularly useful material for forming the guide 33 is a friction-reducing plastic material, such as “Celcon GC-25A”, a glass-filled acetal copolymer which is available from the Celanese Corporation of America.",
        "FIGS. 8 and 9 show an installation table 1 mounted to the support 40 of a rack for receiving desired components (not shown). The support 40 has the usual shape of an angle-bracket, and includes a series of apertures 41 for receiving conventional hardware (for example, screws, bolts, or other threaded, or other types of fasteners) in conventional fashion. In accordance with the present inventions the installation table 1 is positioned on an inside corner of the support 40, with the flange 14 facing the rear of the support 40. When in its desired position, and at its desired height, the aperture 24 in the flange 14 of the installation table 1 is aligned with one of the apertures 41 in the support 40, and desired hardware (not shown) is inserted through the apertures 24, 41 to fix the installation table 1 to the support 40. This brings the corner 25 of the flange 14, and the flange 15, into engagement with the support 40, providing structural and weight-bearing support for the installation table 1 and a component 42 (shown in phantom) received by the installation table 1. An end of the component 42 is conveniently fixed to the upper mounting plate 2 using, for example, conventional hardware engaging the apertures 6 formed in the surface 5 of the mounting plate 2.",
        "To be noted is that the preferred rectangular shape for the plates 2, 3, 4 causes such structures to follow the contour of the adjacent support 40, maximizing the support surfaces which are available for receiving a desired component. Also to be noted is that the pin 8 will then be located on the side of the installation table 1 about which the upper mounting plate 2 is to rotate, leaving the upper mounting plate 2 free to rotate relative to the lower mounting plate 3. It will be understood that a mirror-image placement of such structures would be established for an installation table which is to be affixed to a support (not shown) positioned on an opposing side of the rack.",
        "Let it now be assumed that a servicing procedure is called for which requires the component 42 mounted to the installation table 1 to be accessed. Because such servicing would ordinarily take place from the rear of the rack (from the position 43 shown in FIGS. 8 and 9), the support 40 would then prevent the component 42 from being conveniently accessed. The installation table 1 allows the component 42 to be withdrawn from the region of limited access 44 which receives the component 42 to permit convenient servicing of the component 42.",
        "To accomplish this, and additionally referring to FIGS. 6 and 7, the cap 21 of the plunger 19 of the locking mechanism 17, if used, is grasped and pulled down. This operates to release the tip 22 of the plunger 19, shown in FIG. 6. The component 42, or the upper mounting plate 2, is grasped and rotated outwardly about the pivoting pin 8 to assume a deployed position which is preferably normal to the lower mounting plate 3, as shown in FIG. 9. In the fully deployed position, the guide 33 will be in its fully extended position and the follower 10 will lie at the outer end 45 of the central regions 34 of the guide 33, as shown in FIG. 7. In this way, outward movement of the component 42 will be limited by interaction between the guide 33, the channel 32 of the bearing plate 4 and the follower 10 of the upper mounting plate 2. Convenient servicing of the component 42 can then proceed, as desired, with the component 42 (and the upper mounting plate 2) in an orientation which laterally projects from the region 44.",
        "Following desired servicing of the component 42, the component 42 is conveniently pushed back along the path defined by the guide 33. Initially, this will bring the follower 10 in contact with the end 46 of the guide 33, in turn pushing the guide 33 into the channel 32. The guide 33 will eventually come to a fully retracted position, with the follower 10 lying against the end 46 of the central regions 34 of the guide 33 and with the guide 33 fully retracted into the channel 32, as shown in FIG. 6. In this way, the component 42 will be returned to the region 44, which could not otherwise be accessed because of the blocking support 40, and which could not otherwise be used to receive a component requiring any servicing. If a locking mechanism 17 is employed, the cap 21 of the plunger 19 would be grasped and retracted as the follower 10 moves to the end 46 of the guide 33, serving to lock the upper mounting plate 2, and the component 42, in the retracted position.",
        "It will be understood that various changes in the details, materials and arrangement of parts which have been herein described and illustrated in order to explain the nature of this invention may be made by those skilled in the art within the principle and scope of the invention as expressed in the following claims."
    ],
    "citations": [
        "379232",
        "771877",
        "908394",
        "910189",
        "1197420",
        "1336433",
        "1494112",
        "1659572",
        "1661113",
        "1730154",
        "1742904",
        "1775877",
        "1898562",
        "1935246",
        "2023826",
        "2182546",
        "2270914",
        "2293496",
        "2315862",
        "2332291",
        "2396242",
        "2605153",
        "2614861",
        "2617473",
        "2650871",
        "2680314",
        "2727156",
        "2768043",
        "2851321",
        "2935287",
        "2937839",
        "3192306",
        "3604669",
        "3650577",
        "4564167",
        "4697778",
        "4893747",
        "5069408",
        "5079789",
        "5080322",
        "5337682",
        "5400958",
        "5425313",
        "5460105",
        "5553351",
        "5586665",
        "5671653",
        "5692815",
        "5704100",
        "5711053",
        "5887962",
        "6044984",
        "6045098",
        "6056378",
        "6076846",
        "6079081",
        "6086033",
        "6123203",
        "6158360",
        "6206495",
        "6354550",
        "6435462",
        "6484987",
        "6523223",
        "6568772",
        "6615744",
        "6701575",
        "6709184",
        "6823805",
        "2003/0042830",
        "2004/0034969",
        "3742813",
        "10153382"
    ],
    "us_classification": "108103",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "47",
            "subclass": "B",
            "main_group": "11",
            "subgroup": "00"
        }
    ]
}