{
    "title": "Additives for inhibiting the formation of gas hydrates",
    "abstract": "The invention relates to the use of polymers which contain between 1 and 99 mol-% structural units of formula 1,",
    "inventors": [
        "Dahlmann",
        "Feustel",
        "Kayser",
        "Morschhaeuser"
    ],
    "document_number": "07297823",
    "publication_date": "20071120",
    "assignees": [
        "Clariant Produkte (Deutschland) GmbH"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for inhibiting hydrate formation in a wet hydrocarbon gas stream comprising an aqueous phase, said method comprising adding to the gas from 0.01 to 2% by weight, based on the aqueous phase, an additive comprising a copolymer having from 1 to 100 mol % of bivalent structural units of the formula",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein the copolymer comprises",
            "components": [
                {
                    "component": "A) from 1 to 99 mol % of structural units of the formula (1) and",
                    "subcomponents": []
                },
                {
                    "component": "B) from 1 to 99 mol % of bivalent structural units of the formula (2)",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 2 , wherein said structural units of formula 2 are derived from a compound selected from the group consisting of N-vinylacetamide, N-methyl-N-vinylacetamide, vinylpyrrolidone, vinylcaprolactam, and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 2 wherein said copolymer comprises",
            "components": [
                {
                    "component": "A) from 1 to 99 mol % of structural units of the formula (1),",
                    "subcomponents": []
                },
                {
                    "component": "B) from 1 to 99 mol % of structural units of the formula (2) and",
                    "subcomponents": []
                },
                {
                    "component": "C) from 1 to 99 mol % of bivalent structural units of the formula (3)",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 4 , wherein the sum of structural units A), B) or C) is from 20 to 80 mol %.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 4 , wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 4 , wherein the structural units of the formula 3 are derived from a compound selected from the group consisting of acrylic acid, acrylamide, N-alkylacrylamides, N,N-dialkylacrylamides, 2-dimethylaminomethacrylate, N-acryloylpyrrolidine, N-acryloylmorpholine, N-acryloylpiperidine, and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , wherein the molecular weight of the copolymer is in the range from 1000 to 10",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 1 , wherein the wet hydrocarbon gas stream comprises water and natural gas components.",
            "components": []
        }
    ],
    "description": [
        "The present invention relates to an additive and a process for inhibiting nucleation, growth and/or agglomeration of gas hydrates by adding an effective amount of an inhibitor which contains comb polymers of alkylpolyoxyalkylene acrylates to a multiphase mixture tending to form gas hydrates and comprising water, gas and optionally condensate or to a drilling fluid tending to form gas hydrates.",
        "Gas hydrates are crystalline inclusion compounds of gas molecules in water, which form under certain temperature and pressure conditions (low temperature and high pressure). Under said conditions, the water molecules form cage structures around the corresponding gas molecules. The framework formed from the water molecules is thermodynamically unstable and is stabilized only by the incorporation of guest molecules. Depending on pressure and gas composition, these ice-like compounds can also exist at above the freezing point of water (up to more than 25° C.).",
        "In particular, the gas hydrates are of considerable importance in the mineral oil and natural gas industry, said gas hydrates forming from water and the natural gas components methane, ethane, propane, isobutane, n-butane, nitrogen, carbon dioxide and hydrogen sulfide. Particularly in present day natural gas production, the existence of these gas hydrates constitutes a major problem, particularly when wet gas or multiphase mixtures comprising water, gas and alkane mixtures are exposed to low temperatures under high pressure. Here, owing to its insolubility and crystalline structure, the formation of the gas hydrate leads to the blocking of various transport means, such as pipelines, valves or production means in which wet gas or multiphase mixtures are transported over relatively long distances at low temperatures, as occurs especially in colder regions of the earth or at the bottom of the sea. In addition, the formation of gas hydrates can also lead to problems in the drilling process for the development of new gas and mineral oil deposits under corresponding pressure and temperature conditions by forming gas hydrates in the drilling fluids.",
        "In order to avoid such problems, the formation of gas hydrates in gas pipelines, during the transport of multiphase mixtures or in drilling fluids can be suppressed by using relatively large amounts (more than 10% by weight based on the weight of the aqueous phase) of lower alcohols, such as methanol, glycol or diethylene glycol. The addition of these additives shifts the thermodynamic limit of the formation of gas hydrates to lower temperatures and higher pressures (thermodynamic inhibition). However, the addition of these thermodynamic inhibitors gives rise to relatively major safety problems (flashpoint and toxicity of the alcohols), logistical problems (large storage tanks, recycling of these solvents) and accordingly high costs, especially in offshore production.",
        "Attempts are therefore now being made to replace thermodynamic inhibitors by adding, in temperature and pressure ranges in which gas hydrates can form, additives in amounts of up to 2% by weight which either delay the formation of gas hydrates (kinetic inhibitors) or keep the gas hydrate agglomerates small and therefore pumpable so that they can be transported through the pipeline (i.e. agglomerate inhibitors or antiagglomerates). The inhibitors used thereby either prevent the nucleation and/or the growth of the gas hydrate particles or modify the hydrate growth so that smaller hydrate particles result.",
        "In addition to the known thermodynamic inhibitors, a large number of monomeric and polymeric classes of substances which act as kinetic inhibitors or agglomerate inhibitors are described as gas hydrate inhibitors in the patent literature. Of particular importance here are polymers having a carbon backbone which contain both cyclic (pyrrolidone or caprolactam radicals) and acyclic amide structures in the side groups.",
        "Thus, WO-94/12761 describes a process for the kinetic inhibition of the formation of gas hydrates by the use of polyvinyllactams having a polymer weight of MW of >40 000 D, and WO-93/25798 describes such a process using polymers and/or copolymers of vinylpyrrolidone having a polymer weight MW of from >5 000 to 40 000 D.",
        "EP-A-0 896 123 discloses gas hydrate inhibitors which may contain copolymers of alkoxylated (meth)acrylic acid without an alkyl endcap and cyclic N-vinyl compounds.",
        "The additives described have only limited efficiency as kinetic gas hydrate inhibitors and/or antiagglomerates or are not available in a sufficient amount or available only at high prices.",
        "In order to be able to use gas hydrate inhibitors also with greater supercooling than is possible at present, i.e. further within the hydrate region, a further increase in activity compared with the hydrate inhibitors of the prior art is required. In addition, products improved with respect to their biodegradability and toxicity are desired.",
        "It was therefore an object of the present invention to provide improved additives which both slow down the formation of gas hydrates (kinetic inhibitors) and keep gas hydrate agglomerates small and pumpable (antiagglomerates), in order thus to ensure a wide range of applications with a high action potential. Furthermore, the thermodynamic inhibitors currently used (methanol and glycols), which give rise to considerable safety problems and logistical problems, are to be replaced by novel additives.",
        "As has now surprisingly been found, both water-soluble and oil-soluble comb polymers which are based on alkoxyalkyl-substituted (meth)acrylic acid are suitable as gas hydrate inhibitors. Depending on the structure, the products can both delay the nucleation and growth of hydrates (kinetic gas hydrate inhibitors) and suppress the agglomeration of gas hydrates (agglomerate inhibitors).",
        "The invention therefore relates to the use of polymers comprising from 1 to 100 mol % of structural units of the formula",
        "in which\n\n    R1 is hydrogen or C1-C6-alkyl,\n    R2 is C1-C24-alkyl, C2-C24-alkenyl or a C6-C18-aryl radical which may be substituted by a C1-C12-alkyl group,\n    A are identical or different C2-C4-alkylene radicals and\n    x is an integer from 2 to 40,\n\nin amounts of from 0.01 to 2% by weight, based on the aqueous phase, as gas hydrate inhibitors.",
        "In addition to the structural units of the formula 1, the polymers according to the invention, unless they consist of 100 mol % of structural units of the formula 1, may contain further structural units. These structural units are those which are derived from olefinically unsaturated monomers which contain O, N, S or P. The polymers preferably contain oxygen-, sulfur- or nitrogen-containing comonomers, in particular oxygen- or nitrogen-containing comonomers.",
        "Suitable monomers which are copolymerizable with structural units of formula 1 are to mention, inter alia, styrenesulfonic acid, acrylamidopropyl-methylenesulfonic acid (AMPS), vinylsulfonic acid, vinylphosphonic acid, allylsulfonic acid, methallylsulfonic acid, acrylic acid, methacrylic acid and maleic acid (and the anhydrides thereof) and the salts of the abovementioned acids with monovalent and divalent opposite ions. Preferably used opposite ions are lithium, sodium, potassium, magnesium, calcium, ammonium, monoalkylammonium, dialkylammonium, trialkylammonium or tetraalkylammonium, in which the alkyl substituents of the ammonium ions, independently of one another, are C1- to C22-alkyl radicals which may be occupied by from 0 to 3 hydroxyalkyl groups whose alkyl chain length may vary in a range from C2 to C10. In addition, mono- to triethoxylated ammonium compounds having different degrees of ethoxylation can also be used. Sodium and ammonia are particularly preferably used as opposite ions. The degree of neutralization of the mole fraction of the acids described above may also differ from 100%. All degrees of neutralization from 0 to 100% are suitable, the range from 70 to 100% being particularly preferred.",
        "Further suitable monomers are esters of acrylic or of methacrylic acid with aliphatic, aromatic or cycloaliphatic alcohols having a number of carbon atoms from C1 to C22. Further suitable monomers are 2- and 4-vinylpyridine, vinyl acetate, glycidyl methacrylate, acrylonitrile, vinyl chloride, vinylidene chloride, tetrafluoroethylene and DADMAC.",
        "The polymers containing structural units of the formula (1) are obtainable by polymerization of alkoxyalkylated (meth)acrylic acid. The latter are obtainable from corresponding polyoxyalkylene glycols by transesterification with appropriately unsaturated carboxylic esters, such as acrylic or methacrylic esters.",
        "Examples of parent products of suitable polyoxyalkylene glycols are compounds having molecular weights of 100 to 1000 g/mol, ethylene oxide/propylene oxide copolymers (block or random copolymers), methylpolyglycols, butylpolyglycols, isobutylpolyglycols and also glycol ethers based on octanol, 2-ethylhexanol, decanol, isodecanol, dodecanol, tetradecanol, hexadecanol, octadecanol, oleyl alcohol and synthetic or natural fatty alcohol cuts. Glycol ethers based on alkylphenols having C1-C12-alkyl substituents are likewise suitable.",
        "In a preferred embodiment of the invention, R1 is hydrogen or methyl.",
        "A is a C2-C4-alkylene group or different C2-C4-alkylene groups. This means that the structural units of the formula 1 may be alkoxylated with up to 40 C2-C4-alkoxy units, it being possible for this to be either pure ethoxylation, propoxylation or butoxylation, or a mixed alkoxylation. A is preferably an ethylene or propylene group, in particular an ethylene group. In the case of mixed alkoxylation, a ratio of ethoxy to propoxy groups of from 5:35 to 35:5 is preferred.",
        "The polymers to be used according to the invention preferably contain from 5 to 95, in particular from 20 to 80, mol % of structural units of the formula (1).",
        "Depending on the structure of the structural units of formula (1), the properties of the polymer can be modified in such a way that, according to the existing conditions, they can be used in a targeted manner as specific additives for inhibiting the formation of gas hydrates.",
        "In the case of a short alkyl radical R2 (about C1-C8) or in the case of a high ethylene oxide content, water-soluble products are obtained which can suppress the nucleation of the hydrates and can act as kinetic inhibitors or can enhance the action of other kinetic inhibitors as synergistic components, as shown in the attached examples. Water-soluble is understood here as meaning those substances of which at least 5 g are dissolved in 1 l of water to give a clear solution.",
        "In the case of a longer alkyl radical R2 (about C8-C24) or in the case of lower contents of ethylene oxide or with the use of propylene oxide or butylene oxide, comb polymers which are more hydrophobic/lipophilic, have limited oil solubility and a surfactant character and wet the surface of gas hydrate particles with oil and hence prevent the agglomeration of the hydrates are obtained. They thus act as agglomerate inhibitors. The agglomerate inhibitors are in general at least partly soluble in the condensate phase of the multiphase mixture. Here, limited oil solubility is understood as meaning substances of which at least 1 g is soluble in 1 l of solvent naphtha to give a clear solution.",
        "In a preferred embodiment of the invention, copolymers which contain\n\n    A) from 1 to 99 mol % of structural units of the formula (1) and\n    B) from 1 to 99 mol % of structural units of the formula (2)",
        "in which R3 and R4, independently of one another, are hydrogen or C1-C6-alkyl, or form a ring of 5, 6 or 7 ring atoms with inclusion of the nitrogen atom and of the carbonyl group, are used.",
        "Inter alia, N-vinylformamide (NVF), N-vinylmethylformamide, N-vinylmethyl-acetamide (VIMA), N-vinylacetamide, N-vinylpyrrolidone (NVP) and N-vinylcaprolactam may be mentioned as examples. In a preferred embodiment of the invention, the structural units of the formula 2 are derived from N-vinylacetamide, N-methyl-N-vinylacetamide, vinyl-pyrrolidone and vinylcaprolactam.",
        "In a further preferred embodiment of the invention, copolymers which are derived from\n\n    A) from 1 to 99 mol % of structural units of the formula (1),\n    B) from 1 to 99 mol % of structural units of the formula (2) and\n    C) from 1 to 99 mol % of bivalent structural units of the formula (3)",
        "in which R5 and R6, independently of one another, are hydrogen, C1-C6-alkyl or C1-C6-cycloalkyl, or form a ring having 5, 6 or 7 ring atoms with inclusion of the nitrogen atom, and in which the structural units A), B) and C) sum to 100 mol %, are used.",
        "The preferred amounts of structural units A), B) or C) are from 5 to 95, in particular from 20 to 80, mol % for all embodiments.",
        "R3/R4 and R5/R6 together preferably contain in each case at least 1 carbon atom, in particular at least 2 carbon atoms.",
        "The structural units of the formula 3 are preferably derived from acrylic acid, acrylamide, N-alkylacrylamides, N,N-dialkylacrylamides, 2-dimethyl-aminomethacrylate, N-acryloylpyrrolidine, N-acryloylmorpholine and N-acryloylpiperidine.",
        "The preparation of the polymers to be used according to the invention is effected by free radical polymerization of the monomers using a suitable free radical initiator at temperatures of from 50 to 150° C. The molecular weight of these comb polymers may be in the range from 1000 to 106 g/mol, but molecular weights of from 1000 to 40 000 g/mol are preferred.",
        "Water-soluble monoalcohols, such as, for example, propanols, butanols and oxyethylated monoalcohols, such as butylglycol, isobutylglycol and butyldiglycol, are suitable as the alcoholic solvent. In general, clear solutions form after the polymerization.",
        "The polymers can be used alone or in combination with other known gas hydrate inhibitors. In general, the gas hydrate inhibitor according to the invention is added to the system tending to hydrate formation in an amount such that sufficient inhibition is obtained under the existing pressure and temperature conditions. The gas hydrate inhibitors according to the invention are generally used in amounts of from 0.01 to 2% by weight (based on the weight of the aqueous phase), corresponding to 100-20 000 ppm, preferably from 0.02 to 1% by weight. If the gas hydrate inhibitors according to the invention are used as a mixture with other gas hydrate inhibitors, the concentration of the mixture is from 0.01 to 2 or from 0.02 to 1% by weight in the aqueous phase.",
        "A stirred steel autoclave having temperature control, pressure transducer and torque pickup and having an internal volume of 450 ml was used for investigating the inhibiting effect of the polymers. For investigations into the kinetic inhibition, the autoclave was filled with distilled water and gas in the volume ratio 20:80, while condensate was also added for investigations of the agglomerate inhibition. Finally, natural gas of 90 bar was forced in.",
        "Starting from an initial temperature of 17.5° C., cooling was effected to 2° C. in the course of 2 h, stirring was then effected for 18 h at 2° C. and heating back to 17.5° C. was effected in the course of 2 h. First, a pressure decrease according to the thermal compression of the gas is observed. If the formation of gas hydrate nuclei occurs during the supercooling time, the measured pressure decreases, an increase in the measured torque and a slight increase in the temperature being observable. Further growth and increasing agglomeration of the hydrate nuclei in the absence of inhibitor rapidly leads to a further increase in the torque. When the mixture is warmed up, the gas hydrates decompose so that the initial state of the experimental series is reached.",
        "The time from reaching the minimum temperature of 2° C. to the initial gas absorption (Tind) or the time to the increase in the torque (Tagg) is used as a measure of the inhibiting effect of the polymer. Long induction times or agglomeration times indicate a kinetic inhibitor effect. On the other hand, the torque measured in the autoclave serves as a quantity for the agglomeration of the hydrate crystals. In the case of a good antiagglomerate, the torque which builds up after formation of gas hydrates is substantially reduced compared with the blank value. Ideally, snow-like, fine hydrate crystals form in the condensate phase and do not agglomerate and hence do not lead to blockage of the installations serving for gas transport and for gas production.",
        "Synthesis of the Polymers",
        "5.0 g of methacrylic acid-(EO)5-oleyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 45 g (0.32 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "10.0 g of methacrylic acid-(EO)5-oleyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 40 g (0.29 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "25.0 g of methacrylic acid-(EO)5-oleyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 25 g (0.18 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "5.0 g of methacrylic acid-(EO)8-oleyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 45 g (0.29 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "25.0 g of methacrylic acid-(EO)8-oleyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 25 g (0.18 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "5.0 g of methacrylic acid-(EO)3-butyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 45 g (0.29 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "25.0 g of methacrylic acid-(EO)3-butyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 25 g (0.18 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "45.0 g of methacrylic acid-(EO)3-butyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 5 g (0.04 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "25.0 g of methacrylic acid-(EO)5-butyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 25 g (0.18 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "25.0 g of methacrylic acid-(EO)5-methyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 25 g (0.18 mol) of vinylcaprolactam and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "25.0 g of methacrylic acid-(EO)5-butyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 25 g (0.23 mol) of vinylpyrrolidone and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "25.0 g of methacrylic acid-(EO)5-methyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 25 g (0.23 mol) of vinylpyrrolidone and in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "25.0 g of methacrylic acid-(EO)5-methyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 10.0 g (0.10 mol) of N-vinyl-N-methylacetamide and 15 g (0.13 mol) of dimethylaminomethacrylamide in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "25.0 g of methacrylic acid-(EO)5-methyl ester and 1.0 g of dilauryl peroxide as a free radical initiator in 75 g of butylglycol were initially introduced into a 250 ml four-necked flask and heated to 150° C. while flushing with nitrogen. An N2-flushed solution of 10.0 g (0.07 mol) of N-vinylcaprolactam and 15 g (0.13 mol) of dimethylmethacrylamide in 25 g of butylglycol was added dropwise over 1.5 hours. After the addition, the reaction solution was heated for a further 30 min, a further 0.5 g of initiator was then added and stirring was effected for a further 2 hours at 150° C.",
        "Test Results",
        "Composition of the natural gas used:\n\n    Methane 87.6%, ethane 1.26%, propane 0.08%, butane 0.02%, carbon dioxide 0.35%, nitrogen 10.61%.\n    Supercooling below the equilibrium temperature of hydrate formation at 65 bar: 7° C., supercooling at 90 bar, 8.5° C.",
        "The comparative substance used was a solution of polyvinylcaprolactam in butylglycol, molecular weight 5000 g/mol.",
        "Polymer\n\nPressure p\n\n\n\n\nexample\nDose ppm\n(bar)\nTind (h)\nTagg (h)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBlank value\n—\n65\n0\n0\n\n\nBlank value\n—\n90\n0\n0\n\n\n 1\n5000\n90\n6.5\n7.0\n\n\n 2\n5000\n90\n6.4\n7.8\n\n\n 4\n5000\n90\n4.6\n4.6\n\n\n 6\n5000\n90\n12.6\n12.8\n\n\n 6\n5000\n65\n>16.0\n—\n\n\n 7\n5000\n90\n10.1\n11.0\n\n\n 9\n5000\n90\n13.0\n13.4\n\n\n 9\n5000\n65\n13.9\n14.4\n\n\n12\n5000\n90\n4.6\n5.0\n\n\n13\n5000\n90\n0.2\n0.5\n\n\nComparison 1\n5000\n90\n0.2\n0.2\n\n\nComparison 2\n2500\n90\n5.2\n5.2",
        "As is evident from the above test results, the products according to the invention, especially those with short alkyl chains, act as kinetic hydrate inhibitors and show substantial improvement compared to the prior art.",
        "To test the activity as agglomerate inhibitors, water and mineral spirit were initially introduced into the test autoclave used above (20% of the volume in the ratio of 1:2) and 5000 ppm, based on the aqueous phase, of the respective additive were added.",
        "At an autoclave pressure of 90 bar and a stirring speed of 5000 rpm, the temperature was reduced from 17.5° C. initially to 2° C. in the course of 2 hours, stirring was then effected for 16 hours at 20° C. and heating was again carried out. The induction time up to the occurrence of the initial hydrate formation and the resultant stirrer torque, which is a measure of the agglomeration of the gas hydrates, were measured.",
        "Polymer example\nTind (h)\nMmax (Ncm)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBlank value\n0.1\n15.9 \n\n\n3\n12.9\n0.4\n\n\n5\n>16\nn.d.\n\n\n8\n9.4\n2.1\n\n\n10\n8.2\n3.2\n\n\n11\n10.2\n1.5\n\n\n14\n8.6\n3.7",
        "As is evident from these examples, the measured torques were greatly reduced compared with the blank value, in spite of vigorous hydrate formation. This indicates a substantial agglomerate-inhibiting effect of the products according to the invention. Under the test conditions, the products surprisingly additionally have a substantial effect as kinetic inhibitors. In example 5, no hydrate formation was observed."
    ],
    "citations": [
        "5848644",
        "6093862",
        "6107531",
        "6451892",
        "6544932",
        "6566309",
        "6878788",
        "6894007",
        "6905605",
        "7008466",
        "0 896 123",
        "93/25798",
        "94/12761",
        "96/41784",
        "96/41786",
        "98/23843"
    ],
    "us_classification": "585 15",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "07",
            "subclass": "C",
            "main_group": "7",
            "subgroup": "20"
        }
    ]
}