{
    "title": "Ink, ink set, ink jet recording method, ink cartridge and ink jet recording apparatus",
    "abstract": "An ink to be used in an ink jet recording method of ejecting an ink from a recording head through action of thermal energy can improve the ink ejection stability and shows a high storage stability and a high color developability. An ink to be used in an ink jet recording method of ejecting an ink from a recording head through action of thermal energy is characterized in that the ink comprises a pigment represented by the general formula (1), a dispersant, a water-soluble organic compound and an aggregation inhibiting substance for inhibiting aggregation after dispersion breakdown of the pigment, and the content (mass %) of the aggregation inhibiting substance with respect to the total mass of ink is 0.4 times or more to less than 1.3 times of the content (mass %) of the pigment with respect to the total mass of ink",
    "inventors": [
        "Takada",
        "Matsumoto",
        "Tsuji",
        "Takada",
        "Hakamada",
        "Sugama",
        "Tsujimura",
        "Fujioka"
    ],
    "document_number": "07297203",
    "publication_date": "20071120",
    "assignees": [
        "Canon Kabushiki Kaisha"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An ink for use in an ink jet recording method in which an ink is ejected from a recording head through action of thermal energy,",
            "components": [
                {
                    "component": "wherein the ink comprises a pigment represented by the general formula (1), a dispersant, a water-soluble organic compound and an aggregation inhibiting substance for inhibiting aggregation after dispersion breakdown of the pigment,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the content (mass %) of the water-soluble organic compound is 5.0 mass % or more to 16.5 mass % or less with respect to the total mass of the ink,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the content (mass %) of the aggregation inhibiting substance with respect to the total mass of the ink is 0.4 times or more to less than 1.3 times of the content (mass %) of the pigment with respect to the total mass of the ink;",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The ink according to claim 1 , wherein the pigment represented by the general formula (1) is C. I. Pigment Yellow 74.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The ink according to claim 1 , wherein the aggregation inhibiting substance is at least one substance selected from the group consisting of nonionic surfactants, anionic surfactants, 1,2-alkanediols and glycol monoalkyl ethers.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The ink according to claim 1 , wherein the aggregation inhibiting substance is 1,2-pentanediol and/or 1,2-hexanediol.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The ink according to claim 1 , wherein the water-soluble organic compound comprises at least one water-soluble organic compound that acts as a poor medium for the dispersant.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The ink according to claim 5 , wherein the content (mass %) of the poor medium with respect to the total mass of the ink is 0.8 times or more to 4.0 times or less of the content (mass %) of the pigment represented by the general formula (1) with respect to the total mass of the ink.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The ink according to claim 5 , wherein the content (mass %) of the poor medium with respect to the total mass of the ink is 3.0 mass % or more to 10.0 mass % or less with respect to the total mass of the ink.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The ink according to claim 5 , wherein the poor medium is 1,5-pentanediol.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The ink according to claim 1 , wherein the pigment represented by the general formula (1) is surface-treated with a natural resin and/or a natural resin derivative.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. An ink set having a plurality of inks, comprising an ink according to claim 1 and at least one ink having a hue different from that of the ink.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. An ink jet recording method, comprising a step of ejecting an ink by an ink jet method, wherein the ink comprises the ink according to claim 1 .",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. An ink cartridge, comprising an ink storage portion for storing ink, wherein the ink comprises the ink according to claim 1 .",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. An ink jet recording apparatus, comprising an ink storage portion for storing ink and a recording head for ejecting an ink, wherein the ink comprises the ink according to claim 1 .",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. An ink to be supplied to an ink cartridge to be used in an ink jet recording apparatus for ejecting an ink from a recording head through action of thermal energy,",
            "components": [
                {
                    "component": "wherein the ink comprises C. I. Pigment Yellow 74 as a coloring material, an aggregation inhibiting substance for inhibiting aggregation after dispersion breakdown of the C. I. Pigment Yellow 74, and a water-soluble organic compound,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the content (mass %) of the aggregation inhibiting substance with respect to the total mass of the ink is 0.4 times or more to less than 1.3 times of the content (mass %) of the C. I. Pigment Yellow 74 with respect to the total mass of the ink, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the content (mass %) of the water-soluble organic compound is 5.0 mass % or more to 16.5 mass % or less with respect to the total mass of the ink.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The ink according to claim 14 , wherein the aggregation inhibiting substance is at least one substance selected from the group consisting of nonionic surfactants, anionic surfactants, 1,2-alkanediols and glycol monoalkyl ethers.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The ink according to claim 14 , wherein the aggregation inhibiting substance is 1,2-pentanediol and/or 1,2-hexanediol.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. An ink for use in an ink jet recording method in which an ink is ejected from a recording head through action of thermal energy,",
            "components": [
                {
                    "component": "wherein the ink comprises a pigment represented by the general formula (1), a dispersant, a water-soluble organic compound, and an aggregation inhibiting substance for inhibiting aggregation after dispersion breakdown of the pigment,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the content (mass %) of the aggregation inhibiting substance with respect to the total mass of the ink is 0.4 times or more to less than 1.3 times of the content (mass %) of the pigment with respect to the total mass of the ink,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the water-soluble organic compound comprises at least polyethylene glycol having an average molecular weight of 1000;",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The ink according to claim 17 , wherein the content (mass %) of the dispersant with respect to the total mass of the ink is 0.3 times or more to 2.0 times or less of the content of the pigment with respect to the total mass of the ink.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The ink according to claim 17 , wherein the water content is 73.0 mass % or more to 80.0 mass % or less with respect to the total mass of the ink.",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation of International Application No. PCT/JP2006/300897, filed on Jan. 16, 2006, which claims the benefit of Japanese Patent Application Nos. 2005-010306 filed on Jan. 18, 2005, 2005-010308 filed on Jan. 18, 2005 and 2005-010309 filed on Jan. 18, 2005.",
        "1. Field of the Invention",
        "This invention relates to an ink to be used in an ink jet recording method in which ink is ejected from a recording head through action of thermal energy, an ink cartridge, an ink jet recording method and an ink jet recording apparatus using such an ink. More particularly, the present invention relates to an ink containing a coloring material having a specific structure that can improve the ink ejection stability and shows a high storage stability and a high color developability as well as an ink cartridge, an ink jet recording method and an ink jet recording apparatus using such an ink.",
        "2. Related Background Art",
        "Ink jet recording is a recording method in which ink is applied to a recording medium such as a sheet of paper to form an image thereon. It enables printing with a less expensive apparatus, a high resolution and a high speed. Ink jet recording has become very popular in recent years as means for forming color images with ease and there is an increasing demand for higher quality color images.",
        "Currently, various pigments are being used as coloring materials to be used for ink jet recording. Since azo pigments particularly show an excellent coloring ability and are advantageous in terms of cost, various developments are under way.",
        "For example, there is a proposal of synthesizing a pigment so as to allow two yellow monoazo pigments having different structures to coexist and using an ink containing the obtained pigment composition to improve the optical resistance and the thermal resistance (see, e.g., Japanese Patent Application Laid-Open No. H10-158555). There is a proposal of using a monoazo pigment with a purity of 90% or more to improve the storage stability of ink (see, e.g., Japanese Patent Application Laid-Open No. 2004-123866).",
        "Various proposals have also been made for the purpose of improving the reliability (storage stability, ejection stability and so on) and the image quality (fixing ability, highlighter resistance and so on) of an ink jet recording ink prepared by using pigments as coloring materials. For example, there is a proposal of using an ink containing a compound having an alkylene oxide chain to improve the ejection performance and prevent the ink ejection micro-orifices arranged at a recording head from clogging (see, e.g., Japanese Patent Application Laid-Open No. H09-165538). Inks prepared so as to contain a 1,2-alkanediol or a glycol monoether for the purpose of improving the permeability of ink have also been proposed (see, e.g., Japanese Patent Application Laid-Open No. H07-157698 and Japanese Patent Application Laid-Open No. 2001-354888).",
        "As described above, in particular, recently attention is paid to water-soluble organic solvents and additives contained in ink along with coloring materials, and then design is made for their properties and contents to solve the above-identified problems, which has become the mainstream.",
        "The inventors of the present invention conducted evaluation of ejection stability of ink by loading an ink jet recording apparatus adapted to eject ink from the recording head thereof through action of thermal energy (to be also referred to as thermal type ink jet recording apparatus hereinafter) with an ink containing a monoazo pigment as coloring material. As a result, it was found that various phenomena occur as ink is ejected continuously, which phenomena include that the volume of the ejected ink gradually decreases and that impact position of ink on the recording medium becomes shifted. In short, the ejection stability is gradually degraded.",
        "In view of the findings, the inventors of the present invention looked into the causes of degradation of the ejection stability and observed how the pigment dispersion that is contained in an ink changes as the ink passes through an ink flow path of the recording head and is ejected from the ejection orifices.",
        "As a result, it was found that the dispersion breakdown of the pigment dispersion that is caused by the heat applied to it when ink droplets are ejected occurs rapidly and excessively particularly in the case of monoazo pigment dispersions that show a low thermal stability among numerous pigment dispersions.",
        "In other words, the ejection stability is degraded not because of the clogged ink ejection orifices, which have hitherto been known. When heat is applied to an ink containing thermally unstable monoazo pigments as coloring material to raise the ink temperature, dispersion breakdown of the pigment dispersion takes place rapidly and excessively. Then, as a result, deposits adhere to the inside of the ink flow path and vicinity of the ejection orifices to consequently block the ink flow path of the recording head and degrade the ejection stability.",
        "The above-described phenomenon has not been known so far and the present invention is based on this finding.",
        "Thus, it is an object of the present invention to provide an ink to be used in an ink jet recording method in which ink is ejected from a recording head through action of thermal energy, which ink can improve the ink ejection stability and shows a high storage stability and a high color developability.",
        "Another object of the present invention is to provide an ink set, an ink cartridge, an ink jet recording method and an ink jet recording apparatus using such an ink.",
        "In an aspect of the present invention, the above objects are achieved by providing an ink for use in an ink jet recording method in which an ink is ejected from a recording head through action of thermal energy, characterized in that the ink comprises a pigment represented by the general formula (1), a dispersant, a water-soluble organic compound and an aggregation inhibiting substance for inhibiting aggregation after dispersion breakdown of the pigment, and the content (mass %) of the aggregation inhibiting substance with respect to the total mass of the ink is 0.4 times or more to less than 1.3 times of the content (mass %) of the pigment with respect to the total mass of the ink.",
        "(In the general formula (1), R1, R2, R3, R4, R5 and R6 each independently represent a hydrogen atom, an alkyl group having 1 to 3 carbon atoms, a fluoroalkyl group having 1 to 3 carbon atoms, an alkoxyl group having 1 to 3 carbon atoms, a halogen atom, a nitro group, a sulfonic acid group or an alkaline earth metal salt thereof, an N-phenylaminosulfonyl group, a carboxyl group or an alkaline earth metal salt thereof, a carboamide group, an N-phenylcarbamoyl group, an ureylene group, an iminodicarbonyl group or a carboxylate group.)",
        "In another aspect of the present invention, there is provided an ink for use in an ink cartridge to be used in an ink jet recording apparatus for ejecting an ink from a recording head through action of thermal energy, characterized in that the ink comprises C. I. Pigment Yellow 74 as coloring material and the ink additionally comprises an aggregation inhibiting substance for inhibiting aggregation after dispersion breakdown of the C. I. Pigment Yellow 74 and the content (mass %) of the aggregation inhibiting substance with respect to the total mass of the ink is 0.4 times or more to less than 1.3 times of the content (mass %) of the C. I. Pigment Yellow 74 with respect to the total mass of the ink.",
        "In still another aspect of the present invention, there is provided an ink set having a plurality of inks, characterized in that the ink set comprises an ink as described above and at least one ink having a hue different from that of the ink.",
        "In still another aspect of the present invention, there is provided an ink jet recording method, comprising a step of ejecting an ink by an ink jet recording method, characterized in that the ink is an ink as described above.",
        "In still another aspect of the present invention, there is provided an ink cartridge, comprising an ink storage portion for storing ink, characterized in that the ink is an ink as described above.",
        "In a further aspect of the present invention, there is provided an ink jet recording apparatus, comprising an ink storage portion for storing ink and a recording head for ejecting an ink, characterized in that the ink is an ink as described above.",
        "Thus, the present invention solves the particular problem of degradation of the ejection stability caused by the adhesion of deposits generated when an ink containing a poorly thermally stable monoazo pigment is ejected continuously from a recording head through action of thermal energy. Additionally, it is possible to achieve a high storage stability and a high color developability.",
        "Thus, according to the present invention, there is provided an ink for use in an ink jet recording method in which ink is ejected from a recording head through action of thermal energy, which ink can improve the ink ejection stability and show a high storage stability and a high color developability.",
        "According to the present invention, there are provided an ink set, an ink cartridge, an ink jet recording method and an ink jet recording apparatus using such an ink.",
        "FIGS. 1A, 1B, 1C, 1D, 1E, 1F, 1G and 1H are schematic illustration of the mechanism of generation of deposits; and",
        "FIGS. 2A, 2B and 2C are schematic illustration of the effect of an aggregation inhibiting substance.",
        "Now, the present invention will be described below in greater detail by way of preferred embodiments of the invention.",
        "In the course of looking for the causes of the adhesion of deposits to the inside of the ink flow path and vicinity of the ejection orifices, the inventors of the present invention assumed that one of the causes of the above described phenomenon is the influence of the heat applied to the ink that is ejected. Thus, the inventors conducted the following experiment by using an ink with which deposits adhere to the inside of the ink flow path and vicinity of the ejection orifices when a thermal type ink jet recording apparatus is used. The ink is loaded in an ink jet recording apparatus adapted to convert an electric signal into a mechanical signal by means of an electrostriction element to eject an ink from a recording head through action of mechanical energy (to be referred to as a piezo type ink jet recording apparatus hereinafter) and the ejection stability of the ink was evaluated. As a result, the volume of the ejected ink did not change and the ejection was held in a stable state, when the ink ejection was made to continue for a long time.",
        "Thus, the inventors of the present invention came to firmly believe that the phenomenon that deposits adhere to the inside of the ink flow path and vicinity of the ejection orifices arises specifically when an ink containing a monoazo pigment that is thermally poorly stable is ejected by means of a thermal type ink jet recording apparatus.",
        "On the basis of the obtained finding, the inventors of the present invention conducted a simulation to confirm the phenomenon that occurs in the course of ejecting an ink, using a thermal type ink jet recording apparatus. As a result, the inventors reached to the conclusion that the largest cause that generates deposits is the phenomenon as described below that takes place in the ink flow path.",
        "(Mechanism of Generating Deposits)",
        "FIGS. 1A, 1B, 1C, 1D, 1E, 1F, 1G and 1H are schematic illustration of the mechanism of generation of deposits vicinity of an ejection orifice when a thermal type ink jet recording apparatus is used. Referring to FIGS. 1A to 1H, FIG. 1A illustrates an filmy air bubble 6 just generated on a heater 1 and FIGS. 1B, 1C, 1D, 1E, 1F, 1G and 1H illustrate the conditions after about 1 μsec, about 2.5 μsec, about 3 μsec, about 4 μsec, about 4.5 μsec, about 6 μsec, and about 9 μsec respectively. Note that the horizontally hatched parts in FIGS. 1A to 1H are parts of an orifice plate or a flow path wall.",
        "Firstly, as shown in FIG. 1A, as the heater 1 is electrically energized according to a recording signal, an air bubble 6 is generated on the heater 1 in the inside of an ink flow path 2. The ink temperature is raised to about 200° C. in the vicinity of the heater 1. Then, dispersion breakdown of the pigment dispersion takes place to give rise to phenomena such as detachment of a dispersant from the pigment and fragmentation of the pigment. As a result, some particles of the pigment become to be unstably dispersed in the ink. Since dispersion breakdown takes place rapidly and excessively in the ink that contains the thermally poorly stable monoazo pigment, many particles of the pigment become to be unstably dispersed in the ink.",
        "Thereafter, as shown in FIGS. 1B and 1C, the air bubble 6 rapidly increases its volume in 2.5 μsec. Then, as a result, the ink whose temperature has been raised is cooled. As the ink temperature falls, the pigment particles that became unstably dispersed in the ink can no longer maintain the dispersed state to cause pigment aggregation and then some pigment particles become deposited in the ink. While some deposited aggregates 4 of the pigment are ejected from an ejection orifice 3 in a state of being contained in an ink droplet 5, others remain in the inside of the ink flow path 2 and adhere to the flow path wall. As the operation of ejecting an ink as illustrated in FIGS. 1A to 1H is repeated, the aggregates 4 in the ink are increasingly deposited on the flow path wall.",
        "(Effect of an Aggregation Inhibiting Substance that Inhibits Aggregation after the Dispersion Breakdown of the Pigment)",
        "When the ink that contains a monoazo pigment is made to contain an aggregation inhibiting substance that inhibits aggregation after the dispersion breakdown that takes place when the ink temperature rises, the substance suppresses the generation of deposits to consequently improve the ejection stability. The reason therefore will be described below.",
        "FIGS. 2A, 2B and 2C are schematic illustration of the effect of an aggregation inhibiting substance vicinity of the heater in a thermal type ink jet recording apparatus. Of FIGS. 2A to 2C, FIG. 2A shows a state before the heater is electrically energized according to a recording signal and FIG. 2B shows a state when the heater starts being electrically energized to give rise to air bubbles, while FIG. 2C shows a state where ink is ejected as the air bubbles grow.",
        "Firstly, as shown in FIG. 2A, the temperature of the heater rises as the heater is electrically energized to by turn raise the temperature of the ink in the ink flow path. Then, as described above, dispersion breakdown of the pigment dispersion takes place in the ink whose temperature has been raised to give rise to phenomena such as detachment of a dispersant 8, which contributes to dispersion of a pigment 7, from the pigment 7 and fragmentation of the pigment 7. When the ink contains an aggregation inhibiting substance, the aggregation inhibiting substance 9 comes to be attached to the pigment 7 at areas where the dispersant 8 is detached and at exposed surfaces of the fragmented pigment 7. Thereafter, as the volume of the air bubbles expands, the ink whose temperature has been raised is cooled. As the ink temperature falls, the part of the pigment 7 that is unstably dispersed in the ink can no longer maintain the dispersed state and the pigment starts to aggregate. However, since the ink contains an aggregation inhibiting substance, the aggregation inhibiting substance 9 is attached to the pigment 7 to maintain the dispersed state to a certain extent as shown in FIG. 2C. As a result, it is possible to reduce the aggregates deposited in the ink.",
        "<Ink>",
        "Now, the components of an ink according to the present invention will be described in detail below.",
        "(Aggregation Inhibiting Substance)",
        "An ink according to the present invention should indispensably contain an aggregation inhibiting substance. For the purpose of the present invention, any appropriate aggregation inhibiting substance can be used so long as it is a compound that can be attached to the pigment in areas where the dispersant is detached and areas of exposed surfaces of the pigment. Specific examples of aggregation inhibiting substance that can be used for the purpose of the present invention include nonionic surfactants, anionic surfactants, 1,2-alkanediols and glycol monoalkyl ethers.",
        "Specific examples of nonionic surfactants that can be used for the purpose of the present invention include polyoxyethylene glycerin fatty ester, sorbitan fatty ester, polyoxyethylene sorbitan fatty ester, polyoxyethylene sorbitol fatty ester, polyoxyethylene fatty ester, polyoxyethylene alkyl ether, polyoxyethylene polyoxypropylene alkyl ether, polyoxyethylene alkylaryl ether and acetyleneglycol type surfactants.",
        "Specific examples of anionic surfactants that can be used for the purpose of the present invention include alkyl sulfates, alkylaryl sulfates, plyoxyethylene alkylether sulfates, alkylsulfoacetates, salts of fatty acids, alkylaryl carboxylates and polyoxyethylene alkylether carboxylates.",
        "Specific examples of 1,2-alkanediols that can be used for the purpose of the present invention include 1,2-pentanediol, 1,2-hexanediol, 1,2-heptanediol and 1,2-octanediol.",
        "Specific examples of glycol monoalkyl ethers that can be used for the purpose of the present invention include ethyleneglycol monobutyl ether, diethyleneglycol monobutyl ether and triethyleneglycol monobutyl ether.",
        "However, when surfactants-like properties are marked, the dispersant may be detached from the pigment in the ink. Therefore, for the purpose of the present invention, it is preferable to use a 1,2-aklanediol that shows surfactants-like properties only to a small extent. To be more specific, it is particularly preferable to use 1,2-pentanediol or 1,2-hexanediol which has 5 or 6 carbon atoms.",
        "For the purpose of the present invention, it is indispensably necessary that the content (mass %) of the aggregation inhibiting substance with respect to the total mass of ink is 0.4 times or more and less than 1.3 times of the content (mass %) of the pigment with respect to the total mass of ink. The content of the aggregation inhibiting substance can vary depending on the surface condition of the pigment, the content of a resin that acts as a dispersant for dispersing the pigment and the type of the aggregation inhibiting substance. However, for the purpose of the present invention, it is possible to satisfactorily suppress the generation of deposits in the ink flow path and vicinity of the ejection orifices when the content is set within the above range. While the generation of deposits is suppressed to a certain extent when the content of the aggregation inhibiting substance is less than 0.4 times of the content of the pigment, such a level as to obtain sufficient ejection stability may not be achieved. When, on the other hand, the content of the aggregation inhibiting substance is 1.3 times or more of the content of the pigment, the dispersant can be detached from the pigment if 1,2-alkanediol, which is an aggregation inhibiting substance showing properties of surfactants to a small extent, is used. Then, the storage stability of the ink falls and, in some cases, it may not be possible to suppress the generation of deposits in the ink flow path and vicinity of the ejection orifices.",
        "For the purpose of the present invention, additionally, it is particularly preferable that the content (mass %) of the aggregation inhibiting substance with respect to the total mass of ink is 0.4 mass % or more to 10.0 mass % or less with respect to the total mass of the ink. When the content is more than 10.0 mass %, the ejection characteristics of the ink may be degraded because the storage stability of the ink falls and the ink viscosity rises. When, on the other hand, the content is less than 0.4 mass %, it may not possible to suppress the generation of deposits in the ink flow path and vicinity of the ejection orifices.",
        "The above-cited Japanese Patent Application Laid-Open No. H09-165538, Japanese Patent Application Laid-Open No. H07-157698 and Japanese Patent Application Laid-Open No. 2001-354888 describe inks that contain a substance that corresponds to the aggregation inhibiting substance of the present invention. The purpose of using such a substance is to prevent clogging and maintain the stability of ejection in the case of Japanese Patent Application Laid-Open No. H09-165538. The purpose of using such a substance is to prevent bleeding and reduce the flammability, the smell and the volatility of ink in the case of Japanese Patent Application Laid-Open No. H07-157698. The purpose of using such a substance is to prevent deposits from adhering vicinity of the ink ejection nozzle and achieve a high permeability in the case of Japanese Patent Application Laid-Open No. 2001-354888.",
        "According to Japanese Patent Application Laid-Open No. H09-165538 and Japanese Patent Application Laid-Open No. H07-157698, however, a pigment that is represented by the general formula (1), which is indispensable for the purpose of the present invention, is not used as coloring material. While a monoazo pigment represented by the general formula (1) is used in the example in Japanese Patent Application Laid-Open No. 2001-354888, this patent document describes that the use of a piezo type ink jet recording apparatus is preferable and only a piezo type ink jet recording apparatus is used in the examples described in the patent document. Additionally, Japanese Patent Application Laid-Open No. 2001-354888 describes that the substance that corresponds to an aggregation inhibiting substance according to the present invention can increase permeability, suppress the increase of ink viscosity and allows raising the addition amount of a moisture retaining agent. Still additionally, the above-cited patent document describes that drying of ink is suppressed and ink is prevented from solidifying at the ejection nozzle by using the moisture retaining agent to improve the ejection stability. In other words, clogging of the nozzle pointed out as a technical problem to be solved by the invention described in Japanese Patent Application Laid-Open No. 2001-354888 refers to the phenomenon that the pigment is deposited vicinity of the nozzle due to evaporation of water that is a conventional problem.",
        "Thus, from the above, it is obvious that in the inventions described in Japanese Patent Application Laid-Open No. H09-165538, Japanese Patent Application Laid-Open No. H07-157698 and Japanese Patent Application Laid-Open No. 2001-354888 the technical problem to be solved by the present invention is not recognized.",
        "(Aqueous Medium)",
        "An ink according to the invention may additionally contain water or an aqueous medium that is a mixed medium of water and any of various water-soluble organic compounds so long as the addition of water or such a medium is advantageous for the purpose of the present invention only to such an extent that it does not obstruct the object and the effects of the present invention. Note that the above-described aggregation inhibiting substance contains part of the substances that are classified as water-soluble organic compounds (more specifically, 1,2-alkanediols and glycol molalkylethers).",
        "Specific examples of water-soluble organic compounds that can be used for the purpose of the present invention include: alkyl alcohols having 1 to 4 carbon atoms such as methyl alcohol, ethyl alcohol, n-propyl alcohol, isopropyl alcohol, n-butyl alcohol, sec-butyl alcohol and tert-butyl alcohol; amides such as dimethyl formamide and dimethyl acetamide; ketones and keto-alcohols such as acetone, diacetone alcohol, ethers such as tetrahydrofuran and dioxane; polyalkylene glycols such as polyethylene glycol and polypropylene glycol; alkylene glycols having 2 to 6 carbon atoms such as ethylene glycol, propylene glycol, butylene glycol, triethylene glycol, 1,2,6-hexanetriol, thiodiglycol, hexylene glycol and diethylene glycol; lower alkyl ether acetates such as polyethyleneglycol monomethylether acetate; glycerin; lower alkyl ethers of polyhydric alcohols such as ethyleneglycol monomethylether (and monoethylether), diethylene glycol methyl (or ethyl) ether and triethyleneglycol monomethylether (and monoethylether), polyhydric alcohols such as trimethylol propane, trimethylol ethane; N-methyl-2-pyrrolidone, 2-pyrrolidone and 1,3-dimethyl-2-imidazolidinone.",
        "Any of the above listed water-soluble organic compounds may be used alone or as a mixture thereof.",
        "Water-soluble organic compounds that can be used for the purpose of the present invention include those that are solid at room temperature.",
        "For the purpose of the present invention, the content (mass %) of the water-soluble organic compound(s) is preferably 5.0 mass % or more to 16.5 mass % or less with respect to the total mass of the ink. It has been confirmed that the generation of deposits in the ink flow path and vicinity of the ejection orifices is suppressed when the content is held to a level within the above range, although it is not clear how the content of the water-soluble organic compound(s) influences the generation of deposits in the ink flow path and vicinity of the ejection orifices. However, the inventors of the present invention assumes that the compatibility of the water-soluble organic compound(s) and the hydrophobic part of a resin, which is a dispersant, rapidly increases to consequently relatively reduce the adsorptivity of the pigment and the resin, which is the dispersant, when the total content of the water-soluble organic compound(s) is more than 16.5 mass %.",
        "The water content is preferably 68.5 mass % or more to 90.0 mass % or less with respect to the total mass of the ink, more preferably 73.0 mass % or more to 80.0 mass % or less.",
        "(Poor Medium)",
        "As pointed out above, there are no limitations to water-soluble organic compounds that can be used for an ink according to the present invention so long as they are suitable for ink jet recording.",
        "The inventors of the present invention made studies for the purpose of suppressing the generation of deposits in the ink flow path and vicinity of the ejection orifices and achieving an enhanced level of ejection stability for a prolonged period of time. As a result, it was found that the above purpose is attained when the ink contains a poor medium for the dispersant as selected from the above listed water-soluble organic compounds.",
        "Now, the mechanism of achieving ejection stability for a prolonged period of time particularly when the ink contains a poor medium for the dispersant as selected from the above listed water-soluble organic compounds will be described below.",
        "As illustrated in FIG. 2B, the aggregation inhibiting substance 9 is attached not only to parts of the pigment 7 where the dispersant 8 is detached and where surface of the pigment are exposed as a result of fragmentation but also to the dispersant 8. As a result, the dispersant 8 can be detached from the pigment 7 depending on the type of the aggregation inhibiting substance and the content thereof in the ink.",
        "When the ink contains a poor medium for the dispersant 8, the force attaching the dispersant 8 to the surface of the pigment 7 is dominant relative to the affinity of the dispersant 8 relative to the aqueous medium of the ink. Thus, it may be assumed that the aggregation inhibiting substance 9 can hardly come off from the pigment 7 if it is attached to the dispersant 8 so that the dispersion stability of the pigment is held much higher.",
        "For the purpose of the present invention, there are no limitations to water-soluble organic compounds as a poor medium for the dispersant so long as it provides the above described effect. However, the advantages of the present invention are most remarkable when 1,5-pentanediol is used as a poor medium. Needless to say, the present invention is by no means limited thereto. Note, for the purpose of the present invention, surfactants are excluded from water-soluble organic compounds when judging if such a compound is a poor medium or not for the dispersant.",
        "(Method of Selecting a Poor Medium)",
        "Now, the method of selecting a water-soluble organic compound as a poor medium for the dispersant will be described below. The inventors of the present invention discussed about the criteria to be used for judging a poor medium as suitable or unsuitable from the viewpoint of the advantages of the present invention and found that the following judging method is effective.",
        "Firstly, an aqueous solution containing 50 mass % of a water-soluble organic compound being a subject to be judged, 45 mass % of water and 5 mass % of a dispersant to be used in ink is prepared. Then, after storing the prepared aqueous solution at 60° C. for 24 hours, the turbidity of the prepared solution is visually compared with that of an aqueous solution containing 50 mass % of the water-soluble organic compound and 50 mass % of water.",
        "More specifically, the method as described below was used to judge if the water-soluble organic compound to be used is a poor medium for a given dispersant or not. Firstly, two aqueous solutions including aqueous solution A of a given dispersant containing a water-soluble organic compound to be judged and aqueous solution B of the dispersant were prepared.",
        "Aqueous solution A: an aqueous solution containing 50 mass % of the water-soluble organic compound to be judged, 5 mass % of the given dispersant and 45 mass % of water.",
        "Aqueous solution B: an aqueous solution containing 50 mass % of the water-soluble organic compound to be judged and 50 mass % of water.",
        "Then, after storing the aqueous solution A at 60° C. for 24 hours, it was cooled to the room temperature and then visually observed for the turbidity thereof. Similarly, the aqueous solution B was visually observed for the turbidity thereof. If the aqueous solution A is more turbid, the water-soluble organic compound was judged to be a poor medium.",
        "Specific examples of water-soluble organic compounds that can be used as poor mediums for the purpose of the present invention include polyethylene glycol (molecular weight 1000), 1,5-pentanediol and 1,2-hexanediol. However, for the purpose of the present invention, if a water-soluble organic compound is a poor medium or not is judged from the viewpoint of the relationship with the dispersant used in an ink. Therefore, the present invention is by no means limited to the above-listed specific examples of poor mediums.",
        "The content of the water-soluble organic compound that acts as a poor medium for the dispersant is not subjected to any particular limitations so long as the water-soluble organic compound is effective for improving the effect of suppressing the generation of deposits in the ink flow path and vicinity of the ejection orifices and/or the storage stability of the ink. However, the content (mass %) of the poor medium with respect to the total mass of the ink is preferably 0.8 times or more to 4.0 times or less of the content (mass %) of the pigment with respect to the total mass of the ink. If the ratio of the content of the poor medium to that of the pigment is less than 0.8 times, the affinity of the hydrophilic part of the resin, or the dispersant, for the aqueous medium of the ink rises. Then, as a result, it may not be able to satisfactorily suppress the phenomenon that the dispersant is detached from the pigment as a result of attachment of the aggregation inhibiting substance to the dispersant. If, on the other hand, the ratio of the content of the poor medium to that of the pigment is more than 4.0 times, it may not be able to attain a satisfactory level of storage stability for the ink.",
        "For the purpose of the present invention, it is particularly preferable that the content (mass %) of the poor medium is 3.0 mass % or more to 10.0 mass % or less with respect to the total mass of the ink. The above described effects may not be sufficiently obtained when the content is less than 3.0 mass % or more than 10.0 mass %.",
        "As a result of a study made by the inventors of the present invention, it was found that the effect of an ink containing a water-soluble organic compound that is a poor medium for the dispersant of the ink is particularly remarkable when an aggregation inhibiting substance represented by any of the general formulas (2) to (4) below is combined with the poor medium. Such substances particularly have properties like those of surfactants to a large extent. Therefore, an ink containing a poor medium and an aggregation inhibiting substance represented by any of the general formulas (2) to (4) below in combination enhances the effect of the aggregation inhibiting substance for the pigment if compared with an ink that does not contain a poor medium, and hence such ink can effectively suppress aggregations.",
        "(In the general formula (2), R represents an alkyl group having 10 to 22 carbon atoms and [EO] represents an ethylene oxide chain, while n is an integer from 5 to 45.)",
        "(In the general formula (3), R represents an alkyl group having 10 to 22 carbon atoms and [EO] represents an ethylene oxide chain, while m is an integer from 5 to 45.)",
        "(In the general formula (4), R represents an alkyl group having 10 to 22 carbon atoms and [EO] represents an ethylene oxide chain, while [PO] represents a propylene oxide chain and o and p are respectively integers from 2 to 10 and from 5 to 40.)",
        "According to the present invention, it is possible to use a compound represented by any of the above general formulas (2) to (4) where the number of carbon atoms of the alkyl group is within a range between 10 and 22 and the chain length of the ethylene oxide chain or the propylene oxide chain is within a range between 5 and 45. More specifically, it is possible to use polyoxyethylenealkyl ethers, polyoxyethylenepolyoxypropylenealkyl ethers and polyoxyethylenealkylphenyl ethers and so on. Specific examples of such compounds include polyoxyethylenecetyl ether, polyoxyethylenepolyoxypropylenecetyl ether and polyoxyethylenenonylphenyl ether, although the present invention is by no means limited thereto.",
        "Any compounds represented by the general formulas (2) to (4) can be used without limitations so long as it provides the above-described effect. For the purpose of the present invention, the content (mass %) of the compound represented by any of the general formulas (2) to (4) with respect to the total mass of the ink is preferably more than 0 times to 3.5 times or less, more preferably 2.0 times or more to 3.5 times or less, of the content (mass %) of the poor medium with respect to the total mass of the ink. The effect of the aggregation inhibiting substance on the pigment is enhanced and it is possible to effectively suppress aggregations when the content of the compound is within the above range.",
        "(Monoazo Pigment)",
        "Now, the monoazo pigment and the dispersant which compose an ink according to the present invention will be described below.",
        "An ink according to the present invention is required to indispensably contain a pigment represented by the general formula (1). As may be clear from the structure, a pigment represented by the general formula (1) is a monoazo pigment.",
        "(In the general formula (1), R1, R2, R3, R4, R5 and R6 each independently represent a hydrogen atom, an alkyl group having 1 to 3 carbon atoms, a fluoroalkyl group having 1 to 3 carbon atoms, an alkoxyl group having 1 to 3 carbon atoms, a halogen atom, a nitro group, a sulfonic acid group or an alkaline earth metal salt thereof, an N-phenylaminosulfonyl group, a carboxyl group or an alkaline earth metal salt thereof, a carboamide group, an N-phenylcarbamoyl group, an ureylene group, an iminodicarbonyl group or a carboxylate group.)",
        "Specific examples of pigments that are represented by the general formula (1) non-limitedly include the following.",
        "C. I. Pigment Yellows: 1, 2, 3, 5, 6, 49, 65, 73, 74, 75, 97, 98, 111, 116, 130, 61, 62: 1, 133, 168, 169 and so on.",
        "C. I. Pigment Oranges: 1 and so on.",
        "Of the above, it is particularly preferable to use C. I. Pigment Yellow 74 because the effect of the aggregation inhibiting substance is most remarkable when it is used.",
        "The content (mass %) of the pigment is preferably from 0.1 mass % or more to 15.0 mass % or less, more preferably from 1.0 mass % or more to 10.0 mass % or less, with respect to the total mass of the ink. It is possible to satisfactorily maintain the dispersed condition of the pigment dispersion in the ink when the content of the pigment is within the above-cited range.",
        "(Natural Resin and/or Natural Resin Derivative)",
        "For an ink according to the present invention, it is preferable that the monoazo pigment is surface-treated by means of a natural resin and/or a natural resin derivative. As the pigment is surface-treated by a natural resin and/or a natural resin derivative, the hydrophobicity of the surface of the pigment is enhanced to improve the adsorptivity of the pigment and the dispersant. Then, as a result, it is possible to suppress the effect of detaching the dispersant from the pigment in the ink when the ink contains an aggregation inhibiting substance that has properties like those of surfactants. Additionally, it is possible not only to suppress the generation of deposits in the ink flow path and vicinity of the ejection orifices but also to improve the storage stability of the ink.",
        "Natural resins and/or natural resin derivatives that can be used for the purpose of the present invention are unlimitedly any substances that can enhance the hydrophobicity of the surface of the pigment when added in synthesizing the pigment. Examples of natural resins and natural resin derivatives that can be used for the purpose of the present invention include rosin resins, terpene resins, shellac resins and their derivatives.",
        "Rosin resins include those obtained by polymerizing resin acids taken from pinaceous plants. Examples of resin acids include abietic acid and its related substances such as mixtures containing dihydroabietic acid, dehydroabietic acid and abietic anhydride.",
        "Terpene resins include thermoplastic oligomers obtained by refining and polymerizing terpene oil obtained from pine trees and orange oils obtained from rinds of citrus fruits. Examples of terpene resins include mixtures containing α-pinene and β-pinene as principal ingredients and those containing orange oil or limonene as principal ingredient.",
        "Shellac resins include polymers of various resin acids extracted from the secretion of coccus lacca. Examples of mixtures of resin acids include resins generated as a result of ester bonding of Aleuritic acid, Jalaric acid and/or Laccijalaric acid.",
        "For the purpose of the present invention, the treatment amount of a natural resin and/or a natural resin derivative for the pigment is preferably 3.0% or more to 20.0% or less, more preferably 5.0% or more to 15.0% or less. If the treatment amount is less than 3.0%, it may not be possible to attain the effect of efficiently suppressing the generation of deposits in the ink flow path and vicinity of the ejection orifices and that of improving the ink storage stability. If, on the other hand, the treatment amount is more than 20.0%, the natural resin and/or the natural resin derivative can be dissolved into the ink to wet the surfaces of the ejection orifices of the recording head so as to make it impossible to attain ejection stability.",
        "Methods of treating the surface of the pigment with a natural resin and/or a natural resin derivative include one comprising adding the natural resin and/or the natural resin derivative to the pigment dispersion when preparing the latter and stirring the mixture well so as to attach the natural resin and/or the natural resin derivative to the surface of the pigment, although the present invention is by no means limited thereto.",
        "(Dispersant)",
        "An ink according to the present invention should indispensably contain a dispersant in order to disperse the monoazo pigment into the aqueous medium. It is preferable to use a resin that can stably disperse the monoazo pigment in the aqueous medium by the effect of the anionic groups it has. For the purpose of the present invention, the dispersant may be omitted when a self-dispersing type pigment is used. If such is the case, however, it is preferable to use a dispersant in order to stably disperse the pigment.",
        "Examples of dispersants that can be used for the purpose of the present invention include styrene-acrylic acid copolymers, styrene-acrylic acid-acrylic alkyl ester copolymers, styrene-maleic acid copolymers, styrene-maleic acid-acrylic alkyl ester copolymers, styrene-methacrylic acid copolymers, styrene-methacrylic acid-acrylic alkyl ester copolymers, styrene-maleic half ester copolymers, vinylnaphthalene-acrylic acid copolymers, vinylnaphthalene-maleic acid copolymers, styrene-maleic anhydride-maleic half ester copolymers and salts thereof.",
        "For the purpose of the present invention, the weight-average molecular weight of the dispersant is preferably between 1,000 and 30,000, more preferably between 3,000 and 15,000.",
        "The content (mass %) of the dispersant with respect to the total mass of the ink is preferably 0.3 times or more to 2.0 times or less of the content of the pigment with respect to the total mass of the ink. If the dispersant is detached from the pigment, it is adsorbed to the pigment again when the content of the dispersant is 0.3 times or more of the content of the pigment with respect to the total mass of the ink. If the content of the dispersant exceeds 2.0 times of the content of the pigment, the dispersant that does not adsorb to the pigment exists in an excessively unnecessary amount. As a result, the ejection stability of the ink may be degraded as moisture is evaporated from the front end of the nozzle to raise the viscosity of the ink, and the dispersant adheres to the orifices of the recording head.",
        "(Other Ingredients)",
        "If necessary, an ink according to the present invention may contain a moisture retaining agent to such an extent that may not obstruct the effects and advantages of the present invention. A surfactant, a defoaming agent, an antiseptic agent and/or an anti-mold agent may be added to an ink according to the present invention. It is preferable to adjust the physical properties of the ink including the viscosity and the pH value to desired respective levels when the ink is applied to an ink jet recording apparatus in order to realize a good ejection performance.",
        "<Ink Set>",
        "An ink according to the present invention can advantageously be used in an ink set where the ink is combined with other inks. An ink set according to the present invention is to be used as a combination of an ink according to the present invention and at least one ink having a hue different from that of the ink. The hue of the ink different in hue is not subjected to any particular limitations. For example, in the case of a yellow ink containing C. I. Pigment Yellow 74 as a monoazo pigment, the ink different in hue may be at least one selected from the group of inks of the colors of magenta, cyan, red, green, blue and black. There are no limitations to coloring materials that can be used for the ink having a different hue. In other words, known dyes and pigments may be used.",
        "<Ink Cartridge>",
        "An ink cartridge to be suitably used for recording by means of an ink according to the invention has an ink storage portion.",
        "<Ink Jet Recording Apparatus>",
        "An ink jet recording apparatus to be used for recording by means of an ink according to the invention is adapted to produce ink droplets by applying thermal energy or mechanical energy that corresponds to a recording signal to the ink contained in an ink storage portion of a recording head having the ink storage portion. The present invention is particularly advantageous when the ink jet recording apparatus is a thermal type ink jet recording apparatus adapted to eject ink from the recording head thereof through action of thermal energy.",
        "Now, the present invention will be described further by way of examples and comparative examples. Note, however, that the present invention is by no means limited by the examples that are described below without departing from the scope of the present invention. In the following description, “parts” and “%” refer respectively to parts by mass and % by mass unless noted otherwise.",
        "In the following description, the weight-average particle diameters are observed by means of a laser zeta potentiometer, ELS8000 (trade name, available from OTSUKA ELECTRONICS Co., Ltd.).",
        "[Preparation of Pigment Dispersion]",
        "(Pigment Dispersion 1)",
        "The materials listed below were loaded in a batch type vertical sand mill (available from AIMEX) with 150 parts of zirconia beads having a diameter of 0.3 mm and dispersed for 12 hours, while being cooled with water. The obtained dispersion solution was treated for centrifugation to remove coarse particles. As a final product prepared, a pigment dispersion 1 containing 12.5% of pigment solid matter with a weight-average particle diameter of 120 nm was obtained.\n\n    \n    \n        pigment [C. I. Pigment Yellow 74 (trade name: Hansa Brilliant Yellow 5GX-W, available from Clariant Co.: 10 parts\n        anionic polymer P-1 [styrene/butyl acrylate/acrylic acid copolymer (copolymerization ratio (weight ratio)=30/40/30), acid value 202, weight average molecular weight 6,500, aqueous solution of 10% solid resin content, neutralized with potassium hydroxide]: 30 parts\n        pure water: 60 parts",
        "(Synthesis of Pigment Surface-Treated with Natural Resin and/or Natural Resin Derivative)",
        "187.8 parts of 2-methoxy-4-nitro-aniline were added to a mixed aqueous solution containing 1,300 parts of water and 290 parts of 35% aqueous solution of hydrochloric acid and stirred. The obtained aqueous solution was cooled to 0° C. and subsequently diazotized by adding 80 parts of sodium nitrite.",
        "241.8 parts of 2-methoxyacetanilide were added to 5,000 parts of water and dissolved with 48 parts of sodium hydroxide. Crystals were deposited in the aqueous solution as a result of adding a mixed solution of 196 parts of acetic acid and 196 parts of water to obtain a suspension containing a coupling ingredient.",
        "The diazo aqueous solution which has become transparent was added by being caused to flow down to the above-described acidic suspension of acetic acid that acts as coupling ingredients under agitation at 15° C. within 1 and a half hour to 2 hours.",
        "When the coupling reaction was over, the pigment was surface-treated by adding 45 parts of rosin to the obtained aqueous solution. The obtained pigment was filtered, washed with water, dried and then crushed to powder to obtain 492 parts of a yellow azo pigment (rosin-treated C. I. Pigment Yellow 74)",
        "(Pigment Dispersion 2)",
        "The materials listed below were loaded in a batch type vertical sand mill (available from AIMEX) with 150 parts of zirconia beads having a diameter of 0.3 mm and dispersed for 5 hours, while being cooled with water. The obtained dispersion solution was treated for centrifugation to remove coarse particles. As a final product prepared, a pigment dispersion 2 containing 12.5% of pigment solid matter with a weight-average particle diameter of 125 nm was obtained.\n\n    \n    \n        rosin-treated C. I. Pigment Yellow 74: 10 parts\n        anionic polymer P-1 [styrene/butyl acrylate/acrylic acid copolymer (copolymerization ratio (weight ratio)=30/40/30), acid value 202, weight average molecular weight 6,500, aqueous solution of 10% solid resin content, neutralized with potassium hydroxide]: 30 parts\n        pure water: 60 parts",
        "[Judgment on Poor Medium of Water-Soluble Organic Solvent for Dispersant]",
        "The following experiment was conducted in order to select the water-soluble organic compounds acting as the poor medium for the dispersant (anionic polymer P-1) in the above described pigment dispersion. First, two aqueous solutions including aqueous solution A of a dispersant that contains a water-soluble organic compound to be judged and aqueous solution B of the water-soluble organic compound to be judged were prepared. Note that, surfactants were excluded from water-soluble organic compounds when judging whether it is a poor medium or not for the dispersant.",
        "aqueous solution A: an aqueous solution containing 50 mass % of the water-soluble organic compound to be judged, 5 mass % of the dispersant and 45 mass % of water.",
        "aqueous solution B: an aqueous solution containing 50 mass % of the water-soluble organic compound to be judged and 50 mass % of water.",
        "Then, the aqueous solution A was stored at 60° C. for 24 hours and subsequently cooled to the room temperature and the turbidity of the aqueous solution was visually observed. The turbidity of the aqueous solution B was visually observed in a similar manner. Then, if the aqueous solution A is more turbid than the aqueous solution B, the water-soluble organic compound was judged to be a poor medium.",
        "Table 1 shows the results obtained by the above judgments with respect to water-soluble organic compounds usable in ink to show if each of them is a poor medium for the dispersant (anionic polymer P-1) or not. In Table 1, ‘O’ indicates that the corresponding water-soluble organic compound is a poor medium and ‘x’ indicates that the corresponding water-soluble organic compound is not a poor medium.",
        "TABLE 1\n\n\n\n\n\n\n\nwater-soluble organic compounds\njudgment\n\n\n\n\n\n\n\n\n\nGlycerin\nX\n\n\n\nethylene glycol\nX\n\n\n\npolyethylene glycol (*1)\n◯\n\n\n\n1,5-pentanediol\n◯\n\n\n\n1,6-hexanediol\n◯\n\n\n\n1,2-hexanediol\n◯\n\n\n\n1,2-pentanediol\n◯\n\n\n\n\n\n\n\n(*1): average molecular weight 1,000",
        "[Preparation of Ink]",
        "The ingredients listed in Tables 2-A and 2-B were mixed and fully stirred. Subsequently, the mixture was filtered through a micro filter (available from Fuji Photo Film Co., Ltd.) with a pore size of 1.0 μm under pressure to prepare inks 1 to 16. Each of Tables 2-A and 2-B also shows the contents of the pigment, the dispersant, water, the aggregation inhibiting substance, the water-soluble organic compounds and the poor medium, the ratio of the aggregation inhibiting substance relative to the pigment, the ratio of the poor medium relative to the aggregation inhibiting substance and the ratio of the poor medium relative to the pigment in each ink.",
        "TABLE 2-A\n\n\n\n\n\n\n\n\n\nink\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\npigment dispersion 1\n40.0\n40.0\n40.0\n40.0\n40.0\n40.0\n40.0\n40.0\n\n\npigment dispersion 2\n\n\nglycerin\n9.0\n9.0\n9.0\n6.5\n6.5\n9.0\n9.0\n6.5\n\n\nethylene glycol\n6.0\n6.0\n6.0\n4.0\n4.0\n6.0\n6.0\n4.0\n\n\npolyethylene glycol (*1)\n4.0\n4.0\n4.0\n4.0\n1.0\n4.0\n\n3.0\n\n\n1,5-pentanediol\n\n\n1,6-hexanediol\n\n\n1,2-pentanediol\n\n\n\n\n\n1.0\n\n\n1,2-hexanediol\n2.0\n6.0\n3.0\n2.0\n2.0\n1.0\n3.0\n3.0\n\n\npolyoxyethylene cetyl ether (*2)\n\n\nAcetylenol EH (*3)\n\n\n1.0\n\n\n\n1.0\n1.0\n\n\nwater\n39.0\n35.0\n37.0\n43.5\n46.5\n39.0\n41.0\n42.5\n\n\ncontent of pigment\n5.0\n5.0\n5.0\n5.0\n5.0\n5.0\n5.0\n5.0\n\n\ncontent of dispersant\n1.5\n1.5\n1.5\n1.5\n1.5\n1.5\n1.5\n1.5\n\n\ncontent of water\n72.5\n68.5\n70.5\n77.0\n80.0\n72.5\n74.5\n76.0\n\n\ncontent of aggregation inhibiting\n2.0\n6.0\n4.0\n2.0\n2.0\n2.0\n4.0\n4.0\n\n\nsubstance\n\n\ncontent of water-soluble organic\n21.0\n25.0\n22.0\n16.5\n13.5\n21.0\n18.0\n16.5\n\n\ncompounds\n\n\ncontent of poor medium\n6.0\n10.0\n7.0\n6.0\n3.0\n6.0\n3.0\n6.0\n\n\nratio of aggregation inhibiting\n0.4\n1.2\n0.8\n0.4\n0.4\n0.4\n0.8\n0.8\n\n\nsubstance relative to pigment\n\n\nratio of poor medium relative to\n3.0\n1.7\n1.8\n3.0\n1.5\n3.0\n0.8\n1.5\n\n\naggregation inhibiting substance\n\n\nratio of poor medium relative to\n1.2\n2.0\n1.4\n1.2\n0.6\n1.2\n0.6\n1.2\n\n\npigment\n\n\n\n\n\n(*1) average molecular weight 1,000\n\n\n(*2) BC-20TX (surfactant: available from NIKKO CHEMICALS Co., Ltd.)\n\n\n(*3) acetyleneglycol ethyleneoxide adduct (surfactant: available from KAWAKEN FINE CHEMICALS Co., Ltd.)",
        "TABLE 2-B\n\n\n\n\n\n\n\n\n\nink\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n9\n10\n11\n12\n13\n14\n15\n16\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\npigment dispersion 1\n40.0\n40.0\n40.0\n\n40.0\n40.0\n40.0\n40.0\n\n\npigment dispersion 2\n\n\n\n40.0\n\n\nglycerin\n9.0\n6.0\n10.0\n9.0\n9.0\n9.0\n9.0\n9.0\n\n\nethylene glycol\n6.0\n4.0\n7.0\n6.0\n6.0\n6.0\n6.0\n6.0\n\n\npolyethylene glycol (*1)\n\n\n\n4.0\n5.0\n4.0\n4.0\n4.0\n\n\n1,5-pentanediol\n\n5.0\n\n\n1,6-hexanediol\n\n\n5.0\n\n\n1,2-pentanediol\n\n\n1,2-hexanediol\n\n\n\n6.0\n2.0\n1.5\n7.0\n\n\npolyoxyethylene cetyl ether (*2)\n2.0\n2.0\n2.0\n\n\nAcetylenol EH (*3)\n\n\n\n\n\n\n\n1.0\n\n\nwater\n43.0\n43.0\n36.0\n35.0\n38.0\n39.5\n34.0\n40.0\n\n\ncontent of pigment\n5.0\n5.0\n5.0\n5.0\n5.0\n5.0\n5.0\n5.0\n\n\ncontent of dispersant\n1.5\n1.5\n1.5\n1.5\n1.5\n1.5\n1.5\n1.5\n\n\ncontent of water\n76.5\n76.5\n69.5\n68.5\n71.5\n73.0\n67.5\n73.5\n\n\ncontent of aggregation inhibiting\n2.0\n2.0\n2.0\n6.0\n2.0\n1.5\n7.0\n1.0\n\n\nsubstance\n\n\ncontent of water-soluble organic\n15.0\n15.0\n22.0\n25.0\n22.0\n20.5\n26.0\n19.0\n\n\ncompounds\n\n\ncontent of poor medium\n0.0\n5.0\n5.0\n10.0\n7.0\n5.5\n11.0\n4.0\n\n\nratio of aggregation inhibiting\n0.4\n0.4\n0.4\n1.2\n0.4\n0.3\n1.4\n0.2\n\n\nsubstance relative to pigment\n\n\nratio of poor medium relative to\n0.0\n2.5\n2.5\n1.7\n3.5\n3.7\n1.6\n4.0\n\n\naggregation inhibiting substance\n\n\nratio of poor medium relative to\n0.0\n1.0\n1.0\n2.0\n1.4\n1.1\n2.2\n0.8\n\n\npigment\n\n\n\n\n\n(*1) average molecular weight 1,000\n\n\n(*2) BC-20TX (surfactant: available from NIKKO CHEMICALS Co., Ltd.)\n\n\n(*3) acetyleneglycol ethyleneoxide adduct (surfactant: available from KAWAKEN FINE CHEMICALS Co., Ltd.)",
        "[Evaluation]",
        "(1) Ejection Stability",
        "Each of the obtained inks as listed above was loaded in an ink jet recording apparatus BJF900 (trade name, available from Canon) and used for printing a solid pattern of 19 cm×26 cm on 300 A4-size sheets. A nozzle check pattern was printed after the 200-th sheet and also after the 300-th sheet and the obtained nozzle check patterns were visually observed. The criteria of evaluation of ejection stability are listed below. Table 3 shows the results of the evaluation.",
        "A: The check pattern was not disturbed and normally printed.",
        "B: The check pattern was slightly disturbed but no ejection failure was observed.",
        "C: The check pattern was clearly disturbed and ejection failure was observed on the check pattern, so normal printing could not be conducted.",
        "(2) Deposits",
        "Each of the obtained inks as listed above was loaded in an ink jet recording apparatus BJF900 (trade name, available from Canon) and used for printing a solid pattern of 19 cm×26 cm on 300 A4-size sheets. The recording head was taken out from the ink jet recording apparatus after printing on the 200-th sheet and also after printing on the 300-th sheet and the inside of the nozzle was observed through an optical microscope. The criteria of evaluation of deposits are listed below. Table 3 shows the results of the evaluation.",
        "A: Practically no deposits were found.",
        "B: Deposits were found a little on the nozzle wall.",
        "C: Deposits were found everywhere in the nozzle.",
        "(3) Storage Stability",
        "Each of the obtained inks was put into an enclosed container and stored in a thermostatic bath at 60° C. for 30 days. Subsequently, the enclosed container was taken out and the ink in the inside was cooled to the room temperature and diluted with pure water by 2,000 times (by mass). The absorbance of the obtained diluted liquid was observed by means of a spectrophotometer U-3300 (trade name, available from Hitachi Ltd.). The rate of change in the absorbance after the storage at 60° C. for 30 days was determined by the formula shown below. The criteria of evaluation of storage stability are also listed below. Table 3 shows the results of the evaluation.\n\nrate of change in absorbance=(absorbance before storage−absorbance after storage)/absorbance before storage×100 (%)",
        "A: The rate of change in absorbance is less than 2%.",
        "B: The rate of change in absorbance is 2% or more to less than 3%.",
        "C: The rate of change in absorbance is 3% or more.",
        "TABLE 3\n\n\n\n\n\n\n\n\n\n\nComp.\n\n\n\nExamples\nExamples\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n1\n2\n3\n\n\n\n\n\n\n\n\n\nink\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nejection\n200-\nA\nA\nA\nA\nA\nA\nB\nA\nA\nA\nA\nA\nA\nB\nB\nB\n\n\nstability\nth\n\n\n\nsheet\n\n\n\n300-\nA\nA\nA\nA\nB\nA\nB\nA\nB\nA\nB\nA\nA\nB\nB\nB\n\n\n\nth\n\n\n\nsheet\n\n\ndeposits\n200-\nA\nA\nA\nA\nA\nA\nA\nA\nB\nA\nA\nA\nA\nC\nB\nC\n\n\n\nth\n\n\n\nsheet\n\n\n\n300-\nB\nB\nB\nA\nB\nB\nB\nA\nB\nA\nB\nB\nB\nC\nB\nC\n\n\n\nth\n\n\n\nsheet\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nstorage\nA\nB\nA\nA\nA\nA\nA\nA\nB\nA\nA\nA\nA\nA\nC\nB\n\n\nstability",
        "The extent of appearance of deposits after printing on the 300-th sheet of Ink 5 is slightly more than the extent of appearance of deposits after printing on the 300-th sheet of Ink 1.",
        "This application claims the priority from each of Japanese Patent Application No. 2005-010306 filed Jan. 18, 2005, Japanese Patent Application No. 2005-101308 filed Jan. 18, 2005 and Japanese Patent Application No. 2005-010309 filed Jan. 18, 2005, which are hereby incorporated by reference herein."
    ],
    "citations": [
        "5364461",
        "5620793",
        "5782967",
        "6036307",
        "6132501",
        "6136081",
        "6188850",
        "6214963",
        "6221141",
        "6342095",
        "6387168",
        "6398355",
        "6435658",
        "6474803",
        "6530656",
        "6540329",
        "6552156",
        "6582070",
        "6676254",
        "6698876",
        "6706104",
        "6706105",
        "6723137",
        "6848781",
        "6929362",
        "6932465",
        "6935732",
        "6976755",
        "7005461",
        "7128779",
        "7141105",
        "7144449",
        "7185978",
        "7195340",
        "7195665",
        "7201794",
        "7208032",
        "7208033",
        "7244299",
        "2003/0097960",
        "2003/0189626",
        "2004/0016367",
        "2004/0059020",
        "2004/0069183",
        "2004/0099182",
        "2004/0244622",
        "2005/0005818",
        "2005/0007436",
        "2005/0039632",
        "2005/0088501",
        "2005/0204955",
        "2005/0219341",
        "2006/0007288",
        "2006/0007289",
        "2006/0012657",
        "2006/0014855",
        "2006/0089424",
        "2006/0096498",
        "2006/0098067",
        "2006/0098068",
        "2006/0100311",
        "2006/0103703",
        "2006/0103704",
        "2006/0125895",
        "2006/0125896",
        "2006/0137570",
        "2006/0139429",
        "2006/0142417",
        "2006/0152570",
        "2006/0194056",
        "2006/0194897",
        "2006/0196389",
        "2007/0029522",
        "2007/0034114",
        "2007/0097155",
        "2007/0097156",
        "2007/0112095",
        "2007/0134451",
        "7-157698",
        "9-165538",
        "10-158555",
        "2001-354888",
        "2004-107481",
        "2004-123866",
        "2004-168793",
        "2004-168794",
        "WO 2004/039899"
    ],
    "us_classification": "106 318",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "09",
            "subclass": "D",
            "main_group": "11",
            "subgroup": "00"
        }
    ]
}