{
    "title": "Stackable shelf",
    "abstract": "A blank for a stackable shelf and the shelf formed from it. The blank comprises a substantially rectangular shelf member having attached walls. Each of the sidewalls has an integral extension which extends into and is detachable from the shelf member. The height of the integral extension is greater than the height of the side wall. Each of the integral extensions has a transverse score line which divides the extension into an upper and a lower section. The height of the lower section is substantially equal to the height of said side wall.",
    "inventors": [
        "McClure"
    ],
    "document_number": "07296698",
    "publication_date": "20071120",
    "assignees": [
        "Weyerhaeuser Company"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A blank comprising",
            "components": [
                {
                    "component": "a substantially rectangular shelf member having side edges,",
                    "subcomponents": []
                },
                {
                    "component": "side walls, each of said side walls having an integral extension,",
                    "subcomponents": []
                },
                {
                    "component": "said side walls being attached to said side edges of said shelf member by score lines,",
                    "subcomponents": []
                },
                {
                    "component": "each of said side walls having a height which is perpendicular to said score line which attaches said side wall to said shelf member;",
                    "subcomponents": []
                },
                {
                    "component": "the heights of said side walls being substantially equal,",
                    "subcomponents": []
                },
                {
                    "component": "each said integral extension being formed in the shelf member by lines which allows each said integral extension to be detachable from said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "each of said integral extensions having a height which is perpendicular to the score line which attaches said side wall integral to said extension to said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "the height of said integral extension being greater than the height of said side wall,",
                    "subcomponents": []
                },
                {
                    "component": "each of said integral extensions having a transverse score line which divides said integral extension into an upper and a lower section, said score line being substantially parallel to said score line which attaches said integral extension to said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "said lower section having a height which is perpendicular to the score line which attaches said integral extension's side wall to said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "the height of said lower section being substantially equal to the height of said side wall.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The blank of claim 1 wherein said side wails extend from two opposed sides of said shelf member.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The blank of claim 2 wherein said integral extensions are aligned across said shelf member.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The blank of claim 2 wherein said extensions overlap in said shelf member.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The blank of claim 1 further comprising",
            "components": [
                {
                    "component": "each of said integral extensions having a second transverse score line which divides said upper section into an intermediate and an outer section, said score line being substantially parallel to said score lines which attach said side wall integral with said extension to said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "said intermediate section having a height which is perpendicular to the score line which attaches said integral extension's side wall to said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "the height of said intermediate section being substantially equal to the height of said side wall.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The blank of claim 1 further comprising",
            "components": [
                {
                    "component": "a support post formed in said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "said support post comprising",
                    "subcomponents": []
                },
                {
                    "component": "a substantially rectangular support member having an upper edge attached to said shelf member by a score line, and a side and lower edge that are detachable from said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "a substantially rectangular post member that is attached along a side edge to said support member by a score line,",
                    "subcomponents": []
                },
                {
                    "component": "said post member having a lower edge, a side edge opposite said score line between said post member and said support member, a top edge and a side edge that is in substantial alignment with said score line between said post member and said support member, said edges being detachable from said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "said post member having a notch in said opposite side edge, said notch being aligned with the score line between said lower support member and said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "whereby said shelf member will extend into said notch when said lower support member is rotated around said score line between said lower support member and said shelf member and said post member is rotated around said score line between said post member and said lower support member.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The blank of claim 6 wherein said detachable side, bottom and top edges of said lower support member and said post are formed by cut lines, cut and score lines or perforations.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The blank of claim 6 in which said lower edge of said post member is aligned with said lower edge of said support member.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The blank of claim 1 wherein said lines forming said integral extension in the shelf member are cut lines, cut and score lines or perforations.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A shelf stack comprising",
            "components": [
                {
                    "component": "a first shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "first side walls attached to said first shelf member by score lines and extending downwardly from said first shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "said first side walls having first integral extensions extending upwardly from said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "a second shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "second side walls attached to said second shelf member by score lines and extending downwardly from said second shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "said second side walls having second integral extensions extending upwardly from said second shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "said second side walls resting on said first shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "said second side walls being within said first integral extensions,",
                    "subcomponents": []
                },
                {
                    "component": "said first integral extensions extending above said second shelf member.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The shelf stack of claim 10 further comprising",
            "components": [
                {
                    "component": "each of said first and second integral extensions having a score line thereon,",
                    "subcomponents": []
                },
                {
                    "component": "said score line being located on said integral extension a distance above said shelf member a distance substantially equal to the height of said side walls.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The shelf stack of claim 11 further comprising",
            "components": [
                {
                    "component": "each of said first and second integral extensions having a second score line thereon,",
                    "subcomponents": []
                },
                {
                    "component": "said score line being located on said integral extension a distance above said shelf member a distance substantially equal to twice the height of said side walls.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The shelf stack of claim 10 further comprising",
            "components": [
                {
                    "component": "a support member attached to said shelf member by a score line and extending downwardly from said shelf member,",
                    "subcomponents": []
                },
                {
                    "component": "a post member attached to said support member by a score line and extending through an aperture in said shelf member",
                    "subcomponents": []
                },
                {
                    "component": "said post member having an angular relationship with said support member,",
                    "subcomponents": []
                },
                {
                    "component": "said shelf member extending into a notch in one side of said post member.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This is directed to a blank for a stackable shelf and the formed shelf.",
        "Some products, such as prepackaged meat or chicken, are shipped as units. It is necessary to have several layers of these units in a container. There usually are a plurality of units in each layer. The layers need to be separated so that the units in the lower layers are not crushed by the weight of the units in the upper layers.",
        "One embodiment of the present invention is a blank for a shelf which can separate these layers. Another embodiment is a stack of shelves formed from this blank. Another embodiment is a blank for a shelf which has an integral support post. Another embodiment is a stack of shelves formed from this blank.",
        "In use, the product units are placed on the bottom of a container and the shelf is placed over the units. The shelf has side walls that extend downwardly around the product and rest on the container bottom wall supporting the shelf. If the shelf has an integral post, the post will extend downwardly and rest on the container bottom wall supporting the shelf. If a separate support member is used, it will be placed on the container bottom wall supporting the shelf. Another layer of product units will be placed on the shelf. If there is a separate support member it will also be placed on the shelf. The next shelf will then be placed on the first shelf and be supported by its side walls and either the separate support member or the integral support post.",
        "The downwardly extending side walls have upward extensions which may act to guide the side walls of the next upper shelf into place, or as handles to pull a shelf from the container at the place of use.",
        "FIG. 1 is an isometric view showing the blank for an embodiment of the shelf.",
        "FIG. 2 is an isometric view showing the blank for a separate support member.",
        "FIGS. 3-7 are isometric views showing the formation of the separate support member and shelf and the stacking of the support members and shelves.",
        "FIG. 8 is an isometric view showing the underside of the shelf with a separate support member in place.",
        "FIG. 9 is an isometric cutaway view of a container with the shelves and separate support members in place.",
        "FIG. 10 is an isometric view showing the blank for another embodiment of the shelf.",
        "FIGS. 11-13 are isometric views showing the formation and stacking of the shelves.",
        "FIG. 14 is an isometric view showing the underside of this embodiment.",
        "FIG. 15 is an isometric cutaway view of a container with the shelves of FIG. 10 in place.",
        "FIG. 16 is an isometric view a blank showing another embodiment of the shelf.",
        "FIGS. 17-19 are isometric views showing the formation and stacking of the shelves.",
        "FIG. 20 is an isometric cutaway view of a container with the shelves of FIG. 17 in place.",
        "In FIG. 1 the shelf blank 10 has a central shelf member 12 and four side walls 14a-d attached and hinged to the central shelf member 12 by score lines 16a-d. Each of the side walls 14a-d has an outer bottom edge 18 and side edges 20 and 20′. The height of each of the side walls 14, the distance between the score line 16 and the bottom edge 18, is substantially equal so that each of the bottom edges 18 can provide support for the shelf member 12 in the erected shelf. The side edges 20 and 20′ of each side wall 14 are separated from the side edges 20 or 20′ of an adjacent side wall 14. In one embodiment the side edges 20 and 20′ of a side wall 14 are substantially aligned with the score lines 16 of the adjacent side walls. In another embodiment they are beveled inwardly from the line of score lines 16.",
        "The side walls 14a-d have integral inward extensions 22a-d which are detachable from the central shelf member 12 by lines 24. Lines 24 can be cut lines, cut and score lines or perforations. A transverse score line 26 extends across extension 22 and divides it into a lower section 28 and an upper section 30. The score line 26 of an extension 22 is substantially parallel to the score lines 16 which attach the side wall 14 integral the extension 22 to the shelf member 12. The perpendicular distance between the score line 26 and the score line 16 is substantially equal to the perpendicular distance between the score line 16 and the bottom edge 18.",
        "The shelf member 12 has a pair of elements 32 which surround the upper section 30. These elements 32 are formed by lines 34 and a cut line 36. The lines 34 can be cut lines, score lines, cut and score lines or perforations. These elements 32 allow the upper sections 30 to be grasped and rotated upwardly to detach the extension 22 from the shelf member 12 when forming the shelf.",
        "FIG. 1 also shows the blank for one style of separate support member. An H style support member is shown. Any type of separate support member can be used. The blank 40 is divided into three sections by transverse score lines 42. The blank is also divided into two halves by a central longitudinal score line 44 extending between the score lines 42, and central longitudinal cut lines 46 which are aligned with and extend from the score lines 42 to the outer edges 48 of the blank.",
        "The H support member is formed by folding the blank 40 around the longitudinal score line 44 and bending the end sections 50 outwardly around the score lines 42 to form the support member 52. This is shown in FIG. 2. The height of the support member is substantially equal to the height of the side walls.",
        "A shelf 60 is formed by rotating each of the extensions 22 upwardly around score lines 16, detaching the extensions 22 from the shelf member 12. The inward extensions of the blank become upward extensions in the formed shelf. The side walls 14 then extend downwardly from the shelf member 12. This is shown in FIG. 3.",
        "In using the stacking shelf, the product units and the separate support member 52 are placed on the bottom of the container 62. The shelf 60 is formed and placed over the product units and the separate support member 52. The shelf member 12 is held above the product units by the side walls 14 and the separate support member 52. Another layer of product units and another separate support member 52 are placed on the shelf member 12. When the top of the container is reached, the upper sections 30 are bent downwardly around the score lines 26 to allow the top of the container to be closed.",
        "Two shelves 60 are shown. The actual number of shelves 60 will depend on the height of the container and the height of the side walls 14.",
        "Another embodiment is shown in FIGS. 10-15. This embodiment uses an integral support post. Except for the support post, the reference numerals for the shelf and the relationship among elements of the shelf are the same as for the first embodiment.",
        "For example, the blank has a shelf member 12′, side walls 14a′-14d′, inward extensions 22a′-22d having lower sections 28a′-28d′ and upper sections 30a′-30d′, and the dimensional relationships between the score lines and edges are the same as in the first embodiment.",
        "The support post 70 is formed of a support member 72 and a post member 74. The members 72 and 74 are attached by score line 76 and the support member is attached to the shelf member 12 by score line 78. The edges 80, 82, 84, 86 and 88 of members 72 and 74 are formed by cut lines, cut and score lines or perforations in shelf member 12. The support member 72 and post member 74 can be detached from the shelf member 12 along these edges. An aperture 90 is formed at edge 86 to allow the post member 74 to be grasped and rotated upwardly around score line 78. A notch 92 is formed in edge 84. The notch is aligned with score line 78.",
        "The support post 70 is formed by grasping the post member 74 at edge 86 and rotating the member 74 upwardly around score line 78. If necessary, the edges 80-88 are detached from shelf member 12 prior to rotating the member 74 upwardly. Otherwise, the edges will detach during the rotating process. The post member is then bent inwardly around score line 76 and the post member is fixed in place by fixing the notch 92 to the shelf member 12. The post member 74 extends through the aperture 98 formed by the post when it is detached from the shelf member 12. The post member 74 has a lower post section 94 and an upper post section 96. In some embodiments, in the erected shelf 60′ the lower edge 82 of the lower post section 94 is substantially aligned with bottom edge 18 of the side walls 14. In some embodiment of the erected shelf 60′ the upper edge 86 of the upper post section 96 is aligned with the score lines 26′. In other embodiments of the erected shelf 60′ the upper edge 86 is below the plane of the score lines 26′.",
        "In some embodiments the height of the lower support member, the distance between the score line 78 and the edge 82, is substantially equal to the height of the side walls 14.",
        "In using the stacking shelf, the product units are placed in the bottom of the container 62′. The shelf 60′ is formed and placed over the product units. The lower post section 94 and the support member 72 are among the product units and rest on the bottom of the container. The bottom edges 18′ of the side walls 14′ of the shelf 60′ rest on the bottom of the container Another layer of product units is placed on the shelf member 12′ of the shelf 60′ and another shelf 60′ is placed over the product units. When the top of the container is reached, the upper sections 30′ are bent downwardly around the score lines 26′ to allow the top of the container to be closed.",
        "Three shelves 60′ are shown. The actual number of shelves 60′ will depend on the height of the container and the height of the side walls 14′.",
        "FIG. 16 illustrates other embodiments of the shelf. In certain containers there may be no need for a separate support member or a support post or four side walls.",
        "In FIG. 16 the shelf blank 100 has a central shelf member 102 and two opposed side walls 104a-b attached and hinged to the central shelf member 102 by score lines 106a-b. Each of the side walls 104a-d has an outer bottom edge 108 and side edges 110 and 110′. The height of each of the side walls 104, the distance between the score line 106 and the bottom edge 108, is substantially equal so that each of the bottom edges 108 can provide support for the shelf member 102 in the erected shelf In one embodiment the side edges 110 and 110′ of a side wall 104 are substantially aligned with the side edges 112 of shelf member 102. In another embodiment they are beveled inwardly from the line of side edges 112.",
        "FIG. 16 also illustrates another embodiment of the integral extension. The side walls 104a-b have integral inward extensions 114a-b which are detachable from the central shelf member 102 by lines 116. Lines 116 can be cut lines, cut and score lines or perforations. A transverse score line 118 extends across extension 114 and divides it into a lower section 120 and an upper section 122. A second transverse score line 124 extends across extension 114 and divides upper section 122 into an intermediate section 126 and an outer section 128. The score lines 118 and 124 are substantially parallel to the score lines 106. The perpendicular distance between the score line 118 and the score line 16 is substantially equal to the perpendicular distance between the score line 16 and the bottom edge 18. The perpendicular distance between the score line 118 and the score line 124 is also substantially equal to the perpendicular distance between the score line 16 and the bottom edge 18. The score line 118 is at the height of one erected shelf above shelf member 102 and the score line 124 is at the height of two erected shelves above shelf member 102.",
        "An additional embodiment of the extensions 114 is also illustrated. In the earlier illustrations the extensions 22 extending from opposed sides were aligned. In this illustration the extensions 114 from the opposed sides are not aligned. They also overlap in the shelf member 102.",
        "The shelf member 12 has a pair of elements 130 which surrounds the upper section 122. These elements 130 are formed by lines 132 and 134. The lines 130 can be cut lines, score lines, cut and score lines or perforations. The line 134 would normally be a cut line or a perforation. These elements 130 allow the extension 114 to be grasped and rotated upwardly to detach the extension 114 from the shelf member 102 when forming the shelf 136.",
        "In using the stacking shelf, the product units are placed on the bottom of the container 138. The shelf 136 is formed and placed over the product units. The shelf member 12 is held above the product units by the side walls 104. Another layer of product units is placed on the shelf member 12. When the top of the container is reached, the upper section 122 of each extension 114 of the upper shelf 136 is bent downwardly around score line 118, and the outer section 128 of each extension 114 of the shelf 136 immediately below the upper shelf is bent downwardly around the score lines 124 to allow the top of the container to be closed.",
        "In one embodiment the blank is made from single or double wall corrugated board material. In another embodiment it can be made from single face corrugated material. In another embodiment it can be made of paperboard.",
        "The shelf members have been depicted as being substantially rectangular but it will be understood that substantially rectangular as used herein will include shelf members that are hexagonal in nature with beveled corners and shelf members with rounded corners.",
        "While several embodiments of the invention have been illustrated and described, it will be appreciated that various changes can be made therein without departing from the spirit and scope of the invention."
    ],
    "citations": [
        "2360218",
        "2908464",
        "3041029",
        "3115376",
        "3433401",
        "3480196",
        "4197788",
        "5000376",
        "5484241",
        "6457421"
    ],
    "us_classification": "211188",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "47",
            "subclass": "B",
            "main_group": "43",
            "subgroup": "00"
        }
    ]
}