{
    "title": "Process for production of a borohydride compound",
    "abstract": "A process for production of a borohydride compound. The process comprises the steps of: (a) combining a boron-containing salt, at least one of a metal and its hydride; wherein the metal is Be, Mg, Ca, Sr, Ba, Al, Ga, Si or a transition metal; and a solvent in which the borohydride compound is soluble; (b) grinding a mixture formed in step (a) to form the borohydride compound; and (c) separating a solution comprising the borohydride compound.",
    "inventors": [
        "Chin"
    ],
    "document_number": "07297316",
    "publication_date": "20071120",
    "assignees": [
        "Rohm and Haas Company"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A process for production of a borohydride compound; said process comprising steps of:",
            "components": [
                {
                    "component": "(a) combining a boron-containing salt, at least one member selected from the group consisting of a metal and its hydride; wherein the metal is Be, Mg, Ca, Sr, Ba, Al, Ga, Si or a transition metal; and a solvent in which the borohydride compound is soluble; to form a reaction mixture;",
                    "subcomponents": []
                },
                {
                    "component": "(b) grinding the reaction mixture formed in step (a) to form the borohydride compound; and",
                    "subcomponents": []
                },
                {
                    "component": "(c) separating a solution comprising the borohydride compound.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The process of claim 1 in which the solvent is selected from the group consisting of liquid ammonia, alkyl amines, heterocyclic amines, alkanolamines, alkylene diamines, glycol ethers, amide solvents, dimethyl sulfoxide and combinations thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The process of claim 2 in which the metal is Mg, Ca, La, Ti, Zr, Zn, Al or Si.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The process of claim 3 further comprising a catalyst selected from the group consisting of powders of the transition metals, and their oxides; oxides of aluminum and silicon; alloys of formula AB",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The process of claim 4 in which the borohydride compound is sodium borohydride.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A process for production of a borohydride compound; said process comprising steps of:",
            "components": [
                {
                    "component": "(a) combining a boron-containing salt, mineral oil and at least one member selected from the group consisting of a metal and its hydride; wherein the metal is Al, Si or a transition metal; to form a reaction mixture; and",
                    "subcomponents": []
                },
                {
                    "component": "(b) grinding the reaction mixture formed in step (a) to form the borohydride compound.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The process of claim 6 in which the metal is selected from the group consisting of La, Y, Sc, Ti, Zr, Zn, Al and Si.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The process of claim 7 further comprising a catalyst selected from the group consisting of: powders of the transition metals and their oxides; alloys of formula AB",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The process of claim 8 in which the borohydride compound is sodium borohydride.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A process for production of a borohydride compound; said process comprising steps of:",
            "components": [
                {
                    "component": "(a) combining a boron-containing salt and silicon to form a reaction mixture; and",
                    "subcomponents": []
                },
                {
                    "component": "(b) grinding the reaction mixture formed in step (a) to form the borohydride compound.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The process of claim 10 further comprising combining a mineral oil with the boron-containing salt and silicon to form the reaction mixture.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The process of claim 11 in which the borohydride compound is sodium borohydride.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The process of claim 12 further comprising a catalyst selected from the group consisting of powders of the transition metals and their oxides.",
            "components": []
        }
    ],
    "description": [
        "This is a non-provisional application of prior pending U.S. Provisional Application Ser. No. 60/561,381 filed on Apr. 12, 2004.",
        "This invention relates generally to a process for production of a borohydride compound from boron-containing salts and metals or metal hydrides.",
        "Production of sodium borohydride from sodium metaborate and alkali metal hydrides or alkaline earth hydrides or aluminum hydride is described in U.S. Pat. No. 3,140,150. An equation describing the reaction for magnesium hydride is as follows:\n\nNaBO2+2MgH2→NaBH4+2MgO\n\nIt is also known in the prior art to react sodium borate salts, aluminum and hydrogen to produce sodium borohydride, as follows:\n\n3NaBO2+4Al+6H2→3NaBH4+2Al2O3\n\nHowever, elevated temperatures and pressures typically are required in the prior art processes. Moreover, the number of disclosed metals and metal hydrides is limited.",
        "The problem addressed by this invention is to find an efficient and economical process for production of a borohydride compound from boron-containing salts and metals or metal hydrides.",
        "The present invention is directed to a process for production of a borohydride compound. The process comprises the steps of: (a) combining a boron-containing salt, at least one of a metal and its hydride; wherein the metal is Be, Mg, Ca, Sr, Ba, Al, Ga, Si or a transition metal; and a solvent in which the borohydride compound is soluble; (b) grinding a mixture formed in step (a) to form the borohydride compound; and (c) separating a solution comprising the borohydride compound.",
        "The present invention is further directed to a process for production of a borohydride compound. The process comprises the steps of: (a) combining a boron-containing salt, and at least one of a metal and its hydride; wherein the metal is Al, Si or a transition metal; and (b) grinding a mixture formed in step (a) to form the borohydride compound.",
        "All percentages are weight percentages based on the entire composition described, unless specified otherwise. A “transition metal” is any element in groups 3 to 12 of the IUPAC periodic table, i.e., the elements having atomic numbers 21-30, 39-48, 57-80 and 89-103. A “boron-containing salt” is an acid or salt containing a complex anion of boron, preferably a complex anion containing only boron and oxygen. Most preferably, a boron-containing salt is an acid or salt containing a B4O7−2 or BO2−1 ion, preferably the sodium salt. Preferably, the borohydride compound is sodium, potassium or calcium borohydride; most preferably sodium borohydride; and the boron-containing salt is a sodium salt. If a sodium salt of a boron compound having unequal molar amounts of sodium and boron, e.g., Na2B4O7 is used as the boron-containing salt, preferably sodium hydroxide is added to provide the preferred Na:B molar ratio of 1:1.",
        "In those embodiments using a solvent, suitable solvents are those in which the borohydride compound is soluble and which are relatively unreactive with borohydride, and with the metal and/or metal hydride used. A solvent in which the borohydride compound is soluble is one in which the borohydride compound is soluble at least at the level of 2%, preferably, at least 5%. Preferred solvents include liquid ammonia, alkyl amines, heterocyclic amines, alkanolamines, alkylene diamines, glycol ethers, amide solvents (e.g., heterocyclic amides and aliphatic amides), dimethyl sulfoxide and combinations thereof. Preferably, the solvent is substantially free of water, e.g., it has a water content less than 0.5%, more preferably less than 0.2%. Especially preferred solvents include ammonia, C1-C4 alkyl amines, pyridine, 1-methyl-2-pyrrolidone, 2-aminoethanol, ethylene diamine, ethylene glycol dimethyl ether, diethylene glycol dimethyl ether, triethylene glycol dimethyl ether, tetraethylene glycol dimethyl ether, dimethylformamide, dimethylacetamide, dimethylsulfoxide and combinations thereof. Preferably, the metal oxide produced in the reaction is substantially insoluble in the solvent. Preferably, the solubility of the metal oxide is less than 0.1%. Use of a solvent also allows the reaction to be run more easily as a continuous process. Moreover, the solvent facilitates heat transfer, thereby minimizing hot spots and allowing better temperature control. Recycle of the solvent is possible to improve process economics. In another embodiment of the invention, a mineral oil is used as the solvent to allow higher reaction temperatures. Separation of the borohydride compound from the oil may be accomplished via an extraction process after the oil is removed from the reactor.",
        "The method of this invention uses at least one of a metal and its hydride, i.e., one or more metals may be present, one or more metal hydrides may be present, or a combination of metals and metal hydrides may be present. The term “metal hydride” refers only to a simple metal hydride which is a compound of a single metal and hydrogen, and not to complex hydrides, e.g., lithium aluminum hydride. The metals and metal hydrides are selected from Be, Mg, Ca, Sr, Ba, Al, Ga, Si and the transition metals. Preferably, the metals and metal hydrides are selected from Be, Mg, Ca, Sc, Y, La, Ti, Zr, V, Cr, Mn, Fe, Co, Ni, Cu, Zn, Al and Si. More preferably, the metals and metal hydrides are selected from Mg, Ca, La, Ti, Zr, Zn, Al and Si. In one preferred embodiment, the metals and metal hydrides are selected from Mg, Ca, Zn, Al and Si, preferably as the metal rather than the metal hydride. In another embodiment of the invention, elements are chosen to maximize reaction efficiency. For example, the general reactions of sodium metaborate with metals, M, or their hydrides, MxHy, are as shown below:\n\nNaBO2+4x/y M+2H2→NaBH4+4/y MxOy/2\n\nNaBO2+4/y MxHy→NaBH4+4/y MxOy/2\n\nReaction efficiency would be maximized by selecting metals for which the ratio x/y is minimized; for example, the metals and/or metal hydrides of La, Y, Sc, Ti, Zr, Al and Si.",
        "Grinding of the reactants will accelerate the reaction, and may be achieved using any method which applies energy to solid particles to induce a mechanochemical reaction, especially any method which reduces solids to the micron size range, preferably the sub-micron size range, and continually exposes fresh surfaces for reaction, e.g., impact, jet or attrition milling. Preferred methods include ball milling, vibratory (including ultrasonic) milling, air classifying milling, universal/pin milling, jet (including spiral and fluidized jet) milling, rotor milling, pearl milling. Especially preferred methods are planetary ball milling, centrifugal ball milling, and similar types of high kinetic energy rotary ball milling. Preferably, milling is performed in either a hydrogen atmosphere, or an inert atmosphere, e.g., nitrogen. In an embodiment in which a solvent is used, grinding of the reactants may be achieved using any method suitable for grinding a slurry.",
        "Another method to accelerate the reaction is to use radiation techniques alone or in combination with reactive milling. For example, microwave irradiation can direct energy at specific reaction surfaces to provide rapid heating and deep energy penetration of the reactants. Microwave absorbers such as metal powders, which could be used as milling media, and dipolar organic liquids may also be added to the reaction system to promote the reaction. The advantage of these techniques is that high reaction rates may occur at considerably lower processing temperature than could be obtained with resistive heating thermal techniques.",
        "Without being bound by theory, it is believed that methods allowing use of a lower reaction temperature are beneficial, as the reaction equilibrium becomes less favorable at higher temperatures. Preferably, the reaction temperature is less than 250° C., and more preferably less than 150° C., when the grinding is carried out without a solvent. When a solvent is used, the preferred reaction temperature is below the boiling point of the solvent at the pressure within the grinding equipment. Preferably, the pressure is in the range from 100 kPa to 7000 kPa, more preferably from 100 kPa to 2000 kPa.",
        "Materials that catalyze surface hydride formation from gas phase hydrogen can be used to further hydriding kinetics. Examples of suitable catalysts include powders of the transition metals, and their oxides, preferably La, Sc, Ti, V, Cr, Mn, Fe, Ni, Pd, Pt and Cu; oxides of silicon and aluminum, preferably alumina and silica; and AB2, AB5, AB, and A2B types of alloys, wherein A and B are transition metals, such as FeTi and LaNi5. A comprehensive list of hydriding alloys is given at the Sandia National Laboratory website at hydpark.ca.sandia.gov/.",
        "In one embodiment of the invention in which the boron-containing salt is combined with a metal, hydrogen gas is necessary, as shown in the equations provided above. In this embodiment, the pressure of hydrogen preferably is from 100 kPa to 7000 kPa, more preferably from 100 kPa to 2000 kPa.",
        "After the reaction has proceeded substantially to completion, preferably the borohydride product is separated from the metal oxide byproducts. In one embodiment in which a solvent is used, the solvent is separated from the insoluble metal oxide product and any grinding medium, which also would be insoluble. The borohydride compound can then be separated from the solvent by conventional methods. For example, the borohydride compound-rich solvent can removed by filtering or using any other conventional solid-liquid separation device such as a centrifuge. The insoluble solid metal oxide is collected and dried. High purity borohydride compound can be recovered from the solvent phase by evaporating the solvent or by lowering temperature to crystallize or precipitate the borohydride compound product. The preferred method will depend on the solubility-temperature profile of the solvent selected. Additional solvent washes can be used to improve recovery and purity. The metal oxide can be reduced back to the metal in a subsequent step to develop a recycle loop for the process.",
        "The liquid stream can also be withdrawn during the course of the reaction to remove the borohydride compound and the solvent returned to the reactor to lower the reactor borohydride compound content and drive the reaction further to completion. As such, reactions that may be equilibrium constrained may be enhanced for higher yields. The formation of borohydride is also highly exothermic. By cooling the solvent return stream to the reactor, a means for controlling reaction temperature is also provided. For example, the withdrawn solvent will be at the reactor temperature. If this stream is sufficiently cooled, borohydride compound crystals will form and can be removed using conventional methods as described above. The cooled solvent of lower borohydride compound content is returned to the reactor to maintain reactor temperature at the target condition."
    ],
    "citations": [
        "2534533",
        "3002806",
        "3077376",
        "3140150",
        "3151945",
        "3164441",
        "3471268",
        "3473899",
        "3505035",
        "6251349",
        "2004/0191152",
        "2005/0207959",
        "2006/0013753",
        "1 053 476",
        "2002-193604"
    ],
    "us_classification": "423286",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "01",
            "subclass": "B",
            "main_group": "35",
            "subgroup": "00"
        }
    ]
}