{
    "title": "Surfactant-free cosmetic, dermatological and pharmaceutical agents",
    "abstract": "The invention provides a surfactant-free cosmetic, dermatological, and pharmaceutical agents comprising at least one copolymer obtainable by free-radical copolymerization of",
    "inventors": [
        "Löffler",
        "Morschhäuser"
    ],
    "document_number": "07297328",
    "publication_date": "20071120",
    "assignees": [
        "Clariant Produkte (Deutschland) GmbH"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A surfactant-free cosmetic, dermatological or pharmaceutical composition which is free of surfactant and comprises at least one copolymer obtained by free-radical copolymerization of",
            "components": [
                {
                    "component": "A) acryloyldimethyltaurine and/or acryloyldimethyltaurates,",
                    "subcomponents": []
                },
                {
                    "component": "B) optionally, one or more further olefinically unsaturated, noncationic comonomer which has at least one oxygen, nitrogen, sulfur or phosphorus atom and possess a molecular weight of less than 500 g/mol,",
                    "subcomponents": []
                },
                {
                    "component": "C) optionally, one or more olefinically unsaturated, cationic comonomer which has at least one oxygen, nitrogen, sulfur or phosphorus atom and possess a molecular weight of less than 500 g/mol,",
                    "subcomponents": []
                },
                {
                    "component": "D) one or more silicon-containing component a) capable of free-radical polymerization and having a functionality of at least one, where at least one silicon-containing component a) is a compound selected from the formulae",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The surfactant-free cosmetic, dermatological or pharmaceutical composition as claimed in claim 1 , wherein the comonomer B) is selected from the group consisting of unsaturated carboxylic adds, salts of unsaturated carboxylic acids, anhydrides of unsaturated carboxylic acids, esters of unsaturated carboxylic acids with aliphatic, olefinic, cycloaliphatic, arylaliphatic or aromatic alcohols having 1 to 22 carbon atoms, open-chain N-vinyl amides, cyclic N-vinyl amides having a ring size of from 3 to 9, amides of acrylic acid, amides of methacrylic acid, amides of substituted acrylic acids, amides of substituted methacrylic acids, 2-vinylpyridine, 4-vinylpyridine, vinyl acetate; styrene, acrylonitrile, vinyl chloride, vinylidene chloride, tetrafluoroethylene, vinylphosphonic acid or the esters or salts thereof, vinylsulfonic acid or the esters or salts thereof, allylphosphonic acid or the esters or salts thereof methallyisulfonic acid or the esters or salts thereof, and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The surfactant-free cosmetic, dermatological or pharmaceutical composition as claimed in claim 1 , wherein the comonomer C) are selected from the group consisting of",
            "components": [
                {
                    "component": "diallyldimethylammonium chloride (DADMAC).",
                    "subcomponents": []
                },
                {
                    "component": "[2-(methacryloyloxy)ethyl]trimethylammonium chloride (MAPTAC),",
                    "subcomponents": []
                },
                {
                    "component": "[2-(acryloyloxy)ethyl]trimethylammonium chloride,",
                    "subcomponents": []
                },
                {
                    "component": "[2-methacrylamidoethyl]trimethylammonium chloride,",
                    "subcomponents": []
                },
                {
                    "component": "[2-(acrylamido)ethyl]trimethylammonium chloride,",
                    "subcomponents": []
                },
                {
                    "component": "N-methyl-2-vinylpyridinium chloride,",
                    "subcomponents": []
                },
                {
                    "component": "N-methyl-4-vinylpyridinium chloride,",
                    "subcomponents": []
                },
                {
                    "component": "dimethylaminoethyl methacrylate,",
                    "subcomponents": []
                },
                {
                    "component": "dimethylaminopropylmethacrylamide,",
                    "subcomponents": []
                },
                {
                    "component": "methacryloylethyl N-oxide,",
                    "subcomponents": []
                },
                {
                    "component": "methacryloylethylbetaine, and mixtures thereof.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , wherein the fluorine-containing component E) is a compound of the formula (II)",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                },
                {
                    "component": "where",
                    "subcomponents": []
                },
                {
                    "component": "R",
                    "subcomponents": [
                        "Y is a chemical bridge, and"
                    ]
                },
                {
                    "component": "Y is a chemical bridge, and",
                    "subcomponents": []
                },
                {
                    "component": "r, s are stoichiometric coefficients which independently of one another are numbers between 0 and 200.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , wherein the macromonomer F) is a compound of the formula (Ill)",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                },
                {
                    "component": "where R",
                    "subcomponents": []
                },
                {
                    "component": "Y is a bridging group;",
                    "subcomponents": []
                },
                {
                    "component": "A, B, C, and D independently of one another are discrete chemical repeating units, v, w, x, and z independently of one another amount to from 0 to 500, the sum of v, w, x, and z being on average ≧1; and",
                    "subcomponents": []
                },
                {
                    "component": "R",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 wherein the polymeric additives G) is selected from the group consisting of polyalkylene glycol; alkylpolyglycol; and mixtures thereof or a homopolymer or copolymer of a compound selected from the group consisting of N-vinylformamide, N-vinylacetamide, N-vinylpyrrolidone, ethylene oxide, propylene oxide, acryloyldimethyltaurine, N-vinylcaprolactam, N-vinylmethylacetamide, acrylamide, acrylic acid, methacrylic acid, N-vinylmorpholide, hydroxymethyl methacrylate, diallyldimethylammonium chloride (DADMAC), and [2-(methacryloyloxy)ethyl]trimethylammonium chloride (MAPTAC); and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , wherein the copolymerization takes place in the presence of at least one polymeric additive G).",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , wherein the copolymers are crosslinked.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , wherein the copolymers are prepared by precipitation polymerization in tert-butanol.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , wherein the copolymers are water-soluble or water-swellable.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , which comprises, based on the finished composition, from 0.01 to 10% by weight of the copolymers.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , which has a pH of from 2 to 12.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , containing up to 70% by weight, of organic solvents, based on a finished composition.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The surfactant-free cosmetic, dermatological or pharmaceutical composition as claimed in claim 13 , wherein the organic solvents are selected from the group consisting of monohydric alcohols, polyhydric alcohols, propylene glycol esters, sorbitol and Its derivatives, glycol ethers, propylene glycol ethers, and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , containing, based on a finished composition having an oil phase, up to 95% by weight, of the oil phase.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The surfactant-free cosmetic, dermatological or pharmaceutical composition as claimed in claim 15 , wherein the oil phase comprises one or more oils selected from the group consisting of silicone oils, phenylsilicones, silicone resins, silicone gums, mineral oils, paraffin oils, vaseline oil, oils of animal origin, oils of plant origin, synthetic oils, linear and/or branched fatty alcohols, and linear and/or branched fatty acid esters, waxes, fluorinated oils, perfluorinated oils, and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 1 , which is an emulsion or suspension.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 4 wherein, R",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 4 , wherein the chemical bridge Y is selected from the group consisting of —O—, —C(O)—, —C(O)—O—, —S—, —O—CH",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 4 wherein, R",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 5 , wherein Y is a bridging group selected from the group consisting of —O—, —S—, —C(O)—, —C(O)—O—, —O—CH",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 5 wherein the discrete repeating units of A, B, C, and D are originating from a unit selected from the group consisting of acrylamide, methacrylamide, ethylene oxide, propylene oxide, AMPS, acrylic acid, methacrylic acid, methyl methacrylate, acrylonitrile, maleic acid, vinyl acetate, styrene, 1,3-butadiene, isoprene, isobutene, diethylacrylamide, and diisopropylacrylamide.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 5 wherein the discrete repeating units of A, B, C, and D are originating from a unit of ethylene oxide or propylene oxide.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 5 , wherein v, w, x, and z independently of one another amount to from 1 to 30.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 5 wherein, R",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The surfactant-free cosmetic, dermatological or pharmaceutical of claim 14 , which contains from 2 to 50% by weight of the oil phase.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. A surfactant-free cosmetic, dermatological or pharmaceutical composition which is free of surfactant and comprises at least one copolymer obtained by free-radical copolymerization of acryloyldimethyltaurine and/or acryloyldimethyltaurates, and",
            "components": [
                {
                    "component": "one or more silicon-containing component a) capable of free-radical polymerization and having a functionality of at least one, where at least one silicon-containing component a) is a compound selected from the formulae",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The acidic cosmetic, dermatological or pharmaceutical composition of claim 27 , wherein said copolymerization further comprises a component selected from the group consisting of",
            "components": [
                {
                    "component": "b) one or more fluorine-containing component capable of free-radical polymerization and having a functionality of at least one,",
                    "subcomponents": []
                },
                {
                    "component": "c) one or more olefinically mono- or polyunsaturated, macromonomer each possessing at least one oxygen, nitrogen, sulfur or phosphorus atom and having a number-average molecular weight of greater than or equal to 200 g/mol, the macromonomer not being the silicon-containing component a) or the fluorine-containing component b),",
                    "subcomponents": []
                },
                {
                    "component": "d) at least one polymeric additive having number-average molecular weights of from 200 g/mol to 10",
                    "subcomponents": []
                },
                {
                    "component": "e) one or more further olefinically unsaturated, noncationic comonomer which have at least one oxygen, nitrogen, sulfur or phosphorus atom and possess a molecular weight of less than 500 g/mol,",
                    "subcomponents": []
                },
                {
                    "component": "f) one or more olefinically unsaturated, cationic comonomer which has at least one oxygen, nitrogen, sulfur or phosphorus atom and possess a molecular weight of less than 500 g/mol, and a mixture thereof.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 28 , wherein said macromonomer c) is crosslinking.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The surfactant-free cosmetic, dermatological or pharmaceutical composition of claim 28 , wherein said olefinically unsaturated, noncationic comonomer e) is crosslinking.",
            "components": []
        }
    ],
    "description": [
        "The present invention relates to surfactant-free cosmetic, pharmaceutical, and dermatological compositions comprising comb copolymers based on acryloyldimethyltaurine.",
        "The cosmetic or dermatological compositions in use at the present time mostly take the form of oil-in-water emulsions (i.e., a system composed of a continuous aqueous phase and a discontinuous, dispersed oil phase) or of water-in-oil emulsions (i.e., a system composed of a continuous, fat-containing phase and a discontinuous, dispersed aqueous phase).",
        "The water-in-oil emulsions therefore include a continuous oil phase and allow a fatty film to form at the skin surface that prevents transepidermal water loss and protects the skin against external aggressions. These emulsions are particularly suitable for protecting and enriching the skin and, in particular, for treating dry skin. The oil-in-water emulsions, for their part, impart to the skin upon application a soft, less greasy and more gentle feel than the water-in-oil emulsions.",
        "The emulsions are generally stabilized by incorporation of emulsifying surfactants of the oil-in-water (O/W) or water-in-oil (W/O) type which by virtue of their amphiphilic structure are located at the oil/water interface and so stabilize the dispersed droplets. It is generally necessary to add these surfactants in a considerable amount—up to 10% by weight with regard to the overall weight of the emulsion—in order to obtain an appropriate stability.",
        "These amphiphilic surfactants used in large quantity, however, may trigger an irritant effect toward the skin, eyes and/or scalp of the user. Furthermore, their use at high concentrations may lead to cosmetically unwanted effects, such as a rough, sticky and/or viscous sensation, and may give rise to a compact, heavy substance. Furthermore, the surfactants have to be selected as a function of the polarity of the oils and are therefore compatible only with a limited number of oils, thereby acryloyidimethyltaurate-based thickener systems display outstanding properties in pH ranges below pH 6.0, i.e., within a pH range in which it is no longer possible to operate with conventional poly(meth)acrylate thickeners.",
        "A disadvantage of these acryloyldimethyltaurate-based thickener systems, however, is that stable emulsions are generally only achievable in the presence of additional surfactant coemulsifiers.",
        "There is therefore a need for surfactant-free cosmetic, decorative, and pharmaceutical compositions which are easy to prepare, possess outstanding rheological and sensorial properties and stability, and are stable particularly in the acidic pH range.",
        "Surprisingly it has now been found that a new class of copolymers based on acryloyidimethyltaurine (AMPS)—and suitable in the capacity of a thickener, bodying agent, emulsifier, dispersant and/or stabilizer—are outstandingly suitable for the formulation of acidic cosmetic, pharmaceutical, and dermatological compositions.",
        "The invention accordingly provides surfactant-free cosmetic, dermatological, and pharmaceutical compositions comprising at least one copolymer obtainable by free-radical copolymerization of\n\n    A) acryloyldimethyltaurine and/or acryloyldimethyltaurates,\n    B) if desired, one or more further olefinically unsaturated, noncationic, optionally crosslinking comonomers which have at least one oxygen, nitrogen, sulfur or phosphorus atom and possess a molecular weight of less than 500 g/mol,\n    C) if desired, one or more olefinically unsaturated, cationic comonomers which have at least one oxygen, nitrogen, sulfur or phosphorus atom and possess a molecular weight of less than 500 g/mol,\n    D) if desired, one or more silicon-containing components capable of free-radical polymerization and having a functionality of at least one,\n    E) if desired, one or more fluorine-containing components capable of free-radical polymerization and having a functionality of at least one,\n    F) if desired, one or more olefinically mono- or polyunsaturated, optionally crosslinking macromonomers each possessing at least one oxygen, nitrogen, sulfur or phosphorus atom and having a number-average molecular weight of greater than or equal to 200 g/mol, the macromonomers not being a silicon-containing component D) or fluorine-containing component E),\n    G) the copolymerization taking place if desired in the presence of at least one polymeric additive having number-average molecular weights of from 200 g/mol to 109 g/mol,\n    H) with the proviso that component A) is copolymerized with at least one component selected from one of the groups D) to G).",
        "The copolymers of the invention preferably possess a molecular weight of from 103 g/mol to 109 g/mol, more preferably from 104 to 107 g/mol, with particular preference from 5*104 to 5*106 g/mol.",
        "The acryloyldimethyltaurates can be the organic or inorganic salts of acryloyldimethyltaurine (acrylamidopropyl-2-methyl-2-sulfonic acid). Preference is given to the Li+, Na+, K+, Mg++, Ca++, Al+++and/or NH4+ salts. Likewise preferred are the monoalkylammonium, dialkylammonium, trialkylammonium and/or tetraalkylammonium salts, in which the alkyl substituents of the amines may independently of one another be (C1-C22)-alkyl radicals or (C2-C10)-hydroxyalkyl radicals. Preference is also given to mono- to triethoxylated ammonium compounds with different degrees of ethoxylation. It should be noted that mixtures of two or more of the abovementioned representatives are also embraced by the invention. The degree of neutralization of the acryloyldimethyltaurine can be between 0 and 100%, with particular preference being given to a degree of neutralization of more than 80%.",
        "Based on the total mass of the copolymers, the amount of acryloyldimethyltaurine and/or acryloyldimethyltaurates is at least 0.1% by weight, preferably from 20 to 99.5% by weight, more preferably from 50 to 98% by weight.",
        "As comonomers B) it is possible to use all olefinically unsaturated noncationic monomers whose reaction parameters allow copolymerization with acryloyl-dimethyltaurine and/or acryloyldimethyltaurates in the respective reaction media. Preferred comonomers B) are unsaturated carboxylic acids and their anhydrides and salts, and also their esters with aliphatic, olefinic, cycloaliphatic, arylaliphatic or aromatic alcohols having a carbon number of from 1 to 30.",
        "Particularly preferred unsaturated carboxylic acids are acrylic acid, methacrylic acid, styrenesulfonic acid, maleic acid, fumaric acid, crotonic acid, itaconic acid, and senecic acid.",
        "Preferred counterions are Li+, Na+, K+, Mg++, Ca++, Al+++, NH4+, monoalkyl-ammonium, dialkylammonium, trialkylammonium and/or tetraalkylammonium radicals, in which the alkyl substituents of the amines independently of one another can be (C1-C22)-alkyl radicals or (C2-C10)-hydroxyalkyl radicals. It is additionally possible to employ mono- to triethoxylated ammonium compounds with a different degree of ethoxylation. The degree of neutralization of the carboxylic acids can be between 0 and 100%.",
        "Further preferred comonomers B) are open-chain N-vinyl amides, preferably N-vinylformamide (VIFA), N-vinylmethylformamide, N-vinylmethylacetamide (VIMA) and N-vinylacetamide; cyclic N-vinyl amides (N-vinyl lactams) with a ring size of 3 to 9, preferably N-vinylpyrrolidone (NVP) and N-vinylcaprolactam; amides of acrylic and methacrylic acid, preferably acrylamide, methacrylamide, N,N-dimethyl-acrylamide, N,N-diethylacrylamide, and N,N-diisopropylacrylamide; alkoxylated acrylamides and methacrylamides, preferably hydroxyethyl methacrylate, hydroxy-methylmethacrylamide, hydroxyethylmethacrylamide, hydroxypropylmethacryl-amide, and mono [2-(methacryloyloxy)ethyl] succinate; N,N-dimethylamino methacrylate; diethylaminomethyl methacrylate; acrylamido- and methacrylamido-glycolic acid; 2- and 4-vinylpyridine; vinyl acetate; glycidyl methacrylate; styrene; acrylonitrile; vinyl chloride; stearyl acrylate; lauryl methacrylate; vinylidene chloride; and/or tetrafluoroethylene.",
        "Likewise suitable comonomers B) are inorganic acids and their salts and esters. Preferred acids are vinylphosphonic acid, vinylsulfonic acid, allylphosphonic acid, and methallylsulfonic acid.",
        "The weight fraction of the comonomers B), based on the total mass of the copolymers, can be from 0 to 99.8% by weight and is preferably from 0.5 to 80% by weight, more preferably from 2 to 50% by weight.",
        "Suitable comonomers C) include all olefinically unsaturated monomers with cationic charge which are capable of forming copolymers with acryloyldimethyl-taurine or its salts in the chosen reaction media. The resulting distribution of the cationic charges across the chains can be random, alternating, blocklike or gradientlike. It may be noted that the cationic comonomers C) also comprehend those which bear the cationic charge in the form of a betaine, zwitterionic or amphoteric structure.",
        "Comonomers C) for the purposes of the invention are also amino-functionalized precursors which can be converted by polymer-analogous reactions into their corresponding quaternary derivatives (e.g., reaction with dimethyl sulfate, methyl chloride), zwitterionic derivatives (e.g., reaction with hydrogen peroxide), betaine derivatives (e.g., reaction with chloroacetic acid), or amphoteric derivatives.",
        "Particularly preferred comonomers C) are\n\n    diallyldimethylammonium chloride (DADMAC),\n    [2-(methacryloyloxy)ethyl]trimethylammonium chloride (MAPTAC),\n    [2-(acryloyloxy)ethyl]trimethylammonium chloride,\n    [2-methacrylamidoethyl]trimethylammonium chloride,\n    [2-(acrylamido)ethyl]trimethylammonium chloride,\n    N-methyl-2-vinylpyridinium chloride,\n    N-methyl-4-vinylpyridinium chloride,\n    dimethylaminoethyl methacrylate,\n    dimethylaminopropylmethacrylamide,\n    methacryloylethyl N-oxide and/or\n    methacryloylethylbetaine.",
        "The weight fraction of the comonomers C), based on the total mass of the copolymers, can be from 0.1 to 99.8% by weight, more preferably from 0.5 to 30% by weight, and very preferably from 1 to 20% by weight.",
        "Suitable polymerizable silicon-containing components D) are all compounds which are olefinically at least monounsaturated and capable of free-radical copolymerization under the reaction conditions chosen in each case. The distribution of the individual silicone-containing monomers across the polymer chains which form need not necessarily be random. The invention also embraces the formation, for example, of blocklike (including multiblock) or gradientlike structures. Combinations of two or more different silicone-containing representatives are also possible. The use of silicone-containing components having two or more polymerization-active groups leads to the construction of branched or crosslinked structures.",
        "Preferred silicone-containing components are those of formula (I).\n\nR1-Z-[(Si(R3R4)—O—)w—(Si(R5R6)—Ox—]—R2  (I)",
        "In this formula R1 represents a polymerizable function from the group of the vinylically unsaturated compounds which is suitable for the synthesis of polymeric structures by a free-radical route. R1 represents preferably a vinyl, allyl, methallyl, methylvinyl, acryloyl (CH2═CH—CO—), methacryloyl (CH2═C[CH3]—CO—), crotonyl, senecionyl, itaconyl, maleyl, fumaryl or styryl radical.",
        "The attachment of the silicone-containing polymer chain to the reactive end group R1 requires a suitable chemical bridge Z. Preferred bridges Z are —O—, ((C1-C50)alkylene), —((C6-C30)arylene)-, —((C5-C8)cycloalkylene)-, —((C1-C50)alkenylene)-, -(polypropylene oxide)n-, -(polyethylene oxide)o-, -(polypropylene-oxide)n(polyethylene oxide)o-, where n and o independently of one another denote numbers from 0 to 200 and the distribution of the EO/PO units can be random or in the form of blocks. Further suitable bridge groups Z are —((C1-C10 )alkyl)-(Si(OCH3)2)— and —(Si(OCH3)2)—.",
        "The polymeric central moiety is represented by silicone-containing repeating units. The radicals R3, R4, R5, and R6 denote independently of one another —CH3, —O—CH3, —C6H5 or —O—C6H5.",
        "The indices w and x represent stoichiometric coefficients which amount independently of one another to from 0 to 500, preferably 10 to 250. The distribution of the repeating units across the chain can be not only purely random but also blocklike, alternating or gradientlike.",
        "R2 can first be an aliphatic, olefinic, cycloaliphatic, arylaliphatic or aromatic (C1 - C50) hydrocarbon radical (linear or branched) or —OH, —NH2, —N(CH3)2, —R7 or stand for the structural unit [-Z-R1]. The definition of the two variables Z and R1 has already been explained. R7 stands for further Si-containing groups. Preferred radicals R7are —O—Si(CH3)3, —O—Si(Ph)3, —O—Si(O—Si(CH3)3)2CH3) and —O—Si(O—Si(Ph)3)2Ph).",
        "If R2 is an element of the group [-Z-R1] the monomers in question are difunctional monomers which can be used to crosslink the polymer structures which form. Formula (I) describes not only silicone-containing polymer species with vinylic functionalization and a polymer-typical distribution, but also defined compounds having discrete molecular weights.",
        "Particularly preferred silicone-containing components are the following components with acrylic or methacrylic modification:",
        "methacryloyloxypropyldimethylsilyl-endblocked polydimethylsiloxanes (f=2 to 500)",
        "methacryloyloxypropyl-endblocked polydimethylsiloxanes (f=2 to 500)",
        "vinyldimethoxysilyl-endblocked polydimethylsiloxanes (f=2-500).",
        "Based on the total mass of the copolymers, the amount of silicon-containing components can be up to 99.9% by weight, preferably from 0.5 to 30% by weight, more preferably from 1 to 20% by weight.",
        "Suitable polymerizable fluorine-containing components E) include all compounds which are olefinically at least monounsaturated and which are capable of free-radical copolymerization under the reaction conditions chosen in each case. The distribution of the individual fluorine-containing monomers across the polymer chains which form need not necessarily be random. The invention also embraces the formation of blocklike (including multiblock) or gradientlike structures, for example. Combinations of two or more different fluorine-containing components E) are also possible, it being clear to the expert that monofunctional representatives lead to the formation of comb-shaped structures while di-, tri-, or polyfunctional components E) lead to structures which are at least partly crosslinked.",
        "Preferred fluorine-containing components E) are those of formula (II).\n\nR1—Y—CrH2rCsF2sCF3  (II)",
        "In this formula R1 represents a polymerizable function from the group of the vinylically unsaturated compounds which is suitable for the construction of polymeric structures by a free-radical route. R1 is preferably a vinyl, allyl, methallyl, methylvinyl, acryloyl (CH2═CH—CO—), methacryloyl (CH2═C[CH3]—CO—), crotonyl, senecionyl, itaconyl, maleyl, fumaryl or styryl radical, more preferably an acryloyl or methacryloyl radical.",
        "The attachment of the fluorine-containing group to the reactive end group R1 requires a suitable chemical bridge Y. Preferred bridges Y are —O—, —C(O)—, —C(O)—O—, —S—, —O—CH2—CH (O—)—CH2OH, —O—CH2—CH (OH)—CH2—O—, —O—SO2—O—, —O—S(O)—O—, —PH—, —P(CH3)—, —PO3—, —NH—, —N(CH3)—, —O—(C1-C50)alkyl-O—, —O-phenyl-O—, —O-benzyl-O—, —O—(C5-C8)cycloalkyl-O—, —O—(C1-C50)alkenyl-O—, —O—(CH(CH3)—(CH2—O)n—, —O—(CH2—CH2—O)n—, and —O—([CH—CH2—O]n—[CH2—CH2—O]m)o—, where n, m, and o independently of one another denote numbers from 0 to 200 and the distribution of the EO and PO units can be random or in the form of blocks. r and s are stoichiometric coefficients which independently of one another denote numbers from 0 to 200.",
        "Preferred fluorine-containing components E) of formula (II) are\n\n    perfluorohexylethanol methacrylate,\n    perfluorohexoylpropanol methacrylate,\n    perfluoroctylethanol methacrylate,\n    perfluoroctylpropanol methacrylate,\n    perfluorohexylethanolyl polyglycol ether methacrylate,\n    perfluorohexoylpropanolyl poly[ethylglycol-co-propylene glycol ether] acrylate,\n    perfluoroctylethanolyl poly[ethylglycol-block-co-propylene glycol ether] methacrylate,\n    perfluoroctylpropanolyl polypropylene glycol ether methacrylate.",
        "Based on the total mass of the copolymer the amount of fluorine-containing components can be up to 99.9% by weight, preferably from 0.5 to 30% by weight, more preferably from 1 to 20% by weight.",
        "The macromonomers F) are at least singly olefinically functionalized polymers having one or more discrete repeating units and a number-average molecular weight of greater than or equal to 200 g/mol. In the copolymerization it is also possible to use mixtures of chemically different macromonomers F). The macromonomers are polymeric structures composed of one or more repeating units and have a molecular weight distribution characteristic of polymers.",
        "Preferred macromonomers F) are compounds of formula (III).\n\nR1—Y-[(A)v-(B)w-(C)x-(D)z]-R2  (III)",
        "R1 represents a polymerizable function from the group of the vinylically unsaturated compounds which are suitable for constructing polymeric structures by a free-radical route. Preferably R′ is a vinyl, allyl, methallyl, methylvinyl, acryloyl (CH2═CH—CO—), methacryloyl (CH2═C[CH3]—CO—), crotonyl, senecionyl, itaconyl, maleyl, fumaryl or styryl radical.",
        "Attachment of the polymer chain to the reactive end group requires a suitable bridging group Y. Preferred bridges Y are —O—, —C(O)—, —C(O)—O—, —S—, —O—CH2—CH(O—)—CH2OH, —O—CH2—CH(OH)—CH2O—, —O—SO2—O—, —O—SO2—O—, —O—SO—O—, —PH—, —P(CH3)—, —PO3—, —NH—, and —N(CH3)—, more preferably —O—.",
        "The polymeric central moiety of the macromonomer is represented by the discrete repeating units A, B, C, and D. Preferably the repeating units A, B, C, and D are derived from: acrylamide, methacrylamide, ethylene oxide, propylene oxide, AMPS, acrylic acid, methacrylic acid, methyl methacrylate, acrylonitrile, maleic acid, vinyl acetate, styrene, 1,3-butadiene, isoprene, isobutene, diethylacrylamide, and diisopropylacrylamide.",
        "The indices v, w, x, and z in formula (III) represent the stoichiometric coefficients relating to the repeating units A, B, C, and D. v, w, x, and z amount independently of one another to from 0 to 500, preferably 1 to 30, it being necessary for the sum of the four coefficients on average to be ≧1.",
        "The distribution of the repeating units over the macromonomer chain can be random, blocklike, alternating or gradientlike.",
        "R2 denotes a linear or branched aliphatic, olefinic, cycloaliphatic, arylaliphatic or aromatic (C1-C50) hydrocarbon radical, OH, —NH2, —N(CH3)2 or is the structural unit [—Y—R1].",
        "In the case of R2 being [—Y—R1] the macromonomers in question are difunctional and suitable for crosslinking the copolymers.",
        "Particularly preferred macromonomers F) are acrylically or methacrylically monofunctionalized alkyl ethoxylates of formula (IV).",
        "",
        "R3, R4, R5, and R6 are independently of one another hydrogen or n-aliphatic, iso-aliphatic, olefinic, cycloaliphatic, arylaliphatic or aromatic (C1-C30) hydrocarbon radicals.",
        "Preferably R3 and R4 are H or —CH3, more preferably H; R5is H or —CH3; and R6 is an n-aliphatic, iso-aliphatic, olefinic, cycloaliphatic, arylaliphatic or aromatic (C1-C30) hydrocarbon radical.",
        "v and w are in turn the stoichiometric coefficients relating to the ethylene oxide units (EO) and propylene oxide units (PO). v and w amount independently of one another to from 0 to 500, preferably 1 to 30, it being necessary for the sum of v and w to be on average ≧1. The distribution of the EO and PO units over the macromonomer chain can be random, blocklike, alternating or gradientlike. Y stands for the abovementioned bridges.",
        "Further particularly preferred macromonomers F) have the following structure in accordance with formula (IV):",
        "Name\nR3\nR4\nR5\nR6\nv\nw\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n® LA-030\nH\nH\n—CH3\n-lauryl\n3\n0\n\n\nmethacrylate\n\n\n® LA-070\nH\nH\n—CH3\n-lauryl\n7\n0\n\n\nmethacrylate\n\n\n® LA-200\nH\nH\n—CH3\n-lauryl\n20\n0\n\n\nmethacrylate\n\n\n® LA-250\nH\nH\n—CH3\n-lauryl\n25\n0\n\n\nmethacrylate\n\n\n® T-080 methacrylate\nH\nH\n—CH3\n-talc\n8\n0\n\n\n® T-080 acrylate\nH\nH\nH\n-talc\n8\n0\n\n\n® T-250 methacrylate\nH\nH\n—CH3\n-talc\n25\n0\n\n\n® T-250 crotonate\n—CH3\nH\n—CH3\n-talc\n25\n0\n\n\n® OC-030\nH\nH\n—CH3\n-octyl\n3\n0\n\n\nmethacrylate\n\n\n® OC-105\nH\nH\n—CH3\n-octyl\n10\n5\n\n\nmethacrytate\n\n\n® Behenyl-010-\nH\nH\nH\n-behenyl\n10\n0\n\n\nmethylaryl\n\n\n® Behenyl-020-\nH\nH\nH\n-behenyl\n20\n0\n\n\nmethylaryl\n\n\n® Behenyl-010-\n—CH3\n—CH3\nH\n-behenyl\n10\n0\n\n\nsenecionyl\n\n\n® PEG-440 diacrylate\nH\nH\nH\n-acryloyl\n10\n0\n\n\n® B-11-50\nH\nH\n—CH3\n-butyl\n17\n13\n\n\nmethacrylate\n\n\n® MPEG-750\nH\nH\n—CH3\n-methyl\n18\n0\n\n\nmethacrylate\n\n\n® P-010 acrylate\nH\nH\nH\n-phenyl\n10\n0\n\n\n® O-050-acrylate\nH\nH\nH\n-oleyl\n5\n0",
        "Further particularly suitable macromonomers F) are esters of (meth)acrylic acid with\n\n    (C10-C18) fatty alcohol polyglycol ethers having 8 EO units (Genapol® C-080)\n    C11 oxo alcohol polyglycol ethers having 8 EO units (Genapol® UD-080)\n    (C12-C14) fatty alcohol polyglycol ethers having 7 EO units (Genapol® LA-070)\n    (C12-C14) fatty alcohol polyglycol ethers having 11 EO units (Genapol® LA-110)\n    (C16-C18) fatty alcohol polyglycol ethers having 8 EO units (Genapol® T-080)\n    (C16-C18) fatty alcohol polyglycol ethers having 15 EO units (Genapol® T-150)\n    (C16-C18) fatty alcohol polyglycol ethers having 11 EO units (Genapol® T-110)\n    (C16-C18) fatty alcohol polyglycol ethers having 20 EO units (Genapol® T-200)\n    (C16-C18) fatty alcohol polyglycol ethers having 25 EO units (Genapol® T-250)\n    (C18-C22) fatty alcohol polyglycol ethers having 25 EO units and/or\n    iso-(C16-C18) fatty alcohol polyglycol ethers having 25 EO units.",
        "The Genapol® grades are products of Clariant GmbH.",
        "The molecular weight of the macromonomers F) is preferably from 200 g/mol to 106 g/mol, more preferably from 150 to 104 g/mol, and very preferably from 200 to 5 000 g/mol.",
        "Based on the total mass of the copolymers it is possible for the amount of macromonomers to be up to 99.9% by weight. Preferred ranges used are from 0.5 to 30% by weight and from 70 to 99.5% by weight. Particularly preferred are ranges from 1 to 20% by weight and from 75 to 95% by weight.",
        "Preferred copolymers are those obtainable by copolymerizing at least components A), C) and D).",
        "Further preferred copolymers are those obtainable by copolymerizing at least components A), C) and E).",
        "Further preferred copolymers are those obtainable by copolymerizing at least components A), C) and F).",
        "Further preferred copolymers are those obtainable by copolymerizing at least components A), D) and F).",
        "Further preferred copolymers are those obtainable by copolymerizing at least components A) and F).",
        "Further preferred copolymers are those obtainable by copolymerizing at least components A) and D).",
        "Further preferred copolymers are those obtainable by copolymerizing at least components A) and E).",
        "In one preferred embodiment the copolymerization is conducted in the presence of at least one polymeric additive G), the additive G) being added wholly or partly in solution to the polymerization medium before the actual copolymerization. The use of two or more additives G) is likewise in accordance with the invention.",
        "Crosslinked additives G) may likewise be used.",
        "The additives G) or mixtures thereof must only be wholly or partly soluble in the chosen polymerization medium. During the actual polymerization step the additive G) has a number of functions. On the one hand it prevents the formation of overcrosslinked polymer fractions in the copolymer which forms in the actual polymerization step, and on the other hand the additive G) is statistically attacked by active free radicals in accordance with the very well-known mechanism of graft copolymerization. Depending on the particular additive G), this results in greater or lesser fractions of the additive being incorporated into the copolymers. Moreover, suitable additives G) possess the property of altering the solution parameters of the copolymers which form during the free-radical polymerization reaction in such a way that the average molecular weights are shifted to higher values. As compared with analogous copolymers prepared without the addition of the additives G), those prepared with the addition of additives G) advantageously exhibit a significantly higher viscosity in aqueous solution.",
        "Preferred additives G) are homopolymers and copolymers which are soluble in water and/or alcohols, preferably in t-butanol. The term “copolymers” also comprehends those having more than two different monomer types.",
        "Particularly preferred additives G) are homopolymers and copolymers of N-vinyl-formamide, N-vinylacetamide, N-vinylpyrrolidone, ethylene oxide, propylene oxide, acryloyldimethyltaurine, N-vinylcaprolactam, N-vinylmethylacetamide, acrylamide, acrylic acid, methacrylic acid, N-vinylmorpholide, hydroxyethyl methacrylate, diallyidimethylammonium chloride (DADMAC) and/or [2-(methacryloyloxy)ethyl]-trimethylammonium chloride (MAPTAC); polyalkylene glycols and/or alkylpolyglycols.",
        "Particularly preferred additives G) are polyvinylpyrrolidones (e.g., Luviskol K15®, K20® and K30® from BASF), poly(N-vinylformamides), poly(N-vinylcaprolactams), and copolymers of N-vinylpyrrolidone, N-vinylformamide and/or acrylic acid, which may also have been partly or fully hydrolyzed.",
        "The molecular weight of the additives G) is preferably from 102 to 107 g/mol, more preferably from 0.5*104 to 106 g/mol.",
        "The amount in which the polymeric additive G) is used, based on the total mass of the monomers to be polymerized during the copolymerization, is preferably from 0.1 to 90% by weight, more preferably from 1 to 20% by weight, and with particular preference from 1.5 to 10% by weight.",
        "In another preferred embodiment the copolymers of the invention are crosslinked, i.e., they contain comonomers having at least two polymerizable vinyl groups.",
        "Preferred crosslinkers are methylenebisacrylamide; methylenebismethacrylamide; esters of unsaturated monocarboxylic and polycarboxylic acids with polyols, preferably diacrylates and triacrylates, dimethacrylates and trimethacrylates, more preferably butanediol and ethylene glycol diacrylate and methacrylate, trimethylolpropane triacrylate (TMPTA) and trimethylolpropane trimethacrylate (TMPTMA); allyl compounds, preferably allyl (meth)acrylate, triallyl cyanurate, diallyl maleate, polyallyl esters, tetraallyloxyethane, triallylamine, tetraallylethylene-diamine; allyl esters of phosphoric acid; and/or vinylphosphonic acid derivatives. A particularly preferred crosslinker is trimethylolpropane triacrylate (TMPTA). The weight fraction of crosslinking comonomers, based on the total mass of the copolymers, is preferably up to 20% by weight, more preferably from 0.05 to 10% by weight, and very preferably from 0.1 to 7% by weight.",
        "The polymerization medium used may comprise all organic or inorganic solvents which have a very substantially inert behavior with respect to free-radical polymerization reactions and which advantageously allow the formation of medium or high molecular weights. Those used preferably include water; lower alcohols; preferably methanol, ethanol, propanols, iso-, sec- and t-butanol, very preferably t-butanol; hydrocarbons having 1 to 30 carbon atoms, and mixtures of the aforementioned compounds.",
        "The polymerization reaction takes place preferably in the temperature range between 0 and 150° C., more preferably between 10 and 100° C., either at atmospheric pressure or under elevated or reduced pressure. If desired the polymerization may also be performed under an inert gas atmosphere, preferably under nitrogen.",
        "In order to initiate the polymerization it is possible to use high-energy electro-magnetic rays, mechanical energy, or the customary chemical polymerization initiators, such as organic peroxides, e.g., benzoyl peroxide, tert-butyl hydro-peroxide, methyl ethyl ketone peroxide, cumene hydroperoxide, dilauroyl peroxide or azo initiators, such as azodiisobutyronitrile (AlBN), for example. Likewise suitable are inorganic peroxy compounds, such as (NH4)2S2O8, K2S2O8 or H2O2, for example, where appropriate in combination with reducing agents (e.g., sodium hydrogensulfite, ascorbic acid, iron(ll) sulfate, etc.) or redox systems comprising as reducing component an aliphatic or aromatic sulfonic acid (e.g., benzenesulfonic acid, toluenesulfonic acid, etc.).",
        "Serving as the polymerization medium may be any solvents which are very substantially inert in respect of free-radical polymerization reactions and which allow the development of high molecular weights. Use is preferably made of water and lower, tertiary alcohols or hydrocarbons having 3 to 30 carbon atoms. In one particularly preferred embodiment t-butanol is used as the reaction medium. Mixtures of two or more representatives of the potential solvents described are of course likewise in accordance with the invention. This also includes emulsions of mutually immiscible solvents (e.g., water/hydrocarbons). In principle, all kinds of reaction regime leading to the polymer structures of the invention are suitable (solution polymerization, emulsion methods, precipitation methods, high-pressure methods, suspension methods, bulk polymerization, gel polymerization, and so on). Preferred suitability is possessed by precipitation polymerization, particularly preferred suitability by precipitation polymerization in tert-butanol.",
        "The following list shows 67 copolymers suitable with particular advantage for formulating the compositions of the invention. The different copolymers 1 to 67 are obtainable in accordance with the following preparation processes 1, 2, 3, and 4.",
        "Process 1:",
        "These polymers can be prepared by the precipitation method in tert-butanol. The monomers were introduced in t-butanol, the reaction mixture was rendered inert, and then, after initial heating to 60° C., the reaction was initiated by addition of the corresponding t-butanol-soluble initiator (preferably dilauroyl peroxide). After the end of reaction (2 hours) the polymers were isolated by removal of the solvent under suction and by subsequent vacuum drying.",
        "Process 2:",
        "These polymers are preparable by the gel polymerization method in water. The monomers are dissolved in water, the reaction mixture is rendered inert, and then, after initial heating to 65° C., the reaction is initiated by addition of suitable initiators or initiator systems (preferably Na2S2O8). The polymer gels are subsequently comminuted and the polymers are isolated after drying.",
        "Process 3:",
        "These polymers are preparable by the emulsion method in water. The monomers are emulsified in a mixture of water/organ. solvent (preferably cyclohexane) using an emulsifier, the reaction mixture is rendered inert by means of N2, and then, after initial heating to 80° C., the reaction is initiated by addition of suitable initiators or initiator systems (preferably Na2S2O8). The polymer emulsions are subsequently evaporated down (with cyclohexane acting as an azeotrope former for water) and the polymers are thereby isolated.",
        "Process 4:",
        "These polymers are preparable by the solution method in organic solvents (preferably toluene, also, for example, tertiary alcohols). The monomers are introduced in the solvent, the reaction mixture is rendered inert, and then, after initial heating to 70° C., the reaction is initiated by addition of suitable initiators or initiator systems (preferably dilauroyl peroxide). The polymers are isolated by evaporating off the solvent and by subsequent vacuum drying.",
        "Polymers having hydrophobic side chains, uncrosslinked",
        "No.\nComposition\nPreparation process\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n95 g AMPS 5 g Genapol T-080\n1\n\n\n2\n90 g AMPS 10 g Genapol T-080\n1\n\n\n3\n85 g AMPS 15 g Genapol T-080\n1\n\n\n4\n80 g AMPS 20 g Genapol T-080\n1\n\n\n5\n70 g AMPS 30 g Genapol T-080\n1\n\n\n6\n50 g AMPS 50 g Genapol T-080\n3\n\n\n7\n40 g AMPS 60 g Genapol T-080\n3\n\n\n8\n30 g AMPS 70 g Genapol T-080\n3\n\n\n9\n20 g AMPS 80 g Genapol T-080\n3\n\n\n10\n60 g AMPS 60 g BB10\n4\n\n\n11\n80 g AMPS 20 g BB10\n4\n\n\n12\n90 g AMPS 10 g BB10\n3\n\n\n13\n80 g AMPS 20 g BB10\n1\n\n\n14\n80 g AMPS 20 g Genapol LA040\n1\n\n\n\n\n\n\n\n\n\nPolymers having hydrophobic side chains, crosslinked",
        "Preparation\n\n\nNo.\nComposition\nprocess\n\n\n\n\n\n\n\n15\n80 g AMPS 20 g Genapol LA040 0.6 g AMA\n1\n\n\n16\n80 g AMPS 20 g Genapol LA040 0.8 g AMA\n1\n\n\n17\n80 g AMPS 20 g Genapol LA040 1.0 g AMA\n1\n\n\n18\n628.73 g AMPS 120.45 g Genapol T-250 6.5 g\n2\n\n\n\nTMPTA\n\n\n19\n60 g AMPS 40 g BB10 1.9 g TMPTA\n4\n\n\n20\n80 g AMPS 20 g BB10 1.4 g TMPTA\n4\n\n\n21\n90 g AMPS 10 g BB10 1.9 g TMPTA\n4\n\n\n22\n80 g AMPS 20 g BB10 1.9 g TMPTA\n4\n\n\n23\n60 g AMPS 40 g BB10 1.4 g TMPTA\n4\n\n\n\n\n\n\n\n\n\nPolymers having hydrophobic side chains, crosslinked, grafted",
        "Prepa-\n\n\n\n\nration\n\n\nNo.\nComposition\nprocess\n\n\n\n\n\n\n\n24\n95 g AMPS 5 g BB10, 1.9 g TMPTA, 1 g Poly-NVP\n1\n\n\n25\n90 g AMPS 10 g BB10, 1.9 g TMPTA, 1 g Poly-NVP\n1\n\n\n26\n85 g AMPS 15 g BB10, 1.9 g TMPTA, 1 g Poly-NVP\n1\n\n\n27\n90 g AMPS 10 g BB10, 1.9 g TMPTA, 1 g Poly-NVP\n1\n\n\n\n\n\n\n\n\n\nPolymers having silicon-containing groups, uncrosslinked",
        "No.\nComposition\nPreparation process\n\n\n\n\n\n\n\n28\n80 g AMPS, 20 g Silvet 867\n1\n\n\n29\n80 g AMPS, 50 g Silvet 867\n4\n\n\n\n\n\n\n\n\n\nPolymers having silicon-containing groups, crosslinked",
        "No.\nComposition\nPreparation process\n\n\n\n\n\n\n\n30\n80 g AMPS, 20 g Silvet 867, 0.5 g MBA\n4\n\n\n31\n80 g AMPS, 20 g Silvet 867, 1.0 g MBA\n1\n\n\n32\n60 g AMPS, 40 g Y-12867, 0.95 g AMA\n1\n\n\n33\n80 g AMPS, 20 g Y-12867, 0.95 g AMA\n1\n\n\n34\n90 g AMPS, 10 g Y-12867, 0.95 g AMA\n1\n\n\n35\n60 g AMPS, 40 g Silvet 7280, 0.95 g AMA\n1\n\n\n36\n80 g AMPS, 20 g Silvet 7280, 0.95 g AMA\n1\n\n\n37\n90 g AMPS, 10 g Silvet 7280, 0.95 g AMA\n1\n\n\n38\n60 g AMPS, 40 g Silvet 7608, 0.95 g AMA\n1\n\n\n39\n80 g AMPS, 20 g Silvet 7608, 0.95 g AMA\n1\n\n\n40\n90 g AMPS, 10 g Silvet 7608, 0.95 g AMA\n1\n\n\n\n\n\n\n\n\n\nPolymers having hydrophobic side chains and cationic groups, uncrosslinked",
        "Preparation\n\n\nNo.\nComposition\nprocess\n\n\n\n\n\n\n\n41\n87.5 g AMPS, 7.5 g Genapol T-110, 5 g DADMAC\n2\n\n\n42\n40 g AMPS, 10 g Genapol T110, 45 g\n2\n\n\n\nmethacrylamide\n\n\n43\n55 g AMPS, 40 g Genapol LA040, 5 g Quat\n1\n\n\n44\n75 g AMPS, 10 g BB10, 6.7 g Quat\n1\n\n\n\n\n\n\n\n\n\nPolymers having hydrophobic side chains and cationic groups, crosslinked",
        "Preparation\n\n\nNo.\nComposition\nprocess\n\n\n\n\n\n\n\n45\n60 g AMPS, 20 g Genapol T-80, 10 g Quat, 10 g\n1\n\n\n\nHEMA\n\n\n46\n75 g AMPS, 20 g Genapol T-250, 5 g Quat, 1.4 g\n1\n\n\n\nTMPTA\n\n\n47\n75 g AMPS, 20 g Genapol T-250, 10 g Quat, 1.4 g\n1\n\n\n\nTMPTA\n\n\n48\n75 g AMPS, 20 g Genapol T-250, 20 g Quat, 1.4 g\n1\n\n\n\nTMPTA\n\n\n\n\n\n\n\n\n\nPolymers having fluorine-containing groups",
        "No.\nComposition\nPreparation process\n\n\n\n\n\n\n\n49\n94 g AMPS, 2.02 g Fluowet AC 600\n1\n\n\n50\n80 g AMPS,\n3\n\n\n\n20 g perfluorooctylpolyethylene glycol\n\n\n\nmethacrylate, 1 g Span 80\n\n\n\n\n\n\n\n\n\nPolymers having fluorine-containing groups, grafted",
        "Preparation\n\n\nNo.\nComposition\nprocess\n\n\n\n\n\n\n\n51\n80 g AMPS, 10 g Fluowet AC 600, 5 g Poly-NVP\n1\n\n\n52\n70 g AMPS, 8 g perfluorooctylethyloxyglyceryl\n4\n\n\n\nmethacrylate, 5 g Poly-NVP\n\n\n\n\n\n\n\n\n\nPolyfunctional polymers",
        "Preparation\n\n\nNo.\nComposition\nprocess\n\n\n\n\n\n\n\n53\n80 g AMPS, 10 g Genapol LA070, 10g Silvet 7608, 1.8 g TMPTA\n1\n\n\n54\n70 g AMPS, 5 g N-vinylpyrrolidone, 15 g Genapol T-250\n4\n\n\n\nmethacrylate, 10 g Quat, 10 g Poly-NVP\n\n\n55\n80 g AMPS, 5 g N-vinylformamide, 5 g Genapol O-150\n2\n\n\n\nmethacrylate, 10 g DADMAC, 1.8 g TMPTA, 8 g poly-N-\n\n\n\nvinylformamide\n\n\n56\n70 g AMPS, 5 g N-vinylpyrrolidone, 15 g Genapol T-\n1\n\n\n\n250 methacrylate, 10 g Quat, 10 g Poly-NVP\n\n\n57\n60 g AMPS, 10 g Genapol-BE-020 methacrylate,\n1\n\n\n\n10 g Genapol T-250 acrylate, 20 g Quat, 1 g Span 80\n\n\n58\n60 g AMPS, 20 g MPEG-750 methacrylate,\n1\n\n\n\n10 g methacryloyloxypropyldimethicone,\n\n\n\n10 g perfluorooctylpolyethylene glycol methacrylate,\n\n\n\n10 g poly[N-vinylcaprolactone-co-acrylic acid] (10/90)\n\n\n59\n80 g AMPS, 5 g N-vinylformamide, 5 g Genapol O-150\n1\n\n\n\nmethacrylate, 10 g DADMAC, 1.8 g TMPTA\n\n\n60\n70 g AMPS, 10 g Genapol T-250 acrylate, 5 g N-methyl-\n1\n\n\n\n4-vinylpyridinium chloride, 2.5 g Silvet Y-12867,\n\n\n\n2.5 g perfluorohexylpolyethylene glycol methacrylate,\n\n\n\n10 g polyethylene glycol dimethacrylate,\n\n\n\n4 g poly[N-vinylcaprolactam]\n\n\n61\n10 g AMPS, 20 g acrylamide, 30 g N-2-vinylpyrrolidone,\n3\n\n\n\n20 g Silvet 7608, 10 g methacryloyloxypropyldimethicone,\n\n\n\n10 g Fluowet AC 812\n\n\n62\n60 g AMPS, 10 g DADMAC, 10 g Quat, 10 g Genapol-LA-\n1\n\n\n\n250 crotonate, 10 g methacryloyloxypropyldimethicone,\n\n\n\n7 g poly[acrylic acid-co-N-vinylformamide]\n\n\n63\n50 g AMPS, 45 g Silvet 7608, 1.8 g TMPTA,\n1\n\n\n\n8 g poly[N-vinylformamide]\n\n\n64\n20 g AMPS, 10 g Genapol T 110, 35 g MAA,\n4\n\n\n\n30 g HEMA, 5 g DADMAC\n\n\n65\n20 g AMPS, 80 g BB10, 1.4 g TMPTA\n1\n\n\n66\n75 g AMPS, 20 g BB10, 6.7 g Quat, 1.4 g TMPTA\n1\n\n\n67\n35 g AMPS, 60 g acrylamide, 2 g VIFA,\n4\n\n\n\n2.5 g vinylphosphonic acid, 2 mol % Fluowet EA-600\n\n\n\n\n\n\n\n\n\nChemical designation of the reactants:",
        "AMPS\nacryloyldimethyltaurate, preferably\n\n\n\nNa or NH4 salt\n\n\nGenapol ® T-080\nC16-C18 fatty alcohol polyglycol\n\n\n\nether having 8 EO units\n\n\nGenapol ® T-110\nC12-C14 fatty alcohol polyglycol\n\n\n\nether having 11 EO units\n\n\nGenapol ® T-250\nC16-C18 fatty alcohol polyglycol\n\n\n\nether having 25 EO units\n\n\nGenapol ® LA-040\nC12-C14 fatty alcohol polyglycol\n\n\n\nether having 4 EO units\n\n\nGenapol ® LA-070\nC12-C14 fatty alcohol polyglycol\n\n\n\nether having 7 EO units\n\n\nGenapol ® O-150\nC16-C18 fatty alcohol polyglycol\n\n\nmethacrylate\nether methacrylate having 15 EO units,\n\n\nGenapol ® LA-250\nC12-C14 fatty alcohol polyglycol\n\n\ncrotonate\nether crotonate having 25 EO units\n\n\nGenapol ® T-250\nC16-C18 fatty alcohol polyglycol\n\n\nmethacrylate\nether methacrylate having 25 EO units\n\n\nGenapol ® T-250\nC16-C18 fatty alcohol polyglycol\n\n\nacrylate\nether acrylate having 25 EO units\n\n\nBB10 ®\npolyoxyethylene(10)behenyl ether\n\n\nTMPTA\ntrimethylolpropane triacrylate\n\n\nPoly-NVP\npoly-N-vinylpyrrolidone\n\n\nSilvet ® 867\nsiloxane-polyalkylene oxide copolymer\n\n\nMBA\nmethylenebisacrylamide\n\n\nAMA\nallyl methacrylate\n\n\n®Y-12867\nsiloxane-polyalkylene oxide copolymer\n\n\nSilvet ® 7608\npolyalkylene oxide-modified\n\n\n\nheptamethyltrisiloxane\n\n\nSilvet ® 7280\npolyalkylene oxide-modified\n\n\n\nheptamethyltrisiloxane\n\n\nDADMAC\ndiallyldimethylammonium chloride\n\n\nHEMA\n2-hydroxyethyl methacrylate\n\n\nQuat\n2-(methacryloyloxy)ethyltrimethylammonium\n\n\n\nchloride\n\n\nFluowet ® AC 600\nperfluoroalkylethyl acrylate\n\n\nSpan ® 80\nsorbitan ester",
        "In one preferred embodiment the copolymers are water-soluble or water-swellable. The acryloyidimethyltaurate comb copolymers described display advantageous properties in both crosslinked and noncrosslinked form.",
        "The described grafting of the acryloyidimethyltaurate comb copolymers with other polymers, which can be carried out optionally, leads to products having a particular polymer morphology and giving rise to optically clear gels in aqueous systems. A potential disadvantage of the copolymers without grafting is a more or less strong opalescence in aqueous solution. The basis for this opalescence is hitherto unavoidable, overcrosslinked polymer fractions which arise in the course of the synthesis and are inadequately swollen in water. This produces light-scattering particles whose size is well above the wavelength of visible light and which are therefore the cause of the opalescence. The described grafting process, which can be carried out optionally, substantially reduces or entirely prevents the formation of overcrosslinked polymer fractions in relation to conventional techniques.",
        "The described incorporation both of cationic charges and of silicon, fluorine or phosphorus atoms into the acryloyidimethyltaurate comb copolymers, which can be carried out optionally, leads to products which in cosmetic formulations possess particular sensorial and rheological properties. An improvement in the sensorial and rheological properties may be desired in particular in the context of use in rinse-off products (especially hair treatment compositions) or leave-on products (especially O/W emulsions).",
        "Based on the finished compositions, the compositions of the invention contain preferably from 0.01 to 10% by weight, more preferably from 0.1 to 5% by weight, very preferably from 0.5 to 3% by weight, of copolymers.",
        "The compositions of the invention may further comprise one or more acidic organic active substances. Preferred compounds are those selected from glycolic acid, lactic acid, citric acid, tartaric acid, mandelic acid, salicylic acid, ascorbic acid, pyruvic acid, oligooxa-monocarboxylic and -dicarboxylic acids, alpha-hydroxy acids, fumaric acid, retinoic acid, sulfonic acids, benzoic acid, kojic acid, fruit acid, malic acid, gluconic acid, and derivatives thereof.",
        "The formulations are normally adjusted to a pH in the range from 2 to 12, preferably from 3 to 8.",
        "The compositions can be on an aqueous or aqueous-alcoholic base, and examples include hair gels.",
        "The compositions may further comprise emulsions and suspensions which comprise copolymers as thickeners, dispersants, emulsifiers, suspension media with a thickening effect, and bodying agents.",
        "They may also be decorative preparations which contain solids and which comprise the copolymers as lubricants, adhesives, thickeners, dispersants, and emulsifiers.",
        "The emulsifying, stabilizing and/or bodying effect of the copolymers in emulsions is due to and/or boosted by association of the polymer side chains with one another and also the interaction of the polymer side chains with the hydrophobic oil components.",
        "Besides a cosmetically and/or dermatologically acceptable aqueous medium, the formulations may comprise organic solvents. These solvents are preferably selected from the group consisting of monohydric and polyhydric alcohols, optionally ethoxylated polyethylene glycols, propylene glycol esters, sorbitol and its derivatives, glycol ethers, propylene glycol ethers, and fatty esters, and are used, based on the finished compositions, at up to 90% by weight, preferably from 5 to 70% by weight.",
        "The oil fraction of the emulsions is normally up to 95% by weight, preferably from 2 to 50% by weight, more preferably from 5 to 20% by weight. The fraction of oily substances is dependent inter alia on whether lotions, with a comparatively low viscosity, or creams and ointments, of high viscosity, are to be prepared. The emulsions can be either water-in-oil emulsions or oil-in-water emulsions.",
        "The emulsions can be used as skincare compositions, such as day creams, night creams, beauty creams, nutrient cream, body lotions, ointments and the like, for example, and as further auxiliaries and additives may comprise cationic polymers, film formers, and also other additions customary in cosmetology, such as superfatting agents, moisturizing agents, stabilizers, active biogenic substances, glycerol, preservatives, pearlizing agents, dyes and fragrances, solvents, hydrotropic agents, opacifiers, further thickeners and dispersants, and also protein derivatives such as gelatin, collagen hydrolysates, natural or synthetic-based polypeptides, egg yolk, lecithin, lanolin and lanolin derivatives, deodorants, substances with a keratolytic and keratoplastic action, enzymes and carrier substances, antioxidants, UV light protection filters, pigments and metal oxides, and antimicrobial agents.",
        "An oily substance is any fatty substance which is liquid at room temperature (25° C.).",
        "The fatty phase may therefore comprise one or more oils selected preferably from the following oils:\n\n    silicone oils, volatile or nonvolatile, linear, branched or cyclic, optionally with organic modification; phenylsilicones; silicone resins and silicone gums; mineral oils such as paraffin oil or vaseline oil; oils of animal origin such as perhydrosqualene, lanolin; oils of plant origin such as liquid triglycerides, e.g., sunflower oil, corn oil, soybean oil, rice oil, jojoba oil, babusscu oil, pumpkin oil, grapeseed oil, sesame oil, walnut oil, apricot oil, macadamia oil, avocado oil, sweet almond oil, lady's-smock oil, castor oil, triglycerides of caprylic/capric acids, olive oil, peanut oil, rapeseed oil, and coconut oil;\n    synthetic oils such as purcellin oil, isoparaffins, linear and/or branched fatty alcohols and fatty acid esters, preferably guerbet alcohols having 6 to 18, preferably 8 to 10, carbon atoms; esters of linear (C6-C13) fatty acids with linear (C6-C20) fatty alcohols; esters of branched (C6-C13) carboxylic acids with linear (C6-C20) fatty alcohols, esters of linear (C6-C18) fatty acids with branched alcohols, especially 2-ethylhexanol; esters of linear and/or branched fatty acids with polyhydric alcohols (such as dimerdiol or trimerdiol, for example) and/or guerbet alcohols; triglycerides based on (C6-C10) fatty acids;\n    esters such as dioctyl adipate, diisopropyl dimer dilinoleate; propylene glycols/dicaprylate or waxes such as beeswax, paraffin wax or microwaxes, alone or in combination with hydrophilic waxes, such as cetylstearyl alcohol, for example; fluorinated and perfluorinated oils; fluorinated silicone oils; mixtures of the aforementioned compounds.",
        "Suitable nonionogenic coemulsifiers include adducts of from 0 to 30 mol of ethylene oxide and/or from 0 to 5 mol of propylene oxide with linear fatty alcohols having 8 to 22 carbon atoms, with fatty acids having 12 to 22 carbon atoms, with alkylphenols having 8 to 15 carbon atoms in the alkyl group, and with sorbitan or sorbitol esters; (C12-C18) fatty acid monoesters and diesters of adducts of from 0 to 30 mol of ethylene oxide with glycerol; glycerol monoesters and diesters and sorbitan monoesters and diesters of saturated and unsaturated fatty acids having 6 to 22 carbon atoms and, where appropriate, their ethylene oxide adducts; adducts of from 15 to 60 mol of ethylene oxide with castor oil and/or hydrogenated castor oil; polyol esters and especially polyglycerol esters, such as polyglyceryl polyricinoleate and polyglyceryl poly-12-hydroxystearate, for example. Likewise suitable are mixtures of compounds from one or more of these classes of substance.",
        "Suitable cationic polymers include those known under the INCI designation “Polyquaternium”, especially Polyquaternium-31, Polyquaternium-16, Polyquaternium-24, Polyquaternium-7, Polyquaternium-22, Polyquaternium-39, Polyquaternium-28, Polyquaternium-2, Polyquaternium-10, Polyquaternium-11, and also Polyquaternium 37&mineral oil&PPG trideceth (Salcare SC95), PVP-dimethylaminoethyl methacrylate copolymer, guar-hydroxypropyltriammonium chlorides, and also calcium alginate and ammonium alginate. It is additionally possible to employ cationic cellulose derivatives; cationic starch; copolymers of diallylammonium salts and acrylamides; quaternized vinylpyrrolidone/vinylimidazole polymers; condensation products of polyglycols and amines; quaternized collagen polypeptides; quaternized wheat polypeptides; polyethyleneimines; cationic silicone polymers, such as amidomethicones, for example; copolymers of adipic acid and dimethylaminohydroxypropyldiethylenetriamine; polyaminopolyamide and cationic chitin derivatives, such as chitosan, for example.",
        "Examples of suitable silicone compounds are dimethylpolysiloxane, methylphenylpolysiloxanes, cyclic silicones, and amino-, fatty acid-, alcohol-, polyether-, epoxy-, fluoro- and/or alkyl-modified silicone compounds, and also polyalkylsiloxanes, polyalkylarylsiloxanes, polyethersiloxanes, as described in U.S. Pat. No. 5,104,645 and the documents cited therein, which at room temperature may be present either in liquid form or in resin form.",
        "Suitable film formers, depending on the intended application, include water-soluble polyurethanes, for example, C10-polycarbamyl polyglyceryl esters, polyvinyl alcohol, polyvinylpyrrolidone, copolymers thereof, for example vinylpyrrolidone/vinyl acetate copolymers, water-soluble acrylic acid copolymers and their esters or salts, examples being partial ester copolymers of acrylic/methacrylic acid and polyethylene glycol ethers of fatty alcohols, such as acrylate/steareth-20 methacrylate copolymers, water-soluble cellulose, examples being hydroxymethylcellulose, hydroxyethylcellulose, hydroxypropylcellulose, water-soluble quaterniums, polyquaterniums, carboxyvinyl polymers, such as carbomers and their salts, polysaccharides, polydextrose for example, and glucan.",
        "As superfatting agents it is possible to use substances such as, for example, polyethoxylated lanolin derivatives, lecithin derivatives, polyol fatty acid esters, monoglycerides, and fatty acid alkanol amides, the latter serving simultaneously as foam stabilizers. Moisturizers available include for example isopropyl palmitate, glycerol and/or sorbitol.",
        "As stabilizers it is possible to use metal salts of fatty acids, such as magnesium, aluminum and/or zinc stearate, for example.",
        "Active biogenic substances are to be understood as including, for example, plant extracts and vitamin complexes.",
        "The compositions of the invention can be blended with conventional ceramides, pseudoceramides, fatty acid N-alkylpolyhydroxyalkyl amides, cholesterol, cholesterol fatty acid esters, fatty acids, triglycerides, cerebrosides, phospholipids, and similar substances as a care additive.",
        "Suitable UV filters include for example 4-aminobenzoic acid; 3-(4′-trimethyl-ammonium)benzylideneboran-2-one methylsulfate; 3,3,5-trimethylcyclohexyl salicylate; 2-hydroxy-4-methoxybenzophenone; 2-phenylbenzimidazole-5-sulfonic acid and its potassium, sodium, and triethanolamine salts; 3,3′-(1,4-phenylene-dimethine)bis(7,7-dimethyl-2-oxobicyclo[2.2.1 ]heptane-1-methanesulfonic acid and its salts; 1-(4-tert-butylphenyl)-3-(4-methoxyphenyl)propane-1,3-dione;\n\n    3-(4′-sulfo)benzylidenebornan-2-one and its salts; 2-ethylhexyl 2-cyano-3,3-diphenylacrylate; polymer of N-[2(and 4)-(2-oxoborn-3-ylidenemethyl)benzyl]-acrylamide; 2-ethylhexyl 4-methoxycinnamate; ethoxylated ethyl 4-aminobenzoate; isoamyl 4-methoxycinnamate; 2,4,6-tris[p-(2-ethylhexyloxycarbonyl)anilino]-1,3,5-triazine;\n    2-(2H-benzotriazol-2-yl)-4-methyl-6-(2-methyl-3-(1,3,3,3-tetramethyl-1-(trimethylsilyloxy)disiloxanyl)propyl)phenol;\n    4,4′-[(6-[4-((1,1-dimethylethyl)aminocarbonyl)phenylamino]-1,3,5-triazin-2,4-yl)diimino]bis(benzoic acid 2-ethylhexyl ester);\n    3-(4′-methylbenzylidene)-D,L-camphor; 3-benzylidenecamphor; 2-ethylhexyl salicylate; 2-ethylhexyl 4-dimethylaminobenzoate; hydroxy-4-methoxybenzo-phenone-5-sulfonic acid (sulisobenzone) and the sodium salt; and/or 4-isopropyl-benzyl salicylate.",
        "As pigments/micropigments it is possible for example to use microfine titanium dioxide, mica-titanium oxide, iron oxides, mica-iron oxide, zinc oxide, silicon oxides, ultramarine blue, and chromium oxides.",
        "Examples of suitable antioxidants include superoxide dismutase, tocopherol (vitamin E), and ascorbic acid (vitamin C).",
        "Examples of suitable preservatives include phenoxyethanol, parabens, pentanediol or sorbic acid.",
        "As dyes it is possible to use the substances which are suitable and approved for cosmetic purposes.",
        "Suitable active antifungal substances (fungicides) include preferably ketoconazole, oxiconazole, bifonazole, butoconazole, cloconazole, clotrimazole, econazole, enilconazole, fenticonazole, isoconazole, miconazole, sulconazole, tioconazole, fluconazole, itraconazole, terconazole, naftifine and terbinafine, Zn pyrithione, and octopirox.",
        "Essential to the invention is that the described acryloyldimethyltaurate copolymers can be used even in the absence of an additional nonsurfactant coemulsifier (e.g., polymeric emulsifiers) and/or in the absence of an additional bodying agent. The presence of nonsurfactant coemulsifiers and/or bodying agents is therefore not mandatory, though is possible. Combination with other known nonsurfactant coemulsifiers and/or bodying agents may be desirable in order to set specific cosmetic profiles and to exploit synergistic effects.",
        "The qualities achieved are extremely innovative: the emulsions are creamy and ointmentlike and above all do not have the gellike or even gelatinelike appearance of certain prior art emulsions in which the external aqueous phase is thickened. The cosmetic feel on the skin is also very good. Upon application the emulsion imparts a sensation of freshness and of comfort, and at the same time has a rich and nourishing effect; it is soft and luxurious and in no way sticky. Emulsions of the invention can be prepared in a conventional manner, by hot, hot-hot/cold, or PIT emulsification, for example.",
        "The examples which follow are intended to illustrate the invention, though without restricting it thereto (the percentages are by weight). The copolymers used in the examples are representatives of the particularly preferred copolymers 1 to 67 already listed in the description. They were prepared by the therein-indicated processes 1, 2, 3 or 4 using the preferred initiators and solvents.",
        "O/W Skin Milk with Keratolytic Effect, Surfactant-free",
        "Composition",
        "A\nCopolymer No. 15\n 1.0%\n\n\n\n\nMineral oil\n4.00%\n\n\n\n\nAlmond oil\n4.00%\n\n\n\n\n®Cetiol SN (Henkel)\n8.00%\n\n\n\n\nCetearyl isononanoate\n\n\n\nB\n®Aristoflex AVC (Clariant)\n0.30%\n\n\n\n\nAmmonium acryloyldimethyltaurate/\n\n\n\n\nVP copolymer\n\n\n\nC\nWater\nad 100%  \n\n\n\n\nCitric acid\n0.30%\n\n\n\n\nMalic acid\n0.40%\n\n\n\n\nGlycolic acid\n0.70%\n\n\n\n\nLactic acid\n0.70%\n\n\n\nD\nFragrances\n0.30%\n\n\n\n\n\n\n\n\n\n\nPreparation",
        "I\nMix A and B.\n\n\n\nII\nMix the components C.\n\n\n\nIII\nAdd II to I.\n\n\n\nII\nStir D into I.\n\n\n\nIII\nHomogenize emulsion, pH 3.5.",
        "Surfactant-free Moisturizing Lotion",
        "A\nAlmond oil\n7.00%\n\n\n\n\nCyclomethicone\n5.00%\n\n\n\nB\nCopolymer No. 18\n1.50%\n\n\n\nC\nGlycerol\n7.00%\n\n\n\n\nWater\nad 100%  \n\n\n\n\nPreservative\nq.s.\n\n\n\nD\nFragrance\n0.30%",
        "Preparation",
        "I\nMix A and B.\n\n\n\nII\nStir solution of C into I.\n\n\n\nIII\nAdd D to II.\n\n\n\nIV\nHomogenize.\n\n\n\nV\npH 5.5.",
        "Refreshing, Surfactant-free Lotion",
        "A\nAlmond oil\n7.00%\n\n\n\n\nCyclomethicone\n5.00%\n\n\n\nB\nCopolymer No. 32\n1.50%\n\n\n\nC\nGlycerol\n3.00%\n\n\n\n\nEthanol\n20.00% \n\n\n\n\nWater\nad 100%  \n\n\n\n\nPreservative\nq.s.\n\n\n\nD\nFragrance\n0.30%",
        "Preparation",
        "I\nMix A and B.\n\n\n\nII\nStir solution of C into I.\n\n\n\nIII\nAdd D to II.\n\n\n\nIV\nHomogenize.",
        "Surfactant-free Lotion with Refreshing, Vivifying Effect",
        "A\nJojoba oil\n5.00%\n\n\n\n\nAlmond oil\n3.00%\n\n\n\n\nCetiol V\n3.00%\n\n\n\n\nDecyl oleate\n\n\n\nB\nCopolymer No. 35\n1.50%\n\n\n\nC\nGlycerol\n3.00%\n\n\n\n\nMenthol\n0.70%\n\n\n\n\nCamphor\n0.30%\n\n\n\n\nEthanol\n5.00%\n\n\n\n\nWater\nad 100%  \n\n\n\n\nPreservative\nq.s.\n\n\n\nD\nFragrance\n0.30%",
        "Preparation",
        "I\nMix A and B.\n\n\n\nII\nStir solution of C into I.\n\n\n\nIII\nAdd D to II.\n\n\n\nIV\nHomogenize.\n\n\n\nV\nAdjust pH to 6.00."
    ],
    "citations": [
        "3931089",
        "5368850",
        "5879718",
        "6054138",
        "6120780",
        "6403074",
        "6419912",
        "6468549",
        "6524564",
        "2363079",
        "0 815 828",
        "0 815 844",
        "0 815 845",
        "2 791 558",
        "WO 99/04750",
        "WO 00/12588"
    ],
    "us_classification": "424 7016",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "61",
            "subclass": "K",
            "main_group": "7",
            "subgroup": "06"
        }
    ]
}