{
    "title": "Device for adjusting the camshaft of an internal combustion engine and a mounting tool",
    "abstract": "The invention relates to a device (",
    "inventors": [
        "Ottersbach",
        "Eydam"
    ],
    "document_number": "07296547",
    "publication_date": "20071120",
    "assignees": [
        "Ina-Schaeffler KG"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A device for adjusting a camshaft of an internal combustion engine, comprising:",
            "components": [
                {
                    "component": "an internal rotor and an external rotor, said internal rotor being adjusted rotationally in relation to an external rotor, with the internal rotor being secured to a camshaft by means of a central screw,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the internal rotor and/or the external rotor has at least one recess for the engagement of a mounting tool such that the internal rotor and the external rotor can be securely fixed in terms of rotation,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the recess is produced on the internal rotor on a bore formed concentrically with respect to the rotational axis of the internal rotor, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the recess is produced on the external rotor on an external circumferential face formed concentrically with respect to the rotational axis of the external rotor.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The device according to claim 1 , characterized in that the at least one recess is embodied as a radially extending groove.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The device according to claim 1 , characterized in that the recess produced on the internal rotor extends in the axial direction over part (h) of the axial extent of the bore.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The device according to claim 1 , characterized in that the at least one recess produced on the internal rotor extends from an internal diameter (d",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The device according to claim 1 , characterized in that the at least one recess has a base region which is set back in the axial direction.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The device according to claim 5 , characterized in that the base region is continuous with a tool fitting region which is not arranged set back.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The device according to claim 1 , characterized in that three recesses are distributed over a circumference of the internal rotor or of the external rotor.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The device according to claim 7 , characterized in that the three recesses are arranged distributed non-uniformly over the circumference of the internal rotor or of the external rotor.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The device according to claim 1 , characterized in that the at least one recess is formed in the internal rotor or external rotor by means of a shaping process.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The device according to claim 1 , characterized in that the internal rotor is composed at least partially of sintered metal.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The device according to claim 1 , characterized in that the internal rotor is composed at least partially of non-metallic material.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A mounting tool for mounting the device according to claim 1 , comprising:",
            "components": [
                {
                    "component": "a hollow cylindrical section on which at least one correspondingly constructed projection is arranged in order to engage in the at least one recess.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The mounting tool according to claim 12 , further comprising a radially extending gripping arm arranged on the hollow cylindrical section.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The mounting tool according to claim 13 , wherein the gripping arm is welded to the hollow cylindrical section.",
            "components": []
        }
    ],
    "description": [
        "The invention relates to a device for adjusting the camshaft of an internal combustion engine, which has an internal rotor which can be adjusted rotationally in relation to an external rotor, with the internal rotor being secured to a camshaft by means of a central screw. Furthermore, the invention relates to a mounting tool for mounting such a device.",
        "Camshaft adjustment devices of this type are sufficiently known in the prior art. For example, in DE 198 08 618 A1, in DE 199 51 391 A1 and in DE 102 53 496 A1 solutions are described in which an internal rotor is screwed to the camshaft of the internal combustion engine by means of a central screw. The external rotor is operatively connected to the crankshaft via a chain or via a toothed belt. A relative rotational movement can be induced between the internal rotor and external rotor under the control of an external hydraulic application means. For this purpose, the internal rotor is embodied, for example, as an impeller wheel in which blades are formed or arranged. The blades are located in hydraulic chambers which are formed in the external rotor. By correspondingly acting on the respective side of the hydraulic chambers it is possible to adjust the internal rotor in relation to the external rotor between an “early stop” and a “late stop”.",
        "Occasionally the mounting of the device is problematic in this context: the internal rotor must be secured to the camshaft in a rotationally fixed fashion by means of the central screw. For this purpose, the screw has to be tightened with a predefined torque; it is screwed into the threaded bore in the camshaft which extends in the axial direction of the camshaft. In this context, the tightening torque is applied to the screw at its key face. The opposing torque is taken up on a key face on the camshaft. By tightening the screw, the internal rotor on the camshaft is rotationally fixed. In this context, the entire loading of the tightening torque is inevitably transmitted to the camshaft. As a result, the friction torque between the central screw head and the internal rotor is also transmitted to the clamping face between the internal rotor and camshaft, which can lead to slipping. This in turn leads to a situation in which the relative position between the internal rotor and camshaft changes, which causes a control time error which can have serious consequences.",
        "In order to remedy this it is basically possible to position under the central screw a washer which has a key face (for example hexagonal washer) in which a mounting tool can engage. As a result, when the central screw is tightened the opposing torque can be largely taken up via the washer—only the frictional torque in the thread has to be taken up via a key face on the camshaft—so that there is no risk of twisting of the internal rotor in relation to the camshaft. However it is disadvantageous here that an additional component is necessary (washer) which both entails additional costs and increases the axial installation space of the camshaft adjustment device.",
        "Finally, it is basically possible for the opposing torque to be applied to the external rotor of the camshaft adjuster when the central screw is tightened, for which purpose key faces can be provided on said camshaft adjuster. The tightening torque acting in the thread of the camshaft can be applied by means of key faces formed on the camshaft. As a result, the external rotor is loaded with a considerable torque, which is disadvantageous for the internal components of the camshaft adjuster. Considerable forces are applied to the blades or locking pins here since the tightening torque for the central screw is high compared to the operating torque.",
        "The present invention is therefore based on the object of developing a camshaft adjuster of the type mentioned at the beginning in such a way that the aforesaid disadvantages are avoided. It is also to be possible to tighten firmly the central screw which connects the internal rotor to the camshaft without high torque loading occurring between the individual components of the camshaft adjuster or between the internal rotor and camshaft. The intention here is to make possible a lightweight design of the camshaft adjuster, i.e. one dimensioning process on the operating torque of the camshaft adjuster is to be sufficient. In addition, there is to be no risk of a control time error occurring when the adjuster is mounted.",
        "The means of achieving this object by virtue of the invention is characterized in that the internal rotor and/or the external rotor has at least one recess for the engagement of a mounting tool, via which recess the internal rotor and the external rotor can be secured fixed in terms of rotation.",
        "This ensures that the torque opposing the tightening torque of the central screw is taken up directly on the internal rotor or on the external rotor so that in particular the connection between the internal rotor and camshaft is not loaded with a torque or only with a small torque. As a result, a relatively lightweight design of the camshaft adjuster is possible. Control time errors owing to the transmission of the tightening torque from the internal rotor to the camshaft are prevented.",
        "The recess for the engagement of the mounting tool is preferably produced on the internal rotor on a bore formed concentrically with respect to the rotational axis of the internal rotor. The recess can also be produced on the external rotor on an external circumferential face formed concentrically with respect to the rotational axis of the external rotor.",
        "The recess is preferably embodied as a radially extending groove. It can extend in the axial direction over part of the axial extent of the bore in the internal rotor. In this context, the recess may extend from an internal diameter to an external diameter on the internal rotor or on the external rotor.",
        "An improved fit of the mounting tool is obtained if the recess has a base region which is set back in the axial direction. The base region may be continuous here with a tool fitting region which is not arranged set back.",
        "Three recesses which are distributed over the circumference and in which the mounting tool can engage are preferably formed in the internal rotor or in the external rotor. In order to be able to apply the tool in just one position, it may also be provided that the three recesses are arranged distributed non-uniformly over the circumference of the internal rotor or of the external rotor.",
        "In terms of fabrication equipment it has proven valuable if the at least one recess is formed in the internal rotor or in the external rotor by means of a shaping process or a non-metal-cutting fabrication process.",
        "Sintered metal, for example sintered iron with alloy elements, or else a non-metallic material, may be used as the material for the internal rotor, and the internal rotor can also be composed only partially of the aforesaid materials.",
        "The mounting tool according to the invention for mounting the camshaft adjuster has a hollow cylindrical section on which at least one correspondingly constructed projection is arranged in order to engage in the at least one recess. Good handling of the tool is obtained if a radially extending gripping arm is arranged on the hollow cylindrical section, preferably being welded to it.",
        "An exemplary embodiment of the invention is illustrated in the drawings, in which:",
        "FIG. 1 shows a partially only very schematically illustrated device for camshaft adjustment of an internal combustion engine together with mounting tools in a section (section A-B according to FIG. 3),",
        "FIG. 2 shows the detail “Z” according to FIG. 1,",
        "FIG. 3 shows the view “C” according to FIG. 1 without mounting tools and only for the internal part of the device, and",
        "FIG. 4 shows the view “C” according to FIG. 1 of the mounting tool engaging in the internal rotor.",
        "FIG. 1 shows a camshaft adjuster 1 in which an internal rotor 2 and an external rotor 3 are outlined only very schematically, which internal rotor 2 and external rotor 3 can be set with respect to one another between two end positions by means of a hydraulic adjustment mechanism (not illustrated). By way of example, reference is made to DE 101 35 146 A1 where the customary method of operation of a hydraulic camshaft adjuster is explained.",
        "An operative connection between the crankshaft of the internal combustion engine and the drive gear wheel 20 is brought about by means of a chain (not illustrated), said drive gear wheel 20 being connected fixed in terms of rotation to the external rotor 3. The adjustment mechanism (not illustrated) brings about a relative rotational position between the external rotor 3 and internal rotor 2. The internal rotor 2 is screwed to the camshaft 5 of the internal combustion engine by means of a central screw 4 so as to be fixed in terms of rotation. The internal rotor 2 has a bore 11 which is formed concentrically with respect to the rotational axis 10 of the crankshaft 5 and in whose center the central screw 4 is arranged.",
        "So that a high torque does not need to be transmitted from the internal rotor 2 to the camshaft 5 when the central screw 4 is tightened on the camshaft 5 with a relatively high torque—which can lead to undesired twisting and thus to control time faults—recesses 6 (which are illustrated in detail in FIGS. 2 and 3) are provided in the bore 11 in the axial edge region of the internal rotor 2. In accordance with this the recesses 6 are configured in the form of grooves, in which case they extend from the internal diameter di of the bore to an external diameter da. The axial extent of the recesses 6 is given by h in FIG. 2; viewed together with FIG. 1 it is apparent that the extent h only makes up part of the entire depth of the bore. FIG. 3 shows that three recesses 6 are provided in the internal rotor 2, said recesses 6 being arranged distributed non-uniformly over the circumference. Two recesses 6 lie diametrically opposite one another in the bore 11, while the third recess 6 is arranged between them. This ensures that the tool which is constructed so as to be complementary with respect to the recesses 6 can be fitted in only one position on the internal rotor 2.",
        "FIG. 2 also shows that the recess 6 has a base region 13 which is arranged axially set back with respect to a tool fitting region 14. This permits the mounting tool to be fitted precisely.",
        "Corresponding to the recesses 6 on the internal rotor 2, recesses 7 are arranged on the external rotor 3 and are embodied in an analogous fashion. Here, the recesses extend from an internal diameter Di (see FIG. 1) to an external diameter Da which is at the height of the external circumferential face 12 of the external rotor 3.",
        "The mounting tool 8 which is used for mounting the internal rotor 2 on the camshaft 5, for the purpose of engagement in the recesses 6 in the internal rotor 2, is outlined in FIG. 4. Said mounting tool 8 has, on a hollow cylindrical section 15, three integrally formed-on projections 17 which correspond to the shape of the recesses 6. A gripping arm 18 permits the mounting tool 8 to be secured with a corresponding lever when the central screw 4 is tightened.",
        "The mounting tool 9 which is used for engagement in the external rotor 3 is of corresponding design to the mounting tool 8.",
        "FIG. 1 shows how the mounting tools 8 and 9 are fitted onto the camshaft adjuster 1 in order to tighten the central screw 4. The mounting tools 8 and 9 are outlined here in a position in which they have been pulled off the camshaft adjuster 1. The mounting tool 8 engages with its projections 17 (see FIG. 4) in the recesses 6, which prevents the internal rotor 2 from being rotated by tightening the gripping arm 18. In a corresponding way, the mounting tool 9 engages with its projections (not illustrated) arranged on the hollow cylindrical section 16 in the recesses 7 in the external rotor 3, as a result of which the external rotor 3 can be prevented from rotating by tightening the gripping arm 19. After this, the central screw 4 can be tightened by means of a tightening nut 21 without any appreciable torque having to be applied to the camshaft 5.",
        "1 Device for adjusting a camshaft\n    2 Internal rotor\n    3 External rotor\n    4 Central screw\n    5 Camshaft\n    6 Recess\n    7 Recess\n    8 Mounting tool\n    9 Mounting tool\n    10 Rotational axis\n    11 Bore\n    12 External circumferential face\n    13 Base region\n    14 Tool fitting region\n    15 Hollow cylindrical section\n    16 Hollow cylindrical section\n    17 Projection\n    18 Gripping arm\n    19 Gripping arm\n    20 Drive gear wheel\n    21 Tightening nut\n    h Axial extent of the recess\n    di Internal diameter\n    da External diameter\n    Di Internal diameter\n    Da External diameter"
    ],
    "citations": [
        "5592910",
        "5882181",
        "6439180",
        "6843215",
        "2003/0070639",
        "19612 397",
        "197 09 6556",
        "198 27 860",
        "10 2004 035 077",
        "WO 2004057163"
    ],
    "us_classification": "123 9017",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "F",
            "classification_class": "01",
            "subclass": "L",
            "main_group": "1",
            "subgroup": "34"
        }
    ]
}