{
    "title": "Fixture for magnetization of a shaft for a linear stepper motor",
    "abstract": "In a preferred embodiment, a fixture for magnetizing axially alternating N and S poles defined circumferentially in a portion of an outer periphery of an axially extending, cylindrical, smooth shaft, the fixture including: a hollow cylindrical mandrel formed from a non-magnetic, non-electrically-conducting material; a conductive wire disposed in parallel, circumferential channels defined in an outer surface of the mandrel; a potting compound surrounding the mandrel to secure the conductive wire in place; and a central bore defined axially and centrally through the mandrel and exposing or nearly exposing the conductive wire; and the central bore being sized to accept axially inserted therein the portion of the axially extending, cylindrical, smooth shaft. Methods of using and manufacturing the fixture are also provided.",
    "inventors": [
        "Pulford, Jr."
    ],
    "document_number": "07296342",
    "publication_date": "20071120",
    "assignees": [
        "Tritex Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A fixture for magnetizing axially alternating N and S poles defined circumferentially in a portion of an outer periphery of an axially extending, cylindrical, smooth shaft, said fixture comprising:",
            "components": [
                {
                    "component": "(a) a hollow cylindrical one and only one mandrel formed from a non-magnetic, non-electrically-conducting material;",
                    "subcomponents": []
                },
                {
                    "component": "(b) one and only one conductive wire disposed in parallel, circumferential channels defined in an outer surface of said one and only one mandrel;",
                    "subcomponents": []
                },
                {
                    "component": "(c) a potting compound surrounding said one and only one mandrel to secure said one and only one conductive wire in place;",
                    "subcomponents": []
                },
                {
                    "component": "(d) a central bore defined axially and centrally through said one and only one mandrel and exposing or nearly exposing said one and only one conductive wire; and",
                    "subcomponents": []
                },
                {
                    "component": "(e) said central bore being sized to accept axially inserted therein said portion of said axially extending, cylindrical, smooth shaft to impress thereon alternating axial permanent magnet poles.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A fixture, as defined in claim 1 , wherein: said one and only one conductive wire is placed in said parallel, circumferential channels such that direction of flow in said one and only one conductive wire of a direct current in adjacent ones of said parallel, circumferential channels is in opposite directions.",
            "components": []
        }
    ],
    "description": [
        "The present application is a divisional application of Ser. No. 09/783,179, filed Feb. 12, 2001, and titled LINEAR STEPPER MOTOR AND FIXTURE FOR THE MAGNETIZATION OF THE SHAFT THEREOF AND METHODS, now U.S. Pat. No. 6,756,705, issued Jun. 29, 2004, which claims the benefit of the filing dates of U.S. Provisional Applications Nos. 60/181,449, filed Feb. 10, 2000, and titled LINEAR STEPPER MOTOR and 60/220,369, filed Jul. 24, 2000, and titled METHOD AND FIXTURE FOR MANUFACTURE OF A LINEAR STEPPER MOTOR SHAFT.",
        "1. Field of the Invention",
        "The present invention relates to stepper motors generally and, more particularly, but not by way of limitation, to a novel fixture for the magnetization of the shaft of a linear stepper motor, and methods of use and manufacture of the same.",
        "2. Background Art",
        "Some linear stepper motors convert rotary motion to linear motion by mechanical means such as through the use of a threaded nut and lead screw. Conventional linear motors that directly transfer electromagnetic energy in the stator poles to linear movement of a shaft typically employ toothed structures or have relatively complicated slide/stator arrangements. In either case, the manufacture of such motors is relatively expensive and the motors typically have high parts counts.",
        "A problem resides in producing a linear motor with a smooth shaft with alternating N and S poles. One technique is to glue together cylindrical segments of N and S magnets. That technique, however, is time consuming and results in a somewhat weak structure. Another technique is to roll a cylinder of ferromagnetic material over a flat plate orthogonal to a series of alternating N and S magnetic strips. This technique is somewhat clumsy and suffers from the fact that the resulting magnetized shaft is of fairly weak magnetic strength.",
        "Some conventional motors are described in the following patent documents:",
        "U.S. Pat. No. 3,867,676, issued Feb. 18, 1975, to Chai et al., and titled VARIABLE RELUCTANCE LINEAR STEPPER MOTOR, describes such a motor that has toothed structures on the coils and on the linear member. The novelty of the patent appears to reside in the arrangement of the coils and the manner in which they are energized.",
        "U.S. Pat. No. 4,198,582, issued Apr. 15, 1980, to Matthias et al., and titled HIGH PERFORMANCE STEPPER MOTOR, describes, in part, a variable reluctance linear stepper motor in which both the stator and the slider have nonmagnetic materials arranged therein such that flux leakage is reduced.",
        "U.S. Pat. No. 4,286,180, issued Aug. 25, 1981, to Langley, and titled VARIABLE RELUCTANCE STEPPER MOTOR, describes, in part, such a motor having helically toothed stator and slide structures, the respective widths of the teeth having a predetermined relationship.",
        "U.S. Pat. No. 4,408,138, issued Oct. 4, 1983, to Okamoto, and titled LINEAR STEPPER MOTOR, describes a linear stepper motor having toothed structures on the stator and on the slider. Coil-wound salient poles are provided on the slider. The novelty of the patent appears to reside in the arrangement of rollers and rails disposed between the stator and the slider.",
        "U.S. Pat. No. 4,607,197, issued Aug. 19, 1986, to Conrad, and titled LINEAR AND ROTARY ACTUATOR, describes a variable reluctance linear/rotary motor in which the armature has axial rows of teeth radially spaced around the surface thereof. Selective energization of stator windings provides linear, rotary, or both linear and rotary motion of the armature.",
        "U.S. Pat. No. 4,622,609, issued Nov. 11, 1986, to Barton, and titled READ/WRITE HEAD POSITIONING APPARATUS, describes a variable reluctance positioning device having toothed structures on facing surfaces of the stator and the armature and with coils placed on the armature.",
        "U.S. Pat. No. 4,695,777, issued Sep. 22, 1987, to Asano, and titled VR TYPE LINEAR STEPPER MOTOR, describes such a motor having toothed structures on the stator and on the slider, the toothed structures on the stator being on coil-wound salient poles. The toothed structures bear a predetermined relationship therebetween.",
        "U.S. Pat. No. 4,712,027, issued Dec. 8, 1987, to Karidis, and titled RADIAL POLE LINEAR RELUCTANCE MOTOR, describes such a motor having a smooth double-helix stator shaft and a smooth laminated armature of alternate radial pole laminations and spacer laminations. This arrangement permits a balanced flux path and uses the stator and armature surfaces as slider bearing surfaces.",
        "U.S. Pat. No. 4,810,914, issued Mar. 7, 1989, to Karidis et al., and titled LINEAR ACTUATOR WITH MULTIPLE CLOSED LOOP FLUX PATHS ESSENTIALLY ORTHOGONAL TO ITS AXIS, describes a variable reluctance actuator similar in pertinent respects to that described in the '027 patent above.",
        "U.S. Pat. No. 6,016,021, issued Jan. 18, 2000, to Hinds, and titled LINEAR STEPPER MOTOR, describes a variable reluctance stepper motor similar in pertinent respects to the motor described in the '609 patent above. The novelty of the patent appears to reside in the method of forming the teeth.",
        "Accordingly, it is a principal object of the present invention to provide a permanent magnet shaft for a linear stepper motor that has a smooth, external peripheral surface.",
        "It is a further object of the invention to provide a linear stepper motor that has low parts counts and is simple and economical to manufacture.",
        "It is an additional object of the invention to provide a method of magnetizing a smooth shaft for a linear stepper motor that is quick and economical.",
        "It is another object of the invention to provide a fixture for magnetizing a smooth shaft for a linear stepper motor.",
        "It is yet a further object of the invention to provide a fixture for magnetizing a smooth shaft for a linear stepper motor that can be economically manufactured.",
        "It is yet an additional object of the invention to provide such a stepper motor conventional coils each easily wound around a bobbin.",
        "It is yet another object of the invention to provide such a stepper motor having a shaft that can rotate at any position at any time, whether or not the motor is on or off or the shaft is moving linearly.",
        "Other objects of the present invention, as well as particular features, elements, and advantages thereof, will be elucidated in, or be apparent from, the following description and the accompanying drawing figures.",
        "The present invention achieves the above objects, among others, by providing, in a preferred embodiment, a fixture for magnetizing axially alternating N and S poles defined circumferentially in a portion of an outer periphery of an axially extending, cylindrical, smooth shaft, said fixture comprising: a hollow cylindrical mandrel formed from a non-magnetic, non-electrically-conducting material; a conductive wire disposed in parallel, circumferential channels defined in an outer surface of said mandrel; a potting compound surrounding said mandrel to secure said conductive wire in place; and a central bore defined axially and centrally through said mandrel and exposing or nearly exposing said conductive wire; and said central bore being sized to accept axially inserted therein said portion of said axially extending, cylindrical, smooth shaft. Methods of using and manufacturing said fixture are also provided.",
        "Understanding of the present invention and the various aspects thereof will be facilitated by reference to the accompanying drawing figures, provided for purposes of illustration only and not intended to define the scope of the invention, on which:",
        "FIG. 1 is a fragmentary, side elevational view, partially in cross-section, of a linear stepper motor constructed according to the present invention.",
        "FIG. 2 is a rear elevational view of the motor of FIG. 1.",
        "FIG. 3 is an isometric view of a grooved mandrel for use in fabricating a fixture for magnetizing the shaft of the motor of FIG. 1.",
        "FIG. 4 is an isometric view of the mandrel of FIG. 3 with a conductive wire inserted in the grooves of the mandrel.",
        "FIG. 5 is an schematic, isometric view of the conductive wire showing the path of a direct current flowing therein.",
        "FIG. 6 is an isometric view, partially cut-away, showing the mandrel of FIG. 3 inserted in a potting fixture.",
        "FIG. 7 is an isometric view showing a magnetizing fixture according to the present invention.",
        "Reference should now be made to the drawing figures on which similar or identical elements are given consistent identifying numerals throughout the various figures thereof, and on which parenthetical references to figure numbers direct the reader to the view(s) on which the element(s) being described is (are) best seen, although the element(s) may be seen on other figures also.",
        "FIG. 1 illustrates a linear stepper motor, constructed according to the present invention, and generally indicated by the reference numeral 20. Motor 20 includes a shaft, or slider, 30 having a smooth outer peripheral surface (at least the portion thereof illustrated) and inserted in a stator structure, generally indicated by the reference numeral 32, for axial back and forth motion of the shaft with respect to the stator structure.",
        "Shaft 30 includes a plurality of alternating N and S nonsalient poles, as at 34 and 36, respectively, formed around the periphery thereof, which poles may be formed as described below. Shaft 30 is preferably a hollow cylinder of ceramic or rare earth magnetic material, although the shaft may be solid or may have a core of ferromagnetic or other material with a hollow cylinder of the magnetic material disposed around the core. Shaft 30 can be economically constructed, for example, by conventional extrusion techniques that can produce a shaft of any given length or the shaft can be cut to a suitable length from extruded stock. At least the portion of shaft 30 containing the N and S poles is non-segmented and is constructed of a single piece of material.",
        "Stator structure 32 includes first and second, cylindrical, coils 40 and 42, respectively, encircling shaft 30, and conventionally wound on first and second annular bobbins 44 and 46. Bobbins 44 and 46 are formed of an electrically insulating material such as Delrin®. First and second bobbins 44 and 46 are spaced apart by a first spacer 50 and the second bobbin may be spaced apart from an end plate 52 of motor 20 by a second spacer 54. First and second spacers 50 and 54 may also provide bearing surfaces for shaft 30, in which case the first and second spacers are preferably of a material having a high degree of lubricity such as Delrin®.",
        "First bobbin 44 spaces apart annular pole plates 60 and 62, while second bobbin 46 spaces apart annular pole plates 64 and 66. A steel band 68 surrounds and is in good electrical contact with annular pole plates 60, 62, 64, and 66, thus completing the circular electromagnetic circuit. Annular pole plates 60, 62, 64, and 66 have nonsalient poles.",
        "It will be understood that, by suitable energization of first and second coil-wound bobbins in a conventional manner, shaft 30 may be made to incrementally “step” to the left or right on FIG. 1. It will be further understood that one or both ends of shaft 30 may be attached to, or bear against, one or more elements of another device (not shown).",
        "While motor 20 is shown as having one set of two-phase stator sections, that is, the motor has two coils, it will be understood that other arrangements are possible as well. For example, two or more sets of two-phase stator sections may be provided for greater power, the additional sets of stator sections being added serially in a modular manner.",
        "FIG. 2 illustrates some of the elements of motor 20 (FIG. 1) and illustrates conductors 70 that are used to energize stator structure 32 and mounting holes 72 defined in end plate 52.",
        "Thus arranged, motor 20 as shown (FIG. 1) in its minimum configuration is constructed of only 11 individual elements that may be held together principally with a suitable adhesive or other conventional means may be provided to secure together the elements of motor 20.",
        "FIG. 3 illustrates a mandrel 100 that can be used in constructing a fixture for use in magnetizing shaft 30 (FIG. 1). Here a cylindrical mandrel 100 has a plurality of parallel, cylindrical grooves, as at 110, cut in the outer periphery thereof, the groove having a width approximating the diameter of a wire conductor to be used in magnetizing shaft 30. Mandrel 100 is constructed of a non-magnetic, non-electrically-conducting material, with the spacing of grooves 110 being determined by the final magnetic widths of poles 34 and 36 on shaft 30.",
        "FIG. 4 illustrates a conductive wire 150 serially disposed in grooves 110 in mandrel 100.",
        "FIG. 5 illustrates the current path in conductive wire 150, each nearly complete circle shown on FIG. 5 representing a turn of conductive wire 150 in one of grooves 110. It will be noticed that the current flow represented by the arrows in conductive wire 150 in adjacent turns of the conductive wire are in opposite directions.",
        "FIG. 6 illustrates mandrel 100, with conductive wire 150 placed in grooves 110, disposed in a cylindrical, hollow potting fixture 200. In this step, a suitable potting compound, such as an epoxy material, is poured into an annulus 210 defined between the outer surface of mandrel 100 and the inner surface of potting fixture 200. After hardening, the potting compound holds conductive wire 150 in place in grooves 110.",
        "FIG. 7 illustrates a finished magnetizing fixture, generally indicated by the reference numeral 300. Fixture 300 comprises mandrel 100 with an outer coating of potting compound 310 and ends of conductive wire 150 extending therefrom. A central axial bore 320 has been created, or enlarged, through mandrel 100 to bring conductive wire 150 near to the inner surface of the mandrel or even to be partially exposed, as shown on FIG. 7, if desired.",
        "Shaft 30 of motor 20 (FIG. 1) can now be inserted into fixture 300 and a high level of direct current passed through conductive wire 150 to magnetize alternating N and S poles 34 and 36 along a selected length thereof. Such an arrangement provides an economical and rapid method of magnetizing shaft 30 and nearly any strength of magnetization can be provided, depending on the magnet material, since only one quick burst of direct current is necessary and that can be in a wide range of voltages.",
        "Motor 20 (FIG. 1) has a number of important features. For example, motor 20 is of a brushless, magnetically coupled, bi-directional, non-arcing design, having long operational life, with permanently magnetized output shaft 30. Motor 20 runs on conventional stepper motor drives and can be microstepped for increased resolution and accuracy. Shaft 30 is the only moving part and it can be rotated 360° continuously or intermittently in either direction, at any time and at any linear position, including when motor 20 is not energized. There is no conversion of rotary motion to linear motion with the concomitant efficiency losses. There are no lead screws, ball screws, or ball bearings to wear out and no lubrication is required. Motor 20 can operate in any orientation and is back-driveable (especially at low or zero power input), that is, shaft 30 can be moved by overcoming the magnetic force between the shaft and annular pole plates 64 and 66. Performance of motor 20 can be increased with shorter duty cycles and can be easily constructed for vacuum environments, that is, it can be constructed of materials that do not out gas in a vacuum, the lack of lubrication contributing to this feature. Shaft 30 when hollow allows the pass-through of electrical, optical, and/or fluid lines, and/or the like.",
        "In the embodiments of the present invention described above, it will be recognized that individual elements and/or features thereof are not necessarily limited to a particular embodiment but, where applicable, are interchangeable and can be used in any selected embodiment even though such may not be specifically shown.",
        "Terms such as “upper”, “lower”, “inner”, “outer”, “inwardly”, “outwardly”, “vertical”, “horizontal”, and the like, when used herein, refer to the positions of the respective elements shown on the accompanying drawing figures and the present invention is not necessarily limited to such positions.",
        "It will thus be seen that the objects set forth above, among those elucidated in, or made apparent from, the preceding description, are efficiently attained and, since certain changes may be made in the above construction without departing from the scope of the invention, it is intended that all matter contained in the above description or shown on the accompanying drawing figures shall be interpreted as illustrative only and not in a limiting sense.",
        "It is also to be understood that the following claims are intended to cover all of the generic and specific features of the invention herein described and all statements of the scope of the invention which, as a matter of language, might be said to fall therebetween."
    ],
    "citations": [
        "2095420",
        "4514712",
        "62-94903"
    ],
    "us_classification": "29737",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "23",
            "subclass": "P",
            "main_group": "19",
            "subgroup": "04"
        }
    ]
}