{
    "title": "Removing crosstalk in an organic light-emitting diode display",
    "abstract": "A driver includes a plurality of variable resistors each coupled to a corresponding one of the rows of the organic light-emitting diode display panel, generally between Ground (GND) and the cathodes of the OLEDs on the rows. A variable resistor controller in the driver is coupled to the variable resistors, and adjusts the resistance of the variable resistor coupled to the selected row based upon the display data corresponding to the selected row. The variable resistor controller adjusts the resistance of the variable resistor coupled to the selected row to be inversely proportional to the sum of the display data corresponding to the selected row.",
    "inventors": [
        "Kim"
    ],
    "document_number": "07298351",
    "publication_date": "20071120",
    "assignees": [
        "Leadia Technology, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A driver for driving an organic light-emitting diode (OLED) display panel including a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns, the driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows in accordance with display data corresponding to said selected one of the rows, the driver comprising:",
            "components": [
                {
                    "component": "a plurality of variable resistors, each of the variable resistors coupled to a corresponding one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "a variable resistor controller coupled to the variable resistors, the variable resistor controller adjusting a resistance of the variable resistor coupled to said selected one of the rows to be inversely proportional to a sum of the display data corresponding to said selected one of the rows.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The driver of claim 1 , wherein the variable resistor controller adjusts the resistance of the variable resistor coupled to said selected one of the rows in accordance with:",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The driver of claim 1 , wherein the variable resistor controller comprises an adder for adding the display data corresponding to said selected one of the rows to generate the sum of the display data.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The driver of claim 1 , wherein the display data are 1-bit data indicating 2 levels of brightness.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The driver of claim 1 , wherein the display data are 2-bit data indicating 4 levels of brightness.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The driver of claim 1 , wherein each of the variable resistors is coupled between Ground (GND) and cathodes of the OLEDs on said corresponding one of the rows.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The driver of claim 1 , wherein each of the variable resistors is decoupled from said corresponding one of the rows if said corresponding one of the rows is not selected by the driver.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A driver for driving an organic light-emitting diode (OLED) display panel including a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns, the driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows, the driver comprising:",
            "components": [
                {
                    "component": "a plurality of variable resistors, each of the variable resistors coupled to a corresponding one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "a variable resistor controller coupled to the variable resistors, the variable resistor controller adjusting a resistance of the variable resistor coupled to said selected one of the rows to be inversely proportional to a sum of the current driving the OLEDs coupled between the columns and said selected one of the rows.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. In a driver for driving an organic light-emitting diode (OLED) display panel including a plurality of organic light emitting diodes (OLED) arranged in rows and columns, the driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows in accordance with display data corresponding to said selected one of the rows, a method comprising:",
            "components": [
                {
                    "component": "determining a sum of the display data corresponding to said selected one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "adjusting a resistance of a variable resistor coupled to said selected one of the rows to be inversely proportional to the sum of the display data corresponding to said selected one of the rows.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 9 , wherein adjusting a resistance of a variable resistor comprises adjusting the resistance of the variable resistor coupled to said selected one of the rows in accordance with:",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 9 , wherein the display data are 1-bit data indicating 2 levels of brightness.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 9 , wherein the display data are 2-bit data indicating 4 levels of brightness.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. In a driver for driving an organic light-emitting diode (OLED) display panel including a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns, the driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows, a method comprising:",
            "components": [
                {
                    "component": "determining a sum of the current driving the OLEDs coupled between the columns and said selected one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "adjusting a resistance of a variable resistor coupled to said selected one of the rows to be inversely proportional to the sum of the current.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A driver for driving an organic light-emitting diode (OLED) display panel including a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns, the driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows in accordance with display data corresponding to said selected one of the rows, the driver comprising:",
            "components": [
                {
                    "component": "a plurality of variable resistor means for providing variable resistance to a corresponding one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "controller means coupled to the plurality of variable resistor means, the controller means adjusting a resistance of the variable resistor means coupled to said selected one of the rows to be inversely proportional to a sum of the display data corresponding to said selected one of the rows.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The driver of claim 14 , wherein the controller means adjusts the resistance of the variable resistor means coupled to said selected one of the rows in accordance with:",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A driver for driving an organic light-emitting diode (OLED) display panel including a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns, the driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows, the driver comprising:",
            "components": [
                {
                    "component": "a plurality of variable resistor means, each of the variable resistor means coupled to a corresponding one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "controller means coupled to the plurality of variable resistor means, the controller means adjusting a resistance of the variable resistor means coupled to said selected one of the rows to be inversely proportional to a sum of the current driving the OLEDs coupled between the columns and said selected one of the rows.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. An organic light-emitting diode (OLED) display device comprising:",
            "components": [
                {
                    "component": "an OLED display panel including a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns; and",
                    "subcomponents": []
                },
                {
                    "component": "a driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows in accordance with display data corresponding to said selected one of the rows, the driver comprising:",
                    "subcomponents": [
                        "a plurality of variable resistors, each of the variable resistors coupled to a corresponding one of the rows; and",
                        "a variable resistor controller coupled to the variable resistors, the variable resistor controller adjusting a resistance of the variable resistor coupled to said selected one of the rows to be inversely proportional to a sum of the display data corresponding to said selected one of the rows."
                    ]
                },
                {
                    "component": "a plurality of variable resistors, each of the variable resistors coupled to a corresponding one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "a variable resistor controller coupled to the variable resistors, the variable resistor controller adjusting a resistance of the variable resistor coupled to said selected one of the rows to be inversely proportional to a sum of the display data corresponding to said selected one of the rows.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The organic light-emitting diode display device of claim 17 , wherein the variable resistor controller adjusts the resistance of the variable resistor coupled to said selected one of the rows in accordance with:",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The organic light-emitting diode display device of claim 17 wherein the variable resistor controller includes an adder for adding the display data corresponding to said selected one of the rows to generate the sum of the display data.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The organic light-emitting diode display device of claim 17 , wherein the display data are 1-bit data indicating 2 levels of brightness.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The organic light-emitting diode display device of claim 17 , wherein the display data are 2-bit data indicating 4 levels of brightness.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The organic light-emitting diode display device of claim 17 , wherein each of the variable resistors is coupled between Ground (GND) and cathodes of the OLEDs on said corresponding one of the rows.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The organic light-emitting diode display device of claim 17 , wherein each of the variable resistors is decoupled from said corresponding one of the rows if said corresponding one of the rows is not selected by the driver.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. An organic light-emitting diode (OLED) display device comprising:",
            "components": [
                {
                    "component": "an organic light-emitting diode display panel including a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns; and",
                    "subcomponents": []
                },
                {
                    "component": "a driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows, the driver comprising:",
                    "subcomponents": [
                        "a plurality of variable resistors, each of the variable resistors coupled to a corresponding one of the rows; and",
                        "a variable resistor controller coupled to the variable resistors, the variable resistor controller adjusting a resistance of the variable resistor coupled to said selected one of the rows to be inversely proportional to a sum of the current driving the OLEDs coupled between the columns and said selected one of the rows."
                    ]
                },
                {
                    "component": "a plurality of variable resistors, each of the variable resistors coupled to a corresponding one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "a variable resistor controller coupled to the variable resistors, the variable resistor controller adjusting a resistance of the variable resistor coupled to said selected one of the rows to be inversely proportional to a sum of the current driving the OLEDs coupled between the columns and said selected one of the rows.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. In an organic light-emitting diode (OLED) display device including an organic light-emitting diode display panel having a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns and a driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows in accordance with display data corresponding to said selected one of the rows, a method comprising:",
            "components": [
                {
                    "component": "determining a sum of the display data corresponding to the columns and said selected one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "adjusting a resistance of a variable resistor coupled to said selected one of the rows to be inversely proportional to a sum of the display data corresponding to said selected one of the rows.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The method of claim 25 , wherein adjusting a resistance of a variable resistor comprises adjusting the resistance of the variable resistor coupled to said selected one of the rows in accordance with:",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The method of claim 25 , wherein the display data are 1-bit data indicating 2 levels of brightness.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The method of claim 25 , wherein the display data are 2-bit data indicating 4 levels of brightness.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. In an organic light-emitting diode (OLED) display device including an organic light-emitting diode display panel having a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns and a driver configured to select one of the rows and to provide current driving the OLEDs coupled between the columns and said selected one of the rows, a method comprising:",
            "components": [
                {
                    "component": "determining a sum of the current driving the OLEDs coupled between the columns and said selected one of the rows; and",
                    "subcomponents": []
                },
                {
                    "component": "adjusting a resistance of a variable resistor coupled to said selected one of the rows to be inversely proportional to the sum of the current.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "The present invention relates to an organic light-emitting diode (OLED) display panel and, more specifically, to driving the OLED display panel without generating crosstalk.",
        "An OLED display panel is generally comprised of an array of organic light emitting diodes (OLEDs) that have carbon-based films or other organic material films between two charged electrodes, generally a metallic cathode and a transparent anode typically being glass. Generally, the organic material films are comprised of a hole-injection layer, a hole-transport layer, an emissive layer and an electron-transport layer. When voltage is applied to the OLED cell, the injected positive and negative charges recombine in the emissive layer and create electro-luminescent light. Unlike liquid crystal displays (LCDs) that require backlighting, OLED displays are self-emissive devices—they emit light rather than modulate transmitted or reflected light. Accordingly, OLEDs are brighter, thinner, faster and lighter than LCDs, and use less power, offer higher contrast and are cheaper to manufacture.",
        "An OLED display panel is driven by a driver including a row driver and a column driver. A row driver typically selects a row of OLEDs in the display panel, and the column driver provides driving current to one or more of the OLEDs in the selected row to light the selected OLEDs according to the display data.",
        "Conventional OLED display panels have the shortcoming that cross-talk is generated in the display panel. The problem of cross-talk in conventional OLED display panels will be explained in greater detail below with reference to FIG. 1.",
        "FIG. 1 illustrates a conventional OLED display panel driven by a conventional driver. The OLED display panel 100 comprises an array of OLEDs 102 coupled between the rows and columns of the display panel 100. The anodes of the OLEDs 102 are coupled to the columns and the cathodes of the OLEDs 102 are coupled to the rows of the display panel 100. The OLED display panel 100 is driven by driver including a row driver 120 and a column driver 140.",
        "The row driver 120 includes row driver control circuitry (not shown) configured to couple the cathodes of the OLEDs associated with a row ( . . . ROW(n−1), ROW(n), ROW(n+1), ROW(n+2) . . . ) of the display panel 100 to either a low voltage (e.g., GND) via resistors ( . . . RL(n−1), RL(n), RL(n+1), RL(n) . . . ) by closing the switches 126 and opening the switches 124 to select the row or to a high voltage (e.g., VCC) by closing the switches 124 and opening the switches 126 to unselect the row. For example, in FIG. 1, ROW(n) is shown selected with the switch 126 associated with ROW(n) being closed to couple ROW(n) to GND. The selection of ROW(n) by the row driver 120 forward-biases the OLEDs 102 coupled to ROW(n).",
        "The column driver 140 includes current sources 142 that provide current ( . . . I(n−1), I(n), I(n+1), and I(n+2) . . . ) to the columns (C(n−1), C(n), C(n+1), C(n+2) . . . ) of the panel 100 to drive OLEDs on the columns. Once a row is selected by the row driver 120, the current sources 142 of the column driver 140 generate current ( . . . I(n−1), I(n), I(n+1), and I(n+2) . . . ) for the corresponding columns (C(n−1), C(n), C(n+1), C(n+2) . . . ) according to the corresponding display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ) to drives the OLEDs 102 on the selected row. The amount of current ( . . . I(n−1), I(n), I(n+1), and I(n+2) . . . ) is typically generated to be multiples of a unit driving current (e.g., Iw) and proportional to the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ).",
        "In one embodiment, the display data may be 1-bit data indicating 2 levels of brightness, for example, bright (“1”) or dark (“0”), of the OLEDs 102. Thus, the current ( . . . I(n−1), I(n), I(n+1), I(n+2) . . . ) from the current sources 142 is generated to be, for example, 0 or Iw. In another embodiment, the display data may be 2-bit data indicating 4 levels of brightness, for example, very dark (“0”), dark (“1”), bright (“2), and very bright (“3”), of the OLEDs 102. Thus, the current ( . . . I(n−1), I(n), I(n+1), I(n+2) . . . ) from the current sources 142 is generated to be, for example, 0 or Iw, 2×Iw, or 3×Iw. The OLEDs 102 in the selected row (e.g., ROW(n)) are lit (Iw, 2×Iw, or 3×Iw) or unlit (zero current) based upon the current ( . . . I(n−1), I(n), I(n+1), and I(n+2) . . . ) corresponding to the columns (C(n−1), C(n), C(n+1), C(n+2) . . . ) of the panel 100.",
        "As can be seen from FIG. 1, the sink current (Isink(n)) of a selected row (ROW(n)) is determined by the sum of the current ( . . . I(n−1), I(n), I(n+1), I(n+2) . . . ) driving the columns (C(n−1), C(n), C(n+1), C(n+2) . . . ) of the selected row (ROW(n)), which in turn is determined by the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ). Therefore, the sink voltage Vsink(n) across RL(n) coupled to the selected row ROW(n) is also determined by the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ), since Vsink(n)=Isink(n)×RL(n). This means that the sink voltage Vsink(n) for the rows of the panel 100 are different from each other, since the column display data varies from row to row. This will be explained in greater detail with reference to FIG. 2.",
        "FIG. 2 is illustrates a sample image for display to a conventional OLED display panel 100 by the display data. As shown in FIG. 2, each of the columns 1-100 is driven by a unit current source Iw. The display data is configured to make the region 202 of the panel 100 “black” while making the remaining areas 204 “white.” Assuming a 2-bit display data (0 or 1), the current Iw will flow through the OLEDs coupled between row E and every column (0-100) to light the OLEDs on row E, making the-total sink current Isink(E) for row E as large as 100×Iw. In contrast, the current Iw will flow through the OLEDs coupled between row F and the columns 1-30 and columns 61-100 to light the OLEDs but not between row F and columns 31-60 on row F, making the total sink current Isink(F) for row F merely 70×Iw. Therefore, the sink voltages Vsink(E) and Vsink(F) on the resistors RL(E) and RL(F) coupled to rows E and F, respectively, will be: Vsink(E)=(Iw·100)·RL(E), and Vsink(F)=(Iw·70)·RL(F). Since RL(E) is equal to RL(F) in conventional row drivers, Vsink(E) becomes larger than Vsink(F), resulting in a forward-bias voltage for the OLEDs on Row F greater than the forward-bias voltage for the OLEDs on Row E.",
        "FIG. 3 is a graph illustrating the driving voltage versus brightness characteristics of OLED pixels on a conventional OLED display panel 100. Line 302 illustrates the driving voltage versus brightness characteristics of the OLEDs on row E and line 304 illustrates the driving voltage versus brightness characteristics of the OLEDs on Row(F). As shown in FIG. 3, the OLEDs on Row F are brighter than the OLEDs on Row(E) for a given column driving voltage, because the cathodes of the OLEDs on Row(F) are biased with a voltage lower than-the voltage biasing the cathodes of the OLEDs on Row(E), i.e., the forward-bias voltage for the OLEDs on Row(F) is greater than the forward-bias voltage for the OLEDs on Row(E).",
        "FIG. 4 illustrates a sample image that would be actually displayed on a conventional OLED display panel 100 by the display data due to differing forward-bias voltages for the OLEDs from row to row as illustrated in FIG. 3. Because the OLEDs on Row(F) are brighter than the OLEDs on Row(E), the regions 302 on Row(F) would display a “white” brighter than the “white” in regions 204 on Row (E). The difference in the brightness in these “white” regions 204, 304 is generally referred to as “crosstalk.”",
        "Therefore, there is a need for a driver that can drive an OLED display panel without generating crosstalk.",
        "The present invention provides a driver for driving an OLED display panel including a plurality of organic light emitting diodes (OLEDs) arranged in rows and columns without generating crosstalk in the display panel. The driver is configured to select an active row and to provide current driving the OLEDs coupled between the columns and the active row in accordance with display data corresponding to the columns and the selected row. The driver includes a plurality of variable resistors each of which is coupled to a corresponding one of the rows, in general between Ground (GND) and the cathodes of the OLEDs on the row. A variable resistor controller in the driver is coupled to the variable resistors, and adjusts the resistance of the variable resistor coupled to the selected row based upon the display data corresponding to the columns and the selected row.",
        "In one embodiment, the variable resistor controller adjusts the resistance of the variable resistor coupled to the selected row based upon a sum of the display data corresponding to the columns and the selected row. In another embodiment, the variable resistor controller adjusts the resistance of the variable resistor coupled to the selected rows to be inversely proportional to the sum of the display data corresponding to the columns and the selected row. In still another embodiment, the variable resistor controller adjusts the resistance of the variable resistor coupled to the selected row in accordance with:",
        "RL\n      ⁡\n      \n        (\n        n\n        )\n      \n    \n    =\n    \n      \n        RL\n        ⁡\n        \n          (\n          min\n          )\n        \n      \n      ·\n      \n        \n          Max\n          ⁢\n          \n            \n          \n          ⁢\n          SumDisplayData\n        \n        \n          \n            \n          \n          ⁢\n          SumDisplayData\n        \n      \n    \n  \n  ,\n\n\n\n\nwhere RL(min) is a predetermined minimum resistance, SumDisplayData is the sum of the display data corresponding to the columns and the selected row, and MaxSumDisplayData is the maximum possible sum of the display data.",
        "The OLED display driver according to the present invention has the advantage that the voltage drop across the variable resistors is uniform from row to row regardless of the amount of sink current on the rows, because the resistances of the variable resistors are adjusted based upon the display data for the rows. This is because the display-data for the rows are proportional to the expected sink current for the rows. Therefore, the bias voltage on the cathodes of the OLEDs is same from row to row, and thus the OLEDs display the same brightness from row to row. Accordingly, the OLED display panels driven by the driver of the present invention does not generate crosstalk.",
        "The teachings of the present invention can be readily understood by considering the following detailed description in conjunction with the accompanying drawings. Like reference numerals are used for like elements in the accompanying drawings.",
        "FIG. 1 illustrates a conventional OLED display panel driven by a conventional driver.",
        "FIG. 2 is illustrates a sample image for display to a conventional OLED display panel by the display data.",
        "FIG. 3 is a graph illustrating the driving voltage versus brightness characteristics of OLED pixels on a conventional OLED display panel.",
        "FIG. 4 illustrates a sample image that would be actually displayed on a conventional OLED display panel 100 by the display data due to differing forward-bias voltages for the OLEDs from row to row as illustrated in FIG. 3.",
        "FIG. 5 illustrates an OLED display panel driven by a driver according to one embodiment of the present invention.",
        "FIG. 6 is illustrates a sample image for display to an OLED display panel by the display data, according to one embodiment of the present invention.",
        "FIG. 7 is a graph illustrating the driving voltage versus brightness characteristics of OLED pixels on an OLED display panel according to the present invention.",
        "FIG. 8 illustrates a sample image that would be actually displayed on an OLED display panel by the display data, according to one embodiment of the present invention.",
        "FIG. 9 is a flowchart illustrating a method of adjusting the resistance of the variable resistors coupled to the rows of the OLED panel according to one embodiment of the present invention.",
        "The figures depict embodiments of the present invention for purposes of illustration only. One skilled in the art will readily recognize from the following discussion that alternative embodiments of the structures and methods illustrated herein may be employed without departing from the principles of the invention described herein.",
        "FIG. 5 illustrates an OLED display panel driven by a driver according to one embodiment of the present invention. The OLED display panel 500 comprises an array of OLEDs 102 coupled between the rows and columns of the panel 500. The anodes of the OLEDs 102 are coupled to the columns ( . . . C(n−1), C(n), C(n+1), C(n+2), . . . ) and the cathodes of the OLEDs 102 are coupled to the rows ( . . . ROW(n−1), ROW(n), ROW(n+1), and ROW(n+2) . . . ) of the display panel 500. The OLED display panel 500 is driven by the driver including a row driver 520 and a column driver 140.",
        "The row driver 520 includes row driver control circuitry (not shown) configured to couple the cathodes of the OLEDs 102 associated with a row ( . . . ROW(n−1), ROW(n), ROW(n+1), ROW(n+2) . . . ) of the panel 500 to either a low voltage (e.g., GND) via variable resistors 522 having variable resistance values ( . . . RL(n−1), RL(n), RL(n+1), RL(n) . . . ) by closing the switches 126 and opening the switch 124 to select the row or to a high voltage (e.g., VCC) by closing the switches 124 and opening the switches 126 to unselect the row. For example, in FIG. 1, ROW(n) is shown selected with the switch 126 associated with ROW(n) being closed to couple ROW(n) to GND via one of the variable resistors 522 having a resistance value RL(n). The selection of ROW(n) by the row driver 520 forward-biases the OLEDs 102 coupled, to ROW(n).",
        "The column driver 140 includes current sources 142 that provide current ( . . . I(n−1), I(n), I(n+1), and I(n+2) . . . ) to the columns ( . . . C(n−1), C(n), C(n+1), C(n+2) . . . ) of the display panel 500 to drive the columns ( . . . C(n−1), C(n), C(n+1), C(n+2) . . . ). Once a row is selected by the row driver 520, the current sources 142 of the column driver 140 generate current ( . . . I(n−1), I(n), I(n+1), and I(n+2) . . . ) for the corresponding columns (C(n−1), C(n), C(n+1), C(n+2) . . . ) according to the corresponding display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ) to drives the OLEDs 102 on the selected row. The amount of current ( . . . I(n−1), I(n), I(n+1), and I(n+2) . . . ) is generated to be multiples of a unit driving current (e.g., Iw) and proportional to the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ).",
        "In one embodiment, the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ) may be 1-bit data indicating 2 levels of brightness, for example, bright (“1”) or dark (“0”), of the OLEDs 102. Thus, the current from the current source is generated to be, for example, 0 or Iw. In another embodiment, the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ) may be 2-bit data indicating 4 levels of brightness, for example, very dark (“0”), dark (“1”), bright (“2), and very bright (“3”), of the OLEDs 102. Thus, the current from the current source 142 is generated to be, for example, 0 or Iw, 2×Iw, or 3×Iw). The OLEDs 102 in the selected row (e.g., ROW(n)) are lit (1w, 2×Iw, or 3×Iw) or unlit (for zero current) based upon the driving current ( . . . I(n−1), I(n), I(n+1), and I(n+2) . . . ) corresponding to the columns ( . . . C(n−1), C(n), C(n+1), C(n+2) . . . ), respectively, of the display panel 500. It should be noted that the display data may have any number of bits representing a different variety of brightness levels and that the present invention is not limited to the display data described herein.",
        "The sink current (Isink(n)) of a selected row (ROW(n)) is determined by the sum of the current ( . . . I(n−1), I(n), I(n+1), I(n+2) . . . ) driving the columns (C(n−1), C(n), C(n+1), C(n+2) . . . ) of the selected row (ROW(n)), which in turn is determined by the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ). Therefore, the sink voltage Vsink(n) across RL(n) is also determined by the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ), since Vsink(n)=Isink(n)×RL(n).",
        "The VAR (Variable Resistor) controller 510 is coupled to receive the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ) for the selected row (e.g., ROW(n)) and controls the resistance value of the variable resistor 522 (e.g., RL(n)) of the selected row (ROW(n)) based upon the display data. Specifically, the VAR controller 510 includes an adder 512 for summing the display data ( . . . Idata(n−1), Idata(n), Idata(n+1), Idata(n+2) . . . ) for the selected row (e.g., ROW(n)), and a control signal generator 514 that generates control signals for adjusting the resistance value of the variable resistor 522 of the selected row (e.g., ROW(n)) based upon the value of the sum of the display data.",
        "The VAR controller 510 adjusts the resistance value of the variable resistor 522 coupled to the selected row (ROW(n)) to be inversely proportional to the sum of the display data for the selected row (ROW(n)), so that the resistance of the variable resistor 522 coupled to the selected row (ROW(n)) becomes lower if the sink current Isink(n) that would be generated by the display data for the selected row (ROW(n)) becomes greater, and vice versa. In one embodiment, the VAR controller 510 adjusts the resistance (RL(n)) of the variable resistor 522 coupled to the selected row (ROW(n)) to be:",
        "RL\n      ⁡\n      \n        (\n        n\n        )\n      \n    \n    =\n    \n      \n        RL\n        ⁡\n        \n          (\n          min\n          )\n        \n      \n      ·\n      \n        \n          Max\n          ⁢\n          \n            \n          \n          ⁢\n          SumDisplayData\n        \n        \n          \n            \n          \n          ⁢\n          SumDisplayData\n        \n      \n    \n  \n  ,\n\n\n\n\nwhere RL(min) is a predetermined minimum resistance, SumDisplayData is the sum of the display data corresponding to the columns of the selected row (ROW(n)), MaxSumDisplayData is the maximum possible sum of the display data occurring when all columns of the selected row (ROW(n)) are lit at its maximum brightness. For example, MaxSumDisplayData may be 100 for 1 bit display data (“0” or “1”) driving 100 columns, or 300 for 2 bit display data (“0,” “1,” “2,” or “3,”) driving 100 columns. SumDisplayData and MaxSumDisplayData may also be represented in binary data. The adjustment of the resistance values of the variable resistors 522 is explained in greater detail below with reference to FIG. 6.",
        "FIG. 6 is illustrates a sample image for display to an OLED display panel 500 by the display data, according to one embodiment of the present invention. As shown in FIG. 6, each of the columns 1-64 is driven by a unit current source Iw. The display data is configured to make the region 602 of the panel 100 “black” while making the remaining areas 604 “white.” Assuming a 2-bit display data (0 or 1), the current Iw will flow through every column (1-64) in row E to light the OLEDs on row E, making the total sink current Isink(E) for row E as large as 64×Iw. In contrast, the current Iw will flow through columns 1-16 and 33-64 to light the OLEDs but not through columns 17-32 on row F, making the total sink current Isink(F) for row F 48×Iw.",
        "Assuming 2-bit display data, the sum of the display data, SumDisplayDataE, for row E will be 64 while the sum of the display data, SumDisplayDataF, for row F will be 48. The maximum possible sum of the display data, MaxSumDisplayData, is also 64. In one embodiment, SumDisplayData and MaxSumDisplayData may be indicated in binary form, for example, in 7 bit binary data, although the particular manner in which SumDisplayData and MaxSumDisplayData are indicated is not a requirement of the present invention.",
        "According to one embodiment of the present invention, the resistance RL(E) of the variable resistor 522 for Row E is adjusted to be:",
        "RL\n      ⁡\n      \n        (\n        E\n        )\n      \n    \n    =\n    \n      \n        \n          RL\n          ⁡\n          \n            (\n            min\n            )\n          \n        \n        ·\n        \n          \n            Max\n            ⁢\n            \n              \n            \n            ⁢\n            SumDisplayData\n          \n          \n            \n              \n            \n            ⁢\n            \n              SumDisplayData\n              E\n            \n          \n        \n      \n      ⁢\n      \n        \n\n      \n      ⁢\n      \n        \n      \n      =\n      \n        \n          \n            RL\n            ⁡\n            \n              (\n              min\n              )\n            \n          \n          ·\n          \n            64\n            64\n          \n        \n        =\n        \n          RL\n          ⁡\n          \n            (\n            min\n            )\n          \n        \n      \n    \n  \n  ,\n\n\n\n\nwhile the resistance RL(F) of the variable resistor 522 for Row F is adjusted to be:",
        "RL\n    ⁡\n    \n      (\n      F\n      )\n    \n  \n  =\n  \n    \n      \n        RL\n        ⁡\n        \n          (\n          min\n          )\n        \n      \n      ·\n      \n        \n          Max\n          ⁢\n          \n            \n          \n          ⁢\n          SumDisplayData\n        \n        \n          \n            \n          \n          ⁢\n          \n            SumDisplayData\n            F\n          \n        \n      \n    \n    ⁢\n    \n      \n\n    \n    ⁢\n    \n      \n    \n    =\n    \n      \n        RL\n        ⁡\n        \n          (\n          min\n          )\n        \n      \n      ·\n      \n        \n          64\n          48\n        \n        .\n      \n    \n  \n\n\n\n\nThus, the sink voltage Vsink(E) and Vsink(F) for rows E and F, respectively, will be:\n\nVsink(E)=Isink(E)·RL(E)=64·Iw·RL(min),\n\nVsink(F)=Isink(F)·RL(F)=48·Iw·RL(min)·64/48=64·Iw·RL(min).\n\nIn other words, Vsink(E) is equal to Vsink(F) according to the present invention, and thus the brightness of the “white” regions of the display panel 500 is uniform throughout rows E and F.",
        "FIG. 7 is a graph illustrating the driving voltage versus brightness characteristics of OLED pixels of the display panel 500 according to the present invention. The driving voltage versus brightness characteristics 702 are identical for the OLEDs on both rows, ROW(E) and ROW(F) (FIG. 6), for a given column driving voltage, since the sink voltages Vsink(E) and Vsink(F) are identical as explained with reference to FIG. 6. Thus, the OLEDs on both rows, ROW(E) and ROW(F), will have the same brightness.",
        "FIG. 8 illustrates a sample image that would be actually displayed on an OLED display panel 500 by the display data, according to one embodiment of the present invention. Because the brightness of the OLEDs on rows Row(E) and Row(F) are the same, the “white” regions 606 on Row(F) would display “white” having the same brightness as the “white” displayed in regions 604 on Row(E). Thus, the OLED display panel 500 according to the present invention does not have crosstalk.",
        "FIG. 9 is a flowchart illustrating a method of adjusting the resistance of the variable resistors coupled to the rows of the OLED panel according to one embodiment of the present invention. As the process begins 902, the driver for the OLED display panel determines 904 the sum of the display data (SumDisplayData) for the selected row (ROW(n)). This sum will be proportional to the sink current Isink(n) for the selected row (ROW(n)).",
        "Then, the driver adjusts 906 the resistance RL(n) of the variable resistor 522 coupled to the selected row (ROW(n)). In one embodiment, the resistance RL(n) is adjusted to be inversely proportional to SumDisplayData. In another embodiment, the resistance (RL(n)) of the variable resistor 522 of a selected row (ROW(n)) is adjusted to be:",
        "RL\n      ⁡\n      \n        (\n        n\n        )\n      \n    \n    =\n    \n      \n        RL\n        ⁡\n        \n          (\n          min\n          )\n        \n      \n      ·\n      \n        \n          Max\n          ⁢\n          \n            \n          \n          ⁢\n          SumDisplayData\n        \n        \n          \n            \n          \n          ⁢\n          SumDisplayData\n        \n      \n    \n  \n  ,\n\n\n\n\nwhere RL(min) is a predetermined minimum resistance, SumDisplayData is the sum of the display data for the columns of the selected row (ROW(n)), and MaxSumDisplayData is the maximum possible sum of the display data occurring when all columns of the selected row (ROW(n)) are lit to be at its maximum brightness. Then, the process ends 908.",
        "The present invention has the advantage that the voltage drops across the variable resistors 522 are uniform from row to row regardless of the amount of sink current Isink(n) on the rows, because the resistance values of the variable resistors 522 are adjusted based upon the display data corresponding to the rows, which is also proportional to the expected sink current Isink(n) for the rows. Therefore, the bias voltage on the cathodes of the OLEDs is same from row to row, and thus the OLEDs display the same brightness from row to row. Accordingly, the OLED display panels driven by the driver in accordance with the present invention does not show crosstalk.",
        "Although the present invention has been described above with respect to several embodiments, various modifications can be made within the scope of the present invention. For example, the resistances of the variable resistors may be adjusted not only based upon sum of the display data (which is a digital value) but also based upon the sum of the driving current (which is an analog value) driving the OLEDs coupled between the columns and the selected row. In such case, the driver may further include analog-to-digital converters for converting the driving current to digital values that can be used to control the variable resistors. In addition, the present invention is not limited to any particular-format or number of bits for representing the sum of the display data. Nor is the present invention limited to any particular number of bits used for the display data (e.g., 1 bit or 2 bit display data).",
        "Accordingly, the disclosure of the present invention is intended to be illustrative, but not limiting, of the scope of the invention, which is set forth in the following claims."
    ],
    "citations": [
        "3674928",
        "5170158",
        "5420604",
        "5572211",
        "5684502",
        "5689280",
        "5747363",
        "5754157",
        "5764212",
        "5786799",
        "5818409",
        "5852429",
        "5877738",
        "5900856",
        "6040815",
        "6097352",
        "6252572",
        "6417827",
        "6483497",
        "6522317",
        "6611246",
        "7034782",
        "2001/0028346",
        "2001/0038385",
        "2001/0050662",
        "2002/0149608",
        "2002/0158585",
        "2003/0011298",
        "0837446",
        "02267589",
        "2003005712",
        "2000-172236",
        "2000-258751",
        "2003-005712",
        "2004-138976"
    ],
    "us_classification": "345 77",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "09",
            "subclass": "G",
            "main_group": "3",
            "subgroup": "34"
        }
    ]
}