{
    "title": "Hooded garment with built-in skull cap, gloves, and lower face covering with mouth opening",
    "abstract": "A garmet has a hood with an inside front base and a pair of lower front hood portions each having upper and lower projections projecting toward the other lower front hood portion and a securing device connected to each of the projections for connecting the lower projections to each other across a user's face and respectively above and below the user's mouth so that a recess is defined of a size to expose the mouth. When the projections are connected to each other the user will not breath onto the lower front hood portions. A skull cap has a rear lower edge connected to the inside front base of the hood and sleeves with storable gloves can also be included as part of the garmet.",
    "inventors": [
        "DeLorenzo",
        "DeLorenzo"
    ],
    "document_number": "07296302",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A garment for covering at least part of the head and face of a user, comprising:",
            "components": [
                {
                    "component": "a hood having a head covering position for covering the head of a user, and a lowered position, the hood having an inside front base for being behind the neck of the user when the garment is used;",
                    "subcomponents": []
                },
                {
                    "component": "the hood including a pair of lower front hood portions each having a face covering position for covering a lower portion of the face of a user using the garment, and an open position for exposing the face of a user using the garment;",
                    "subcomponents": []
                },
                {
                    "component": "each lower front hood portion having upper and lower projections projecting toward the other lower front hood portion;",
                    "subcomponents": []
                },
                {
                    "component": "a securing device connected to each upper and lower projection of each lower front hood portion for connecting the upper projections to each other over the mouth of a user using the garment and for connecting the lower projections to each other under the mouth of a user using the garment;",
                    "subcomponents": []
                },
                {
                    "component": "each of the lower front hood portions including a recess between the upper and the lower projection thereof, each recess being of a size to expose the mouth of a user using the garment when the hood is in the head covering position, the lower front hood portions are in the face covering position, and the upper and lower projections are connected to each other so that a user using the garment will not breathe onto the lower front hood portions; and",
                    "subcomponents": []
                },
                {
                    "component": "a skull cap having a rear lower edge connected to the inside front base of the hood for covering the head of a user using the garment, with and without the hood being in the head covering position, and for being stored in the hood when the skull cap is not covering the head of the user.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A garment according to claim 1 , wherein the projections each are at least partly made of elastic material so that the projections stretch across the face of a user using the garment when the upper and lower projections are connected respectively to each other.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A garment according to claim 1 , wherein the garment includes a body covering portion connected to the hood for covering the shoulders and chest of a user using the garment.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A garment according to claim 1 , wherein the garment includes a body covering portion connected to the hood for covering the shoulders and chest of a user using the garment, a pair of sleeves with cuffs connected to the body covering portion, and a glove connected to each of the pair of cuffs, each sleeve including a glove covering flap near the cuff for defining a pocket for storing each glove, and at least one securing device connected to each flap for keeping each respective pocket closed.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A garment according to claim 1 , wherein the projections each are at least partly made of elastic material so that the projections stretch across the face of a user using the garment when the upper and lower projections are connected to each other, the garment including a body covering portion connected to the hood for covering the shoulders and chest of a user using the garment, a pair of sleeves with cuffs connected to the body covering portion, and a glove connected to each of the pair of cuffs, each sleeve including a glove covering flap near the cuff for defining a pocket for storing each glove, and at least one further securing device connected to each flap for keeping each respective pocket closed.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A garment according to claim 1 , wherein the securing devices are selected from the group comprising: snaps, buttons and hook-and-loop fasteners.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A garment for covering at least part of the head and face of a user, comprising:",
            "components": [
                {
                    "component": "a hood having a head covering position for covering the head of a user, and a lowered position;",
                    "subcomponents": []
                },
                {
                    "component": "the hood including a pair of lower front hood portions each having a face covering position for covering a lower portion of the face of a user using the garment, and an open position for exposing the face of a user using the garment;",
                    "subcomponents": []
                },
                {
                    "component": "each lower front hood portion having upper and lower projections projecting toward the other lower front hood portion;",
                    "subcomponents": []
                },
                {
                    "component": "a securing device connected to each of the upper and lower projections of each of the lower front hood portions for connecting the upper projections to each other and for connecting the lower projections to each other; and",
                    "subcomponents": []
                },
                {
                    "component": "each of the lower front hood portions including a recess between the upper and the lower projection thereof, each recess being of a size to expose the mouth of a user using the garment when the hood is in the head covering position, the lower front hood portions are in the face covering position, and the upper and lower projections are connected to each other so that a user using the garment will not breathe unto the lower front hood portions, the garment including a body covering portion connected to the hood for covering the shoulders and chest of a user using the garment, a pair of sleeves with cuffs connected to the body covering portion, and a glove connected to each of the pair of cuffs, each sleeve including a glove covering flap near the cuff for defining a pocket for storing each glove, and at least one securing device connected to each flap for keeping each respective pocket closed.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A garment according to claim 7 , wherein the projections each are at least partly made of elastic material so that the projections stretch across the face of a user using the garment when the upper and lower projections are connected respectively to each other.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A garment according to claim 7 , wherein the garment includes a body covering portion connected to the hood for covering the shoulders and chest of a user using the garment.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A garment for covering at least part of the head and face of a user, comprising:",
            "components": [
                {
                    "component": "a hood having a head covering position for covering the head of a user, and a lowered position;",
                    "subcomponents": []
                },
                {
                    "component": "the hood including a pair of lower front hood portions each having a face covering position for covering a lower portion of the face of a user using the garment, and an open position for exposing the face of a user using the garment;",
                    "subcomponents": []
                },
                {
                    "component": "each lower front hood portion having upper and lower projections protecting toward the other lower front hood portion;",
                    "subcomponents": []
                },
                {
                    "component": "a securing device connected to each of the upper and lower projections of each of the lower front hood portions for connecting the upper projections to each other and for connecting the lower projections to each other; and",
                    "subcomponents": []
                },
                {
                    "component": "each of the lower front hood portions including a recess between the upper and the lower projection thereof, each recess being of a size to expose the mouth of a user using the garment when the hood is in the head covering position, the lower front hood portions are in the face covering position, and the upper and lower projections are connected to each other so that a user using the garment will not breathe unto the lower front hood portions, the projections each being at least partly made of elastic material so that the projections stretch across the face of a user using the garment when the upper and lower projections are connected to each other, the garment including a body covering portion connected to the hood for covering the shoulders and chest of a user using the garment, a pair of sleeves with cuffs connected to the body covering portion, and a glove connected to each of the pair of cuffs, each sleeve including a glove covering flap near the cuff for defining a pocket for storing each glove, and at least one securing device connected to each flap for keeping each respective pocket closed.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A garment according to claim 7 , wherein the securing devices are selected from the group comprising: snaps, buttons and hook-and-loop fasteners.",
            "components": []
        }
    ],
    "description": [
        "(1) Field of the Invention",
        "The present invention is a hooded garment with built-in skull cap, lower face covering with mouth opening, and built-in gloves.",
        "(2) Description of the Related Art",
        "Various types of previously introduced hooded garments have been geared primarily toward either functionality or fashionability. The singular aspect of the current invention is the dual focus on both functionality and casual fashionability.",
        "Additionally, various types of hoods, skull caps, and gloves have been previously introduced separately for either functionality or fashionability. The hood, skull cap, and gloves of the current invention combine to form one functional and casually fashionable garment.",
        "One object of the current invention is to provide a casual garment that also doubles as a functional, inclement weather-friendly garment. Three main options are available: 1) a built-in skull cap, 2) lower face covering with mouth opening, and 3) built-in gloves. The garment can be worn without employing any of the three main options. It can also be worn while employing all three options simultaneously. Additionally, any one or two of the three options may be employed at any given time without employing the other(s).",
        "In the drawings:",
        "FIG. 1A is a front elevational view of the hooded garment of the present invention;",
        "FIG. 1B is a view similar to FIG. 1A of the garment with a lower portion of the hood open;",
        "FIG. 2A is a side view of the hood and a skull cap of the invention in a covering but open position;",
        "FIG. 2B is a view similar to FIG. 2A but with the hood down;",
        "FIG. 3A is a perspective view of one sleeve of the garment with a a glove in a use position over the hand of a user; and",
        "FIG. 3B is a view similar to FIG. 3A of the glove in a stored position.",
        "It is another object of the current invention to allow for the use of a unique lower face covering for protection from inclement weather while maintaining comfort. As shown in FIGS. 1A and 1B, two sets of corresponding snaps, buttons, hook-and-loop fasteners (e.g. Velcro brand fasteners—Velcro being a trademark) or other securing devices 12 and 14 are provided near the ends of two pairs of projections located at each of the front, lower portions 16 of the hood 10 near the user's cheeks 18, which when pulled together and secured, cover the lower face and chin while leaving an opening 20 for the user's mouth. Opening 20 is formed by a pair of recesses 15 provided on each lower, front hood portion 16, between the upper and lower projections with their securing devices 12 and 14 on each lower, front hood portion 16 as best shown in FIG. 2A. The usual discomfort around the mouth area usually associated with masks and face coverings is not present in the current invention because of the created mouth opening 20, which allows the wearer to breathe freely without coping with any covering material. Contingent upon the material and size of the garment, the area of the garment or hood portions where the securing devices 12 and 14 are located may need to include a certain percentage of elastic-type material so as to allow the securing devices to attach to one another, thereby stretching the material across the user's lower face and chin. As shown in FIGS. 1A and 1B, the garment 24 includes a body covering portion connected to the hood 10 for covering the shoulders and the chest of a user using the garment.",
        "It is still another object of the current invention to allow for the use of a skull cap 22 which is permanently fixed near its lower rear edge 26, via stitching or other fixing method to the inside front of the base 28 of the hood 10 of the garment 24, thus positioning the skull cap 22 in front of the hood 10 so as to allow A) the skull cap 22 to be worn alone as shown in FIG. 2B, B) the hood 10 to be worn alone, or C) both the skull cap 22 and hood 10 to be worn in conjunction as shown in FIGS. 1A, 1B and 2A. The inside front base 28 of the hood is behind the user's neck when the garment is being used. When the skull cap is not in use, it can be stored in various ways. One such storage option is using opposite pieces of Velcro brand hook-and-loop fastener, one adhered to the back of the skullcap and one adhered to the inside lining of the hood so as to allow the skullcap to be temporarily attached to the inside lining of the hood. Another such storage option is tucking the skullcap downward into a pocket on the inside and back of a permanently attached garment, thereby completely clearing the skullcap from the head area.",
        "It is yet another object of the current invention, as shown in FIG. 3A and 3B to allow for the use of gloves 30 permanently attached at an outer edge 32 to the sleeve cuffs 34 of the sleeve 36 of the garment 24, whereby the gloves can either be A) worn as in FIG. 3A or B) not worn as in FIG. 3B. The attached gloves can be stored in a number of ways when not being worn. One such storage option is to tuck each glove into a pocket on the inside or outside of the corresponding sleeve. Another such storage option is to fold each glove back onto the sleeve 36 and cover it with a flap 38 of material permanently fixed with stitching or other fixing method along one edge to the garment sleeve 36 and secure the other edge of the material to the sleeve with snaps, buttons, Velcro brand or other securing devices 40."
    ],
    "citations": [
        "1097530",
        "2274510",
        "2839757",
        "3214771",
        "3696474",
        "4573217",
        "5115517",
        "5125117",
        "5251336",
        "5615416",
        "5704068",
        "5713077",
        "5845340",
        "5918314",
        "D430721",
        "6253381",
        "6397395",
        "6425138",
        "6665878",
        "6789266",
        "2003/0154536",
        "2004/0187186",
        "2005/0160514",
        "2253776"
    ],
    "us_classification": "2 84",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "42",
            "subclass": "B",
            "main_group": "1",
            "subgroup": "22"
        }
    ]
}