{
    "title": "Methods for measurement and control of ink concentration and film thickness",
    "abstract": "A process is disclosed to measure or monitor ink concentration or ink thickness of an ink film as printed on a printing press, which consists of measuring light reflected from the ink film and the ink substrate.",
    "inventors": [
        "Rich"
    ],
    "document_number": "07296518",
    "publication_date": "20071120",
    "assignees": [
        "Sun Chemical Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of measuring printed ink concentration on an opaque substrate on-line comprising:",
            "components": [
                {
                    "component": "(a) projecting a light over the ink printed on the substrate measuring light reflectance as a camera response R, G or B, wherein R is the camera response for a red sensor, G is the camera response for a green sensor and B is the camera response for a Blue sensor;",
                    "subcomponents": []
                },
                {
                    "component": "(b) Substituting the camera response R, G or B for reflectance (ρ",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein a xenon flash lamp is the source of the light.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A method of measuring printed ink thickness on a substrate on-line comprising:",
            "components": [
                {
                    "component": "(a) projecting a light over the ink printed on the substrate measuring light reflectance as a camera response R, G or B, wherein R is the camera response for a red sensor, G is the camera response for a green sensor and B is the camera response for a Blue sensor;",
                    "subcomponents": []
                },
                {
                    "component": "(b) Substituting the camera response R, G or B for reflectance (ρ",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 3 , wherein a xenon flash lamp is the source of the light.",
            "components": []
        }
    ],
    "description": [
        "The invention relates to predicting or determining ink concentration and/or ink thickness on an on-line printing process.",
        "Online inspection of printed materials is realized in the prior art through the use of either a densitometer attached to the printing press that reads small area of ink along the edge of the substrate, known as test targets or through the use of an electronic color video or color digital camera that reads either the test targets or specified areas within the printed image. Disclosures of such prior art are found in U.S. Pat. Nos. 4,289,405; 5,163,012; and 5,774,225.",
        "In those methods that utilize a color video camera, the camera is used as a light sensor with three wide-band light detectors, commonly referred to as Red, Green or Blue (RGB) with spectral sensitivities that peak in the “blue”, “green” or “red” regions of the visible spectrum as shown in FIG. 1. The light sensor integrates or sums all of the light rays with wavelengths within its passband. The camera sensors are then used to approximate the responses of a Standard ISO Status Density, as defined in ISO 5/3 and illustrated in FIG. 2. It is important to note that the spectral response of the three camera sensors only approximate the ISO Status Density spectral curves.",
        "The densitometer or the camera measures “substrate relative” density. That is, the camera is first pointed to the unprinted substrate and the light projected onto the substrate. The projected light that is reflected from the substrate is collected by camera in each of its three sensors. Typical RGB camera signals are binary coded values with a range of 0 to 255 (8 bits). The camera is adjusted so that a perfect white object will read RGB values (255, 255, 255). The values are normalized so that the perfect white will have relative values of (1.0, 1.0, 1.0) as is disclosed in patents U.S. Pat. Nos. 5,724,259 and 5,767,980. The normalized values of the sensors are converted into density by computing the negative of the logarithm of the sensor value. Next, a printed area is move into the field of view of the camera and the light projected onto that area. The camera captures the light reflected from the printed area, comprised of the ink and the substrate. The camera readings are again converted to density. The previously computed substrate density is then subtracted from the ink-on-substrate density to leave only the density of the ink. The density of the ink is assumed to be proportional to the thickness of the ink layer.",
        "Because of the differences between the camera sensors and an ISO Status Densitometer, it is not possible to simultaneously obtain colorant concentration and ink film thickness. On a commercial offset press the only parameter that is available to the pressman to control is the weight of ink applied to the substrate which modulates the ink film thickness. Accordingly, there is a need in the printing industry to have a press inspection system that measures and tacks the color and the concentration of the inks as they are being printed.",
        "The present invention provides a method of measuring printed ink concentration on an opaque substrate on-line comprising:",
        "(a) projecting a light over the ink printed on the substrate measuring light reflectance as a camera response R, G or B, wherein R is the camera response for a red sensor, G is the camera response for a green sensor and B is the camera response for a Blue sensor;",
        "(b) Substituting the camera response R, G or B for reflectance (ρo) of the printed ink over the opaque substrate in order to calculate the extinction (E) of light by the printed ink as indicated in the following formula",
        "E\n  =\n  \n  ⁢\n  \n    \n      \n        \n          -\n          2\n        \n        b\n      \n      ·\n      \n      ⁢\n      ln\n    \n    ⁢\n    \n      {\n      \n        \n          \n            \n              -\n              \n                (\n                \n                  1\n                  -\n                  \n                    B\n                    0\n                  \n                \n                )\n              \n            \n            ·\n            \n              (\n              \n                1\n                -\n                \n                  ρ\n                  0\n                \n              \n              )\n            \n          \n          \n            2\n            ·\n            ρ\n            ·\n            \n              B\n              0\n            \n          \n        \n        +\n        \n          \n            \n              \n                [\n                \n                  \n                    \n                      (\n                      \n                        1\n                        -\n                        \n                          β\n                          0\n                        \n                      \n                      )\n                    \n                    ·\n                    \n                      (\n                      \n                        1\n                        -\n                        \n                          ρ\n                          0\n                        \n                      \n                      )\n                    \n                  \n                  \n                    2\n                    ·\n                    ρ\n                    ·\n                    \n                      B\n                      0\n                    \n                  \n                \n                ]\n              \n              2\n            \n            +\n            \n              1\n              \n                B\n                -\n                \n                  B\n                  0\n                \n              \n            \n          \n        \n      \n      }\n    \n  \n\n\n\n\nwherein B, b and B0 are constants having values of about 1.0, 4.271 and 0.606, respectively; and",
        "(c) calculating printed ink concentration (c) based on the following formula:\n\nE=ε×c×t\n\nwherein (E) is as calculated in step (b), (ε) is the relative (relative to the scattering of the substrate) unit extinction coefficient, a predetermined measurement of the pre-printed ink per unit concentration per unit thickness and (t) is the thickness of the printed ink either predetermined prior to or measured after printing.",
        "The present invention also provides a method of measuring printed ink thickness on a substrate on-line comprising:",
        "(a) projecting a light over the ink printed on the substrate measuring light reflectance as a camera response R, G or B, wherein R is the camera response for a red sensor, G is the camera response for a green sensor and B is the camera response for a Blue sensor;",
        "(b) Substituting the camera response R, G or B for reflectance (ρo) of the printed ink over the opaque substrate in order to calculate the extinction (E) of light by the printed ink as indicated in the following formula",
        "E\n  =\n  \n  ⁢\n  \n    \n      \n        \n          -\n          2\n        \n        b\n      \n      ·\n      \n      ⁢\n      ln\n    \n    ⁢\n    \n      {\n      \n        \n          \n            \n              -\n              \n                (\n                \n                  1\n                  -\n                  \n                    B\n                    0\n                  \n                \n                )\n              \n            \n            ·\n            \n              (\n              \n                1\n                -\n                \n                  ρ\n                  0\n                \n              \n              )\n            \n          \n          \n            2\n            ·\n            ρ\n            ·\n            \n              B\n              0\n            \n          \n        \n        +\n        \n          \n            \n              \n                [\n                \n                  \n                    \n                      (\n                      \n                        1\n                        -\n                        \n                          β\n                          0\n                        \n                      \n                      )\n                    \n                    ·\n                    \n                      (\n                      \n                        1\n                        -\n                        \n                          ρ\n                          0\n                        \n                      \n                      )\n                    \n                  \n                  \n                    2\n                    ·\n                    ρ\n                    ·\n                    \n                      B\n                      0\n                    \n                  \n                \n                ]\n              \n              2\n            \n            +\n            \n              1\n              \n                B\n                -\n                \n                  B\n                  0\n                \n              \n            \n          \n        \n      \n      }\n    \n  \n\n\n\n\nwherein B, b and B0 are constants having values of about 1.0, 4.271 and 0.606, respectively; and",
        "(c) calculating printed ink thickness (t) based on the following formula:\n\nE=ε×c×t\n\nwherein (E) is as calculated in step (b), (ε) is the relative (relative to the scattering of the substrate) unit extinction coefficient, a predetermined measurement of the pre-printed ink per unit concentration per unit thickness and (c) is the concentration of the printed ink either predetermined prior to or measured after printing.",
        "Other objects and advantages of the present invention will become apparent from the following description and appended claims.",
        "FIG. 1 shows plots of spectral extinction for a series of batches of ink with varying amounts of pigment in the ink.",
        "A method has been discovered to measuring the reflectance of an ink film as printed on a printing press, and during the operation of that press with the intent of monitoring the ink concentration and the ink film thickness.",
        "Accordingly, the camera sensor in the present invention is used as an absolute reflectometer. The camera is not standardized to the substrate but to an absolute white standard, as disclosed in U.S. Pat. Nos. 5,821,993 and 6,151,064. The measurements of the substrate, the ink on the substrate are all made on the same basis as readings made off-line on a spectrophotometer or spectrocolorimeter. Knowing the spectral response of the camera will allow the offline instrument to approximate the camera measurements on the off-line spectral instrument and provide absolute data to the camera about the color, film thickness and concentration dependence of the ink.",
        "When the press is operating, the camera may be used to capture the color of the press sheets during startup and compare them to the standard values computed off-line. This greatly reduces the print “make-ready” time for the printer. Getting acceptable prints sooner results in lower waste amounts and in better utilization of the printing machinery.",
        "Additionally the camera may be used to monitor the color of the printing through out the run by comparing the current printed image to the laboratory colors or to the colors in the first acceptable image. If the color begins to drift, the data supplied by the camera may be used to adjust either the ink film thickness (also known as the film weight) or the concentration of base color in the ink well using the process described below.",
        "In offset lithography, the inks are very thick pastes, loaded with as much pigment as modern chemical engineering can allow. The paste is mixed with water, either from a press fountain or at the ink factory in the form of pre-emulsified ink. The only operational controls on the press, known as “keys” control the amount of ink transferred from the roller train to the plate and from the plate to the blanket and from the blanket to the substrate. Since the ink does not evaporate, the weight of film on the substrate can be determined indirectly by weighing the rollers before and after printing. The difference in weight represents the amount of ink transferred. The film weight or thickness is historically controlled, offline by status densitometry.",
        "In direct gravure printing or flexographic printing, the inks are thin liquids and the amount of ink transferred is controlled by the size and shape of the impressions in the gravure cylinder or anilox cylinder. The film thickness is quite difficult or nearly impossible to assess, even offline. Because the inks are thin liquids, held in simple wells, it is possible to adjust the amount of base ink relative to the printing solvent and thus adjust the concentration of the pigment in the ink transferred to the substrate.",
        "One lesser known method for computing the optical properties of a thin, transparent, pigmented coating in the laboratory uses the model of turbid media developed by Hoffman in the 1960s and simplified by Schmelzer in the 1970s (Hoffman, K., “Zusammenhang zwischen Extinktion bzw. Transmission und Remission micht streuender Farbauflagen aug weissem Untergrund”, Farbe and Lack, 76, (7), 665-672, (1970); Schmelzer, H., “Näherungslösungen für die Theorie tranparenter Schichten auf streuendem Untergrund”, Farbe and Lack, 87, (1), 15-18, (1981)). In this model the coating is assumed to be transparent and absorbing of light and the substrate is assumed to be opaque and scattering of light. In the simplified formalism, the extinction (E) of light by the ink film can be derived from the reflectance (ρ) of the transparent coatings over the opaque substrate as shown in equation 1. Here, the parameters B, b, and B0 are constants for which Schmelzer has made suggested values of 1.000 for B, 4.271 for b and 0.606 for B0.",
        "E\n        =\n        \n          \n            \n              \n                -\n                2\n              \n              b\n            \n            ·\n            ln\n          \n          ⁢\n          \n            {\n            \n              \n                \n                  \n                    \n                      \n                        \n                          -\n                          \n                            (\n                            \n                              1\n                              -\n                              \n                                B\n                                0\n                              \n                            \n                            )\n                          \n                        \n                        ·\n                        \n                          (\n                          \n                            1\n                            -\n                            \n                              ρ\n                              0\n                            \n                          \n                          )\n                        \n                      \n                      \n                        2\n                        ·\n                        ρ\n                        ·\n                        \n                          B\n                          0\n                        \n                      \n                    \n                    +\n                  \n                \n              \n              \n                \n                  \n                    \n                      \n                        \n                          [\n                          \n                            \n                              \n                                (\n                                \n                                  1\n                                  -\n                                  \n                                    β\n                                    0\n                                  \n                                \n                                )\n                              \n                              ·\n                              \n                                (\n                                \n                                  1\n                                  -\n                                  \n                                    ρ\n                                    0\n                                  \n                                \n                                )\n                              \n                            \n                            \n                              2\n                              ·\n                              ρ\n                              ·\n                              \n                                B\n                                0\n                              \n                            \n                          \n                          ]\n                        \n                        2\n                      \n                      +\n                      \n                        1\n                        \n                          B\n                          -\n                          \n                            B\n                            0\n                          \n                        \n                      \n                    \n                  \n                \n              \n            \n            }\n          \n        \n      \n    \n    \n      \n        (\n        1\n        )",
        "This derivation assumed that the light was taken in small increments of energy or wavelength bands, such as found in monochromatic light. In fact, it has been reported that narrow bands of wavelength are not needed for color control (Strocka, D., “Are intervals of 20 nm sufficient for industrial color measurement?”, COL-OUR 73, Adam Hilger, London, 453-456, (1973); and Billmeyer, F. W., Beasley, J. K., Sheldon, J. A., “Formulation of transparent colors with a digital computer”, Journal of the Optical Society of America, 50, 70-72, (1960)). In the application of this model to color formulation in the laboratory, it has been assumed that the ratio of absorption to scattering (K/S) is modulated by both the concentration (c) of the absorbing species and the thickness (t) of the coating such that the total E is proportional to ε, the relative (relative to the scattering of the substrate) unit extinction coefficient, a predetermined measurement of the pre-printed ink per unit concentration per unit thickness, as shown in equation 2.\n\nE=ε×c×t  (2)",
        "Using this formalism it is possible to substitute a camera response (R, G, or B) or a CIE calorimetric response (X, Y, or Z), obtained by linear transformation from RGB for the value of ρ in equation 1 thus yielding an equation that can be used to control either the film thickness (t) or the concentration (c) using readings captured by the camera on-line over a printing press. Good results were reported by applying general approximations to the coefficients shown in equation (1)(Schmelzer, H., “Näherungslösungen für die Theorie tranparenter Schichten auf streuendem Untergrund”, Farbe and Lack, 87, (1), 15-18, (1981)). The default values are b=4.271, B=1.0, B0=0.606. The equations given below show a workable approximation to equation (1).\n\n[E]R=[−0.15−0.4351n(R)](1−R)\n\n[E]G=[−0.15−0.4351n(G)](1−G)  (3)\n\n[E]B=[−0.15−0.4351n(B)](1−B)",
        "In Table 1, an abridged table of camera spectral response functions for a typical RGB video camera is given. In Table 2, are a series of spectral reflectance curves measured in a laboratory with a spectrocolorimeter for a range of colorant concentrations and film weights. In Table 3, the camera responses for the spectral data in Table 2 are shown. These are simulated by numerical convolution of the camera response functions with the spectral reflectance curves. Such a simulation is documented in international standards such as ISO 5/3 and ASTM E-308.",
        "Equation (1) was applied to the reflectance data in Tables 2a and 2b and equation (3) to camera data in Tables 3a and 3b. Table 5 shows the Extinction values and the estimates of the relative film weights of the ink films computed from the spectral data and the same information computed from the camera response values converted to Extinction values. The relative film weight is computed as the ratio of the Extinction (E) values for the various labs to those of the first lab. The results show that the relative thickness values computed from the CIE values and from the camera values are approximately equal—at least to within the noise of the readings.",
        "Equation (1) was applied to the reflectance data in Tables 2a and 2b and equation (3) to camera data in Tables 3a and 3b. Table 5 shows the Extinction values and the estimates of the relative concentrations (strength) of the ink films computed from the spectral data and the same information computed from the camera response values converted to Extinction values. The strength is computed as the ratio of the Extinction (E) values for the various ink batches to those of the standard ink. The results show that the relative concentration (strength) computed from the CIE values and from the camera values are approximately equal—at least to within the noise of the readings.",
        "TABLE 1\n\n\n\n\n\n\n\nSpectral response of a typical RGB video camera\n\n\n\n\n\n\n\n\n\n\n\n\nWavelength\nRed sensor\nGreen sensor\nBlue sensor\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n400\n0.000177\n0.001082\n0.03663\n\n\n\n420\n0.000950\n0.001933\n0.18529\n\n\n\n440\n0.001119\n0.002410\n0.27042\n\n\n\n460\n0.001114\n0.002435\n0.29388\n\n\n\n480\n0.000761\n0.004262\n0.19861\n\n\n\n500\n0.000711\n0.162198\n0.00383\n\n\n\n520\n0.001122\n0.286955\n0.00106\n\n\n\n540\n0.001339\n0.283162\n0.00101\n\n\n\n560\n0.041264\n0.216318\n0.00117\n\n\n\n580\n0.309783\n0.032398\n0.00288\n\n\n\n600\n0.298412\n0.003166\n0.00261\n\n\n\n620\n0.191670\n0.001921\n0.00166\n\n\n\n640\n0.098084\n0.000981\n0.00081\n\n\n\n660\n0.040003\n0.000462\n0.00028\n\n\n\n680\n0.012703\n0.000188\n0.00000\n\n\n\n700\n0.000788\n0.000127\n−0.00015\n\n\n\nSUM\n1.000001\n0.999999\n1.000000",
        "TABLE 2a\n\n\n\n\n\n\n\nSpectral reflectance factors and CIE coordinates of a series\n\n\nof prints with differing ink concentrations\n\n\n\n\n\n\n\n\n\n\n\n\nWavelength\nSTD\nBAT01\nBAT05\nBAT10\nBAT15\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n400\n24.93\n28.84\n26.62\n23.76\n21.71\n\n\n420\n22.37\n26.30\n24.03\n21.28\n19.17\n\n\n440\n20.47\n24.38\n22.15\n19.53\n17.38\n\n\n460\n19.30\n23.19\n20.94\n18.4\n16.29\n\n\n480\n18.91\n22.81\n20.54\n18.03\n15.92\n\n\n500\n19.75\n23.71\n21.43\n18.83\n16.67\n\n\n520\n20.93\n24.98\n22.66\n19.99\n17.76\n\n\n540\n25.97\n30.22\n27.85\n24.98\n22.51\n\n\n560\n50.85\n54.40\n52.55\n49.97\n47.42\n\n\n580\n81.00\n81.65\n81.28\n80.83\n79.86\n\n\n600\n87.23\n87.05\n86.99\n87.3\n87.11\n\n\n620\n87.85\n87.57\n87.66\n88.1\n87.89\n\n\n640\n87.72\n87.48\n87.56\n88.05\n87.76\n\n\n660\n88.81\n88.61\n88.63\n89.09\n88.8\n\n\n680\n90.55\n90.34\n90.32\n90.74\n90.42\n\n\n700\n92.89\n92.66\n92.67\n93.03\n92.73\n\n\nX\n59.73\n61.26\n60.36\n59.4\n58.24\n\n\nY\n48.38\n51.04\n49.53\n47.78\n46.04\n\n\nZ\n21.64\n25.83\n23.41\n20.63\n18.34",
        "TABLE 2b\n\n\n\n\n\n\n\nSpectral reflectance factors and CIE coordinates of a series of prints\n\n\nwith differing ink film weights\n\n\n\n\n\n\n\n\n\n\n\n\nWavelength\nLab 1\nLab 2\nLab 3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n400\n23.87\n24.03\n22.40\n\n\n\n420\n23.58\n23.72\n22.03\n\n\n\n440\n25.56\n25.71\n23.95\n\n\n\n460\n23.62\n23.82\n21.96\n\n\n\n480\n17.38\n17.63\n15.87\n\n\n\n500\n12.32\n12.58\n11.09\n\n\n\n520\n8.45\n8.63\n7.58\n\n\n\n540\n7.61\n7.70\n6.90\n\n\n\n560\n6.97\n6.90\n6.44\n\n\n\n580\n11.29\n11.02\n10.58\n\n\n\n600\n46.27\n46.23\n45.14\n\n\n\n620\n77.77\n77.92\n77.54\n\n\n\n640\n84.13\n84.17\n84.02\n\n\n\n660\n86.66\n86.69\n86.62\n\n\n\n680\n89.10\n89.05\n88.99\n\n\n\n700\n90.37\n90.36\n90.26\n\n\n\nX\n33.31\n33.32\n32.54\n\n\n\nY\n20.65\n20.69\n19.83\n\n\n\nZ\n24.41\n24.61\n22.72",
        "TABLE 3a\n\n\n\n\n\n\n\nCamera responses for the of a series of prints\n\n\nwith differing ink concentrations\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSensor Color\nStd\nBat01\nBat05\nBat10\nBat15\n\n\n\n\n\n\n\nR\n83.60\n83.83\n83.63\n83.62\n83.05\n\n\n\nG\n31.04\n34.88\n32.73\n30.13\n27.83\n\n\n\nB\n20.89\n24.77\n22.54\n19.95\n17.84",
        "TABLE 3b\n\n\n\n\n\n\n\nCamera responses for the of a series of prints with differing film\n\n\nweights\n\n\n\n\n\n\n\n\n\n\n\n\nSensor Color\nLab - 1\nLab - 2\nLab - 3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nR\n45.54\n45.48\n44.90\n\n\n\nG\n9.16\n9.26\n8.35\n\n\n\nB\n22.98\n23.16\n21.41",
        "TABLE 4\n\n\n\n\n\n\n\nExtinction values and relative film weights for the data of\n\n\nTables 2b and 3b\n\n\n\n\n\n\n\n\n\n\n\n\nWavelength\nLab - 1\nLab - 2\nLab - 3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n400\n0.3602\n0.3573\n0.3886\n\n\n\n420\n0.3657\n0.3630\n0.3961\n\n\n\n440\n0.3301\n0.3275\n0.3587\n\n\n\n460\n0.3649\n0.3611\n0.3976\n\n\n\n480\n0.5050\n0.4983\n0.5475\n\n\n\n500\n0.6671\n0.6572\n0.7172\n\n\n\n520\n0.8467\n0.8367\n0.8985\n\n\n\n540\n0.8966\n0.8910\n0.9431\n\n\n\n560\n0.9383\n0.9431\n0.9759\n\n\n\n580\n0.7087\n0.7202\n0.7396\n\n\n\n600\n0.0995\n0.0998\n0.1075\n\n\n\n620\n−0.0090\n−0.0092\n−0.0088\n\n\n\n640\n−0.0119\n−0.0119\n−0.0119\n\n\n\n660\n−0.0117\n−0.0117\n−0.0117\n\n\n\n680\n−0.0109\n−0.0109\n−0.0109\n\n\n\n700\n−0.0102\n−0.0102\n−0.0103\n\n\n\nX\n0.2189\n0.2188\n0.2283\n\n\n\nY\n0.4255\n0.4246\n0.4439\n\n\n\nZ\n0.3503\n0.3467\n0.3823\n\n\n\nFilmWeight\n1.000\n0.998\n1.043\n\n\n\nR\n0.1046\n0.1051\n0.1093\n\n\n\nG\n0.8081\n0.8031\n0.8523\n\n\n\nB\n0.3771\n0.3736\n0.4091\n\n\n\nFilmWeight\n1.000\n0.994\n1.055",
        "TABLE 5\n\n\n\n\n\n\n\nKubelka-Munk values and strengths for the data of Tables 2b and 3b\n\n\n\n\n\n\n\n\n\n\n\n\nWavelength\nSTD\nBAT01\nBAT05\nBAT10\nBAT15\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n400\n0.341011\n0.278152\n0.312398\n0.362268\n0.402738\n\n\n420\n0.389229\n0.317637\n0.357251\n0.41180\n0.459554\n\n\n440\n0.429463\n0.350848\n0.393679\n0.450994\n0.504961\n\n\n460\n0.456442\n0.373089\n0.419118\n0.478483\n0.535208\n\n\n480\n0.465849\n0.380483\n0.427905\n0.487896\n0.545976\n\n\n500\n0.445851\n0.363204\n0.408615\n0.467805\n0.524419\n\n\n520\n0.419335\n0.340130\n0.383442\n0.440313\n0.494901\n\n\n540\n0.323126\n0.258570\n0.292984\n0.340130\n0.386424\n\n\n560\n0.070868\n0.052363\n0.061629\n0.075936\n0.091786\n\n\n580\n−0.011080\n−0.011340\n−0.011200\n−0.011010\n−0.010510\n\n\n600\n−0.011570\n−0.011610\n−0.011630\n−0.011550\n−0.011600\n\n\n620\n−0.011380\n−0.011470\n−0.011440\n−0.011290\n−0.011370\n\n\n640\n−0.011420\n−0.011500\n−0.011470\n−0.011310\n−0.011410\n\n\n660\n−0.011010\n−0.011090\n−0.011090\n−0.010880\n−0.011010\n\n\n680\n−0.010090\n−0.010220\n−0.010230\n−0.009980\n−0.010170\n\n\n700\n−0.008380\n−0.008580\n−0.008570\n−0.008260\n−0.008520\n\n\nX\n0.029869\n0.024472\n0.027592\n0.031092\n0.035563\n\n\nY\n0.085610\n0.069799\n0.078545\n0.089440\n0.101127\n\n\nZ\n0.404199\n0.325481\n0.368875\n0.425911\n0.479995\n\n\nStrength\n\n80.52%\n91.26%\n105.37%\n118.75%\n\n\nR\n−0.011820\n−0.011850\n−0.011830\n−0.011820\n−0.011730\n\n\nG\n0.247564\n0.200702\n0.225898\n0.259815\n0.293294\n\n\nB\n0.420127\n0.343866\n0.385925\n0.441249\n0.492747\n\n\nStrength\n\n81.85%\n91.86%\n105.03%\n117.29%",
        "The invention has been described in terms of preferred embodiments thereof, but is more broadly applicable as will be understood by those skilled in the art. The scope of the invention is only limited by the following claims."
    ],
    "citations": [
        "4289405",
        "4690564",
        "5163012",
        "5724259",
        "5767980",
        "5774225",
        "5821993",
        "5967033",
        "6003967",
        "6151064",
        "6318260",
        "6857368",
        "7077064"
    ],
    "us_classification": "101484",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "41",
            "subclass": "F",
            "main_group": "31",
            "subgroup": "00"
        }
    ]
}