{
    "title": "Liquid additive for reducing water-soluble chromate",
    "abstract": "Methods for cementing and cement compositions are provided, wherein the cement composition comprises cementitious material and an aqueous suspension of zeolite and a chromate reducing agent.",
    "inventors": [
        "Luke",
        "Cromwell"
    ],
    "document_number": "07296626",
    "publication_date": "20071120",
    "assignees": [
        "Halliburton Energy Services, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of cementing an area comprising:",
            "components": [
                {
                    "component": "mixing a cementitious material with water and an aqueous suspension comprising water, zeolite and a chromate reducing agent to form a cement composition, wherein the aqueous suspension comprises zeolite in an amount of from about 67 to about 100 weight percent of the weight of the water, and chromate reducing agent in an amount of from about 42 to about 167 weight percent of the weight of the zeolite, and from about 28 to about 111 weight percent of the weight of the water in the aqueous suspension;",
                    "subcomponents": []
                },
                {
                    "component": "placing the cement composition in the area; and",
                    "subcomponents": []
                },
                {
                    "component": "allowing the cement composition to set therein.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 wherein the zeolite is represented by the formula:",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , wherein the zeolite is selected from the group consisting of analcime, bikitaite, brewsterite, chabazite, clinoptilolite, faujasite, harmotome, heulandite, laumontite, mesolite, natrolite, paulingite, phillipsite, scolecite, stellerite, stilbite, and thomsonite.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein the chromate reducing agent is selected from the group consisting of stannous sulfate and ferrous sulfate, and hydrates thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 , wherein the aqueous suspension comprises zeolite in an amount of more than about 67 weight percent to less than about 100 weight percent of the weight of the water, and chromate reducing agent in an amount that is about 111 weight percent of the weight of the water, and more than about 100 weight percent to about 167 weight percent of the weight of the zeolite.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein the aqueous suspension comprises zeolite in an amount of about 67 to about 100 weight percent of the weight of the water, and chromate reducing agent in an amount that is from more than about 100 weight percent to about 111 weight percent of the weight of the water, and about 167 weight percent of the weight of the zeolite.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein the aqueous suspension comprises zeolite in an amount of about 67 weight percent of the weight of the water, and chromate reducing agent in an amount that is from about 56 to about 111 weight percent of the weight of the water, and from about 83 to about 167 weight percent of the weight of the zeolite.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , wherein the cement composition comprises up to about 0.5% of the chromate reducing agent by weight of the cementitious material.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 1 wherein the cementitious material comprises at least one member selected from the group consisting of micronized cement, Portland cement, pozzolan cement, gypsum cement, aluminous cement, silica cement, and alkaline cement.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 1 wherein the area comprises a wellbore penetrating a subterranean zone.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A method of cementing an area comprising:",
            "components": [
                {
                    "component": "mixing a cementitious material with water and an aqueous suspension comprising water, zeolite and a chromate reducing agent to form a cement composition, wherein the aqueous suspension comprises zeolite in an amount of from about 48 to about 150 weight percent by weight of the water, and chromate reducing agent in an amount of from about 103 to about 167 weight percent by weight of the zeolite and from about 49 to about 167 weight percent by weight of the water in the aqueous suspension;",
                    "subcomponents": []
                },
                {
                    "component": "placing the cement composition in the area; and",
                    "subcomponents": []
                },
                {
                    "component": "allowing the cement composition to set therein.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 11 wherein the zeolite is represented by the formula:",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 11 , wherein the zeolite is selected from the group consisting of analcime, bikitaite, brewsterite, chabazite, clinoptilolite, faujasite, harmotome, heulandite, laumontite, mesolite, natrolite, paulingite, phillipsite, scolecite, stellerite, stilbite, and thomsonite.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 11 , wherein the chromate reducing agent is selected from the group consisting of stannous sulfate and ferrous sulfate.",
            "components": []
        }
    ],
    "description": [
        "The present embodiment relates generally to cement compositions and methods for cementing an area using such cement compositions. In certain examples, methods for cementing in a subterranean zone are described.",
        "In the drilling and completion of an oil or gas well, a cement composition is often introduced in the wellbore for cementing pipe string or casing. When the desired drilling depth of the well is reached, a cement composition is pumped into the annular space between the walls of the wellbore and the casing. The cement composition sets in the annular space, supporting and positioning the casing, and forming a substantially impermeable barrier, or cement sheath, which isolates the wellbore from subterranean zones.",
        "Most cements contain chromium compounds because the raw material (typically shale) from which cements are made usually contains chromium compounds. When the cements are mixed with water, the chromium compounds appear as Cr+6 (chromate) dissolved in the water. The dissolved chromate presents a health risk to humans, for example, allergic reactions.",
        "Ferrous sulfate is known to reduce Cr+6 to Cr+3, which is less soluble in cement-water mixtures. Ferrous sulfate has been dry blended with cement during the manufacturing of the cement, but in such a blend, the ferrous sulfate remains effective for only a limited period of time. In addition, the solubility of ferrous sulfate is such that it will settle out of solution if formulated as a liquid additive.",
        "According to embodiments described herein, methods of cementing an area are provided. Certain methods include preparing a cement composition by mixing a cementitious material with water and an aqueous suspension comprising water, zeolite and a chromate reducing agent, placing the cement composition in the area, and allowing the cement composition to set therein.",
        "According to some embodiments, the aqueous suspension comprises zeolite in an amount of from about 67 weight percent to about 100 weight percent by weight of the water, and chromate reducing agent in an amount that is from about 42 weight percent to about 167 weight percent by weight of the zeolite and from about 28 weight percent to about 111 weight percent by weight of the water in the aqueous suspension.",
        "According to other embodiments, the aqueous suspension comprises zeolite in an amount of more than about 56 weight percent to less than about 111 weight percent of the weight of the water, and chromate reducing agent in an amount that is about 111 weight percent of the weight of the water, and more than about 100 weight percent to about 167 weight percent of the weight of the zeolite.",
        "According to still other embodiments, the aqueous suspension comprises zeolite in an amount of about 67 weight percent to about 100 weight percent of the weight of the water, and chromate reducing agent in an amount that is from more than about 100 weight percent to about 111 weight percent of the weight of the water, and about 167 weight percent of the weight of the zeolite.",
        "According to still further embodiments, the aqueous suspension comprises zeolite in an amount of about 67 weight percent of the weight of the water, and chromate reducing agent in an amount that is from about 56 weight percent to about 111 weight percent of the weight of the water, and from about 83 weight percent to about 167 weight percent of the weight of the zeolite.",
        "According to certain embodiments described herein, an aqueous suspension comprises water, zeolite and stannous sulfate or ferrous sulfate as a chromate reducing agent. The ferrous sulfate can be any of the hydrates of ferrous sulfate, such as the monohydrate (FeSO4.H2O), the tetrahydrate (FeSO4.4H2O), the pentahydrate (FeSO4.5H2O), and the heptahydrate (FeSO4.7H2O). Hydrated forms of stannous sulfate, if any, could also prove to be suitable.",
        "According to certain embodiments, the zeolite in the aqueous suspension is one or more of analcime (hydrated sodium aluminum silicate), bikitaite (lithium aluminum silicate), brewsterite (hydrated strontium barium calcium aluminum silicate), chabazite (hydrated calcium aluminum silicate), clinoptilolite (hydrated sodium aluminum silicate), faujasite (hydrated sodium potassium calcium magnesium aluminum silicate), harmotome (hydrated barium aluminum silicate), heulandite (hydrated sodium calcium aluminum silicate), laumontite (hydrated calcium aluminum silicate), mesolite (hydrated sodium calcium aluminum silicate), natrolite (hydrated sodium aluminum silicate), paulingite (hydrated potassium sodium calcium barium aluminum silicate), phillipsite (hydrated potassium sodium calcium aluminum silicate), scolecite (hydrated calcium aluminum silicate), stellerite (hydrated calcium aluminum silicate), stilbite (hydrated sodium calcium aluminum silicate) and thomsonite (hydrated sodium calcium aluminum silicate).",
        "Zeolites are porous alumino-silicate minerals that may be either a natural or manmade material. Manmade zeolites are based on the same type of structural cell as natural zeolites and are composed of aluminosilicate hydrates having the same basic formula as given below. It is understood that as used in this application, the term “zeolite” means and encompasses all natural and manmade forms of zeolites. All zeolites are composed of a three-dimensional framework of SiO4 and AlO4 in a tetrahedron, which creates a very high surface area. Cations and water molecules are entrained into the framework. Thus, all zeolites may be represented by the crystallographic unit cell formula:\n\nMa/n[(AlO2)a(SiO2)b].xH2O\n\nwhere M represents one or more cations such as Na, K, Mg, Ca, Sr, Li or Ba for natural zeolites and NH4, CH3NH3, (CH3)3NH, (CH3)4N, Ga, Ge and P for manmade zeolites; n represents the cation valence; the ratio of b:a is in a range of from greater than or equal to 1 to less than or equal to 5; and x represents the moles of water entrained into the zeolite framework.",
        "Compositions for cementing are also described herein. According to certain embodiments, the compositions comprise cementitious material and an aqueous suspension of water, zeolite and a chromate reducing agent. According to certain embodiments, the aqueous suspension is present in the cement composition in an amount sufficient to provide the cement composition with a chromate reducing agent content of up to about 0.5% by weight of the cementitious material.",
        "A variety of cementitious materials can be used with the present embodiments, including but not limited to hydraulic cements. Hydraulic cements set and harden by reaction with water, and are typically comprised of calcium, aluminum, silicon, oxygen, and/or sulfur. Hydraulic cements include Portland cements, pozzolan cements, gypsum cements, aluminous cements, silica cements, and alkaline cements. According to certain examples, the cementitious material comprises at least one API Portland cement. As used herein, the term API Portland cement means any cement of the type defined and described in API Specification 10A, 23rd Edition, Oct. 1, 2002, of the American Petroleum Institute, (ANSI/API 10A/ISO 10426-1-2001) such as Classes A, B, C, G, and H.",
        "Water in the cement compositions according to the present embodiments is present in an amount sufficient to make a slurry of a desired density. The water used to form a slurry can be fresh water, unsaturated salt solution, including brines and seawater, and saturated salt solution. Generally, any type of water can be used, provided that it does not contain an excess of compounds that are well known to those skilled in the art to adversely affect properties of the cement composition. In certain embodiments, the water is present in an amount of about 20% to about 150% by weight of the cementitious material in the cement composition.",
        "A variety of additives may be added to a cement composition that includes an aqueous suspension of zeolite and a chromate reducing agent. Such additives include density modifying materials (e.g., fly ash, silica flour, sodium silicate, microfine sand, iron oxides and manganese oxides), dispersing agents, set retarding agents, set accelerating agents, fluid loss control agents, strength retrogression control agents, and viscosifying agents, all of which are well known to those of ordinary skill in the art.",
        "The following examples are illustrative of the methods and compositions discussed above.",
        "Components of the types and amounts reported in Table 1A were mixed to form Sample Nos. 1-45. The chromate reducing agent (“CRA” ) was SnSO4 or FeSO4.7H2O as indicated in the table. SnSO4 and FeSO4.7H2O were each obtained from Fisher Laboratory Chemicals. The zeolite used in Sample Nos. 1-45 was chabazite, which was mined from Bowie, Ariz., USA and obtained from C2C Zeolite Corporation, Calgary, Canada. The water used to form the suspensions was tap water.",
        "The reported amount of chromate reducing agent and the reported amount of zeolite were weighed and added to a glass beaker. The reported amount of water (grams) was added to the beaker, and the chromate reducing agent, zeolite and water in the beaker were hand mixed with a stirring rod at room temperature. The amounts of chromate reducing agent and zeolite are reported in grams, and also in a weight percent of the total weight of the mixture (chromate reducing agent, zeolite and water).",
        "Also reported in Table 1A are: the percentage of zeolite in the mixture, expressed as a weight percentage of the weight of water in the mixture, and the percentage of reducing agent in the mixture, expressed as a weight percentage of the weight of water in the mixture, and as a weight percentage of the weight of zeolite in the mixture.",
        "The notes reported in Table 1A indicate whether the samples settled within 24 hours of visual observation.",
        "TABLE 1A\n\n\n\n\n\n\n\nCRA\nZeolite\nWater\nCRA\nZeolite\nCRA/Water\nCRA/Zeolite\nZeolite/\n\n\n\nNo.\nReducing agent\n(g)\n(g)\n(g)\n(wt. %)\n(wt. %)\n(%)\n(%)\nWater (%)\nNotes\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\nSnSO4\n12.50\n0.00\n12.50\n50\n0\n100\n0\n0\nSolids settled/\n\n\n\n\n\n\n\n\n\n\n\n\nfree water\n\n\n2\nFeSO4•7H2O\n10.00\n6.00\n4.00\n50\n30\n250\n167\n150\nBarely mixable\n\n\n3\nFeSO4•7H2O\n10.00\n10.00\n9.00\n34\n34\n111\n100\n111\nBarely mixable -\n\n\n\n\n\n\n\n\n\n\n\n\nthixotropic\n\n\n4\nFeSO4•7H2O\n5.00\n12.00\n9.00\n19\n46\n56\n42\n133\nBarely mixable -\n\n\n\n\n\n\n\n\n\n\n\n\nthixotropic\n\n\n5\nFeSO4•7H2O\n15.00\n12.00\n9.00\n42\n33\n167\n125\n133\nBarely mixable -\n\n\n\n\n\n\n\n\n\n\n\n\nthixotropic\n\n\n6\nFeSO4•7H2O\n5.00\n12.00\n9.00\n19\n46\n56\n42\n133\nBarely mixable -\n\n\n\n\n\n\n\n\n\n\n\n\nthixotropic\n\n\n7\nFeSO4•7H2O\n10.00\n9.00\n6.00\n40\n36\n167\n111\n150\nBarely mixable -\n\n\n\n\n\n\n\n\n\n\n\n\nthixotropic\n\n\n8\nSnSO4\n10.00\n6.00\n9.00\n40\n24\n111\n167\n67\nNo settling\n\n\n9\nFeSO4•7H2O\n10.00\n6.00\n9.00\n40\n24\n111\n167\n67\nNo settling\n\n\n10\nFeSO4•7H2O\n10.00\n8.00\n9.00\n37\n30\n111\n125\n89\nNo settling\n\n\n11\nFeSO4•7H2O\n10.00\n9.00\n9.00\n36\n32\n111\n111\n100\nNo settling\n\n\n12\nFeSO4•7H2O\n10.00\n12.00\n18.00\n25\n30\n56\n83\n67\nNo settling\n\n\n13\nFeSO4•7H2O\n7.00\n6.00\n9.00\n25\n30\n78\n117\n67\nNo settling\n\n\n14\nFeSO4•7H2O\n5.00\n6.00\n9.00\n25\n30\n56\n83\n67\nNo settling\n\n\n15\nFeSO4•7H2O\n5.00\n12.00\n18.00\n14\n34\n28\n42\n67\nNo settling\n\n\n16\nFeSO4•7H2O\n10.00\n9.00\n9.00\n36\n32\n111\n111\n100\nNo settling\n\n\n17\nFeSO4•7H2O\n10.00\n9.00\n12.00\n32\n29\n83\n111\n75\nNo settling\n\n\n18\nFeSO4•7H2O\n5.00\n6.00\n9.00\n25\n30\n56\n83\n67\nNo settling\n\n\n19\nSnSO4\n12.50\n12.50\n12.50\n33\n33\n100\n100\n100\nNo settling\n\n\n20\nSnSO4\n12.50\n4.00\n8.50\n50\n16\n147\n313\n47\nSettling\n\n\n21\nSnSO4\n10.00\n4.80\n10.20\n40\n19\n98\n208\n47\nSettling\n\n\n22\nFeSO4•7H2O\n10.00\n5.00\n9.00\n42\n21\n111\n200\n56\nSettling\n\n\n23\nFeSO4•7H2O\n10.00\n6.00\n10.00\n38\n23\n100\n167\n60\nSettling\n\n\n24\nFeSO4•7H2O\n12.00\n6.00\n9.00\n44\n22\n133\n200\n67\nSettling\n\n\n25\nSnSO4\n12.50\n3.50\n9.00\n50\n14\n139\n357\n39\nSettling\n\n\n26\nFeSO4•7H2O\n15.00\n6.00\n9.00\n50\n20\n167\n250\n67\nSettling\n\n\n27\nFeSO4•7H2O\n15.00\n9.00\n12.00\n42\n25\n125\n167\n75\nSettling\n\n\n28\nFeSO4•7H2O\n15.00\n6.00\n9.00\n50\n20\n167\n250\n67\nSettling\n\n\n29\nFeSO4•7H2O\n5.00\n6.00\n12.00\n22\n26\n42\n83\n50\nSettling\n\n\n30\nFeSO4•7H2O\n15.00\n9.00\n12.00\n42\n25\n125\n167\n75\nSettling\n\n\n31\nSnSO4\n12.50\n6.25\n12.50\n40\n20\n100\n200\n50\nSevere settling\n\n\n32\nSnSO4\n12.50\n2.50\n10.00\n50\n10\n125\n500\n25\nSevere settling\n\n\n33\nFeSO4•7H2O\n10.00\n3.00\n9.00\n45\n14\n111\n333\n33\nSevere settling\n\n\n34\nFeSO4•7H2O\n5.00\n3.00\n9.00\n29\n18\n56\n167\n33\nSevere settling\n\n\n35\nFeSO4•7H2O\n15.00\n3.00\n9.00\n56\n11\n167\n500\n33\nSevere settling\n\n\n36\nFeSO4•7H2O\n10.00\n3.00\n9.00\n45\n14\n111\n333\n33\nSevere settling\n\n\n37\nSnSO4\n16.50\n16.08\n33.50\n24\n24\n49\n103\n48\nSlight settling\n\n\n38\nSnSO4\n8.25\n8.00\n16.75\n25\n24\n49\n103\n48\nSlight settling\n\n\n39\nFeSO4•7H2O\n10.00\n6.00\n6.00\n45\n27\n167\n167\n100\nSlight settling\n\n\n40\nFeSO4•7H2O\n10.00\n6.00\n6.00\n45\n27\n167\n167\n100\nSlight settling\n\n\n41\nFeSO4•7H2O\n15.00\n12.00\n18.00\n33\n27\n83\n125\n67\nSlight settling\n\n\n42\nSnSO4\n12.50\n12.50\n6.25\n40\n40\n200\n100\n200\nUnmixable\n\n\n43\nSnSO4\n12.50\n9.375\n9.375\n40\n30\n133\n133\n100\nVery thixotropic\n\n\n44\nSnSO4\n12.50\n6.25\n6.25\n50\n25\n200\n200\n100\nVery thixotropic\n\n\n45\nSnSO4\n12.50\n8.00\n4.50\n50\n18\n278\n156\n177\nVery thixotropic",
        "The settling observations reported in Table 1A indicate that with sufficient zeolite to water ratios, chromate reducing agent to water ratios and chromate reducing agent to zeolite ratios, a chromate reducing agent can be formulated as an aqueous suspension having sufficient suspension and thixotropic properties for use in preparing cement compositions as will be described further in Example 2.",
        "In particular, Sample Nos. 8-18 reported in Table 1A illustrate that aqueous suspensions of a chromate reducing agent can be made with zeolite in an amount of from about 67 weight percent to about 100 weight percent of the weight of the water, and chromate reducing agent in an amount that is from about 42 weight percent to about 167 weight percent of the weight of the zeolite, and from about 28 weight percent to about 111 weight percent of the weight of the water in the aqueous suspension.",
        "Sample Nos. 3, 8-11, 16 and 21 illustrate that aqueous suspensions of a chromate educing agent can be made with zeolite in an amount of more than about 56 weight percent to less than about 111 weight percent of the weight of the water, and chromate reducing agent in an amount that is about 111 weight percent of the weight of the water, and more than about 100 weight percent to about 167 weight percent of the weight of the zeolite.",
        "Sample Nos. 2, 8, 9, 22 and 39 illustrate that aqueous suspensions of a chromate reducing agent can be made with zeolite in an amount of about 67 weight percent to about 100 weight percent of the weight of the water, and chromate reducing agent in an amount that is from more than about 100 weight percent to about 111 weight percent of the weight of the water, and about 167 weight percent of the weight of the zeolite.",
        "Sample Nos. 8, 9, 13, 18, 23, 25 and 27 illustrate that aqueous suspensions of a chromate reducing agent can be made with zeolite in an amount of about 67 weight percent of the weight of the water, and chromate reducing agent in an amount that is from about 56 weight percent to about 111 weight percent of the weight of the water, and from about 83 weight percent to about 167 weight percent of the weight of the zeolite.",
        "Sample Nos. 8, 9 and 36 were visually observed for a period of 14 days to determine whether settling would occur over time. The results of the observations are reported in Table 1B, where “n/a” indicates that no observation was recorded.",
        "TABLE 1B\n\n\n\n\n\n\n\n\n\nTime (days)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSample No.\n0\n2\n4\n5\n7\n8\n10\n11\n14\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n8\nNo settling\nNo settling\nNo settling\nNo settling\nn/a\nn/a\nn/a\nn/a\nSlight settling\n\n\n9\nNo settling\nn/a\nn/a\nn/a\nn/a\nNo settling\nn/a\nn/a\nSlight settling\n\n\n36\nSlight settling\nn/a\nn/a\nSlight settling\nn/a\nn/a\nSlight settling\nViscous\nn/a",
        "Table 1B indicates that aqueous suspensions of chromate reducing agent as described herein are stable.",
        "Cement compositions comprising a cementitious material, a chromate reducing agent and water were prepared. The water used in this example was distilled and deionized. For certain compositions, the chromate reducing agent was included in the composition as an aqueous suspension that included zeolite. The type and amount of cementitious material, the type and amount of chromate reducing agent, and whether the chromate reducing agent was formulated as an aqueous suspension is reported in Table 2.",
        "TABLE 2\n\n\n\n\n\n\nCementitious\n\nReducing Agent Type (40%\n\n\n\n\n\nMaterial Type\nReducing Agent Type (dry)\nby weight of an aqueous\nWater\nCr+6 content\n\n\nNo.\nand Amount\nand Amount\nsuspension) and Amount\n(mL)\n(mgL−1)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\nA 25 g\n0\n0\n25\n5.68\n\n\n2\nA 25 g\nSnSO4 (0.35% bwoc)\n0\n25\n0.032\n\n\n3\nA 25 g\n0\nSnSO4 (0.35% bwoc)\n25\n0.030\n\n\n4\nA 25 g\nFeSO4•7H2O (0.5% bwoc)\n0\n25\n0.016\n\n\n5\nA 25 g\n0\nFeSO4•7H2O (0.5% bwoc)\n25\n0.012\n\n\n6\nB 25 g\n0\n0\n25\n2.65\n\n\n7\nB 25 g\nSnSO4 (0.35% bwoc)\n0\n25\n0.019\n\n\n8\nB 25 g\n0\nSnSO4 (0.35% bwoc)\n25\n0.030\n\n\n9\nB 25 g\nFeSO4•7H2O (0.5% bwoc)\n0\n25\n0.020\n\n\n10\nB 25 g\n0\nFeSO4•7H2O (0.5% bwoc)\n25\n0.005\n\n\n11\nC 25 g\n0\n0\n25\n5.19\n\n\n12\nC 25 g\nSnSO4 (0.35% bwoc)\n0\n25\n0.067\n\n\n13\nC 25 g\n0\nSnSO4 (0.35% bwoc)\n25\n0.017\n\n\n14\nC 25 g\nFeSO4•7H2O (0.5% bwoc)\n0\n25\n0.013\n\n\n15\nC 25 g\n0\nFeSO4•7H2O (0.5% bwoc)\n25\n0.013\n\n\n\n\n\nCementitious material A = API Class G cement from Lafarge Corp.\n\n\nCementitious material B = API Class G cement from Dyckerhoff AG\n\n\nCementitious material C = API Class G cement from Norcem AS",
        "Composition Nos. 2, 4, 7, 9, 12 and 14 were prepared with the reported amount and type of cementitious material, and the reported amount and type of chromate reducing agent, which was mixed with the cementitious material as a “dry” additive, rather than as an aqueous suspension. The cementitious material, chromate reducing agent and water were measured into a glass jar, and mixed by hand at room temperature. The amount of chromate reducing agent is reported as a percent based on the total weight of the cementitious material (bwoc), or in other words, an amount that is 0.35% or 0.5% of the 25 grams of cementitious material.",
        "Composition Nos. 3, 5, 8, 10, 13 and 15 were prepared using aqueous suspensions that included zeolite in an amount of about 67 percent by weight of water in the suspension, and the reported chromate reducing agent in an amount that was about 167 percent by weight of the zeolite and about 111 percent by weight of the water in the suspension (which is an aqueous suspension of about 40 weight percent chromate reducing agent, about 24 weight percent zeolite and about 36 weight percent water).",
        "The zeolite used in the aqueous suspensions was chabazite, which was mined from Bowie, Ariz., USA and obtained from C2C Zeolite Corporation, Calgary, Canada. The suspensions were mixed according to the methods described in Example 1. Namely, the reported chromate reducing agent, zeolite and water were mixed with a stirring rod in a glass beaker at room temperature.",
        "The aqueous suspensions were mixed with the reported amounts of cementitious material and water to form the compositions. The water was measured into a glass jar, and the aqueous suspension was added to the jar in an amount of 0.218 grams (which, when expressed as a volume, is about 0.15 mL of the ferrous sulfate suspension and about 0.12 mL for the stannous sulfate suspension, or when expressed by the weight of the cementitious material (bwoc) to be added (25 grams), is about 0.35% for the ferrous sulfate suspension and about 0.5% for the stannous sulfate suspension.) After addition of the suspension, the mixture was stirred for about one minute at room temperature. The reported amount of cementitious material (25 grams) was then added to the jar and mixing continued.",
        "Composition Nos. 1, 6 and 11 did not contain a chromate reducing agent, and served as a control for the remaining compositions.",
        "The Cr+6 content of each composition was determined using a Hach DR 4000 Spectrometer and 1,5-diphenylcarbohydrazide reagent. To prepare the samples for spectral analysis, each composition was stirred with a magnetic stirring bar for about 15 minutes, followed by filtering and acidification of the filtrate with sulfuric acid to a pH of about 2.",
        "Per Method 8023 of the manufacturer's procedures for operation of the Hach DR 4000 Spectrometer, sample cells were then filled with the acidified filtrate, and a 65 mg powder pillow of the 1,5-diphenylcarbohydrazide reagent (available under the tradename “ChromaVer 3” Reagent Powder Pillow) was added to each cell. The Cr+6 concentration of the reacted filtrate was then determined by ultraviolet-visible spectroscopy, per Method 8023 of the manufacturer's procedures for operation of the Hach DR 4000 Spectrometer.",
        "The concentrations of Cr+6 reported in Table 2 indicate that aqueous suspensions of chromate reducing agent are effective for reducing the Cr+6 content of cement compositions. In addition, as described in Example 3, the inclusion in cement compositions of chromate reducing agents formulated in an aqueous suspension included zeolite does not adversely affect the suitability of such cement compositions for use in sealing in a subterranean zone penetrated by a well bore.",
        "Referring now to Table 3A, various properties of cement compositions that include a chromate reducing agent formulated as an aqueous suspension as described herein are reported. In particular, Table 3A describes rheological data, thickening times and free water data of cement compositions comprising stannous sulfate or ferrous sulfate, each of which is formulated as an aqueous suspension comprising zeolite.",
        "The rheological data reported in Table 3A was obtained generally according to the procedures set forth in Section 12 of the API Specification RP 10B, 22nd Edition, 1997, of the American Petroleum Institute. Generally according to such procedure, dial readings on a Fann Model 35 viscometer were read at the different rotational speeds and temperatures reported in Table 3A. For example, the Fann viscometer is rotated at 300 RPM (revolutions per minute) for 60 seconds and a value on the dial is read, the speed is then changed to 200 RPM and the new value on the dial reading taken.",
        "Thickening times (“TT” ) were determined using a Well Simulation Thickening Time test described in API Specification 10B 22nd Edition, 1997, of the American Petroleum Institute. The thickening time reported in Table 3A is that amount of time (hours:minutes) that it took the composition to attain 70 Bearden units of consistency (Bc) in a high pressure consistometer, as described in API Specification 10B noted above.",
        "Free water data was gathered according to Section 15.5 of Addendum 2 of the API Specification 10B 22nd Edition, 1997, of the American Petroleum Institute. Generally according to this API Specification, 250 ml of each cement composition was poured into its own 250 ml graduated glass cylinder and then sealed with a plastic film wrap to prevent evaporation. A two-hour test period was then initiated, in which the graduated cylinders were left standing. After two hours, the free fluid that had gathered on top of each cement composition inside the cylinder was measured. The percent of free fluid was calculated as the measured milliliters of free fluid multiplied by 100 and then divided by the initial 250 milliliters of the cement composition.",
        "“n/a” indicates that the particular measurement was not recorded.",
        "The cementitious material used to prepare each of Composition Nos. 1A-7B reported in Table 3A was API Class G cement from Dyckerhoff AG. The water used to prepare the compositions was tap water.",
        "The amount of the aqueous suspension of a chromate reducing agent used to form the compositions is reported in Table 3A in “L/100 Kg”, which describes the volume of the aqueous suspension used in the composition per 100 Kg of cementitious material used in the composition. The amount of the aqueous suspension to form the compositions is also reported in % bwoc, which describes the percent of the aqueous suspension used in the composition, by weight of the cementitious material used in the composition.",
        "Certain of the cement compositions, as reported below, included dispersants, retarders and viscosifiers. In particular, additives bearing the tradenames CFR-3™, Econolite™ liquid, SSA-1™ and HR-4L™ were used in certain compositions of this Example 3. Bentonite was also used in certain compositions. CFR-3™ is the tradename for a dispersant commercially available from Halliburton Energy Services, Duncan, Okla., and comprises a condensation product of formaldehyde, acetone and a sulfite. Econolite™ liquid is the tradename for a lightweight additive commercially available from Halliburton Energy Services, Duncan, Okla., and comprises sodium silicate. SSA-1™ is the tradename for a strength retrogression additive commercially available from Halliburton Energy Services, Duncan, Okla., and comprises silica flour. HR-4L™ is the tradename for a retarder commercially available from Halliburton Energy Services, Duncan, Okla., and comprises an aqueous solution of an unrefined lignosulfonate. Bentonite is a montmorillonite clay commercially available from Halliburton Energy Services, Duncan, Okla. Bentonite was used in the examples herein as a viscosifier.",
        "TABLE 3A\n\n\n\n\n\n\n\n\n\nType of Reducing\nAmt. of Reducing\n\n\nTT to\nFree\n\n\n\nAgent (in a\nAgent (Aq. Susp.)\nRheo Test\nRheological data - reading at rpm\n70 Bc\nwater\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNo.\nAq. Susp.)\nin Comp.\nTemp (° C.)\n600\n300\n200\n100\n60\n30\n6\n3\n(Hr:min)\n(%)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1A\nnone\n0\n80\n98\n64\n54\n40\n33\n28\n17\n15.5\nn/a\nn/a\n\n\n1B\nSnSO4\n0.479L/100 Kg\n80\n75\n49\n42\n32\n29\n26\n18\n16.5\nn/a\nn/a\n\n\n\n\n(0.87% bwoc)\n\n\n2A\nnone\n0\n123\n15\n11\n9\n8\n7\n6\n5\n4\n6:04\n18\n\n\n2B\nSnSO4\n0.479 L/100 Kg\n123\n13\n7.5\n6.5\n5.5\n4.5\n4\n3\n2.5\n3:49\n16\n\n\n\n\n(0.87% bwoc)\n\n\n3A\nSnSO4\n0.479 L/100 Kg\n80\n22\n16\n13\n9\n8\n7\n4.5\n3.5\n9:47\nn/a\n\n\n\n\n(0.87% bwoc)\n\n\n3B\nSnSO4\n0.479 L/100 Kg\n98\n22\n16\n13\n9\n8\n7\n4.5\n3\n10:22 \nn/a\n\n\n\n\n(0.87% bwoc)\n\n\n4A\nnone\n0\n80\n99\n65\n57\n45\n40\n35\n24\n21\n5:47\nn/a\n\n\n4B\nFeSO4•7H2O\n0.888 L/100Kg\n80\n115\n75\n65\n49\n42\n35\n23\n17\n5:25\nn/a\n\n\n\n\n(1.32% bwoc)\n\n\n5A\nnone\n0\n123\n15\n11\n9\n8\n7\n6\n5\n4\n5:09\n18\n\n\n5B\nFeSO4•7H2O\n0.888 L/100 Kg\n123\n10\n5\n4\n3\n2\n2\n1\n1\n5:25\n4\n\n\n\n\n(1.32% bwoc)\n\n\n6A\nnone\n0\n80\n22\n15\n12\n9\n7\n6\n4\n3\nn/a\nn/a\n\n\n6B\nFeSO4•7H2O\n0.888 L/100 Kg\n80\n24\n15\n12\n8.5\n7\n6\n4\n3.5\nn/a\nn/a\n\n\n\n\n(1.32% bwoc)\n\n\n7A\nnone\n0\n98\nn/a\nn/a\nn/a\nn/a\nn/a\nn/a\nn/a\nn/a\n9:47\n20\n\n\n7B\nFeSO4•7H2O\n0.888 L/100 Kg\n98\nn/a\nn/a\nn/a\nn/a\nn/a\nn/a\nn/a\nn/a\n9:04\n10\n\n\n\n\n(1.32% bwoc)",
        "The density for each of Comp. Nos. 1A and 1B was 1.91 Kg/L. The yield for each of Comp. Nos. 1A and 1B was 0.75 L/Kg, which describes the volume of slurry that would be obtained per Kg of cementitious material. The water requirement for each of Comp. Nos. 1A and 1B was 0.44 L/Kg, which describes the total water in the slurry per Kg of cementitious material.",
        "Comp. No. 1A was prepared by adding 794 g of cementitious material to 350 g of water being stirred in a Waring blender at 4000 rpm at room temperature. The cementitious material was added to the water over a 15 second period. When all of the cementitious material was added to the water, a cover was placed on the blender and mixing was continued at about 12,000 RPM for 35 seconds.",
        "Comp. No. 1B further included a chromate reducing agent formulated as an aqueous suspension that included zeolite, namely, an aqueous suspension having the concentrations of zeolite, water, and stannous sulfate as reported for Sample No. 8 in Table 1A.",
        "Comp. No. 1B was prepared by adding the reported amount of the aqueous suspension of stannous sulfate to 347 g of water in a Waring blender at 4000 rpm at room temperature. Cementitious material in an amount of 789 g was added to the mixing fluid (water and aqueous zeolite suspension of stannous sulfate) being maintained in the Waring Blender at 4000 rpm. The cementitious material was added to the mixing fluid over a 15 second period. When all of the cementitious material was added to the water, a cover was placed on the blender and mixing was continued at about 12,000 RPM for 35 seconds.",
        "A comparison of Comp. Nos. 1A and 1B illustrates that cement compositions comprising a chromate reducing agent that was added to the composition as an aqueous suspension are rheologically comparable to cement compositions that do not include a chromate reducing agent.",
        "Composition Nos. 2A and 2B included a lightweight additive (Econolite™ liquid) in an amount of about 4.439 L/100 Kg of cementitious material, a dispersant (CFR-3L™) in an amount of about 0.266 L/100 Kg of cementitious material, and a retarder (HR-4L™) in an amount of about 2.308 L/100 Kg of cementitious material. The density for each of Comp. Nos. 2A and 2B was 1.44 Kg/L. The yield for each of Comp. Nos. 2A and 2B was 1.36 L/Kg, which describes the volume of slurry obtained per Kg of cementitious material. The water requirement for each of Comp. Nos. 2A and 2B was 1.68 L/Kg, which describes the total water in the slurry per Kg of cementitious material.",
        "Comp. No. 2A was prepared by adding the reported amounts of lightweight additive, dispersant and retarder to 473 g of water being stirred in a Waring blender at 4000 RPM at room temperature. Cementitious material in an amount of 360 g was then added to the mixing fluid (the water, lightweight additive, dispersant and retarder) at 4000 RPM over a 15 second period. When all of the cementitious material was added to the mixing fluid, a cover was placed on the blender and mixing continued at about 12,000 RPM for 35 seconds.",
        "Comp. No. 2B further included a chromate reducing agent formulated as an aqueous suspension that included zeolite, namely, an aqueous suspension having the concentrations of zeolite, water, and stannous sulfate as reported for Sample No. 8 in Table 1A.",
        "Comp. No. 2B was prepared by adding the reported amount of the aqueous suspension to 472 g of water being stirred in a Waring blender at 4000 rpm at room temperature. The lightweight additive, dispersant and retarder were then added to the Waring blender. Cementitious material in an amount of 358 g was added to the mixing fluid (the water, aqueous suspension of chromate reducing agent, lightweight additive, dispersant and retarder) at 4000 RPM over a 15 second period. When all of the cementitious material was added to the mixing fluid, a cover was placed on the blender and mixing was continued at about 12,000 RPM for 35 seconds.",
        "A comparison of Comp. Nos. 2A and 2B illustrates that cement compositions comprising a chromate reducing agent that was added to the composition as an aqueous suspension have rheology, thickening times and free water data comparable to cement compositions that do not include a chromate reducing agent.",
        "Each of Comp. Nos. 3A and 3B included a chromate reducing agent formulated as an aqueous suspension that included zeolite, namely, an aqueous suspension having the concentrations of zeolite, water, and stannous sulfate as reported for Sample No. 8 in Table 1A.",
        "Each of Comp. Nos. 3A and 3B also included a strength retrogression agent (SSA-1™) in an amount of 35% by weight of cementitious material (bwoc), bentonite in an amount of 2.5% bwoc, and a retarder (HR-4L™) in an amount of 0.533 L/100 Kg of cementitious material.",
        "The density for each of Comp. Nos. 3A and 3B was 1.62 Kg/L. The yield for each of Comp. Nos. 3A and 3B was 1.49 L/Kg, which describes the volume of slurry obtained per Kg of cementitious material. The water requirement for each of Comp. Nos. 3A and 3B was 1.03 L/Kg, which describes the total water in the slurry per Kg of cementitious material.",
        "Comp. Nos. 3A and 3B were prepared by adding the reported amounts of the aqueous suspension to 412 g of water being stirred in a Waring blender at 4000 RPM at room temperature. The retarder was then added to the Waring blender. Four hundred and four (404) g of cementitious material was dry blended in a jar with the strength retrogression agent and bentonite. The dry blended mix was added to the mixing fluid (the aqueous suspension of chromate reducing agent, water and retarder) at 4000 RPM over a 15 second period. When all of the cementitious material was added to the mixing fluid, a cover was placed on the blender and mixing was continued at about 12,000 RPM for 35 seconds.",
        "A comparison of Comp. Nos. 3A and 3B illustrates that cement compositions comprising a chromate reducing agent that was added to the composition as an aqueous suspension have acceptable rheology and thickening times at a variety of temperatures.",
        "The density for each of Comp. Nos. 4A and 4B was 1.91 Kg/L. The yield for each of Comp. Nos. 4A and 4B was 0.76 L/Kg, which describes the volume of slurry obtained per Kg of cementitious material. The water requirement for each of Comp. Nos. 4A and 4B was 0.45 L/Kg, which describes the total water in the slurry per Kg of cementitious material.",
        "Comp. No. 4A was prepared by adding 793 g of cementitious material to 350 g of water being stirred in a Waring blender at 4000 rpm at room temperature. The cementitious material was added to the water over a 15 second period. When all of the cementitious material was added to the water, a cover was placed on the blender and mixing continued at about 12,000 RPM for 35 seconds.",
        "Comp. No. 4B further included a chromate reducing agent formulated as an aqueous suspension that included zeolite, namely, an aqueous suspension having the concentrations of zeolite, water, and ferrous sulfate as reported for Sample No. 9 in Table 1A.",
        "Comp. No. 4B was prepared by adding the reported amount of the aqueous suspension of ferrous sulfate to 344 g of water being stirred in a Waring blender at 4000 rpm at room temperature. Cementitious material in an amount of 789 g was added to the mixing fluid (the water and the aqueous suspension of chromate reducing agent) at 4000 RPM over a 15 second period. When all of the cementitious material was added to the mixing fluid, a cover was placed on the blender and mixing was continued at about 12,000 RPM for 35 seconds.",
        "A comparison of Comp. Nos. 4A and 4B illustrates that cement compositions comprising a chromate reducing agent that was added to the composition as an aqueous suspension have rheology and thickening times comparable to cement compositions that do not include a chromate reducing agent.",
        "Composition Nos. 5A and 5B included a lightweight additive (Econolite™ liquid) in an amount of about 4.439 L/100 Kg of cementitious material, a dispersant (CFR-3L™) in an amount of about 0.178 L/100 Kg of cementitious material, and a retarder (HR-4L™) in an amount of about 2.308 L/100 Kg of cementitious material. The density for each of Comp. Nos. 5A and 5B was 1.44 Kg/L. The yield for each of Comp. Nos. 2A and 2B was 1.60 L/Kg, which describes the volume of slurry obtained per Kg of cementitious material. The water requirement for each of Comp. Nos. 5A and 5B was 1.29 L/Kg, which describes the total water in the slurry per Kg of cementitious material.",
        "Comp. No. 5A was prepared by adding the reported amounts of lightweight additive, dispersant and retarder to 454 g of water being stirred in a Waring blender at 4000 RPM at room temperature. Cementitious material in an amount of 377 g was then added to the mixing fluid (the water, lightweight additive, dispersant and retarder) at 4000 RPM over a 15 second period. When all of the cementitious material was added to the mixing fluid, a cover was placed on the blender and mixing was continued at about 12,000 RPM for 35 seconds.",
        "Comp. No. 5B further included a chromate reducing agent formulated as an aqueous suspension that included zeolite, namely, an aqueous suspension having the concentrations of zeolite, water, and ferrous sulfate as reported for Sample No. 9 in Table 1A.",
        "Comp. No. 5B was prepared by adding the reported amount of the aqueous suspension of ferrous sulfate to 451 g of water being stirred in a Waring blender at 4000 rpm at room temperature. The lightweight additive, dispersant and retarder were then added to the Waring Blender. Cementitious material in an amount of 375 g was added to the mixing fluid (the water, aqueous suspension of chromate reducing agent, lightweight additive, dispersant and retarder) at 4000 RPM over a 15 second period. When all of the cementitious material was added to the mixing fluid, a cover was placed on the blender and mixing was continued at about 12,000 RPM for 35 seconds.",
        "A comparison of Comp. Nos. 5A and 5B illustrates that cement compositions comprising a chromate reducing agent that was added to the composition as an aqueous suspension have rheology, thickening times and free water data comparable to cement compositions that do not include a chromate reducing agent.",
        "Composition Nos. 6A-7B included a strength retrogression agent (SSA-1™) in an amount of 35% by weight of the cement (bwoc), bentonite in an amount of 3.00% bwoc, and a retarder (HR-4L™) in an amount of 0.533 L/100 Kg of cementitious material. The density for each of Comp. Nos. 6A-7B was 1.62 Kg/L. The yield for each of Comp. Nos. 6A-7B was 1.50 L/Kg, which describes the volume of slurry obtained per Kg of cementitious material. The water requirement for each of Comp. Nos. 6A-7B was 1.04 L/Kg, which describes the total water in the slurry per Kg of cementitious material.",
        "Comp. Nos. 6A and 7A were prepared by adding the retarder to 412 g of water being stirred in a Waring blender at 4000 RPM at room temperature. Four hundred and four (404) g of cementitious material was dry blended in a jar with the strength retrogression agent and bentonite. The dry blended mix was added to the mixing fluid (the water and retarder) at 4000 RPM over a 15 second period. When all of the cementitious material was added to the mixing fluid, a cover was placed on the blender and mixing was continued at about 12,000 RPM for 35 seconds.",
        "Comp. Nos. 6B and 7B further included a chromate reducing agent formulated as an aqueous suspension that included zeolite, namely, an aqueous suspension having the concentrations of zeolite, water, and ferrous sulfate as reported for Sample No. 9 in Table 1A.",
        "Comp. Nos. 6B and 7B were prepared by adding the reported amounts of the aqueous suspension of ferrous sulfate to 410 g of water being stirred in a Waring blender at 4000 RPM at room temperature. The retarder was then added to the Waring blender. Four hundred and one (401) g of cementitious material was dry blended in a jar with the strength retrogression agent and bentonite. The dry blended mix was added to the mixing fluid (the aqueous suspension of chromate reducing agent, water and retarder) at 4000 RPM over a 15 second period. When all of the cementitious material was added to the mixing fluid, a cover was placed on the blender and mixing was continued at about 12,000 RPM for 35 seconds.",
        "A comparison of Comp. Nos. 6A-7B illustrates that cement compositions comprising a chromate reducing agent added to composition as an aqueous suspension that includes zeolite have acceptable rheology and thickening times at a variety of temperatures.",
        "The compressive strengths of Comps Nos. 5A, 5B, 7A and 7B were determined according to Non-Destructive Sonic Testing as set forth in Section 7 of API Recommended Practice 10B, 22nd Edition, 1997, of the American Petroleum Institute, which is a text known and available to those of ordinary skill in the art. The results are reported in Table 3B.",
        "TABLE 3B\n\n\n\n\n\nCompressive\nNo. 5A at\nNo. 5B at\nNo. 7A at\nNo. 7B at\n\n\nStrength (psi)\n123° C.\n123° C.\n98° C.\n98° C.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n12 hr\n226\n241\n53\n40\n\n\n24 hr\n420\n410\n490\n423",
        "Comparisons of Comp. Nos. 5A to 5B, and 7A to 7B, illustrate that cement compositions comprising a chromate reducing agent that was added to the composition as an aqueous suspension can achieve compressive strengths, over a variety of temperatures, that are comparable to compressive strengths achieved by cement compositions that do not include a chromate reducing agent.",
        "Although only a few exemplary embodiments of this invention have been described in detail above, those skilled in the art will readily appreciate that many other modifications are possible in the exemplary embodiments without materially departing from the novel teachings and advantages of this invention. Accordingly, all such modifications are intended to be included within the scope of this invention as defined in the following claims."
    ],
    "citations": [
        "1782353",
        "1943584",
        "2094316",
        "2131338",
        "2349049",
        "2662827",
        "2727001",
        "2848051",
        "3000128",
        "3047493",
        "3065170",
        "3115721",
        "3179528",
        "3293040",
        "3359225",
        "3689927",
        "3694152",
        "3781225",
        "3884302",
        "3887285",
        "3888998",
        "3963508",
        "4054462",
        "4141843",
        "4217229",
        "4363736",
        "4372876",
        "4415367",
        "4435216",
        "4444668",
        "4468334",
        "4474667",
        "4482379",
        "4515635",
        "4530402",
        "4536297",
        "4548734",
        "4552591",
        "4555269",
        "4557763",
        "4566214",
        "4632186",
        "4650593",
        "4676317",
        "4703801",
        "4717488",
        "4772307",
        "4784691",
        "4784693",
        "4818288",
        "4888120",
        "4943544",
        "4986989",
        "5121795",
        "5123487",
        "5125455",
        "5127473",
        "5151131",
        "5238064",
        "5252554",
        "5301752",
        "5307876",
        "5314022",
        "5340860",
        "5346012",
        "5362321",
        "5377439",
        "5383967",
        "5435846",
        "5464060",
        "5494513",
        "5501276",
        "5527387",
        "5529624",
        "5566491",
        "5588489",
        "5626665",
        "5658624",
        "5680900",
        "5711383",
        "5716910",
        "5759964",
        "5788762",
        "5789352",
        "5807810",
        "5851960",
        "5866517",
        "5913364",
        "5964692",
        "5980446",
        "5990052",
        "6060434",
        "6063738",
        "6070664",
        "6138759",
        "6145591",
        "6149724",
        "6153562",
        "6167967",
        "6170575",
        "6171386",
        "6176315",
        "6182758",
        "6209646",
        "6210476",
        "6213213",
        "6230804",
        "6234251",
        "6235809",
        "6245142",
        "6258757",
        "6283213",
        "6312515",
        "6315042",
        "6372694",
        "6379456",
        "6390197",
        "6405801",
        "6409819",
        "6457524",
        "6475275",
        "6478869",
        "6488091",
        "6494951",
        "6508305",
        "6524384",
        "6555505",
        "6565647",
        "6566310",
        "6572698",
        "6593402",
        "6607035",
        "6610139",
        "6616753",
        "6626243",
        "6626991",
        "6630021",
        "6643971",
        "6645289",
        "6656265",
        "6656266",
        "6660080",
        "6702044",
        "6713553",
        "6719055",
        "6719902",
        "6722434",
        "6729405",
        "6737385",
        "6743288",
        "6752866",
        "6767868",
        "6832652",
        "6840319",
        "6840996",
        "6889767",
        "7005007",
        "7087110",
        "7128782",
        "7137448",
        "2001/0014651",
        "2002/0077390",
        "2002/0091177",
        "2002/0117090",
        "2002/0157575",
        "2003/0066460",
        "2003/0092582",
        "2003/0096945",
        "2003/0153466",
        "2003/0168215",
        "2003/0181543",
        "2003/0203996",
        "2003/0217847",
        "2004/0007162",
        "2004/0007360",
        "2004/0035331",
        "2004/0040475",
        "2004/0040712",
        "2004/0069537",
        "2004/0069538",
        "2004/0094331",
        "2004/0107877",
        "2004/0108113",
        "2004/0112255",
        "2004/0112600",
        "2004/0168803",
        "2004/0188091",
        "2004/0188092",
        "2004/0244977",
        "2004/0262000",
        "2004/0262001",
        "2005/0000734",
        "2005/0034864",
        "2005/0109243",
        "2005/0133222",
        "2006/0025312",
        "2006/0094921",
        "2153372",
        "202 07 178",
        "0 621 247",
        "0 802 253",
        "0 895 971",
        "1 260 491",
        "1 428 805",
        "1 428 805",
        "1 533 287",
        "1 544 182",
        "763.998",
        "1469954",
        "2 353 523",
        "52117316",
        "61021947",
        "07003254",
        "10110487",
        "1373781",
        "WO 97/28097",
        "WO 98/54108",
        "WO 00/50357",
        "WO 01/70646",
        "WO 2005/059301"
    ],
    "us_classification": "166292",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "E",
            "classification_class": "21",
            "subclass": "B",
            "main_group": "33",
            "subgroup": "13"
        }
    ]
}