{
    "title": "Adjustable blade-assisting mechanism for a folding knife",
    "abstract": "A folding knife is disclosed. The folding knife includes a handle; a blade connected to the handle in a manner allowing movement of the blade between a closed position in which the blade extends along the handle and an open position in which the blade extends away from the handle; and a blade-assisting mechanism configured to apply a manually adjustable force to urge the blade towards the open position over at least a portion of the blade travel between the closed position and the open position.",
    "inventors": [
        "Onion"
    ],
    "document_number": "07296355",
    "publication_date": "20071120",
    "assignees": [
        "Kai U.S.A., Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A folding knife, comprising:",
            "components": [
                {
                    "component": "a handle;",
                    "subcomponents": []
                },
                {
                    "component": "a blade connected to the handle in a manner allowing movement of the blade between a closed position in which the blade extends along the handle and an open position in which the blade extends away from the handle;",
                    "subcomponents": []
                },
                {
                    "component": "a blade-assisting mechanism including a bias element and an adjustment element, said bias element configured to apply a biasing force to urge the blade towards the open position over at least a portion of the blade travel between the closed position and the open position; and",
                    "subcomponents": []
                },
                {
                    "component": "said adjustment element configured to allow a user to selectively adjust the biasing force of the bias element to urge the blade towards the open position, the adjustment element having a portion exposed at a surface of the handle.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The folding knife of claim 1 , wherein the bias element includes a coiled spring.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The folding knife of claim 1 , wherein the blade-assisting mechanism includes at least one connector element operatively connecting the bias element and the blade.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The folding knife of claim 3 , wherein the at least one connector element includes a flexible cable.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The folding knife of claim 4 , wherein the at least one connector element includes a bracket connected to an end of the flexible cable.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The folding knife of claim 3 , wherein the at least one connector element includes a push rod.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The folding knife of claim 6 , wherein the at least one connector element includes a bracket connected to an end of the push rod.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The folding knife of claim 1 , wherein the adjustment element is manipulable from outside the handle.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The folding knife of claim 8 , wherein the adjustment element is pivotally mounted on the handle to pivot around a bias axis.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The folding knife of claim 9 , wherein the bias axis is parallel to a pivot axis of the blade.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The folding knife of claim 8 , wherein the bias element is a coiled spring including first and second ends, the first end is connected to the adjustment element, and the adjustment element is configured to pivot the first end around a bias axis.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The folding knife of claim 11 , wherein the blade pivots about a pivot axis, and the bias axis is parallel to the pivot axis.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The folding knife of claim 1 , further comprising a safety element movable relative to the handle between a safety position in which the safety element engages part of the blade-assisting mechanism in a manner preventing the blade-assisting mechanism from applying the force to the blade, and a release position in which the blade-assisting mechanism applies the force to the blade.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The folding knife of claim 1 , wherein the bias element is configured to apply the force to urge the blade towards at least one of the open position and the closed position.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The folding knife of claim 1 wherein the blade-assisting mechanism is configured to apply a force to urge the blade towards the open position over a portion of the blade travel, and also the closed position over a portion of the blade travel.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A folding knife, comprising:",
            "components": [
                {
                    "component": "a handle;",
                    "subcomponents": []
                },
                {
                    "component": "a blade pivotably connected to the handle in a manner allowing pivoting of the blade from a closed position in which the blade extends along the handle, to an open position in which the blade extends away from the handle;",
                    "subcomponents": []
                },
                {
                    "component": "a bias element configured to apply a biasing force between the handle and the blade to urge the blade towards the open position; and",
                    "subcomponents": []
                },
                {
                    "component": "user adjustable element operatively connected to the bias element and configured to be manipulable to allow a user to selectively vary the biasing force of the bias element.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The folding knife of claim 16 , wherein the bias element includes a coiled spring having an end and a flexible cable operatively connecting the blade to the end of the coiled spring.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The folding knife of claim 16 , wherein the bias element includes a coiled spring having first and second ends and a push rod operatively connecting the blade to the first end of the spring.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The folding knife of claim 18 , wherein the handle pivots about a pivot axis, and the second end of the spring is connected to the adjustable element and the adjustable element is pivotally mounted on the handle to pivot around a bias axis parallel to the pivot axis.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The folding knife of claim 16 , further comprising a safety element movable relative to the handle between a safety position in which the safety element engages part of the bias element in a manner preventing the bias element from applying the force to the blade, and a release position in which the bias element applies the force to the blade.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The folding knife of claim 16 , wherein the bias element is configured to apply the biasing force to urge the blade towards at least one of the open position and the closed position.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The folding knife of claim 21 , wherein the bias element is configured to apply the biasing force to urge the blade towards both the open position and the closed position.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The folding knife of claim 16 , wherein the adjustable element is configured to be manipulable from outside the handle to allow a user to selectively vary the biasing force of the bias element.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. A folding knife, comprising:",
            "components": [
                {
                    "component": "a handle;",
                    "subcomponents": []
                },
                {
                    "component": "a blade pivotably connected to the handle in a manner allowing pivoting of the blade around a pivot axis from a closed position in which the blade extends along the handle, to an open position in which the blade extends away from the handle; and",
                    "subcomponents": []
                },
                {
                    "component": "a blade-assisting mechanism including:",
                    "subcomponents": []
                },
                {
                    "component": "a bias element disposed within the handle and operatively connecting the handle to the blade, wherein the bias element is configured to apply a biasing force to urge the blade towards at least one of the open position and the closed position;",
                    "subcomponents": []
                },
                {
                    "component": "at least one connector element configured to operatively connect the bias element to the blade; and",
                    "subcomponents": []
                },
                {
                    "component": "an adjustment element operatively connected to the bias element, pivotally mounted on the handle to pivot around a bias axis parallel to the pivot axis, and configured to be manipulable outside the handle to allow a user to selectively adjust the biasing force.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The folding knife of claim 24 , further comprising a safety element movable relative to the handle between a safety position in which the safety element engages part of the blade-assisting mechanism in a manner preventing the blade-assisting mechanism from applying the force to the blade, and a release position in which the blade-assisting mechanism applies the force to the blade.",
            "components": []
        }
    ],
    "description": [
        "This application claims priority under 35 U.S.C. § 119(e) to U.S. Provisional Patent Application Ser. No. 60/510,639 entitled “Adjustable Opening and Closing Assisting Mechanism for a Folding Knife,” filed Oct. 10, 2003, the entire disclosure of which is herein incorporated by reference for all purposes.",
        "The present disclosure relates generally to a folding knife, and particularly to a folding knife with an adjustable blade-assisting mechanism that urges the blade towards the open position and/or closed position.",
        "Folding knives enjoy wide popularity, particularly among sportsmen, campers, hikers, and many others engaged in outdoor activities. Common elements to folding knives include a handle and a blade pivotally connected to an end of the handle so that the blade pivots with respect to the handle between an open position in which the blade is extended away from the handle and a closed position in which the blade is at least partially received within the handle. Many folding knives also include a blade-assisting mechanism that urges the blade towards the open position and/or closed position.",
        "Examples of folding knives, including folding knives with blade-assisting mechanisms, may be found in U.S. Pat. Nos. 551,052; 552,928; 557,760; 600,442; 1,315,503; 1,319,532; 1,412,373; 1,440,793; 1,603,914; 1,701,027; 1,743,022; 1,864,011; 2,736,959; 5,293,690; 5,815,927; 5,822,866; 5,802,722; 5,819,414; 6,145,202; 6,308,420; 6,338,431; 6,378,214; 6,397,477; 6,651,344; and 6,732,436; and U.S. patent application Nos. 2003/0070299; 2004/0020058; and 2004/0158991, the entire disclosures of which are herein incorporated by reference for all purposes.",
        "One embodiment provides a folding knife. The folding knife includes a handle; a blade connected to the handle in a manner allowing movement of the blade between a closed position in which the blade extends along the handle and an open position in which the blade extends away from the handle; and a blade-assisting mechanism configured to apply a manually adjustable force to urge the blade towards the open position over at least a portion of the blade travel between the closed position and the open position.",
        "FIG. 1 is a side view of a folding knife incorporating an example of an adjustable blade-assisting mechanism and an example of a safety assembly.",
        "FIG. 2 is a front plan view of the folding knife of FIG. 1.",
        "FIG. 3 is a side view of the folding knife of FIG. 1, shown without a handle side panel to illustrate the adjustable blade-assisting mechanism with the blade in the open position and the safety assembly is in the unlocked position.",
        "FIG. 4 is a side view of the folding knife of FIG. 1, shown without a handle side panel to illustrate the adjustable blade-assisting mechanism with the blade in the closed position and the safety assembly is in the locked position.",
        "FIG. 5 is a cross-sectional view of the adjustable blade-assisting mechanism taken along lines 5-5 shown in FIG. 3 illustrating a connection to the blade.",
        "FIG. 6 is an exploded view of the adjustable blade-assisting mechanism of the folding knife of FIG. 1.",
        "FIG. 7 is side view of a connector element that is part of the adjustable blade-assisting mechanism of the folding knife of FIG. 1.",
        "FIG. 8 is a side view of another example of a folding knife with an adjustable blade-assisting mechanism, the knife shown without a handle side panel and with the blade in the open position.",
        "FIG. 9 is a side view of the folding knife of FIG. 8, shown without a handle side panel to illustrate the adjustable blade-assisting mechanism with the blade in the closed position.",
        "FIG. 10 is side view of a connector element that is part of the adjustable blade-assisting mechanism of the folding knife of FIG. 8.",
        "FIG. 11 is a side view of another example of a folding knife with an adjustable blade-assisting mechanism, shown without a handle side panel with the blade in the open position.",
        "FIG. 12 is a side view of the folding knife of FIG. 11, shown without a handle side panel to illustrate the adjustable blade-assisting mechanism with the blade in the closed position.",
        "FIG. 13 is a side view of a connector element that is part of the adjustable blade-assisting mechanism of the folding knife of FIG. 11.",
        "FIGS. 1-2 depict an embodiment of a folding knife 20 having a blade 22, a handle 24 defining a blade-receiving channel 26, and a blade-assisting mechanism 28. Blade 22 includes a tang 22a pivotally connected to an end 24a of handle 24. The blade pivots with respect to the handle about a pivot axis P between an open position O and a closed position C. In the open position, the blade extends away from the handle, where it is deployed and ready for use. From the open position, the blade may be folded towards the handle, pivoting about pivot axis P, into the closed position, in which the blade may be at least partially received for storage within blade-receiving channel 26. In the closed position, blade 22 extends along handle 24.",
        "Handle 24 may include a pivot-end portion 24a, an opposing-end portion 24b, and first and second handle sides 24c and 24d. Tang 22a of blade 22 may be pivotally connected to handle 24 at pivot-end portion 24a. Handle sides 24c and 24d also may include respective handle side panels, such as opposite handle side panels 30 and 32. Handle side panels 30 and 32 may be any suitable shape or structure configured to facilitate gripping or handling of knife 20, including use of blade-assisting mechanism 28.",
        "Additionally, handle 24 may include one or more handle liners, such as liners 34 and 36, which may be located between blade 22 and one or more of handle side panels 30 and 32. Handle side panels 30 and 32 may be any suitable shape or structure and may be configured to provide access to various components internal to handle 24. For example, one of handle side panels 30 and 32 may include slots 31 and 33 to provide access to an adjustment knob of a blade assisting mechanism and to a gripping portion of a safety assembly, as further discussed below.",
        "Liners 34 and 36 may be any suitable shape or structure and may or may not conform to the shape of handle side panels 30 and 32. The liners also may be configured to accommodate and/or support various components internal to handle 24. For example, one of liners 34 and 36 may include arcuate groove 37 to allow blade-assisting mechanism to operatively connect with blade 22, as further discussed below. Although the knife discussed and shown in FIGS. 1-2 includes two handle side panels and two liners, any combination of handle side panels and liners may be used.",
        "Blade-assisting mechanism 28 may include any structure configured to apply a biasing force F to urge blade 22 towards the open position and/or closed position and to allow a user to adjust the biasing force. For example, as shown in FIGS. 3-6, blade-assisting mechanism 28 may include a bias element 38, a connector element 40, and an adjustment element 42.",
        "Bias element 38 may include any structure configured to apply biasing force F to urge blade 22 towards the open position and/or closed position. For example, bias element 38 may be in the form of a coiled spring 39, as shown in FIG. 6. The bias element may include a first end 38a and a second end 38b. Additionally, bias element 38 may be configured to provide biasing force F in any suitable direction. For example, bias element 38 in FIGS. 3-4 provides a biasing force F1 in a “pulling direction” from pivot end 24a of handle 24 toward the opposing end 24b. Alternatively, bias element 38 may be configured to provide a biasing force F2 in a “pushing direction” from opposing end 24b toward pivot end 24a, as further discussed below and in FIGS. 8-10. Moreover, other suitable directions may be used for biasing force F.",
        "Although bias element 38 is depicted as a coiled spring, it may be of any other suitable type of bias element configured to apply biasing force F to urge blade 22 towards the open position and/or closed position, such as wire springs, leaf springs, piano wires, or other resilient material or structure.",
        "Connector element 40 may include any structure operatively connecting bias element 38 and blade 22. For example and particularly when bias element 38 provides biasing force F1, the connector element may include a laterally flexible cable or cord 44, as shown in FIG. 7. The flexible cable may be made of any suitable resilient material. Optionally and particularly when bias element 38 provides biasing force F2, connector element 40 may include a push rod made of any suitable rigid material, as further discussed below. Optionally, biasing force F may be provided only by a resilient cable or other structure, without the use of separate bias element 38.",
        "Flexible cable 44 may include a first end portion 44a and a second end portion 44b. First end portion 44a may have any suitable shape or structure configured to operatively connect that portion to second end 38b of bias element 38, such as eyelet 46. Second end portion 44b may have any suitable shape or structure configured to operatively connect that portion to blade 22, such as hook 48. Hook 48 may engage a hole 22b in tang 22a of blade 22 via arcuate groove 37, as shown in FIG. 5.",
        "Although the first and second end portions of flexible cable 44 are shown to include eyelet 46 and hook 48, respectively, any suitable shape or structure may be used, such as latches or posts, or mechanical, magnetic, or electronic devices, configured to operatively connect flexible cable 44 to bias element 38 and/or blade 22. Moreover, although the first and second end portions of flexible cable 44 include different shapes or structures, the same shape or structure may be used for both end portions.",
        "“Operatively connecting,” “operatively connect,” “operatively connected,” or “operative connection,” as used herein, refers to a connector element being directly and/or indirectly connected to a bias element and/or to a blade in a manner that allows that bias element to apply biasing force F to urge the blade towards the open position and/or closed position. For example, connector element 40 may be directly connected to bias element 38 but indirectly connected to blade 22, such as by contacting a post or any other structure on the blade. Additionally, the operative connection made by the connector element may be throughout the pivoting of the blade or may be during only part of the pivoting of that blade. For example, the connector element may contact the blade or a post on the blade only between the blade's closed position and an intermediate blade position.",
        "Blade-assisting mechanism 28 also may include adjustment element 42, which may include any structure configured to allow a user to adjust the biasing force from bias element 38 from outside handle 24. For example, as shown in FIG. 6, adjustment element 42 may include an adjustment knob 50, a platform 52, and a retainer 54.",
        "Adjustment knob 50 may be pivotally mounted to pivot around a bias axis B. The bias axis may or may not be parallel to pivot axis P. The adjustment knob also may include a support 56, mating ridges 58, spacers 60, and holder 62. Support 56 may be any suitable shape or structure configured to support bias element 38. For example, support 56 may be a hollow cylindrical portion 64 configured to support coiled spring 39 and to receive retainer 54. Mating ridges 58 may be any suitable shape or structure configured to engage the mating ridges of platform 52, as further discussed below, and prevent the user from rotating adjustment knob 50. Spacers 60 may be any suitable shape or structure configured to house bias element 38. Holder 62 may be any suitable shape or structure configured to engage first end 38a of bias element 38 and allow adjustment knob 50 to adjust biasing force F from the bias element.",
        "Platform 52 may be any suitable shape or structure configured to be mounted on one of liners 34 and 36. For example, platform 52 may be in the shape of a disk. The platform may include a receptacle 68, mating sockets 70, and stabilizers 72. Receptacle 68 may be any suitable shape or structure configured to receive retainer 54, as further discussed below. For example, receptacle 68 may be a threaded hole 74. Mating sockets 70 may be any suitable shape or structure configured to engage mating ridges 58 of adjustment knob 50 and prevent the user from rotating that adjustment knob. Stabilizers 72 may be any suitable shape or structure configured to stabilize platform 52 and prevent that platform from pivoting with adjustment knob 50. For example, as shown in FIG. 6, stabilizers 72 may be in the form of anti-spin pegs 76.",
        "Although platform 52 is shown to be separate from liners 34 and 36 and handle side panels 30 and 32, the platform or at least some of its components may be made integral to the liner and/or handle side panel. For example, liner 34 may be configured to include receptacle 68 and mating sockets 70.",
        "Adjustment element 42 also may include retainer 54, which may be any suitable shape or structure configured to secure adjustment knob 50 to one of liners 34 and 36. For example, retainer 54 may be in the form of a screw or bolt 78, as shown in FIG. 6. Retainer 54 also may selectively prevent pivoting of adjustment knob 50. For example, a user may tighten retainer 54 to mesh mating ridges 58 and mating sockets 70 thereby preventing pivoting of adjustment knob 50. The user can then loosen retainer 54 to pivot the adjustment knob. Although retainer 54 is shown to be in the form of a bolt, any suitable retainer may be used configured to secure adjustment knob 50 to one of liners 34 and 36, such as latching elements, pins, or posts, or mechanical, magnetic, or electronic devices, or the like.",
        "Although blade-assisting mechanism 28 is shown to include the elements in FIG. 6, any suitable structure may be used and configured to apply biasing force F to blade 22 to urge that blade towards the open position and/or closed position. Additionally, although blade-assisting mechanism 28 is shown to be mostly located and/or mounted on liner 34 between handle side panel 30 and blade 22, the blade-assisting mechanism may be located on either of the handle side panels and/or either of the liners.",
        "Folding knife 20 also may include a safety assembly 80, which may include any suitable structure configured to prevent blade-assisting mechanism 28 from applying biasing force F to blade 22. For example, as shown in FIGS. 1-4, safety assembly 80 may include a safety element 82 slidably mounted between handle side panel 30 and liner 34. The safety assembly may slide between a safety position in which the safety element engages part of blade-assisting mechanism 28 in a manner preventing that mechanism from applying the biasing force to blade 22, and a release position in which blade-assisting mechanism 28 is free to apply the biasing force to blade 22.",
        "Safety element 82 may include a gripping portion 82a and a capturing portion 82b. Gripping portion 82a may be any suitable shape or structure configured to allow safety element 82 to be manipulated from outside of handle 24. For example, gripping portion 82a may include gripping ridges 84 or other suitable surface texture or structure. Capturing portion 82b may be any suitable shape or structure configured to engage part of blade-assisting mechanism 28 and prevent that mechanism from applying the biasing force to blade 22. For example, capturing portion 82b may be shaped to as a notch 86 sized to receive second end 38b of bias element 38, thereby preventing adjustment knob 50 from pivoting and blade-assisting mechanism 28 from applying biasing force F to blade 22. In some embodiments, the safety assembly also may prevent pivoting of blade 22.",
        "Although safety element 82 is shown to engage second end 38b of bias element 38, any suitable part of blade-assisting mechanism 28 may be engaged by capturing portion 82b of the safety element to prevent that mechanism from applying biasing force F to the blade.",
        "An alternative embodiment of folding knife 20 is shown in FIGS. 8-10 and generally indicated at 120. Unless otherwise specified, folding knife 120 may selectively include any of the elements, subelements, and variations as the other folding knives illustrated, described, or incorporated herein. Similar to the previously discussed embodiment, folding knife 120 includes a blade 122, a handle 124 including a blade-receiving channel 126, and a blade-assisting mechanism 128. Handle 124 includes at least one liner 134 on which blade-assisting mechanism 128 may be mounted, and at least one handle side panel (not shown in FIGS. 8-10) that may cover most of blade-assisting mechanism 128.",
        "Blade-assisting mechanism 128 may include a bias element 138, a connector element 140, and an adjustment element 142. Bias element 138 may include any suitable structure configured to provide biasing force F2 in a “pushing direction.” For example, bias element 138 may be in the form of a coiled spring or other resilient structures or material described above configured to provide biasing force F2.",
        "Connector element 140 may include any suitable structure configured to operatively connect bias element 138 and blade 122. For example, connector element 140 may be in the form of a push rod 145. The push rod may be made of any suitable rigid material. Push rod 145 may include a first end portion 145a and a second end portion 145b, as shown in FIG. 10. First end portion 145a may have any suitable shape or structure configured to operatively connect to bias element 138, such as hook 146. Second end portion 145b may have any suitable shape or structure configured to operatively connect blade 122, such as hook 148 that engages a hole in (not shown) blade 122.",
        "Although the first and second end portions of push rod 145 are shown to include hooks 146 and 148, any suitable shape or structure may be used, such as latches or posts, or mechanical, magnetic, or electronic devices, configured to operatively connect push rod 145 to bias element 138 and/or blade 122. Moreover, although the first and second end portions of push rod 145 include similar shapes or structures, different shapes or structures may be used for the end portions. Furthermore, although blade-assisting mechanism 128 is configured to apply biasing force F2 in the pushing direction, the blade-assisting mechanism may be configured to apply biasing force F1 in the pulling direction, or any other biasing forces in any suitable directions.",
        "Another alternative embodiment of folding knife 20 is shown in FIGS. 11-13 and generally indicated at 220. Unless otherwise specified, folding knife 220 may selectively include any of the elements, subelements, and variations as the other folding knives illustrated, described, or incorporated herein. Similar to the previously discussed embodiments, folding knife 220 includes a blade 222, a handle 224 including a blade-receiving channel 226, and a blade-assisting mechanism 228. Handle 224 includes at least one liner 234 on which blade-assisting mechanism 228 may be mounted, and at least one handle side panel (not shown in FIGS. 11-13) that may cover most of blade-assisting mechanism 228.",
        "Blade-assisting mechanism 228 may include a bias element 238, a connector element 240, and an adjustment element 242. Bias element 238 may include any suitable structure configured to provide biasing force F1 in a “pulling direction.”For example, bias element 238 may be in the form of a coiled spring or other resilient structure or material, such as the structures described above that are configured to provide biasing force F1.",
        "Blade-assisting mechanism 228 may include a bias element 238, a connector element 240, and an adjustment element 242. Bias element 238 may include any suitable structure configured to provide biasing force F1 in a “pulling direction.” For example, bias element 238 may be in the form of a coiled spring or other resilient structure or material, such as the structures described above that are configured to provide biasing force F2.",
        "Connector element 240 may include any suitable structure configured to operatively connect bias element 238 and blade 222. For example, connector element 240 may be in the form of a flexible cord 244. The flexible cord may be made of any suitable resilient material. Flexible cord 244 may include a first end portion 244a and a second end portion 244b, as shown in FIG. 13. First end portion 244a may have any suitable shape or structure configured to operatively connect to bias element 238, such as hook 246. Second end portion 244b may have any suitable shape or structure configured to connect to a bracket 248. Bracket 248 includes any structure configured to operatively connect second end portion 244b to blade 222. Although bracket 248 is shown in FIGS. 11-13 to be C-shaped, it may S-shaped, horseshoe-shaped, or any suitable shaped configured to operatively connect second end portion 244b to blade 222.",
        "Although the first and second end portions of flexible cord 244 are shown to include hook 246 and bracket 248, any suitable shape or structure may be used, such as latches or posts, or mechanical, magnetic, or electronic devices, configured to operatively connect flexible cord 244 to bias element 238 and/or blade 222. Moreover, although the first and second end portions of flexible cable 244 include different shapes or structures, similar shapes or structures may be used for the end portions. Furthermore, although blade-assisting mechanism 228 is configured to apply biasing force F1 in the pulling direction, the blade-assisting mechanism may be configured to apply biasing force F2 in the pushing direction, or any other biasing forces in any suitable directions.",
        "Although the adjustable blade-assisting mechanisms are shown to be used in folding knives with pivoting blades, the adjustable blade-assisting mechanisms disclosed may be used for folding knives with other types of moving blades that are configured to move between the open position and the closed position.",
        "Although particular examples of blade-assisting mechanisms have been disclosed, any suitable structure may be used configured to apply a biasing force F to a blade and urge the blade towards an open position and/or closed position. For example, blade-assisting mechanism may include a bias element and an adjustment element. In that mechanism, the bias element may be positioned around a pivot pin of a blade and operatively connected to the blade and to the adjustment element. The adjustment element may be located adjacent the pivot pin of the blade and allows adjustment of the biasing force applied by the bias element.",
        "Another example of a blade-assisting mechanism may include a bias element, at least one connector element, and an adjustment element. In that mechanism, bias element may provide a biasing force perpendicular to a pivot axis of a blade. The at least one connector element may include a lever with first and second ends that pivot around an axis parallel to the pivot axis. The first end of the lever may be operatively connected to the bias element and the second end of the lever may be operatively connected to the blade, such as the second end acting on a pin or other structure on the blade during at least a part of the blade movement between the open position and the closed position. The bias element may then apply a biasing force in a first direction to the first end of the lever, which translates to a biasing force in a second direction to the second end of the lever and to the blade. The adjustment element allows adjustment of the biasing force applied by the bias element.",
        "Although the folding knives and features of folding knives has been shown and described with reference to the foregoing operational principles and preferred embodiments, those skilled in the art will find apparent that various changes in form and detail may be made without departing from the spirit and scope of the claims. The present disclosure is intended to embrace all such alternatives, modifications, and variances that fall within the scope of the appended claims."
    ],
    "citations": [
        "23975",
        "57902",
        "226910",
        "338251",
        "382967",
        "530792",
        "551052",
        "552928",
        "557760",
        "577593",
        "600442",
        "616689",
        "749230",
        "777358",
        "825976",
        "845792",
        "969909",
        "1057525",
        "1189005",
        "1315503",
        "1319532",
        "1357398",
        "1412373",
        "1417872",
        "1440793",
        "1454665",
        "1496188",
        "1515688",
        "1584165",
        "1603914",
        "1614949",
        "1701027",
        "1738496",
        "1743022",
        "1810031",
        "1864011",
        "2284168",
        "2286524",
        "D137408",
        "2407897",
        "2455765",
        "2736959",
        "3079784",
        "3404456",
        "3868774",
        "4040181",
        "4133106",
        "4148140",
        "4173068",
        "4211003",
        "4218819",
        "4240201",
        "4268960",
        "4274200",
        "4322885",
        "4347665",
        "4356631",
        "4389775",
        "4404748",
        "4426779",
        "4439922",
        "4442600",
        "4451982",
        "4466561",
        "4481712",
        "4494309",
        "4494310",
        "4502221",
        "4525928",
        "4529111",
        "4541175",
        "4541556",
        "4561577",
        "4570341",
        "4600133",
        "4604803",
        "4612706",
        "4670984",
        "4719700",
        "4741106",
        "4776094",
        "4802279",
        "4805303",
        "4805819",
        "4811486",
        "4837932",
        "4848000",
        "4893409",
        "4896424",
        "4909424",
        "4947552",
        "4974323",
        "4979301",
        "5044079",
        "5060379",
        "5092045",
        "5095624",
        "5111581",
        "5123167",
        "5131149",
        "D333251",
        "D336602",
        "5217150",
        "5217151",
        "D345289",
        "5293690",
        "D348599",
        "5325588",
        "5331741",
        "5349753",
        "5361497",
        "5400509",
        "5425175",
        "5437101",
        "5450670",
        "5461786",
        "D366408",
        "5493781",
        "5502895",
        "5511310",
        "5511311",
        "5515610",
        "5537750",
        "5546662",
        "D373716",
        "5581895",
        "5596808",
        "5615484",
        "5647129",
        "D385173",
        "5685079",
        "5689885",
        "5692304",
        "5699615",
        "D392538",
        "D392539",
        "5737841",
        "5755035",
        "5781998",
        "5802722",
        "D399113",
        "5815927",
        "5819414",
        "5822866",
        "5822867",
        "5826340",
        "5839194",
        "5845404",
        "D407003",
        "5875552",
        "5878500",
        "5887347",
        "5964036",
        "5966816",
        "D422479",
        "6079106",
        "6122829",
        "6125543",
        "6145202",
        "D434631",
        "6154965",
        "6158127",
        "D438085",
        "6256888",
        "6276063",
        "6289592",
        "6308420",
        "6338431",
        "6378214",
        "6397476",
        "6397477",
        "6427334",
        "6427335",
        "6430816",
        "6434831",
        "6438848",
        "D462581",
        "D462582",
        "6442843",
        "6490797",
        "6523265",
        "6553671",
        "6574869",
        "6591504",
        "6651344",
        "6732436",
        "D498985",
        "2002/0000042",
        "2002/0157260",
        "2003/0070299",
        "2003/0089750",
        "2004/0020058",
        "29469",
        "1 104 386",
        "0 230 000",
        "493 741",
        "1 069 862",
        "1 171 740",
        "1 248 117",
        "2 705 606",
        "3-227601",
        "4-030979",
        "5-185381"
    ],
    "us_classification": "30159",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "26",
            "subclass": "B",
            "main_group": "1",
            "subgroup": "04"
        }
    ]
}