{
    "title": "Polymers for enhanced solubility of nanomaterials, compositions and methods therefor",
    "abstract": "Poly(aryleneethynylene) polymers, poly(ferrocenylaryleneethynylene) polymers and poly(ferrocenylethynylene) polymers having properties particularly useful for solubilizing nanomaterials and for effecting subsequent re-solubilization of a solid polymer-solubilized nanomaterial, and compositions and methods thereto are provided.",
    "inventors": [
        "Ait-Haddou",
        "Rutkofsky"
    ],
    "document_number": "07296576",
    "publication_date": "20071120",
    "assignees": [
        "Zyvex Performance Materials, LLC"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of making a rigid poly(aryleneethynylene) polymer, the polymer having at least one functional group for solubilizing nanomaterial, a length of about 25 nm to about 110 nm, and a polydispersity of less than about 2, the method comprising:",
            "components": [
                {
                    "component": "coupling a para-diethynyl-(R",
                    "subcomponents": [
                        "wherein each R of (R",
                        "wherein x of (R"
                    ]
                },
                {
                    "component": "wherein each R of (R",
                    "subcomponents": []
                },
                {
                    "component": "wherein x of (R",
                    "subcomponents": []
                },
                {
                    "component": "under conditions and for a period of time to produce fluorescence; and",
                    "subcomponents": []
                },
                {
                    "component": "terminating the coupling by addition of a second polymerization-terminating haloaryl agent, the second haloaryl agent having equal or greater activity for coupling as the (R",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 wherein the arylene of the para-diethynyl-(R",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A method of making a rigid poly(ferrocenylaryleneethynylene) polymer, the polymer having at least one functional group for solubilizing nanomaterial, a length of about 25 nm to about 110 nm, and a polydispersity of less than about 2, the method comprising:",
            "components": [
                {
                    "component": "coupling a 1,1′-diethynyl-(R",
                    "subcomponents": [
                        "wherein each R of (R",
                        "wherein z of (R"
                    ]
                },
                {
                    "component": "wherein each R of (R",
                    "subcomponents": []
                },
                {
                    "component": "wherein z of (R",
                    "subcomponents": []
                },
                {
                    "component": "under conditions for a period of time to produce fluorescence; and",
                    "subcomponents": []
                },
                {
                    "component": "terminating the coupling by addition of a second polymerization-terminating haloaryl agent, the second haloaryl agent having equal or greater activity for coupling as the (R",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A method of making a rigid poly(ferrocenylethynylene) polymer, the polymer having at least one functional group for solubilizing nanomaterial, a length of about 25 nm to about 110 nm, and a polydispersity of less than about 2, the method comprising:",
            "components": [
                {
                    "component": "coupling a 1,1′-diethynyl-(R",
                    "subcomponents": [
                        "wherein each R of (R",
                        "wherein corresponding R groups of the 1,1′-diethynyl-(R"
                    ]
                },
                {
                    "component": "wherein each R of (R",
                    "subcomponents": []
                },
                {
                    "component": "wherein corresponding R groups of the 1,1′-diethynyl-(R",
                    "subcomponents": []
                },
                {
                    "component": "under conditions for a period of time to produce fluorescence; and",
                    "subcomponents": []
                },
                {
                    "component": "terminating the coupling by addition of a second polymerization-terminating haloaryl agent, the second haloaryl agent having equal or greater activity for coupling as the (R",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 wherein the coupling is carried out at a first temperature for a period of time followed by a second temperature for a period of time, wherein the second temperature is greater than the first temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 5 wherein the first temperature is about room temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 6 wherein the coupling at about room temperature is for about 10 mm to 1 hour.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 5 wherein the second temperature is less than about 80° C.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 8 wherein the coupling at 80° C. is for about 24 hours.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 1 wherein the poly(aryleneethynylene) rigid polymer comprises a poly(phenyleneethynylene) polymer, the para-diethynyl-(R",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 1 wherein the first or second polymerization-terminating haloaryl agent comprises an iodoalkyloxybenzene or a bromoalkyloxybenzene, or a combination thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 1 wherein the iodoalkyloxybenzene comprises iodoanisole, iodoethoxybenzene, or iodopropoxybenzene, or a combination thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 1 wherein the bromoalkyloxybenzene comprises bromoanisole, bromoethoxybenzene, or bromopropoxybenzene, or a combination thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 1 wherein the polydispersity of the polymer is about 1.2 to about 1.8.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 1 wherein the polydispersity of the polymer is about 1.4 to about 1.6.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 1 wherein at least one R of (R",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 10 wherein x is 4, y is 4, one set of para R's of(R",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 10 wherein x is 4, y is 4, one set of para R's of(R",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 10 wherein x is 4, y is 4, one set of para R's of(R",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method of claim 10 wherein x is 4, y is 4, and each set of para R's of (R",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The method of claim 1 wherein the length of the polymer is about 25 nm to about 55 nm.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. A rigid poly(aryleneethynylene) polymer made by the method of claim 1 .",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. A rigid poly(ferrocenylaryleneethynylene) polymer made by the method of claim 3 .",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. A rigid poly(ferrocenylethynylene) polymer made by the method of claim 4 .",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. A rigid poly(phenyleneethynylene) polymer made by the method of claim 10 .",
            "components": []
        }
    ],
    "description": [
        "The present patent application relates generally to the technical field of solubilization of nanomaterials, compositions and methods therefor.",
        "Pristine nanotubes are generally insoluble in common solvents and polymers. Such nanotubes are also difficult to chemically functionalize without altering the desirable intrinsic properties of nanotubes. Single-walled nanotubes (SWNTs) have been solubilized in organic solvents and water by polymer wrapping (Dalton et al., (J. Phys. Chem. B (2000) 104, 10012); Star et al. (Angew. Chem., Int. Ed. (2001) 40, 1721), and O'Connell et al. (Chem. Phys. Lett. (2001) 342, 265)), and noncovalently functionalized by adhesion of small molecules for protein immobilization (Chen et al., (J. Am. Chem. Soc. 123:3838 (2001))). The polymer wrapping approach works poorly for dissolution of small diameter SWNTs possibly due to unfavorable polymer conformations.",
        "A process of noncovalent functionalization and solubilization of carbon nanotubes is described by Chen, J. et al. (J. Am. Chem. Soc., 124, 9034 (2002)) which process results in excellent nanotube dispersion using a nonwrapping approach. SWNTs were solubilized in chloroform with poly(phenyleneethynylene)s (PPE) along with vigorous shaking and/or short bath-sonication as described by Chen et al. (ibid) and in U.S. Patent Publication No. U.S. 2004/0034177 published Feb. 19, 2004, and U.S. patent application Ser. No. 10/318,730 filed Dec. 13, 2002; the contents of such patent applications are incorporated by reference herein in their entirety. The rigid backbone of a PPE cannot wrap around the SWNT in contrast to the polymer wrapping approach described above. The major interaction between the polymer backbone and the nanotube surface is described as parallel π-stacking. Thin film visible and near-infrared spectroscopy of PPE-solubilized nanomaterial demonstrated that the electronic structures are basically intact after solubilization. One such PPE-solubilized nanomaterial sample was obtained by filtration and redissolved in chloroform to a concentration of about 0.1 to 0.2 mg/mL (Chen et al. (ibid) and in U.S. Patent Publication No. U.S. 2004/0034177 published Feb. 19, 2004, and U.S. patent application Ser. No. 10/318,730 filed Dec. 13, 2002).",
        "Further rigid polymers for solubilizing nanomaterials, compositions, and methods therefore are described herein.",
        "The present embodiments provide rigid poly(aryleneethynylene) polymers, poly(ferrocenylaryleneethynylene) polymers, and poly(ferrocenylethynylene) polymers having properties particularly useful for solubilizing nanomaterials and for effecting subsequent resolubilization of a solid material obtained from the solubilized nanomaterial, compositions and methods related thereto. The polymer has at least one functional group for solubilizing nanomaterial, a length of about 25 nm to about 110 nm, and a polydispersity of less than about 2.",
        "Embodiments of the present invention provide a method of making rigid poly(aryleneethynylene) polymers, poly(ferrocenylaryleneethynylene) polymers and poly(ferrocenylethynylene) polymers as described above.",
        "In general, a method of making a rigid poly(aryleneethynylene) polymer of the present invention comprises coupling a para-diethynyl-(R1–Rx)arylene and an (R1–Ry)-para-dihaloarylene in the presence of a first polymerization-terminating haloaryl agent under conditions and for a period of time to produce fluorescence; and terminating the coupling by addition of a second polymerization-terminating haloaryl agent, the second haloaryl agent having equal or greater activity for coupling as compared to the (R1–Ry)-para-dihaloarylene.",
        "In general, a method of making a rigid poly(ferrocenylaryleneethynylene) polymer of the present invention comprises coupling a 1,1′-diethynyl-(R1–R8)ferrocene and an (R1–Rz)-para-dihaloarylene, or coupling a 1,1′-dihalo-(R1–R8)ferrocene and a para-diethynyl-(R1–Rz)arylene, in the presence of a first polymerization-terminating haloaryl agent under conditions for a period of time to produce fluorescence; and terminating the coupling by addition of a second polymerization-terminating haloaryl agent, the second haloaryl agent having equal or greater activity for coupling as compared to the (R1–Rz)-para-dihaloarylene or the 1,1′-dihalo-(R1–R8)ferrocene.",
        "In general, a method of making a rigid poly(ferrocenylethynylene) polymer of the present invention comprises coupling a 1,1′-diethynyl-(R1–R8)ferrocene and an (R1–R8)-1,1′-dihaloferrocene in the presence of a first polymerization-terminating haloaryl agent under conditions for a period of time to produce fluorescence; and terminating the coupling by addition of a second polymerization-terminating haloaryl agent, the second haloaryl agent having equal or greater activity for coupling as compared to the (R1–R8)-1,1′-dihaloferrocene.",
        "A further embodiment of the present invention comprises mixing nanomaterial, a rigid poly(aryleneethynylene) polymer, a poly(ferrocenylaryleneethynylene) polymer, a poly(ferrocenylethynylene) polymer, or a combination thereof, and a solubilization solvent to form a solution. Nanomaterial made soluble by a polymer of the present invention results in a noncovalent complex of nanomaterial and solubilizing polymer. Such a complex is termed herein “processed nanomaterial.” Processed nanomaterial may be made into a solution using a solubilization solvent (solution of processed nanomaterial), subsequently removed therefrom by removing solvent and made into a solid (solid processed nanomaterial), re-solubilized by mixing solid processed nanomaterial with a re-solubilization solvent (re-solubilized solution of processed nanomaterial) and made insoluble (insoluble processed nanomaterial). Re-solubilized processed nanomaterial is provided herein at concentrations not heretofore achieved. Such re-solubilized material may be dried and heated to produce insoluble material.",
        "A rigid poly(aryleneethynylene) polymer, poly(ferrocenylaryleneethynylene) polymer, poly(ferrocenylethynylene) polymer, a solution of processed nanomaterial, solid processed nanomaterial obtained from solution by removing solvent, re-solubilized solution of processed nanomaterial, or an insoluble processed nanomaterial made by a method described herein is an embodiment of the present invention.",
        "Compositions comprising a rigid poly(aryleneethynylene) polymer, a poly(ferrocenylaryleneethynylene) polymer, or a poly(ferrocenylethynylene) polymer where the polymer comprises at least one functional group for solubilizing nanomaterial, a length of about 25 nm to about 10 nm, and a polydispersity of less than about 2 are embodiments of the present invention. Further compositions of the present invention include a solution of processed nanomaterial, solid processed nanomaterial obtained from solution by removing solvent, re-solubilized solution of processed nanomaterial, or an insoluble processed nanomaterial. The solution comprises nanomaterial, a polymer as set forth above and a solubilization solvent.",
        "An article of manufacture comprising a polymer, a solid, a solution, or an insoluble solid as described herein are further embodiments of the present invention.",
        "Nanomaterials are solubilized by polymers of the present invention in organic or aqueous solvents, or a combination thereof, in particular in organic solvents to a concentration of about 10 mg/mL to 15 mg/mL. Solid material is obtained from such solutions and re-solubilized to concentrations not heretofore achieved, i.e., concentrations greater than 0.2 mg/mL, typically 1.5 mg/mL or 3.0 mg/mL, or greater.",
        "Polymers for Solubilizing Nanomaterial: Polymers for solubilizing nanomaterial are rigid rods having at least one functional group for solubilizing nanomaterial, a length of about 25 nm to about 110 nm, and a polydispersity of less than about 2. Such polymers are poly(aryleneethynylene) polymers, poly(ferrocenylaryleneethynylene) polymers poly(ferrocenylethynylene) polymer, for example, and are rigid, π-conjugated polymers, the backbone of which noncovalently binds to the nanomaterial in a non-wrapping fashion. By virtue of functional groups present on the backbone of the polymer, the polymers solubilize the nanomaterial.",
        "Polymer length ranges between a minimum length to effect solubilization which is about 25 nanometers and a maximum length that avoids hairpin formation which is about 110 nanometers. That is, an effective polymer has a length that is shorter than a length at which it folds back on itself. Polymers of the present embodiments have a length of between about and including any of 25 nm, 30 nm, 35 nm, 40 nm, 45 nm, 50 nm, 55 nm, 60 nm, 65 nm, 70 nm, 75 nm, 80 nm, 85 nm, 90 nm, 95 nm, 100 nm, 105 nm, and 110 nm. Polymers of the present embodiments having a length of about 25 nm to about 110 nm have a number of polymer repeating units depending upon the length of the monomer unit. The number of repeating units is between about 45 to 200 when the repeating unit contains one aryleneethynylene unit since one benzene ring together with one triple bond has a length of about 5.4 Å. Forty-five to 200 of such repeating units provides a polymer length of about 24.3 nm to about 108 nm. The number of repeating units of a polymer having monomers that contain two aryleneethynylene units is one-half that of a polymer having one aryleneethynylene, thereby maintaining the desired length of polymer backbone. The number of repeating units for a multiple ring poly(aryleneethynylene), a poly(ferrocenylaryleneethynylene) polymer or a poly(ferrocenylethynylene) polymer can be calculated based upon the length of the monomer. In certain embodiments, the number of repeating units is equal to or within a range of any of the following numbers of units: 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, and 200. The number of repeating units is determined by proton NMR, for example.",
        "Polymers of the present embodiments have a polydispersity of less than about 2. Polydispersity is the weight-average molecular weight of a polymer divided by the number average molecular weight of the polymer. If polymer chains have a uniform chain length, the polydispersity is 1. Typical values for polydispersity vary depending upon the mechanism of polymerization and are affected by reaction conditions, for example, for addition polymerization, polydispersity values may be between 10 and 20 whereas step polymerization may provide polydispersity values of about 2 to 3 and “living polymerization” may provide a polydispersity value of about 1.",
        "Polydispersity of less than about 2 for embodiments of the present invention is achieved by particular reaction conditions that use a polymerization-terminating haloaryl agent at the beginning of the polymerization reaction to favor polymerization from one end of a growing polymer chain rather than from both ends, and also to further add polymerization-terminating haloaryl agent to terminate the polymerization reaction, thereby providing greater uniformity in the length of polymers produced as discussed further below. The polydispersity of polymers of the present invention may be about 1.2 to about 1.8, about 1.3 to about 1.7, about 1.4 to about 1.6, or about 1.5. Polydispersity may be determined by gel permeation chromatography using polystyrene standards.",
        "Polymers of the present embodiments may be poly(aryleneethynylene) polymers having generic structure I.",
        "",
        "Ar1 and Ar2 of structure I. are independently phenyl, diphenyl, naphthyl, anthracenyl, phenanthrenyl, pyridinyl, bis-pyridinyl, phenanthrolyl, pyrimidinyl, bis-pyrimidinyl, pyrazinyl, bis-pyrazinyl, aza-anthracenyl, or isomers thereof. Ar1 and Ar2 may be identical or different. The designation “n” is the number of repeating units. The “x” of Rx is the maximum number of substituents on Ar1 and the “y” of Ry is the maximum number of substituents on Ar2. For example, where Ar1 is phenyl, the x is 4; and where Ar1 is pyridinyl, x is 3. The substituents on Ar1 and Ar2 are designated (R1–Rx) and (R1–Ry), respectively. The designation “R” refers to an R group of (R1–Rx) and (R1–Ry). For example, an R of (R1–Rx), where x is 4, may refer to R1, R2, R3, or R4. Each R is independently H or a functional group for solubilizing nanomaterial and at least one R of (R1–Rx) and (R1–Ry) is a functional group for solubilizing nanomaterial.",
        "An embodiment of the present invention is a polymer having structure I. where Ar1 and Ar2 are phenyl, x and y are 4, and corresponding R groups on Ar1 and Ar2 are identical, resulting in a poly(phenyleneethynylene) polymer provided as structure II.",
        "R1, R2, R3, and R4 of structure II. are independently H or a functional group for solubilizing nanomaterial, and at least one of R1, R2, R3, and R4 is a functional group for solubilizing nanomaterial.",
        "Further polymers of the present embodiments may be poly(ferrocenylaryleneethynylene) polymers having generic structure III.",
        "Ar of structure III. is phenyl, diphenyl, naphthyl, anthracenyl, phenanthrenyl, pyridinyl, bis-pyridinyl, phenanthrolyl, pyrimidinyl, bis-pyrimidinyl, pyrazinyl, bis-pyrazinyl, aza-anthracenyl, or isomers thereof. The designation “n” is the number of repeating units. The “z” of Rz is the maximum number of substituents on Ar. For example, where Ar is phenyl, z is 4; and where Ar is pyridinyl, z is 3. The substituents on Ar are designated (R1–Rz). The designation “R” refers to an R group of (R1–Rz) or an R group of (R1–R8) of the ferrocenyl. Each R is independently H or a functional group for solubilizing nanomaterial and at least one R of (R1–Rz) and (R1–R8) is a functional group for solubilizing nanomaterial.",
        "A poly(ferrocenylethynylene) polymer having a structure 1) as shown below is an embodiment of the present invention. The designation “n” is the number of repeating units. Each R of (R1–R8) is independently H or a functional group for solubilizing nanomaterial and at least one R of (R1–R8) is a functional group for solubilizing nanomaterial.",
        "Exemplary monomer units for polymers of the present invention include monomer units such as monomer units a) to z) and aa) to pp) as follows:",
        "",
        "Polymer backbone monomers a)-k), s) to z), and aa) to pp) are examples of poly(aryleneethynylene) backbone monomers; monomers m)-r) are examples of poly(ferrocenylaryleneethynylene) backbone monomers; and monomer 1) is an example of a poly(ferrocenylethynylene) backbone polymer. The number of repeating units “n” is such that the length of the polymer is equal to or between about 25 nm and 110 nm.",
        "“Having at least one functional group for solubilizing nanomaterial,” as used herein, means that at least one R of the repeat unit of the polymer is a substituent capable of interacting with another chemical group to form a covalent or noncovalent bond. The substituent may be a functional organic group or an inorganic group.",
        "In certain embodiments, the at least one functional group for solubilizing nanomaterial comprises, for example, acetal, acid halide, acyl azide, aldehyde, alkane, alkyl, anhydride, cyclic alkane, arene, alkene, alkyne, alkyl halide, aryl, aryl halide, amine, amide, amino acid, alcohol, alkoxy, azide, aziridine, azo compounds, calixarene, carbohydrate, carbonate, carboxylic acid, carboxylate, carbodiimide, cyclodextrin, crown ether, cryptand, diaminopyridine, diazonium compounds, ester, ether, epoxide, fullerene, glyoxal, halide, imide, imine, imidoester, ketone, nitrile, isothiocyanate, isocyanate, isonitrile, lactone, maleimide, metallocene, NHS ester, nitroalkane, nitro compounds, nucleotide, oligosaccharide, oxirane, peptide, phenol, phthalocyanine, porphyrin, phosphine, phosphonate, polyimine (2,2′-bipyridine, 1,10-phenanthroline, terpyridine, pyridazine, pyrimidine, purine, pyrazine, 1,8-naphthyridine, polyhedral oligomeric silsequioxane (POSS), pyrazolate, imidazolate, torand, hexapyridine, 4,4′-bipyrimidine, for example), pyridine, quaternary ammonium salt, quaternary phosphonium salt, quinone, Schiff base, selenide, sepulchrate, silane, sulfide, sulfone, sulfonyl chloride, sulfonic acid, sulfonic acid ester, sulfonium salt, sulfoxide, sulfur and selenium compounds, thiol, thioether, thiol acid, thio ester, thymine, or a combination thereof.",
        "For example, a poly(aryleneethynylene) of structure I., where Ar1 and Ar2 are phenyl, and x and y are 4, may have substituent groups as follows:",
        "i) R1=R4=H and R2=R3=OC10H21,",
        "ii) R1=R2=R3=R4=F,",
        "iii) R1=R4=H and R2=R3=",
        "",
        "iiii) R1=R4=H and R2=R3=",
        "or any combination thereof.",
        "Further, a substituent group R1, R2, R3, and R4 may be H, OC10H21, F,",
        "CH2—O—C10H21, CH2—NH(C10H21), CH2—N(C10H21)2, or OCH2COX (where X is a secondary amine, primary amine, alkoxy group, amide group, or an acid group, for example). In general, an H substituent is not considered a functional group for solubilizing nanomaterial.",
        "In certain embodiments, the at least one functional R group is independently alkoxy, alkyl, aryl, halo, or a combination thereof, thereby providing a functional group for solubilizing nanomaterial.",
        "A synthesis procedure for making polymers having such functional substituents would vary from the procedure provided below in that the starting materials would contain the appropriate substituent groups. One of ordinary skill in the art in light of the present disclosure is able to determine starting materials for polymers of the present invention.",
        "Substituents on the polymer backbone may increase the stability of the polymer to temperatures such as up to 150° C. to 350° C., for example. In general, aliphatic side chains tend to provide the polymer with greater temperature stability.",
        "In further embodiments, the at least one functional group is present at the periphery of a substituent group. The term “periphery,” as used herein, means at the outer end of a substituent side chain, away or distal from the polymer backbone. In certain embodiments, the functional group is alkoxy or alkyl, bound directly to the backbone portion of the polymer or bound at the periphery of a substituent group. In further embodiments, the functional group is CH2—O—C10H21, CH2—NH(C10H21), CH2—N(C10H21)2, or OCH2COX (where X is a secondary amine, primary amine, alkoxy group, amide group, or an acid group, for example).",
        "Polymers of the present embodiments have end terminal groups (as distinguished from side chain terminal groups) provided by a polymerization-terminating haloaryl agent as described below. In certain embodiments, the terminal groups are alkoxyaryl groups such as methoxyaryl, ethoxyaryl, or propoxyaryl, for example. In further embodiments, the terminal groups are haloalkoxyaryl when the polymerization-terminating haloaryl agent is a dihaloaryl agent.",
        "Methods of Making Polymers for Solubilizing Nanomaterial: A method of making a rigid poly(aryleneethynylene) polymer of the present invention comprises coupling a para-diethynyl-(R1–Rx)arylene and an (R1–Ry)-para-dihaloarylene in the presence of a first polymerization-terminating haloaryl agent under conditions and for a period of time to produce fluorescence; and terminating the coupling by addition of a second polymerization-terminating haloaryl agent, the second haloaryl agent having equal to or greater activity for coupling as compared to the (R1–Ry)-para-dihaloarylene. For this method of making a rigid poly(aryleneethynylene) polymer, each R of (R1–Rx) and (R1–Ry) is independently H, or a functional group for solubilizing nanomaterial, and at least one R of (R1–Rx) and (R1–Ry) is a functional group for solubilizing nanomaterial, wherein x of (R1–Rx) is the maximum number of substituents on the para-diethynyl-(R1–Rx)arylene, and y of (R1–Ry) is the maximum number of substituents on the (R1–Ry)-para-dihaloarylene. In one embodiment of the present method, the arylene of the para-diethynyl-(R1–Rx)arylene and the arylene of the (R1–Ry)-para-dihaloarylene are the same arylene structure.",
        "A method of making a rigid poly(ferrocenylaryleneethynylene) polymer of the present invention comprises coupling a 1,1′-diethynyl-(R1–R8)ferrocene and an (R1–Rz)-para-dihaloarylene, or coupling a 1,1′-dihalo-(R1–R8)ferrocene and a para-diethynyl-(R1–Rz)arylene, in the presence of a first polymerization-terminating haloaryl agent under conditions for a period of time to produce fluorescence; and terminating the coupling by addition of a second polymerization-terminating haloaryl agent, the second haloaryl agent having equal or greater activity for coupling as compared to the (R1–Rz)-para-dihaloarylene or the 1,1′-dihalo-(R1–R8)ferrocene. For this method of making a rigid poly(ferrocenylaryleneethynylene) polymer, each R of (R1–R8) and (R1–Rz) is independently H, or a functional group for solubilizing nanomaterial, and at least one R of (R1–R8) and (R1–Rz) is a functional group for solubilizing nanomaterial, and z of (R1–Rz) is the maximum number of substituents on the (R1–Rz)-para-dihaloarylene.",
        "A method of making a rigid poly(ferrocenylethynylene) polymer of the present invention comprises coupling a 1,1′-diethynyl-(R1–R8)ferrocene and an (R1–R8)-1,1′-dihaloferrocene in the presence of a first polymerization-terminating haloaryl agent under conditions for a period of time to produce fluorescence; and terminating the coupling by addition of a second polymerization-terminating haloaryl agent, the second haloaryl agent having equal or greater activity for coupling as compared to the (R1–R8)-1,1′-dihaloferrocene. For this method of making a rigid poly(ferrocenylethynylene) polymer, each R of (R1–R8) is independently H, or a functional group for solubilizing nanomaterial, and at least one R of (R1–R8) is a functional group for solubilizing nanomaterial. Corresponding R groups of the 1,1′-diethynyl-(R1–R8)ferrocene and the (R1–R8)-1,1′-dihaloferrocene are identical.",
        "In general, polymer synthesis is carried out using palladium-catalyzed coupling procedures of Bunz, U. H. F. (Chem. Rev. 2000, 100, 1605), McQuade et al., (J. Am. Chem. Soc. 2000:122, 12389), or Erdogan, et al., (Macromolecules 2002:35, 7863) with modifications as described herein. In order to achieve length and polydispersity of polymer embodiments of the present invention, the coupling is carried out at least for a period of time to produce fluorescence due to production of salts of the reaction.",
        "Coupling is generally carried out at a temperature of about room temperature to about 80° C. Side reactions occur at the higher temperatures of that range and the coupling is slow at the lower temperatures of that range. Coupling temperatures are also dependent upon particular reactants, for example, the coupling of an iodo-derivatized reactant takes place at a lower temperature than the coupling of a bromo-derivatized reactant. In certain embodiments, coupling is conducted at a lower temperature for a period of time, followed by a period of time at a higher temperature. A lower temperature is, for example, about room temperature. A higher temperature is, for example, about 70° C. Coupling may be carried out at a temperature between nd including any of room temperature, 30° C., 35° C., 40° C., 45° C., 50° C., 55° C., 60° C., 65° C., 70° C., 75° C., and 80° C. In further embodiments coupling is carried out at room temperature for a period of time and then at a temperature between about 50° C. and about 80° C., about 60° C. and about 75° C., or about 70° C. for a period of time.",
        "The length of time of the coupling reaction is a few minutes to up to a week. In certain embodiments, the coupling is at room temperature for a period of time of a few minutes to a few hours, for example, a period of time between and including any of 5 min., 10 min., 20 min., 30 min., 40 min., 50 min., 1 hr., 1.5 hr., 2 hr., or 3 hr., then coupling is continued at a temperature of less than about 80° C. for about 6 h to 48 h. In certain embodiments, the second temperature is between about 50° C. and about 80° C., about 60° C. and about 75° C., or about 70° C. for a period of time of about 12 hr. to about 36 hr., about 18 hr. to about 24 hr., or about 24 hr.",
        "Coupling is carried out in the presence of a first polymerization-terminating haloaryl agent. Such an agent encourages polymerization from one end instead of both ends of the polymer and contributes to uniformity of polymer product size. Coupling is terminated by incubation with a second polymerization-terminating haloaryl agent. The second polymerization-terminating haloaryl agent may be the same agent as the first polymerization-termination haloaryl agent. The second polymerization-terminating haloaryl agent has equal or greater activity for coupling as compared to the (R1–Rz)-para-dihaloarylene or the 1,1′-dihalo-(R1–R8)ferrocene of the coupling reaction. The first or second haloaryl agent may have more than one halo group.",
        "In certain embodiments of the present invention, the first or second polymerization-terminating haloaryl agent comprises an iodo- or bromo-derivatized alkoxyarylene, alkylarylene, or alkylaryloate. Exemplary iodoalkoxyarylene agents are iodoanisole, iodoethoxybenzene, or iodopropoxybenzene, where the alkoxy has one to ten carbons, or a combination thereof, for example. Exemplary iodoalkylarylene agents are 4-iodoalkylbenzene, or 2-iodoalkylbenzene where the alkyl has one to 10 carbons. Exemplary iodoalkylaryloate agents are 4-iodoalkylbenzoate, or 2-iodoalkylbenzoate where the alkyl group has from one to 10 carbons, for example. Exemplary bromoalkoxyarylene agents are bromoanisole, bromoethoxybenzene, or bromopropoxybenzene, where the alkoxy has one to ten carbons, or a combination thereof, for example. Exemplary bromoalkylarylene agents are 4-bromoalkylbenzene, or 2-bromoalkylbenzene where the alkyl group has from one to 10 carbons. Exemplary bromoalkylaryloate agents are 4-bromoalkylbenzoate, or 2-bromoalkylbenzoate where the alkyl group has from one to 10 carbons, for example.",
        "The polymerization-terminating haloaryl agent is added under conditions of time and temperature that provide for uniformity of polymer size as described herein, thereby accomplishing a polydispersity of less than about 2. Polydispersity of the resultant polymer is determined by gel permeation chromatography, for example. The number of repeating units of the polymer is determined by proton NMR.",
        "Nanomaterial: The term “nanomaterial,” as used herein, includes, but is not limited to, multi-wall carbon or boron nitride nanotubes, single-wall carbon or boron nitride nanotubes, carbon or boron nitride nanoparticles, carbon or boron nitride nanofibers, carbon or boron nitride nanoropes, carbon or boron nitride nanoribbons, carbon or boron nitride nanofibrils, carbon or boron nitride nanoneedles, carbon or boron nitride nanosheets, carbon or boron nitride nanorods, carbon or boron nitride nanohorns, carbon or boron nitride nanocones, carbon or boron nitride nanoscrolls, graphite nanoplatelets, graphite nanoparticles, nanodots, other fullerene materials, or a combination thereof. The term, “multi-wall,” is meant to include double-wall nanotubes (DWNTs) and few-wall nanotubes (FWNTs).",
        "SWNTs produced by high pressure carbon monoxide process (HiPco) were purchased from Carbon Nanotechnologies, Inc. (Houston, Tex.) as used herein in the present examples, however, nanomaterial made by the arc discharge, laser vaporization, or other methods known to one of skill in the art in light of the present disclosure may be used.",
        "Boron nitride nanotubes and methods for their manufacture are known to those of ordinary skill in the art. See e.g., Han et al. (Applied Physics Letters 73(21) pp. 3085–3087, 1998), Chen et al. (Materials Science Forum Vols. 312–314 (1999) pp. 173–178), the Journal of Metastable and Nanocrystalline Materials Vols. 2–6 (1999) pp. 173–178, and 1999 Trans Tech Publications, Switzerland.",
        "The term “nanotubes” is used broadly herein and, unless otherwise qualified, is intended to encompass any type of nanomaterial. Generally, a “nanotube” is a tubular, strand-like structure that has a circumference on the atomic scale. For example, the diameter of single walled nanotubes typically ranges from approximately 0.4 nanometers (nm) to approximately 100 nm, and most typically have diameters ranging from approximately 0.7 nm to approximately 5 nm.",
        "While the term “SWNTs,” as used herein, means single walled nanotubes, the term means that other nanomaterials as cited supra may be substituted unless otherwise stated herein.",
        "Solutions of Processed Nanomaterial: A method of solubilizing nanomaterials using a solubilizing polymer in accordance with certain embodiments of the present invention includes mixing nanomaterial; a poly(aryleneethynylene) polymer, a poly(ferrocenylaryleneethynylene) polymer, a poly(ferrocenylethynylene) polymer, or a combination thereof as set forth herein; and a solubilization solvent to form a solution. The term “mixing,” as used herein, means that the nanomaterial and the solubilizing polymer are brought into contact with each other in the presence of the solvent. “Mixing” may include simply vigorous shaking, or may include sonication for a period of time of about 10 min. to about 3 hr. A further optional step of solubilizing nanomaterials using a solubilizing polymer of the present invention may include a pre-sonication of nanomaterial in the solvent for about 30 min. to about 3 hr., for example.",
        "A solubilization solvent may be organic or aqueous such as, for example, CHCl3, chlorobenzene, water, acetic acid, acetone, acetonitrile, aniline, benzene, benzonitrile, benzyl alcohol, bromobenzene, bromoform, 1-butanol, 2-butanol, carbon disulfide, carbon tetrachloride, chlorobenzene, chloroform, cyclohexane, cyclohexanol, decalin, dibromethane, diethylene glycol, diethylene glycol ethers, diethyl ether, diglyme, dimethoxymethane, N,N-dimethylformamide, ethanol, ethylamine, ethylbenzene, ethylene glycol ethers, ethylene glycol, ethylene oxide, formaldehyde, formic acid, glycerol, heptane, hexane, iodobenzene, mesitylene, methanol, methoxybenzene, methylamine, methylene bromide, methylene chloride, methylpyridine, morpholine, naphthalene, nitrobenzene, nitromethane, octane, pentane, pentyl alcohol, phenol, 1-propanol, 2-propanol, pyridine, pyrrole, pyrrolidine, quinoline, 1,1,2,2-tetrachloroethane, tetrachloroethylene, tetrahydrofuran, tetrahydropyran, tetralin, tetramethylethylenediamine, thiophene, toluene, 1,2,4-trichlorobenzene, 1,1,1-trichloroethane, 1,1,2-trichloroethane, trichloroethylene, triethylamine, triethylene glycol dimethyl ether, 1,3,5-trimethylbenzene, m-xylene, o-xylene, p-xylene, 1,2-dichlorobenzene, 1,3-dichlorobenzene, 1,4-dichlorobenzene, 1,2-dichloroethane, N-methyl-2-pyrrolidone, methyl ethyl ketone, dioxane, or dimethyl sulfoxide. In certain embodiments of the present invention, the solubilization solvent is a halogenated organic solvent and, in further embodiments, the solubilization solvent is chlorobenzene.",
        "A solution of processed nanomaterial comprising nanomaterial as described herein, a solubilizing polymer as described herein and a solubilization solvent as described herein is an embodiment of the present invention.",
        "The interaction between polymer and nanomaterial in polymer-solubilized nanomaterial is noncovalent bonding instead of covalent bonding. Therefore, the underlying electronic structure of the nanomaterial and its key attributes are not affected.",
        "The processed nanomaterial may comprise an amount of solubilizing polymer by weight ratio of greater than zero and less than 1.0; an amount equal to or within a range of any of the following weight ratios: 0.05, 0.10, 0.15, 0.20, 0.25, 0.30, 0.33, 0.35, 0.40, 0.45, 0.50, 0.60, 0.70, 0.80, and 0.90; an amount by weight ratio equal to or greater than 0.15 and less than or equal to 0.40; an amount by weight ratio equal to or greater than 0.20 and less than or equal to 0.35, or an amount by weight ratio of about 0.33.",
        "Processed nanomaterials dissolved in solvent do not settle out even over a period of weeks. While the nanomaterials can be filtered out on filter paper, this separation is more a function of their large size, not their solubility. A sufficiently fine filter can separate most solvated molecules. The terms “solubilization” and “dispersion” are used interchangeably herein.",
        "Dispersion or solubilization is determined using analysis of photographs of an aliquot of the dispersion. A photograph of nanomaterial without solubilizing polymers is analyzed as a control. For example, an aliquot (1 mL) of each of a series of nanotube solutions having known and increasing concentrations of nanotubes and lacking solubilizing polymer is photographed. Nanotubes are dispersed and two different zones are observed: dark zones (aggregates of nanotubes) and clear zones (absence of nanotubes due to the non-dispersion of nanotubes). This series provides a standard reference control. An aliquot (1 mL) of a solution of polymer-solubilized nanotubes with a known concentration of nanotubes and solubilizing polymer is photographed and compared to the control. Highly uniform dispersion is observed in a solubilized sample.",
        "Solid Processed Nanomaterial obtained from Solution by Removing Solvent,: Solid processed nanomaterial is obtained from the solutions of processed nanomaterial as described above by removing the solvent by one of many standard procedures well known to those of ordinary skill in the art. Such standard procedures include drying by evaporation such as by evaporation under vacuum or evaporation with heat, casting, precipitation or filtration and the like. A solvent for precipitating solid processed nanomaterials has a polarity that is opposite in the polarity of the polymer backbone side chains. For material obtained by methods of the present invention, the solid material is generally black in color with a uniform network of carbon nanotubes. Solid material may be pulverized to produce a powder.",
        "Removed solvent may be recycled by collection under vacuum and trapping in liquid nitrogen. Such recycled solvent may be used without further purification.",
        "Solid nanomaterial has advantages over solutions of nanomaterial such as easier shipping, handling, storage, and a longer shelf life.",
        "Re-solubilized Processed Nanomaterial: Solid processed nanomaterial obtained as described above is re-solubilized by mixing the solid processed nanomaterial with a re-solubilization solvent. The term “mixing,” as used herein for re-solubilization, means that the solid processed nanomaterial and the re-solubilization solvent are brought into contact with each other. “Mixing” for re-solubilization may include simply vigorous shaking, or may include sonication for a period of time of about 10 min to about 3 h.",
        "The re-solubilization solvent may be the same solvent as the solubilization solvent or may be a different solvent. Accordingly, the re-solubilization solvent may be organic or aqueous such as, for example, CHCl3, chlorobenzene, water, acetic acid, acetone, acetonitrile, aniline, benzene, benzonitrile, benzyl alcohol, bromobenzene, bromoform, 1-butanol, 2-butanol, carbon disulfide, carbon tetrachloride, chlorobenzene, chloroform, cyclohexane, cyclohexanol, decalin, dibromethane, diethylene glycol, diethylene glycol ethers, diethyl ether, diglyme, dimethoxymethane, N,N-dimethylformamide, ethanol, ethylamine, ethylbenzene, ethylene glycol ethers, ethylene glycol, ethylene oxide, formaldehyde, formic acid, glycerol, heptane, hexane, iodobenzene, mesitylene, methanol, methoxybenzene, methylamine, methylene bromide, methylene chloride, methylpyridine, morpholine, naphthalene, nitrobenzene, nitromethane, octane, pentane, pentyl alcohol, phenol, 1-propanol, 2-propanol, pyridine, pyrrole, pyrrolidine, quinoline, 1,1,2,2-tetrachloroethane, tetrachloroethylene, tetrahydrofuran, tetrahydropyran, tetralin, tetramethylethylenediamine, thiophene, toluene, 1,2,4-trichlorobenzene, 1,1,1-trichloroethane, 1,1,2-trichloroethane, trichloroethylene, triethylamine, triethylene glycol dimethyl ether, 1,3,5-trimethylbenzene, m-xylene, o-xylene, p-xylene, 1,2-dichlorobenzene, 1,3-dichlorobenzene, 1,4-dichlorobenzene, 1,2-dichloroethane, N-methyl-2-pyrrolidone, methyl ethyl ketone, dioxane, or dimethyl sulfoxide. In certain embodiments of the present invention, the re-solubilization solvent is a halogenated organic solvent such as 1,1,2,2-tetrachloroethane, chlorobenzene, chloroform, methylene chloride, or 1,2-dichloroethane and, in further embodiments, the re-solubilization solvent is chlorobenzene.",
        "A solution of re-solubilized solid processed nanomaterials comprising solid processed nanomaterial as described herein, and a re-solubilization solvent as described herein is an embodiment of the present invention.",
        "Processed nanomaterial of the present embodiments has been re-solubilized at concentrations of greater than 0.2 mg/mL. Concentrations of re-solubilized material greater than 1.0 mg/mL have been obtained using compositions and methods of the present embodiments.",
        "Insoluble Processed Nanomaterial: Re-solubilized processed nanomaterial may be cast into a desired shape, and heated at about 120° C. to about 200° C. to produce insoluble processed nanomaterial. The heating may occur at a temperature between and including 120° C., 130° C., 140° C., 150° C., 160° C., 170° C., 180° C., 190° C., and 200° C. Insoluble material is useful particularly in layered structural materials.",
        "Product-by–Process: Polymers, processed nanomaterial, solutions of such processed nanomaterial, solids of processed nanomaterials, re-solubilized solutions of processed nanomaterial, and insoluble processed nanomaterial made by a method of the present invention are embodiments of the present invention. For example, a poly(aryleneethynylene) polymer, a poly(ferrocenylaryleneethynylene) polymer or a poly(ferrocenylethynylene) polymer, made by methods described herein, a solution thereof made by methods as described herein, a solid material made therefrom by methods described herein, a re-solubilized material made therefrom by methods described herein, and insoluble solids made by methods described herein are embodiments of the present invention.",
        "Composites of Processed Nanomaterial: Composites of processed nanomaterial as provided herein dispersed within a host matrix are embodiments of the present invention. The host matrix may be a host polymer matrix or a host nonpolymer matrix as described in U.S. patent application Ser. No. 10/850,721 filed May 21, 2004, the entire contents of which is incorporated by reference herein.",
        "The term “host polymer matrix,” as used herein, means a polymer matrix within which the processed nanomaterial is dispersed. A host polymer matrix may be an organic polymer matrix or an inorganic polymer matrix, or a combination thereof.",
        "Examples of a host polymer matrix include a nylon, polyethylene, epoxy resin, polyisoprene, sbs rubber, polydicyclopentadiene, polytetrafluoroethulene, poly(phenylene sulfide), poly(phenylene oxide), silicone, polyketone, aramid, cellulose, polyimide, rayon, poly(methyl methacrylate), poly(vinylidene chloride), poly(vinylidene fluoride), carbon fiber, polyurethane, polycarbonate, polyisobutylene, polychloroprene, polybutadiene, polypropylene, poly(vinyl chloride), poly(ether sulfone), poly(vinyl acetate), polystyrene, polyester, polyvinylpyrrolidone, polycyanoacrylate, polyacrylonitrile, polyamide, poly(aryleneethynylene), poly(phenyleneethynylene), polythiophene, thermoplastic, thermoplastic polyester resin (such as polyethylene terephthalate), thermoset resin (e.g., thermosetting polyester resin or an epoxy resin), polyaniline, polypyrrole, or polyphenylene such as PARMAX®, for example, other conjugated polymers (e.g., conducting polymers), or a combination thereof.",
        "Further examples of a host polymer matrix includes a thermoplastic, such as ethylene vinyl alcohol, a fluoroplastic such as polytetrafluoroethylene, fluoroethylene propylene, perfluoroalkoxyalkane, chlorotrifluoroethylene, ethylene chlorotrifluoroethylene, or ethylene tetrafluoroethylene, ionomer, polyacrylate, polybutadiene, polybutylene, polyethylene, polyethylenechlorinates, polymethylpentene, polypropylene, polystyrene, polyvinylchloride, polyvinylidene chloride, polyamide, polyamide-imide, polyaryletherketone, polycarbonate, polyketone, polyester, polyetheretherketone, polyetherimide, polyethersulfone, polyimide, polyphenylene oxide, polyphenylene sulfide, polyphthalamide, polysulfone, or polyurethane. In certain embodiments, the host polymer includes a thermoset, such as allyl resin, melamine formaldehyde, phenol-fomaldehyde plastic, polyester, polyimide, epoxy, polyurethane, or a combination thereof.",
        "Examples of inorganic host polymers include a silicone, polysilane, polycarbosilane, polygermane, polystannane, a polyphosphazene, or a combination thereof.",
        "More than one host matrix may be present in a nanocomposite. By using more than one host matrix, mechanical, thermal, chemical, or electrical properties of a single host matrix nanocomposite are optimized by adding processed nanomaterial to the matrix of the nanocomposite material. For example, addition of polycarbonate in addition to epoxy appears to reduce voids in a nanocomposite film as compared to a nanocomposite film with just epoxy as the host polymer. Such voids degrade the performance of nanocomposites.",
        "In one embodiment, using two host polymers is designed for solvent cast epoxy nanocomposites where the processed nanomaterial, the epoxy resin and hardener, and the polycarbonate are dissolved in solvents and the nanocomposite film is formed by solution casting or spin coating.",
        "Host nonpolymer matrix: The term “host nonpolymer matrix,” as used herein, means a nonpolymer matrix within which the nanomaterial is dispersed. Examples of host nonpolymer matrices include a ceramic matrix (such as silicon carbide, boron carbide, or boron nitride), or a metal matrix (such as aluminum, titanium, iron, or copper), or a combination thereof. Processed nanomaterial is mixed with, for example, polycarbosilane in organic solvents, and then the solvents are removed to form a solid (film, fiber, or powder). The resulting nanocomposite is further converted to SWNTs/SiC nanocomposite by heating at 900–1600° C. either under vacuum or under inert atmosphere (such as Ar).",
        "A further embodiment of the invention is the above-cited nanocomposite wherein the processed nanomaterial of the nanocomposite is a primary filler and the nanocomposite further comprises a secondary filler to form a multifunctional nanocomposite. In this embodiment, the secondary filler comprises a continuous fiber, a discontinuous fiber, a nanoparticle, a microparticle, a macroparticle, or a combination thereof. In another embodiment, the processed nanomaterial of the nanocomposite is a secondary filler and the continuous fiber, discontinuous fiber, nanoparticle, microparticle, macroparticle, or combination thereof, is a primary filler.",
        "Multifunctional nanocomposites: Nanocomposites can themselves be used as a host matrix for a secondary filler to form a multifunctional nanocomposite. Examples of a secondary filler include: continuous fibers (such as carbon fibers, carbon nanotube fibers, carbon black (various grades), carbon rods, carbon nanotube nanocomposite fibers, KEVLAR®D fibers, ZYLON® fibers, SPECTRA® fibers, nylon fibers, VECTRAN® fibers, Dyneema Fibers, glass fibers, or a combination thereof, for example), discontinuous fibers (such as carbon fibers, carbon nanotube fibers, carbon nanotube nanocomposite fibers, KEVLAR® fibers, ZYLON® fibers, SPECTRA® fibers, nylon fibers, or a combination thereof, for example), nanoparticles (such as metallic particles, polymeric particles, ceramic particles, nanoclays, diamond particles, or a combination thereof, for example), and microparticles (such as metallic particles, polymeric particles, ceramic particles, clays, diamond particles, or a combination thereof, for example). In a further embodiment, the continuous fiber, discontinuous fiber, nanoparticle, microparticle, macroparticle, or combination thereof, is a primary filler and the nanoprocessed material is a secondary filler.",
        "A number of existing materials use continuous fibers, such as carbon fibers, in a matrix. These fibers are much larger than carbon nanotubes. Adding processed nanomaterial to the matrix of a continuous fiber reinforced nanocomposite results in a multifunctional nanocomposite material having improved properties such as improved impact resistance, reduced thermal stress, reduced microcracking, reduced coefficient of thermal expansion, or increased transverse or through-thickness thermal conductivity. Resulting advantages of multifunctional nanocomposite structures include improved durability, improved dimensional stability, elimination of leakage in cryogenic fuel tanks or pressure vessels, improved through-thickness or inplane thermal conductivity, increased grounding or electromagnetic interference (EMI) shielding, increased flywheel energy storage, or tailored radio frequency signature (Stealth), for example. Improved thermal conductivity also could reduce infrared (IR) signature. Further existing materials that demonstrate improved properties by adding processed nanomaterial include metal particle nanocomposites for electrical or thermal conductivity, nano-clay nanocomposites, or diamond particle nanocomposites, for example.",
        "Articles of manufacture: An article of manufacture comprising a polymer, a solution, a solid, a re-solubilized solid, or an insoluble solid as set forth herein is an embodiment of the present invention. Such articles of manufacture include, for example, epoxy and engineering plastic composites, filters, actuators, adhesive composites, elastomer composites, materials for thermal management (interface materials, spacecraft radiators, avionic enclosures and printed circuit board thermal planes, materials for heat transfer applications, such as coatings, for example), aircraft, ship infrastructure and automotive structures, improved dimensionally stable structures for spacecraft and sensors, reusable launch vehicle cryogenic fuel tanks and unlined pressure vessels, fuel lines, packaging of electronic, optoelectronic or microelectromechanical components or subsystems, rapid prototyping materials, fuel cells, medical materials, composite fibers, or improved flywheels for energy storage, for example.",
        "The following examples are presented to further illustrate various aspects of the present invention, and are not intended to limit the scope of the invention.",
        "An exemplary poly(aryleneethynylene) polymer having structure I. where Ar1 and Ar2 are phenyl, x and y are 4, two para R's are H and two para R's are OC10H21, and n is a number of repeating units is synthesized for use in solubilizing nanomaterials:",
        "",
        "Such a poly(aryleneethynylene) polymer is a poly(phenyleneethynylene) polymer and is synthesized by reacting 1,4-didecyloxy-2,5-diiodobenzene (2) with 1,4-diethynyl-2,5-didecyloxybenzene (4), which reactants are synthesized according to the following Scheme 1:",
        "",
        "A 1-L, three-necked flask, equipped with a reflux condenser and mechanical stirrer is charged under argon atmosphere with 1,4-hydroquinone (44.044 g, 0.4 mol) and potassium carbonate, K2CO3, (164.84 g, 1.2 mol), and acetonitrile (ACS grade, 500 mL). 1-Bromodecane (208.7 mL, 1.0 mol) is added and the reaction mixture is then heated to reflux under argon flow for 48 h. The hot solution is poured into an Erlenmeyer flask charged with water (1.5 L) and stirred with a magnetic bar stirrer to precipitate the product. The beige precipitate is then collected by filtration using a Buchner funnel with a fritted disc, washed with water (1.0 L), dried, and then dissolved in hot hexanes (ACS grade, 250 mL). The resulting hot hexanes solution is added slowly into an Erlenmeyer flask charged with ethanol (tech. grade, 1.5 L) and vigorously stirred to precipitate the product. The mixture is stirred for at least 2 hr then the white precipitate is collected by filtration on a Buchner funnel equipped with a fritted disc, washed with cooled ethanol (tech. grade, 0.5 L), and dried under vacuum pressure for 12 hr to give 151.5 g. (97% yield) of a fluffy white solid. 1H NMR (CDCl3) δ 6.83 (s, 4H), 3.92 (t, J=6.6 Hz, 4H), 1.73 (m, 4H), 1.45 (m, 4H), 1.30 (m, 22H), 0.91 (t, J=6.7 Hz, 6H).",
        "A 1-L, two-necked flask equipped with a reflux condenser, and magnetic bar stirring is charged with potassium iodate, KIO3, (15.20 g, 0.066 mol), iodine (36.90 g, 0.132 mol), acetic acid (700 mL), water (50 mL), and sulfuric acid (15 mL). 1,4-didecyloxybenzene (1) (51.53 g, 0.132 mol) is added to the solution and the reaction mixture is then heated to reflux for 8 hours. The purple solution is allowed to cool down to room temperature under constant agitation and saturated aqueous solution of sodium thiosulphate (100 mL) is added until the brown iodine color is gone. The beige-brown precipitate is collected by filtration using a Buchner funnel equipped with a fritted disc, washed with water (700 mL), ethanol (500 mL), and dried. This solid is then dissolved in hot hexanes (300 mL). The resulting hot hexanes solution is poured slowly into an Erlenmeyer flask charged with ethanol (1.5 L) and vigorously stirred to give a white precipitate. This precipitate is collected by filtration, washed with ethanol (1.0 L), and dried under vacuum overnight to give 78.10 g (92% yield) of pure white solid. 1H NMR (CDCl3) δ 7.21 (s, Ph, 2H), 3.94 (t, J=6.4 Hz, OCH2, 4H), 1.82 (m, CH2, 4H), 1.47 (m, CH2, 4H), 1.29 (m, CH2, 22H), 0.90 (t, J=6.72 Hz, CH3, 6H). 13C NMR (CDCl3) d 152.8, 122.7, 86.2, 70.3, 31.9, 29.5, 29.3, 29.2, 29.1, 26.0, 22.6, 14.1.",
        "To a degassed 1.5 L of diisopropylamine is added 1,4-didecyloxy-2,5-diiodobenzene (2) intermediate (100.0 g, 0.1557 mol), CuI (1.48 g, 0.00778 mol), and dichlorobis(triphenylphosphine)palladium(II) (5.46 g, 0.00778 mol). The reaction mixture is stirred for 10 minutes and trimethylsilylacetylene (48.4 mL, 0.342 mol) is added slowly over 15–30 minutes at room temperature. The diisopropylammonium salts are formed during the addition and at the end of the addition the solution is dark brown. After the addition is completed, the reaction mixture is stirred at reflux for 8 h. After cooling, the mixture is diluted with hexanes (500 mL) and filtered through a 4 cm plug of silica gel. The solvent is removed and the product is precipitated from chloroform/EtOH (1:5, 1.5 L). The solid is filtered, washed with water (250 mL), washed with EtOH (250 mL) and dried to give 81.8 g of the desired product as a white solid. Yield (91%). 1H NMR (CDCl3) δ 6.85 (s, Ph, 2H), 3.93 (t, J=6.4 Hz, OCH2, 4H), 1.78 (m, CH2, 4H), 1.27 (m, CH2, 22H), 0.88 (t, J=6.42 Hz, CH3, 6H), 0.26 (s, 18H). 13C NMR (CDCl3) d 154.0, 117.2, 113.9, 101.0, 100.0, 69.4, 31.9, 29.6, 29.5, 29.4, 29.3, 26.0, 22.6, 14.1, 0.17.",
        "Methanol (200 mL) and 120 mL of 20% KOH are added to a rapidly stirred solution of 1,4-didecyloxy-2,5-bis(trimethylsilylethynyl) benzene (3) (80.0 g, 137.21 mmol) in THF (500 mL) at room temperature. The reaction mixture is stirred overnight. The THF is then removed under reduced pressure and the residue is diluted with EtOH (400 mL). A pale yellow solid is filtered, washed with EtOH (250 mL), and dried to give 60.05 g of the desired pale yellow product. Yield (99.7%). 1H NMR (CDCl3) δ 6.96 (s, Ph, 2H), 3.98 (t, J=6.58 Hz, OCH2, 4H), 3.34 (s, CCH, 2H), 1.82 (m, CH2, 4H), 1.52 (m, CH2, 4H), 1.31 (m, CH2, 22H), 0.88 (t, J=6.71 Hz, CH3, 6H). 13C NMR (CDCl3) d 153.9, 117.7, 113.2, 82.4, 79.7, 69.6, 31.9, 29.5, 29.3, 29.1, 25.9, 22.6, 14.1.",
        "Synthesis of Poly(aryleneethynylene) Polymer having Structure I.: A 1-L, oven dried three-necked flask, equipped with a reflux condenser, and magnetic stir bar was charged with toluene/diisopropylamine (7:3; 800 mL) and was degassed at room temperature by constant argon bubbling for 3 h. 1,4-Diethynyl-2,5-didecyloxybenzene (4) (13.0 g, 14.82 mmol), 1,4-didecyloxy-2,5-diiodobenzene (2) (8.66 g, 13.48 mmol), (PPh3)4Pd (0.62 g, 0.54 mmol), 2-iodoanisole (0.26 mL, 15 mol %), and CuI (0.206 g, 0.54 mmol) were added under argon atmosphere. The reaction mixture was stirred at room temperature for 30 minutes and then warmed at 70° C. for 24 h. Diisopropylammonium salts were formed immediately after the start of the reaction and the reaction mixture became highly fluorescent.",
        "After 24 h, an additional 2.0 mL of iodoanisole was added to stop the polymer propagation and the reaction was heated at 70° C. for an additional 4 h. The reaction mixture was then allowed to cool to room temperature and added slowly to an Erlenmeyer flask charged with acetone (1.5 L), heated at 40° C., and vigorously stirred. The mixture was stirred for 2 h and the orange precipitate was collected by filtration. The orange solid was then washed with ethanol (1.0 L) and hot acetonitrile (0.5 L). After drying for 24 h under a vacuum line at room temperature, PPE polymer I. was obtained as an orange solid (10.2 g).",
        "The number of repeating units “n” of this PPE is estimated by 1H NMR to be about 60. The polydispersity is about 1.4 to about 1.6 as determined by gel permeation chromatography using polystyrene standards. Melting point (mp) 130° C. (decomposition). 1H NMR (CDCl3) δ7.55 (m, Ph, 2H/end group), 7.35 (m, Ph, 2H/end group), 7.02 (s, Ph, 2H/polymer), 6.85 (m, Ph, 4H/end group), 4.03 (t, J=6.25 Hz, OCH2, 4H), 3.85 (s, OCH3, 6H, end group), 1.88 (m, CH2, 4H), 1.56 (m, CH2, 4H), 1.27 (m, CH2, 22H), 0.88 (t, J=6.32 Hz, CH3, 6H).",
        "Further polymers were synthesized using the above-cited reaction conditions and the synthesis scheme was demonstrated to be reproducible in generating polymers having length and polydispersity as cited herein. Polymers having structure I. where Ar1 and Ar2 are phenyl, x and y are 4, two para R's are H, and two para R's are OC12H25; or where two para R's are H, an R is OC10H21, and an R is triethyleneglycol; or where two para R's are H, an R is OC10H21, and an R is OCH2CH2COOCH2CH3 were synthesized, for example.",
        "Poly(aryleneethynylene) polymer having structure I., where Ar1 and Ar2 are phenyl, x and y are 4, two para R's are H and two para R's are OC10H21, and n is a number of repeating units, was prepared according to Example 1. The polymer was mixed with single-walled carbon nanotubes (SWNTs) and a solubilization solvent in the amounts as indicated in Table 1. The mixtures were sonicated at 25° C. for about 30 min to produce solutions of processed nanotubes. After sonication, each of the mixtures had formed a stable solution. The SWNTs used in the present example were purified HiPco-SWNTs (“SWNTsHiPco”) commercially available from Carbon Nanotechnologies, Inc. (Houston, Tex.), and purified SWNTs from Nanocyl (Namur, Belgium). While the concentrations of SWNTsHiPco in chlorobenzene shown in Table 1 are 2 mg/mL and 3 mg/mL, concentrations of processed nanotubes have been obtained to 10–15 mg/mL.",
        "TABLE 1\n\n\n\n\n\n\n\nSolutions of Processed Nanotubes\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStructure\nI.:SWNTs\nSolubilization\nConc. of\n\n\n\nSWNTsHiPco\nI. Polymer\nweight\nSolvent\nSWNTs\n\n\nNo.\n(mg)\n(mg)\nratio\n(mL)\n(mg/mL)*\n\n\n\n\n\n1.\n150\n 50\n0.33\nchlorobenzene\n3\n\n\n\n\n\n\n 50\n\n\n2.\n500\n250\n0.5 \nchlorobenzene\n2\n\n\n\n\n\n\n250\n\n\n\n\n\n*based on SWNT material only (excludes polymer material)",
        "Solutions of Table 1. are black in color, visually nonscattering, and no precipitation occurred upon prolonged standing (e.g., over 2 months). Solutions of Table 1. were stored at −5° C. to −20° C. and no precipitation was observed for months.",
        "Solutions of Table 1. were each poured into a TEFLON® plate and dried to a solid film material at room temperature under vacuum for 180 min and 320 min, respectively. The removed solvent was trapped under liquid nitrogen and recycled for subsequent use. The solvent thus trapped is reusable without requiring purification. Although the solutions were dried at room temperature, the solutions could be heated up to about 40° C.–50° C. On a small scale, the solution can be dried by casting film with simple evaporation under atmospheric pressure.",
        "The solid material is a black film having a uniform network of carbon nanotubes, a thickness between a few μm and 100's of μm, and electrical conductivity of about 10,000–50,000 Siemens/meter as measured using a standard four-point probe method.",
        "The solid film formed in Example 2 was re-solubilized by mixing the film and a re-solubilization solvent (“RSS”) as indicated in Table 2. The mixture was sonicated at room temperature for about 30 min. After sonication, each of the mixtures had formed a re-solubilized solution.",
        "TABLE 2\n\n\n\n\n\n\n\nRe-solubilization of Film of Processed Nanotubes\n\n\n\n\n\n\n\n\n\n\n\nAmount of film in mg\nAmount of\nConc. of SWNTs in\n\n\n\n(Portion of film weight\nre-solubilization\nre-solubilized\n\n\nNo.\nthat is SWNTs)\nsolvent (mL)\nsolution (mg/mL)*\n\n\n\n\n\n1.\n150\nChloroform\n1.33\n\n\n\n(100.05 mg, i.e., 66.7%)\n75\n\n\n2.\n 60\nDichloromethane\n1  \n\n\n\n(40 mg, i.e., 66.7%)\n40\n\n\n\n\n\n*based on SWNT material only (excludes polymer material)\n\n\n\n\n\n\nNo excess non-solubilized film was present in either sample. Solid film of processed nanotubes may also be solubilized in halogenated solvents such as 1,1,2,2-tetrachloroethane (typically at 1.5 mg/ml and up to about 3.0 mg/ml), chlorobenzene (typically at 0.5 mg/ml and up to about 1.5 mg/mL), and dichloroethane (typically at 0.5 mg/mL and up to about 1.0 mg/mL), for example.",
        "Solid films of processed MWNTs were re-solubilized in chloroform, chlorobenzene, or dichloromethane at concentrations ranging from 2 mg/mL to 6 mg/mL; and in THF, toluene, or methyl ethyl ketone at concentrations ranging from 2 mg/mL to 5 mg/mL.",
        "Composites comprising polystyrene and processed nanomaterial, polycarbonate and processed nanomaterial, epoxy and processed nanomaterial, polyurethane and processed nanomaterial were made using the processed nanomaterial as described herein.",
        "Methods for incorporating processed nanomaterial as described herein into host polymer matrix include, but are not limited to: (i) in-situ polymerization of monomer(s) of the host polymer in a solvent system in the presence of processed nanomaterial; (ii) mixing both processed nanomaterial and host matrix in a solvent system; or (iii) mixing processed nanomaterial with a host polymer melt as set forth in U.S. patent application Ser. No. 10/850,721 filed May 21, 2004, the entire contents of which is incorporated herein by reference.",
        "The polymer-processed nanotubes of the present embodiments allow high loading of nanotubes in composite material in the presence of low solvent volume due to the high concentration of processed nanotubes in the solvents (5 mg/mL–10 mg/mL).",
        "Other embodiments of the present invention will be apparent to those skilled in the art from a consideration of this specification or practice of the embodiments disclosed herein. However, the foregoing specification is considered merely exemplary of the present invention with the true scope and spirit of the invention being indicated by the following claims.",
        "The references cited herein, to the extent that they provide exemplary procedural or other details supplementary to those set forth herein, are specifically incorporated by reference.",
        "As used herein and unless otherwise indicated, the terms “a” and “an” are taken to mean “one”, “at least one” or “one or more”."
    ],
    "citations": [
        "4663230",
        "5098771",
        "5204038",
        "5281406",
        "5482601",
        "5560898",
        "5578543",
        "5611964",
        "5627140",
        "5753088",
        "5824470",
        "5866434",
        "5877110",
        "5965470",
        "5968650",
        "6017390",
        "6066448",
        "6113819",
        "6140045",
        "6146227",
        "6146230",
        "6180114",
        "6187823",
        "6203814",
        "6276214",
        "6284832",
        "6299812",
        "6315956",
        "6331262",
        "6362011",
        "6368569",
        "6417265",
        "6422450",
        "6426134",
        "6430511",
        "6432320",
        "6464908",
        "6491789",
        "6524466",
        "6531513",
        "6555945",
        "6569937",
        "6576341",
        "6597090",
        "6599961",
        "6610351",
        "6617398",
        "6630772",
        "6634321",
        "6641793",
        "6645455",
        "6656763",
        "6669918",
        "6670179",
        "6680016",
        "6682677",
        "6683783",
        "6685810",
        "6693055",
        "6695974",
        "6709566",
        "6712864",
        "6723299",
        "6734087",
        "6737939",
        "6741019",
        "6746627",
        "6746971",
        "6749712",
        "6756025",
        "6756795",
        "6758891",
        "6762025",
        "6762237",
        "6764540",
        "6770583",
        "6770905",
        "6773954",
        "6774333",
        "6782154",
        "6783702",
        "6783746",
        "6790425",
        "6790790",
        "6798127",
        "6803840",
        "6805642",
        "6805801",
        "6806996",
        "6818821",
        "6824974",
        "6825060",
        "6827918",
        "6835366",
        "6841139",
        "6842328",
        "6843850",
        "6852410",
        "6861481",
        "6866891",
        "6872681",
        "6875274",
        "6875412",
        "6878961",
        "6890654",
        "6894359",
        "6896864",
        "6897009",
        "6899945",
        "6900264",
        "6902658",
        "6902720",
        "6905667",
        "6908261",
        "6914372",
        "6921462",
        "6924003",
        "6934144",
        "6936322",
        "6936653",
        "6946597",
        "6949216",
        "6955939",
        "6958216",
        "6960425",
        "6962092",
        "6969536",
        "6969690",
        "6972467",
        "6974927",
        "6979248",
        "6979709",
        "6982174",
        "6989325",
        "6991528",
        "7008563",
        "7008758",
        "7015393",
        "7018261",
        "7025840",
        "7026432",
        "7029598",
        "7029646",
        "7040948",
        "7045087",
        "7048903",
        "7048999",
        "7052668",
        "7056452",
        "7056455",
        "7060241",
        "7061749",
        "7065857",
        "7066800",
        "7067096",
        "7070753",
        "7070810",
        "7070923",
        "7071287",
        "7074980",
        "7075067",
        "7081429",
        "7087290",
        "7093664",
        "7094367",
        "7094467",
        "7105596",
        "7112816",
        "7115305",
        "7116273",
        "7118881",
        "7122165",
        "7122461",
        "7125533",
        "7126207",
        "7148269",
        "7151625",
        "7153903",
        "7160531",
        "2001/0004471",
        "2001/0010809",
        "2001/0016283",
        "2001/0016608",
        "2001/0031900",
        "2001/0041160",
        "2002/0004028",
        "2002/0004556",
        "2002/0008956",
        "2002/0025490",
        "2002/0028337",
        "2002/0034757",
        "2002/0046872",
        "2002/0048632",
        "2002/0049495",
        "2002/0053257",
        "2002/0053522",
        "2002/0068170",
        "2002/0081397",
        "2002/0081460",
        "2002/0085968",
        "2002/0086124",
        "2002/0090330",
        "2002/0090331",
        "2002/0092613",
        "2002/0094311",
        "2002/0098135",
        "2002/0100578",
        "2002/0102194",
        "2002/0102196",
        "2002/0102617",
        "2002/0110513",
        "2002/0113335",
        "2002/0117659",
        "2002/0122765",
        "2002/0127162",
        "2002/0127169",
        "2002/0136681",
        "2002/0136683",
        "2002/0141934",
        "2002/0150524",
        "2002/0159943",
        "2002/0167374",
        "2002/0167375",
        "2002/0172639",
        "2002/0172963",
        "2002/0176650",
        "2002/0180077",
        "2002/0180306",
        "2002/0197474",
        "2003/0001141",
        "2003/0008123",
        "2003/0012723",
        "2003/0017936",
        "2003/0026754",
        "2003/0039604",
        "2003/0039860",
        "2003/0044608",
        "2003/0052006",
        "2003/0065206",
        "2003/0065355",
        "2003/0066956",
        "2003/0077515",
        "2003/0083421",
        "2003/0086858",
        "2003/0089890",
        "2003/0089893",
        "2003/0091750",
        "2003/0093107",
        "2003/0101901",
        "2003/0102585",
        "2003/0108477",
        "2003/0111333",
        "2003/0111646",
        "2003/0111946",
        "2003/0113714",
        "2003/0116757",
        "2003/0118815",
        "2003/0122111",
        "2003/0129471",
        "2003/0133865",
        "2003/0134736",
        "2003/0142456",
        "2003/0144185",
        "2003/0148086",
        "2003/0151030",
        "2003/0153965",
        "2003/0155143",
        "2003/0158351",
        "2003/0164477",
        "2003/0168756",
        "2003/0170166",
        "2003/0170167",
        "2003/0175803",
        "2003/0178607",
        "2003/0180491",
        "2003/0180526",
        "2003/0181328",
        "2003/0183560",
        "2003/0185741",
        "2003/0185985",
        "2003/0186167",
        "2003/0203139",
        "2003/0205457",
        "2003/0207984",
        "2003/0209448",
        "2003/0211028",
        "2003/0211029",
        "2003/0215816",
        "2003/0216502",
        "2003/0218224",
        "2003/0220518",
        "2003/0227243",
        "2003/0228467",
        "2004/0000661",
        "2004/0007528",
        "2004/0009114",
        "2004/0013597",
        "2004/0016912",
        "2004/0018139",
        "2004/0018371",
        "2004/0018423",
        "2004/0018543",
        "2004/0022677",
        "2004/0022718",
        "2004/0023610",
        "2004/0028599",
        "2004/0028859",
        "2004/0029297",
        "2004/0029706",
        "2004/0034177",
        "2004/0035355",
        "2004/0036056",
        "2004/0036128",
        "2004/0038007",
        "2004/0038251",
        "2004/0040834",
        "2004/0041154",
        "2004/0048241",
        "2004/0051933",
        "2004/0058058",
        "2004/0058457",
        "2004/0069454",
        "2004/0070326",
        "2004/0071624",
        "2004/0071949",
        "2004/0076681",
        "2004/0082247",
        "2004/0084353",
        "2004/0092329",
        "2004/0092330",
        "2004/0101634",
        "2004/0102577",
        "2004/0105726",
        "2004/0113127",
        "2004/0115232",
        "2004/0115501",
        "2004/0120100",
        "2004/0120879",
        "2004/0121018",
        "2004/0124504",
        "2004/0127637",
        "2004/0131835",
        "2004/0131859",
        "2004/0131934",
        "2004/0132072",
        "2004/0132845",
        "2004/0136893",
        "2004/0136894",
        "2004/0137834",
        "2004/0142172",
        "2004/0142285",
        "2004/0146452",
        "2004/0146863",
        "2004/0149759",
        "2004/0160156",
        "2004/0166152",
        "2004/0167014",
        "2004/0169151",
        "2004/0171779",
        "2004/0177451",
        "2004/0179989",
        "2004/0180201",
        "2004/0180244",
        "2004/0184982",
        "2004/0185342",
        "2004/0186220",
        "2004/0191698",
        "2004/0194944",
        "2004/0197638",
        "2004/0202603",
        "2004/0204915",
        "2004/0206940",
        "2004/0206942",
        "2004/0209782",
        "2004/0211942",
        "2004/0217336",
        "2004/0217520",
        "2004/0219093",
        "2004/0219221",
        "2004/0222080",
        "2004/0222413",
        "2004/0223900",
        "2004/0231975",
        "2004/0232073",
        "2004/0232389",
        "2004/0240144",
        "2004/0241080",
        "2004/0241896",
        "2004/0241900",
        "2004/0245085",
        "2004/0247808",
        "2004/0248282",
        "2004/0251042",
        "2004/0254297",
        "2004/0257307",
        "2004/0258603",
        "2004/0262636",
        "2004/0265209",
        "2004/0265755",
        "2004/0266939",
        "2005/0001100",
        "2005/0001528",
        "2005/0002849",
        "2005/0002851",
        "2005/0006623",
        "2005/0006843",
        "2005/0007680",
        "2005/0008919",
        "2005/0019791",
        "2005/0022726",
        "2005/0025694",
        "2005/0026163",
        "2005/0029498",
        "2005/0031525",
        "2005/0031526",
        "2005/0035334",
        "2005/0038171",
        "2005/0038203",
        "2005/0038225",
        "2005/0040370",
        "2005/0040371",
        "2005/0042450",
        "2005/0043503",
        "2005/0045030",
        "2005/0045477",
        "2005/0045877",
        "2005/0048697",
        "2005/0053826",
        "2005/0061451",
        "2005/0062034",
        "2005/0064647",
        "2005/0065229",
        "2005/0069669",
        "2005/0069701",
        "2005/0070654",
        "2005/0074390",
        "2005/0074565",
        "2005/0074613",
        "2005/0079386",
        "2005/0081625",
        "2005/0083635",
        "2005/0087726",
        "2005/0089677",
        "2005/0089684",
        "2005/0090015",
        "2005/0090388",
        "2005/0093425",
        "2005/0095191",
        "2005/0098204",
        "2005/0098205",
        "2005/0098437",
        "2005/0100499",
        "2005/0100501",
        "2005/0100960",
        "2005/0103097",
        "2005/0107182",
        "2005/0112052",
        "2005/0112451",
        "2005/0113669",
        "2005/0113676",
        "2005/0113874",
        "2005/0113876",
        "2005/0116214",
        "2005/0116336",
        "2005/0118372",
        "2005/0118403",
        "2005/0121068",
        "2005/0124020",
        "2005/0124535",
        "2005/0127030",
        "2005/0129575",
        "2005/0129858",
        "2005/0130258",
        "2005/0130296",
        "2005/0131163",
        "2005/0133363",
        "2005/0133372",
        "2005/0143508",
        "2005/0147373",
        "2005/0147553",
        "2005/0148984",
        "2005/0154116",
        "2005/0155216",
        "2005/0158390",
        "2005/0158612",
        "2005/0159524",
        "2005/0160798",
        "2005/0161212",
        "2005/0162606",
        "2005/0165155",
        "2005/0169798",
        "2005/0169830",
        "2005/0169831",
        "2005/0170121",
        "2005/0170169",
        "2005/0179594",
        "2005/0181209",
        "2005/0184294",
        "2005/0186333",
        "2005/0186378",
        "2005/0186565",
        "2005/0191490",
        "2005/0194036",
        "2005/0194038",
        "2005/0195354",
        "2005/0203203",
        "2005/0205265",
        "2005/0205860",
        "2005/0207963",
        "2005/0208328",
        "2005/0209388",
        "2005/0211294",
        "2005/0212395",
        "2005/0214196",
        "2005/0214197",
        "2005/0214198",
        "2005/0214535",
        "2005/0215718",
        "2005/0218045",
        "2005/0221038",
        "2005/0221473",
        "2005/0222333",
        "2005/0224765",
        "2005/0224788",
        "2005/0226778",
        "2005/0228110",
        "2005/0228140",
        "2005/0229334",
        "2005/0229335",
        "2005/0230270",
        "2005/0233158",
        "2005/0234263",
        "2005/0238810",
        "2005/0239948",
        "2005/0242089",
        "2005/0242344",
        "2005/0244326",
        "2005/0244991",
        "2005/0245667",
        "2005/0245690",
        "2005/0247237",
        "2005/0250244",
        "2005/0254760",
        "2005/0255030",
        "2005/0255312",
        "2005/0257946",
        "2005/0261670",
        "2005/0262674",
        "2005/0263456",
        "2005/0266605",
        "2005/0271648",
        "2005/0271829",
        "2005/0272143",
        "2005/0272856",
        "2005/0276743",
        "2005/0277160",
        "2005/0277201",
        "2005/0277675",
        "2005/0279478",
        "2005/0284337",
        "2005/0287371",
        "2005/0287414",
        "2006/0001013",
        "2006/0003203",
        "2006/0003401",
        "2006/0014068",
        "2006/0014155",
        "2006/0014375",
        "2006/0016552",
        "2006/0019093",
        "2006/0024503",
        "2006/0025515",
        "2006/0027499",
        "2006/0029537",
        "2006/0032702",
        "2006/0033226",
        "2006/0036018",
        "2006/0036045",
        "2006/0039848",
        "2006/0040381",
        "2006/0041050",
        "2006/0045838",
        "2006/0047052",
        "2006/0051579",
        "2006/0052509",
        "2006/0054488",
        "2006/0054555",
        "2006/0057016",
        "2006/0057053",
        "2006/0057055",
        "2006/0057290",
        "2006/0057361",
        "2006/0058443",
        "2006/0062714",
        "2006/0062718",
        "2006/0062924",
        "2006/0062930",
        "2006/0062985",
        "2006/0065546",
        "2006/0065887",
        "2006/0067939",
        "2006/0067941",
        "2006/0069199",
        "2006/0073089",
        "2006/0081775",
        "2006/0081882",
        "2006/0084742",
        "2006/0084752",
        "2006/0094309",
        "2006/0098389",
        "2006/0099135",
        "2006/0099715",
        "2006/0103641",
        "2006/0104886",
        "2006/0104890",
        "2006/0110537",
        "2006/0115640",
        "2006/0115711",
        "2006/0116284",
        "2006/0121275",
        "2006/0122284",
        "2006/0122614",
        "2006/0124028",
        "2006/0124613",
        "2006/0126175",
        "2006/0127470",
        "2006/0131440",
        "2006/0131570",
        "2006/0135030",
        "2006/0135281",
        "2006/0135282",
        "2006/0135677",
        "2006/0137817",
        "2006/0140847",
        "2006/0142148",
        "2006/0142149",
        "2006/0142466",
        "2006/0145194",
        "2006/0148642",
        "2006/0151844",
        "2006/0154195",
        "2006/0154489",
        "2006/0159612",
        "2006/0159921",
        "2006/0162818",
        "2006/0165586",
        "2006/0165896",
        "2006/0166003",
        "2006/0167139",
        "2006/0167147",
        "2006/0171874",
        "2006/0172179",
        "2006/0174789",
        "2006/0175581",
        "2006/0177946",
        "2006/0180755",
        "2006/0184714",
        "2006/0188723",
        "2006/0188774",
        "2006/0189412",
        "2006/0192475",
        "2006/0193026",
        "2006/0193868",
        "2006/0194058",
        "2006/0199770",
        "2006/0201880",
        "2006/0202168",
        "2006/0205872",
        "2006/0207758",
        "2006/0210466",
        "2006/0211236",
        "2006/0211807",
        "2006/0214262",
        "2006/0219689",
        "2006/0223991",
        "2006/0228497",
        "2006/0231399",
        "2006/0233692",
        "2006/0235113",
        "2006/0237217",
        "2006/0237218",
        "2006/0237219",
        "2006/0237221",
        "2006/0237693",
        "2006/0237708",
        "2006/0240305",
        "2006/0249020",
        "2006/0249711",
        "2006/0251568",
        "2006/0252853",
        "2006/0257556",
        "2006/0257645",
        "2006/0270777",
        "2006/0270790",
        "2006/0274049",
        "2006/0275371",
        "2006/0275596",
        "2006/0275956",
        "2006/0276056",
        "2006/0278444",
        "2006/0286023",
        "2006/0286297",
        "2006/0291142",
        "2006/0292297",
        "2006/0293434",
        "2007/0003471",
        "2007/0004857",
        "2007/0009379",
        "31 18 503",
        "1359121",
        "1359169",
        "1449887",
        "2003096313",
        "2003-138040",
        "2003292801",
        "2004002849",
        "2004002850",
        "WO99/57222",
        "WO 00/44094",
        "WO2001/030694",
        "WO 02/16257",
        "WO2001/057917",
        "WO 02/076888",
        "WO 02/076888",
        "WO 02/88025",
        "WO 02/95099",
        "WO2004/060988"
    ],
    "us_classification": "128397",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "08",
            "subclass": "G",
            "main_group": "61",
            "subgroup": "00"
        }
    ]
}