{
    "title": "Polymer based electrospray nozzle for mass spectrometry",
    "abstract": "A MEMS device with an overhanging ‘polymer’ capillary provides vital and significant improvements in interfacing a MEMS electrospray nozzle to an MS inlet or other macroscopic instrumentation. The fabrication methodology associated therewith is easily expanded to include built-in micro particle filters and centimeter long serpentine micro channels provided on-chip and fabricated using a low temperature process.",
    "inventors": [
        "Tai",
        "Wang",
        "Desai",
        "Lee",
        "Licklider"
    ],
    "document_number": "07297943",
    "publication_date": "20071120",
    "assignees": [
        "California Institute of Technology",
        "City of Hope National Medical Center and Beckman Research Institute"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A polymer nozzle for electrospray ionization, comprising:",
            "components": [
                {
                    "component": "a support structure formed of a semiconductor material;",
                    "subcomponents": []
                },
                {
                    "component": "a MEMS electrospray nozzle structure, formed of a polymer material, having a first portion which is supported by said support structure, and a second portion which is unsupported by said support structure; and",
                    "subcomponents": []
                },
                {
                    "component": "a first inlet window, fluidly coupled to said nozzle structure, said first inlet window being supported by said support structure.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A nozzle as in claim 1 , wherein said nozzle structure which is unsupported is flexible.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A nozzle as in claim 1 , wherein said polymer material includes Parylene.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A nozzle as in claim 1 , further comprising a filtering element formed supported by said support structure.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A nozzle as in claim 4 , wherein said filtering element comprises a serpentine shaped filtering part, coupled between said first inlet window, and said nozzle structure.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A nozzle as in claim 4 , wherein said filtering element is also formed from a polymer material.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A nozzle as in claim 1 , further comprising a second inlet window, separate from said inlet window and spaced from said inlet window.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A nozzle as in claim 7 , further comprising a first filtering element coupled between said first inlet window and said nozzle, and a second filtering element coupled between said first inlet window and said nozzle.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A polymer nozzle for electrospray ionization, comprising:",
            "components": [
                {
                    "component": "a support structure, formed of a silicon material;",
                    "subcomponents": []
                },
                {
                    "component": "a MEMS electrospray nozzle structure, having an exterior portion, and a hollow interior portion, having a first nozzle part which is supported by said silicon support structure, and a second nozzle part which extends beyond said support structure and forms a freestanding part, said nozzle structure being flexible.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A nozzle as in claim 9 , further comprising an inlet window, fluidly coupled to said nozzle structure, and supported on said support structure.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A nozzle as in claim 10 , further comprising a filtering element, coupled between said inlet window and said support structure.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A nozzle as in claim 11 , wherein said filtering element is formed of Parylene.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A nozzle as in claim 11 , further comprising a second inlet window, also connected fluidly to said nozzle structure, and enabling a second fluid communication to said nozzle structure.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A nozzle as in claim 11 , wherein the nozzle is a Parylene nozzle.",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation of Ser. No. 09/442,843 filed Nov. 18, 1999 now abandoned, which claims priority benefit to U.S. provisional application Nos. 60/109,264 filed Nov. 19, 1998 and 60/114,900 filed Jan. 5, 1999, each of which are incorporated herein by reference in their entirety.",
        "The U.S. Government may have certain rights in this invention pursuant to a Grant No. 2 R01 RR06217-06 awarded by the National Institute of Health.",
        "This disclosure relates to chip-based chemical analysis systems such as electrospray mass spectroscopy (MS). More specifically, this disclosure relates to fabrication of a micron-sized micro-electromechanical systems (“MEMS”) electrospray nozzle.",
        "Over the past decade, there has been increasing interest in the development of miniaturized chemical analysis systems using micro-electromechanical (MEMS) technology. Until more recently, the prior art in MEMS technology has included UV absorbance and electro-chemi-luminescence for on-chip detection. These optical methods are not viable for detection of many biomolecules. A viable commercial product should be able to process/analyze a wide range of samples.",
        "Mass spectrometers (“MS”) are one type of widely used macroscopic instrument for the analysis of biomolecular structures such as proteins, carbohydrates, lipids and polynucleotides. MS is widely used due to its ability to analyze large proteins and peptides. MS also has high sensitivity, e.g., as high as 10−12 moles.",
        "Much experimentation has focused on an on-chip interface that has the advantage of directly coupling a MEMS electrospray nozzle to an MS inlet.",
        "The present disclosure describes a MEMS device with an overhanging ‘polymer’ capillary that allows interfacing a MEMS electrospray nozzle to an MS inlet or other macroscopic instrumentation. The fabrication methodology associated therewith is easily expanded to include built-in micro particle filters and centimeter long serpentine micro channels provided on-chip and fabricated using a low temperature process.",
        "In an embodiment, the core structured material is parylene polymer, aluminum and photoresist are used as sacrificial layers, and bromine trifluoride (BrF3) gas phase etching is employed for final microcapillary releasing.",
        "These and other aspects will be described with reference to the drawings, in which:",
        "FIG. 1 shows a three dimensional view of a silica-based micromachined electrospray nozzle;",
        "FIG. 2 shows a three dimensional view of a polymer-based micromachined electrospray nozzle constructed in accordance with the present invention;",
        "FIG. 3 shows the fabrication sequence of the nozzle in FIG. 2; and",
        "FIG. 4 shows a mass spectrum analysis of myoglobin using a polymer-based nozzle structure vs. a silica-based nozzles structure.",
        "Electrospray ionization (ESI) can be used with MEMS chemical systems to generate ions for MS analysis.",
        "ESI is an atmospheric pressure ionization technique in which gaseous ionized molecules are produced in a fine spray from a liquid droplet in the presence of a strong electric field between a capillary tip and an MS inlet. The released ionized molecules are then directed into the MS inlet by the applied field. The applied electric field changes the shape of the fluid droplet from a spherical shape to a cone called the Taylor cone. The base of this cone is dependent on the geometry and the wetted area (wall thickness) of the capillary. Hence, reduction of these parameters reduces the size of the Taylor cone, thus reducing dead-volume.",
        "ESI can form a simple and direct way to interface a MEMS device to a mass spectrometer. The MEMS device needs an electrospray nozzle from which fluid can be injected toward the mass spectrometer inlet.",
        "The capability to fabricate micron-sized tips with micromachining is advantageous in many ways: 1) the shape and finish of the tip can be reproducible from chip to chip, 2) complex MEMS filter structures can be constructed inside the micromachined liquid channel in order to filter out debris, and 3) mass production is available due to batch processing.",
        "A silica-based micromachined nozzle construction is shown in FIG. 1. The silica-based nozzle structure 10 is shown constituted by a support silicon substrate 15. The support silicon substrate 15 is formed to have a sample inlet window 17. The sample inlet window 17 is positioned on the underside of the silicon substrate 15 in contact with the nozzle structure 10, represented by dashed lines. A capillary tubing 20 is attached to the sample inlet window 17 to supply liquid sample into the nozzle structure 10.",
        "The liquid sample is intended for flow into the channel field 25 of the nozzle structure 10. In the illustrated nozzle structure, the channel field 25 is a micro-channel formed with multiple filter structures 30.",
        "The silica-based nozzle structure 10 is formed by a “sandwich” fabrication sequence. The sequence involves depositing two silicon nitride (SixNy) layers on the silicon substrate 15 during the manufacturing process to form outer portions of a sandwich. An interior/sacrificial layer of phosphosiligate glass (PSG) material is deposited between the sandwiching SixNy nitride layers and this interior layer selectively etched to form the illustrated filter structures which function as filters and space inhibitors in the interior of the channel field 25. The channel field 25 and the tip channel 35 occupy the volume where the PSG layer was located before the PSG layer is etched away.",
        "The nozzle structure 10 is ultimately finally etched to form the nozzle structure with an overhanging electrospray capillary. The tip orifice of the nozzle structure is micron-sized. This resultant MEMS device with its overhanging micro-channel was found to reduce the wetted surface area at the ESI tip. Reduction of this orifice diameter and tip surface area correspondingly reduce the size of the fluid cone during electrospray, thus reducing the internal volume that the liquid occupies from the inlet of the device to the actual point of analysis. This internal volume is called the dead volume. In addition to reducing dead volume, the nozzle has integrated particle filter structures that function to reduce MEMS ESI tip clogging.",
        "An outward sloping sidewall 19 combined with the short length (l) of the silicon nitride nozzle tip 35 limits the tip-to-inlet distance as well as interferes with the electric field profile at the channel tip end. Furthermore, it is well known that fabrication of mm-long silicon nitride overhanging structures poses significant challenges. SixNy capillaries longer than a few hundred microns can curve due to film stress gradients (typically 200 MPa for LPCVD SixNy). To achieve channels longer than a few hundred microns long, etching holes on SixNy channels are necessary. Such etching holes can be sealed after sacrificial layer etching. Etching holes not only complicate the process, but the resulting stress concentration around such etching holes could cause released microchannels to easily crack. Another drawback is that the fragile silicon nitride capillaries shatter with the slightest contact with the MS inlet during chemical analysis.",
        "Many of the above-mentioned drawbacks of SixNy ESI tips are found to be eliminated with an overhanging “polymer”-based nozzle structure 50 described below in connection with FIGS. 2-4. The polymer material utilized is Parylene-C (“Parylene”). Parylene is a bio-compatible polymer material used to make MEMS microchannels and microvalves. The properties of Parylene produce advantages when forming an improved nozzle structure. In contrast to the silica-based nozzle structure 10, polymer material is ideal for fabrication of high aspect ratio overhanging structures due to its low tensile stress (<100 Mpa).",
        "Because Parylene allows for deposition at room temperature, a photoresist is used in place of the sacrificial material used in the fabrication of silica-based nozzle structures. Unlike PSG etching, a photoresist sacrificial etching (with acetone) does not require etching. holes along the channel. Thus, structures that are orders of magnitude longer can be easily fabricated. The Young's modulus of Parylene (˜3 GPa) is only about one hundredth of. SixNy In terms of robustness, the fabricated Parylene microcapillaries are far superior. While SixNy capillaries can shatter easily with the slightest contact with other objects, Parylene capillaries, even when up to 600 times longer, flex and return to their original shape.",
        "Parylene ESI tips possess improved plasticity. Despite a longer overhanging tip structure than SixNy ESI tips, Parylene ESI tips were found to even be able to survive table-top falls and mishandling without having the tips break. In short, the robustness of the parylene nozzles coupled with the simple to manufacture process makes polymer-based technology very much more commercially viable.",
        "An illustrative embodiment of a polymer-based nozzle structure 50 is shown in FIG. 2. The polymer-based nozzle structure is a micromachined electrospray-type nozzle formed on a support substrate 55, preferably a silicon substrate. The support substrate 100 is formed with first and second inlet windows 56 and 57 (shown in dashed lines). Inlet windows 56, 57 extend vertically through the silicon substrate 55 to make contact, at an underside thereof, with a capillary tubing through which is to be supplied liquid sample(s) during chemical analysis.",
        "The liquid sample flows into a filtered channel field 70 of the nozzle structure 50. In the illustrative nozzle structure, the filtered channel field 70 is a micro-channel comprised of circumferentially integrated filter elements 71 formed about each of first and second inlet windows 56 and 57. Filtered channel field 70 further comprises serpentine channels 75 disposed downstream from the back of the channel field 25 closest to first inlet window 56. Both filter elements 71 and serpentine channels 75 function to separately trap debris and other particles in the liquid sample.",
        "Liquid sample introduced to nozzle structure 50 through first inlet window 56 travels through associated filter elements 71 downstream, through serpentine channels 75, and ultimately out through a substantially rectangularly-shaped orifice at tip channel 78 extending axially through microcapillary tip 80.",
        "Liquid sample introduced to nozzle structure 50 through second inlet window 57 bypasses filtration through the serpentine channels 75.",
        "It should be appreciated that while serpentine channels and filter elements have been shown as a manner to provide filtration, other orientations are possible. For example, the nozzle structure 50 may be fabricated with only serpentine channels, or only with filter elements, and such may be of variable dimensions and sizes. An important consideration in designing the positioning of filtration means is selecting appropriate spacing and dimensioning so as to achieve sufficient filtration. Clogging between the nozzle-structure Parylene layers by particulates in the liquid sample also must be considered.",
        "Use of more than one sample inlet window 56, 57 facilitates mixing or adding other liquids to the sample before ionization.",
        "FIGS. 3A to 3F will now be used to explain the fabrication steps associated with the formation of a polymer-based nozzle structure. FIGS. 3A to 3F only show a limited cross-section of the nozzle structure 50 of FIG. 2 taken along zigzag path A-A′.",
        "The nozzle structure 50 is generally similar in fabrication to the “sandwich” layering of the silica-based nozzle structure 10 shown in FIG. 1. However, instead of SixNy upper and lower layers, two Parylene polymer layers are used to form layers that will eventually become the floor and roof of the nozzle structure 50.",
        "The polymer-based “sandwich” is constituted by a 5 μm thick photoresist 110 enclosed by two Parylene layers 101, 102, each 3 μm thick on a 500 μm thick silicon substrate 55. The overhanging capillary nozzle structure 50 is created by gas phase etching of the Si support substrate 55 underneath.",
        "Nozzle structure 50 could be formed on a 1 cm×0.7 cm die. Serpentine channels may be either 5 or 10 cm long, for example, and selected based on desired separation of course, all dimensions are only exemplary and may be varied based on liquid sample properties and flow requirements.",
        "During fabrication, appropriate windows 57 are opened in a silicon wafer preferably coated on both sides with 1.5 μm silicon dioxide (FIG. 3A). Next, backside cavities are etched by potassium hydroxide (KOH) to leave a 10 μm silicon membrane left with a SiO2 mask layer 103. The SiO2 layer on wafer top side is patterned and etched with BHF. BrF3 gas phase etching follows, to roughen the silicon surface for adhesion enhancement (FIG. 3B). Next, a 3 μm thick layer 101 of Parylene is deposited on the wafer front side only. After patterning the Parylene with oxygen plasma, a 5000 Å thick Al layer is evaporated and patterned to form filter elements 71 (FIG. 3C).",
        "A photoresist layer of 5 μm thickness is then spun and patterned. The wafer is then hard baked at 120° C. for 10 minutes to evaporate the solvent in the photoresist. Baking helps prevent buckle and burst if heat is applied later on. A 3 μm thick Parylene layer 102 is then deposited on the front side. A 0.1 μm thick Al layer evaporated and patterned as a masking layer thereover follows this. Afterwards, oxygen plasma etching is performed and the microcapillary tip 80 is given form (FIG. 3D). Next, the wafer is diced, and the thin silicon membrane is etched away with BrF3 to open up the backside inlet window 56 and release the overhanging polymer tip 80 (FIG. 3E).",
        "The photoresist layer is then dissolved away with acetone to establish the channel field 25 through which liquid sample flows downstream and out to tip 80. The MEMS nozzle structure 50 is eventually rinsed and immersed in alcohol and deionized water for several hours (FIG. 3F).",
        "To minimize tip clogging, particle filters can also be incorporated in several other designs by employing a double sacrificial material method. Using sub-micron channel heights in the filter areas, and larger channel heights for the remaining microchannel length forms filter elements 71. To achieve this type of bi-level sacrificial structure, careful control of both thicknesses is essential. In a preferred embodiment, a sub-micron Al layer is used for the filter region and a thicker photoresist for the rest of the structure. The flexibility of polymer material selected must also be taken into account when designing structures that are subject to mechanical pressure. For example, fluidic pressure can cause deformation in the sub-micron filter area and nullify its effectiveness as a sub-micron filter. To address this deformation problem, polymer anchor structures are fabricated in this region to hold the top and bottom of the channel together.",
        "The gas phase silicon etchant BrF3 is used to release the microcapillaries. This etching method serves two purposes in this process: 1) to partially roughen the silicon surface for increased adhesion to the Parylene, and 2) to release the microcapillaries from the silicon substrate 55 in the last fabrication step.",
        "Compared to other silicon etching methods, plasma etching offers less silicon undercutting and tends to damage the Parylene film on the structure. Even though potassium hydroxide (KOH) or tetramethyl ammonium hydroxide (TMAH) do not attack Parylene at low temperature, they do attack the Parylene-silicon interface significantly and cause Parylene to peel off from the substrate. In contrast, the gas phase silicon isotropic etchant, BrF3, can etch silicon spontaneously at room temperature and maintain the integrity of a Parylene-silicon interface.",
        "The ability to fabricate precise micrometer-sized tip geometries expands the uses of micro-electrospray phenomena. In addition to experimentally derived empirical data, mathematical models also facilitate prediction calculations. For instance, the following mathematical model models a circular cone with a specific cone tip angle, where re represents the radius of the emission region at the tip of the Taylor cone, γ the surface tension of the liquid, ρ the density of the liquid, Ua the applied voltage, Ut the voltage at which the cone is formed, υ the cone angle, and dV/dt the flow rate. The equation below predicts that re, the emission radius can be reduced with a reduction in flow rate. However, in the illustrative nozzle structure 50, the orifice through the tip 80 is rectangular and initial measurements of the cone angle show significant deviation from that of a circular capillary Taylor cone (˜49°).",
        "r\n    e\n  \n  =\n  \n    \n      \n        (\n        \n          ρ\n          \n            4\n            ⁢\n            \n              π\n              2\n            \n            ⁢\n            \n              γ\n              ⁡\n              \n                [\n                \n                  \n                    \n                      (\n                      \n                        \n                          U\n                          a\n                        \n                        \n                          U\n                          t\n                        \n                      \n                      )\n                    \n                    2\n                  \n                  -\n                  1\n                \n                ]\n              \n            \n            ⁢\n            \n              tan\n              ⁡\n              \n                (\n                \n                  \n                    π\n                    2\n                  \n                  -\n                  υ\n                \n                )\n              \n            \n          \n        \n        )\n      \n      \n        1\n        /\n        3\n      \n    \n    ·\n    \n      \n        (\n        \n          \n            ⅆ\n            V\n          \n          \n            ⅆ\n            t\n          \n        \n        )\n      \n      \n        2\n        /\n        3",
        "The improved polymer-base nozzle structure makes possible coupling a MEMS device to an MS interface. The nozzle structure represents vital and significant improvements in MEMS process technology and MS functionality with respect to the silicon-nitride ESI nozzles reported before. The-tests validate the tremendous advantages and viability of Parylene polymer technology particularly when combined with gas phase etching to form mm-long rugged overhanging capillary structures. The integration of micro-particle filters sandwiched between polymer layers has made the nozzle a more convenient tool for MS. In the context of a MEMS application for chemical analysis, the invention renders MEMS ESI more cost-efficient and practical.",
        "Employed as a MEMS device, the nozzle structure now has the possibility to be integrated with other chip-based chemical analysis systems, thus increasing the potential of high sensitivity chemical detection with MEMS systems.",
        "Although only a few embodiments have been described in detail above, those having ordinary skill in the art will certainly understand that many modifications are possible in the preferred embodiment without departing from the teachings thereof.",
        "All such modifications are intended to be encompassed within the following claims."
    ],
    "citations": [
        "5994696",
        "6633031",
        "6864480"
    ],
    "us_classification": "250288",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "J",
            "main_group": "49",
            "subgroup": "04"
        }
    ]
}