{
    "title": "Conductive composites",
    "abstract": "A conductive composite material formed from an organic polymer base, a highly conductive metal interlayer, and an electroless nickel top layer is described. The composite material may be electrically conductive and resistant to corrosion. The highly conductive metal interlayer may be silver or copper. An electroless nickel plating process is described that efficiently deposits the nickel top layer without the use of, surfactants, and stabilizers at low temperatures. The method enables reduction of substantially all of a nickel salt onto the silver surface leaving a spent bath solution free of nickel that can be recycled.",
    "inventors": [
        "Naik"
    ],
    "document_number": "07297373",
    "publication_date": "20071120",
    "assignees": [
        "Noble Fiber Technologies, LLC"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for preparing a conductive composite by forming a nickel phosphorus alloy electrolessly, comprising:",
            "components": [
                {
                    "component": "providing a metallic coated polymer base;",
                    "subcomponents": []
                },
                {
                    "component": "cleaning the metallic coated polymer base;",
                    "subcomponents": []
                },
                {
                    "component": "contacting the metallic coated polymer base with an aqueous solution of a tin salt;",
                    "subcomponents": []
                },
                {
                    "component": "washing the metallic coated polymer base after exposure to the aqueous solution of a tin salt to remove excess tin salt;",
                    "subcomponents": []
                },
                {
                    "component": "contacting the metallic coated polymer base with an aqueous solution of a palladium salt;",
                    "subcomponents": []
                },
                {
                    "component": "washing the metallic coated polymer base after exposure to the aqueous solution of a palladium salt to yield a palladium activated metallic coated polymer base; and",
                    "subcomponents": []
                },
                {
                    "component": "contacting the metallic coated polymer base with an aqueous solution comprising nickel sulfate, sodium hypophosphite, ammonium sulfate and ammonia.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein a metal forming the metallic coated polymer base is silver.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , wherein a metal forming the metallic coated polymer base is copper.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein a metal forming the metallic coated polymer base is between about 12.5 percent and about 37.5 percent by weight of the metallic coated polymer base.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 , wherein the tin salt is stannous chloride.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein the palladium salt is palladium (II) chloride.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein a weight ratio of nickel sulfate to sodium hypophosphite is between about 0.6 and about 0.9.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , wherein a pH of the aqueous solution comprising nickel sulfate, sodium hypophosphite, animonium sulfate and ammonia is between about 8.5 and about 10.0.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 1 , wherein a temperature of the aqueous solution comprising nickel sulfate, sodium hypophosphite, animonium sulfate and ammonia is between about 35° C. and about 90° C.",
            "components": []
        }
    ],
    "description": [
        "The invention relates to conductive composites, and more particularly to flexible conductive composites.",
        "The need for electrically conductive organic polymeric structures has increased. One method to achieve such structures is the formation of a composite between the organic polymer and a metal. Flexible conductors of this type are useful for electromagnetic wave shielding materials and other applications. The reduction in size of electronic devices requires greater flexibility, durability and softness for conducting materials, and such reduction is most easily achieved by the use of a fabric from a metal-coated organic polymer fiber. The manner in which the conducting fibers have been prepared has varied depending upon the desired metals that have been placed on the organic polymer. Silver and copper are the two primary metals deposited on organic polymers for these applications because these metals have very high conductivities. Unfortunately, these two metals easily undergo corrosion and are inherently soft, lacking the durability required for many applications.",
        "The deposition of silver on organic polymers is well known. This is described in United States Patent Application Publication 2004/0173056. Likewise, the deposition of copper on organic polymers is well known and is described in U.S. Pat. No. 4,228,213.",
        "Nickel is frequently deposited on a metal to enhance the surface properties of the metal. Usually this is carried out by an electroless plating process. Although an electrodeposition process can produce a nickel-plated structure, it requires a conductive substrate and gives a different coating than an electroless plated structure. The electroless plated structure typically displays less pure nickel but the coating is typically thicker and more even. The electroless plated nickel is generally superior in corrosion resistance.",
        "The electroless plating process is often carried out by the addition of a reducing agent to a solution containing a metal salt. For the deposition of nickel, common reducing agents include sodium hypophosphite, sodium borohydride, dimethylamine borane, and hydrazine. Depending upon the reducing agent that is used, the metal displays some content of phosphorous, boron, or nitrogen. The nickel deposits are generally characterized as high phosphorous, low phosphorous, high boron, and so forth. When sodium hypophosphite is used as the reducing agent, phosphorous can range from about one percent to about 15 percent of the nickel coating. The properties of the coating depend upon the amount of the non-nickel content. Properties that can vary include conductive, magnetic and corrosion resistance properties.",
        "The most commonly used reducing agent for electroless nickel deposition is sodium hypophosphite. The process can be described by the following equation:\n\nNi+2+H2PO2−+H2O→Ni0+H2PO3−+2H+\n\nThis reaction competes with the following reaction:\n\nH2PO2−+H2O→H2PO3−+H2↑\n\nBoth of these reactions involve the adsorption of atomic hydrogen on a catalytically active surface. The adsorbed hydrogen either combines to form hydrogen gas or transfers an electron to reduce the nickel ion to nickel metal. The adsorbed hydrogen is believed to be responsible for the reduction of hypophosphite to phosphorous, and the phosphorous is incorporated into the nickel coating.",
        "The electroless deposition technique requires the formation of the catalytically active surface prior to the autocatalytic reduction of nickel (II) to nickel metal on the surface. The nature of the catalyst added to generate the catalytically active substrate surface is dependent on the substrate, and for noble metals and non-metals, the common catalyst is a palladium species. A particularly effective system uses stannous chloride and palladium chloride to form the catalytically active surface. Typically, a colloid is formed from a reaction of palladium chloride and stannous chloride in the presence of excess hydrochloric acid to treat the surface for electroless plating of nickel.",
        "In addition to the catalyst to form the active surface, a typical deposition bath requires a complexing agent, a pH regulator, an accelerator, a stabilizer, a buffer, a wetting agent and a reducing agent to achieve a desired metal coating. This complex mixture unfortunately results in a waste stream that is complicated to process. A typical electroless nickel bath is spent after three or four turnovers at which time it is considered waste. This spent bath typically contains nickel at a concentration of more than 5,000 mg per liter, unreacted reducing agent, oxidized reducing agent, and all of the other components previously mentioned. The spent bath is usually treated with hydrated lime to precipitate nickel salts and the remainder of the sludge, which still has significant quantities of nickel, is frequently sent to a landfill with potential environmental risks and, in the United States, an economic risk to the generator of the waste stream.",
        "Numerous studies directed toward the reduction and treatment of waste from electroless nickel plating processes have been carried out and are in progress. The direction of these studies include alternate plating chemistries, plate out of residual nickel, ion exchange and electrodialysis.",
        "A need for a corrosion resistant highly conductive metal-coated plastic substrate remains. More specifically, a need exists for a composite including the flexibility and strength of a polymeric substrate and a highly conductive metal that is resistant to corrosion. Furthermore, a need exists for an electroless nickel process that permits many turnovers of a bath and leaves little or no nickel in the spent bath, thereby reducing expenses associated with environmental cleanup.",
        "This invention is direct to a conductive composite that may be formed from a polymer base, a metallic interlayer, and a metallic top layer. In at least one embodiment, the conductive composite may be formed from an organic polymer base, a highly conductive metal interlayer, and a nickel top layer. The organic polymer can be any suitable organic polymer including polyamide, polyimide, polyester, polyurea, polyurethane, polyolefin, polyacrylate, polycarbonates, polyethers, vinyl polymers, other organic polymer or copolymers thereof. The metal interlayer can be silver, copper, or other appropriate material. The interlayer may be between about 10 percent and about 30 percent of the weight of the composite. The nickel top layer can be between about five percent and about 20 percent of the weight of the composite. The nickel top layer may contain phosphorous at less than 10 percent by weight of the top layer. In particular, the nickel top layer may contain phosphorous between about one percent and about 10 percent by weight of the top layer.",
        "The invention also includes a method for preparing a conductive composite with a polymer base, a highly conductive metal interlayer and a nickel top layer. A polymer base coated with a highly conductive metal such as silver or copper is cleaned and brought in contact with an aqueous solution of a tin salt. The tin salt may be, but is not limited to being, stannous chloride or other appropriate materials. The polymer base coated with a highly conductive metal is then washed to remove excess tin salt and brought into contact with an aqueous solution of a palladium salt. The palladium salt may be, but is not limited to being, palladium (II) chloride or other appropriate materials. After washing excess palladium salt for the polymer base coated with a highly conductive metal it is contacted with an aqueous solution comprising nickel sulfate, sodium hypophosphate, ammonium sulfate and ammonia at a low temperature. The weight ratio of nickel sulfate to sodium hypophosphite is between about 0.6 and about 0.9 in the nickel plating solution. The nickel plating is carried out at a pH between about 8.5 and about 10.0 and at a temperature between about 35° C. and about 90° C.",
        "The accompanying drawings, which are incorporated in and form a part of the specification, illustrate embodiments of the presently disclosed invention and, together with the description, disclose the principles of the invention.",
        "FIG. 1 is a perspective view of an embodiment of the invention.",
        "FIG. 2 is a perspective view of an alternative embodiment of the invention.",
        "FIG. 3 is a detail view taken in FIG. 2 of yet another alternative embodiment of the invention.",
        "This invention, as shown in FIGS. 1-3, is directed to a conductive composite 10 and a method of forming the conductive composite 10. In at least one embodiment, the conductive composite 10 may be formed by a polymer 12 coated with a metallic interlayer 14. The metallic interlayer 14 may in turn be coated with a metallic top layer 16. The interlayer 14 coated on the polymer 12 may be, but is not limited to being, silver, copper, or other appropriate material. The top layer 16 coated on the interlayer 14 may be, but is not limited to being, nickel or other appropriate material.",
        "The process of forming a metallic coated polymer 12 may be prepared for a silver or copper coating on an organic polymer substrate 12 using processes that are commercially available or easily prepared by known methods. A silver coated onto as organic polymer substrate 12 such as nylon may be prepared as described in United States Patent Application Publication No. US 2004/0173056 and in U.S. Pat. No. 3,877,965. The formation of a copper coated organic polymer substrate 12 such as nylon may be prepared as described in U.S. Pat. No. 4,228,213. The polymer 12 may be a polyamide, polyimide, polyester, polyurea, polyurethane, polyolefin, polyacrylate, polycarbonates, polyethers, vinyl polymers, other organic polymer or copolymers thereof, whereby the copolymer may be alternating, random, block, or branched. The polymer 12 may also be cross-linked.",
        "The polymer 12 may be in the form of a fiber or a yarn, as shown in FIG. 1, a fabric, a film, a sheet, molded structure or machined structure, as shown in FIGS. 2 and 3. The conductive composite 10 may be coated over an entire surface, on a single surface, or positioned on a portion of a surface. As shown in FIG. 1, the interlayer 14 may coat entirely the polymer 12, and the top layer 16 may coat entirely the interlayer 14. As shown in FIG. 2, the polymer 12 may be coated on one side with an interlayer 14 and a top layer 16. As shown in FIG. 3, the polymer may be coated on two sides by an interlayer 14 and a top layer 16.",
        "The process of coating the substrate 12 involves cleaning the substrate 12, activating the substrate 12 for deposition of a conductive metal, and then performing an electroless plating process by the action of a reducing agent on a soluble salt of the metal. The nature of the cleaning method can vary depending upon the nature and even more specifically on the source of a given organic polymer 12. The cleaning method may include rinsing with water or may include a complicated removal of a film or etching of a surface using organic solvents, acids, oxidizing agents, et cetera.",
        "Activation of the substrate 12 typically involves placing the washed substrate 12 into a solution containing a tin salt. The activated substrate 12 is then exposed to a solution containing a silver salt and a reducing agent. The solution typically contains complexing agents and often includes surfactants, stabilizers, and other chemicals to aid in the deposition of the silver. Formulations for the electroless deposition of silver onto a polymer 12 are commercially available and specific methods are well described in the art. As the final composite structure 10 formed from a top layer 16 on an interlayer 14 on a polymer 12 is designed to have between about 10 percent and about 30 percent by weight silver, the silver coated substrate 12 and 14 can have a weight percent of silver between about 12.5 percent and about 37.5 percent.",
        "As previously stated, the metallic coating on the polymer 12 may be, but is not limited to being, copper. The deposition of copper on an organic polymer substrate 12 involves similar steps to that of depositing silver where the substrate 12 is washed, activated and then exposed to a solution containing a copper salt and a reducing agent. The nature of the washing step can vary depending on the substrate 12. The activation may be carried out by exposure to a solution containing a tin salt and a noble metal which may be palladium, platinum, silver, or gold. The copper may then be deposited on the activated surface from a solution that contains a copper salt and a reducing agent along with a variety of complexing agents, stabilizers etc. Formulations for the electroless deposition of copper are commercially available and specific methods are well described in the art. As the final composite structure 10 formed from a top layer 16 on an interlayer 14 on a polymer 12 is designed to have between about 10 percent and about 30 percent by weight copper, the copper coated substrate 12 and 14 can have a weight percent of copper between about 12.5 percent and about 37.5 percent.",
        "A method of depositing nickel on a highly conductive metal surface is herein described for the deposition of nickel onto silver. A description of the deposition of nickel onto copper is not described because the method is substantially identical to the deposition of nickel onto silver. A top layer 14 formed from nickel may be applied to the silver coated polymeric structure 12 by the following electroless nickel plating method. The electrodeposition of nickel in an electrolysis process may be used, but such as process creates a nickel coating that is not sufficiently resistant to corrosion.",
        "The silver surface 14 is first cleaned by immersion in a dilute tetrasodium pyrophosphate solution and then washing with deionized water. This can be carried out by placing the cleaned portion of the metal coated polymer 12 in a bath where the deionized water is passed through the bath.",
        "The substrate 12 with the cleaned silver surface 14 may then transferred to a bath containing a tin salt solution, which may be for example, stannous chloride, directly from the bath where it was rinsed. The silver surface 14 may again washed with deionized water and subsequently immersed into a bath containing a palladium salt, which may be for example palladium chloride. The exposure to air between the rinsing and the introduction to the palladium salt bath should be minimal and that the silver coated substrate 12 and 14 is maintained in the rinsing bath until the palladium chloride bath is ready for acceptance of the silver coated substrate 12 and 14. After the exposure to the palladium salt solution the surface is again rinsed in a bath. The exposure to air should be again avoided after washing the palladium activated silver coated substrate 12 and 14. It is most convenient to maintain the substrate 12 in the rinsing bath until the subsequent step is to be performed.",
        "The silver coated substrate 12 and 14 may then be immersed in an electroless nickel plating solution. The electroless nickel plating solution may consist of nickel sulfate and sodium hypophosphite in a basic ammonium sulfate solution. The basic ammonium sulfate can be prepared by mixing sulfuric acid with ammonia solution using more than two equivalents of ammonia to sulfuric acid. The molar ratio of sulfate ion to nickel ion in the initial solution may be between about 2.8 to 1 and about 3.4 to 1. A sufficient concentrated ammonia results in a pH between about 9.5 and about 10. The molar ratio of nickel sulfate to sodium hypophosphite may be between about 0.6 and about 0.9. The weight of nickel that may be deposited is controlled by the weight of nickel salt to silver coated substrate 12 used. The amounts may be determined because substantially all of the nickel ion is converted into nickel metal on the metal coated polymer 12, and the amount of nickel that will be deposited can be predicted.",
        "The ratio of nickel ion to hypophosphite ion in the present invention may be significantly greater than a conventional ratio in standard electroless nickel baths, in which a molar ratio of about 0.4 is typically used to assure sufficient reducing agent. The lower ratio of nickel salt to hypophosphite is used to assure sufficient reducing agent to convert nickel ion to nickel metal. The use of a higher molar ratio results in less effective competition of water and hypophosphite with hypophosphite to form hydrogen and phosphorous, respectively. At typical ratios of nickel salt to hypophosphite, stabilizers are required.",
        "The initial range of pH should be equal to or greater than about 8.5 and is most effective at pH values between about 9 and about 10. Solutions that are more basic are detrimental to the bath and result in the precipitation of nickel salts. This pH range is easily maintained and adjusted by the addition of an ammonia solution.",
        "Concentrated ammonium hydroxide solution can be added as necessary to adjust the pH but the initial solution can be formulated such that all of the nickel can be deposited on the silver without the addition of more ammonia. As the reaction progresses the pH drops and ultimately stabilizes at about 8.5. The blue-green color of the solution disappears completely indicating the reduction of the Ni+2 to Ni0 which plates out only on the catalytically active surface.",
        "The temperature should be kept above about 35° C. but need not exceed about 50° C. to achieve a reasonable deposition rate with little difference in the rate of deposition observed over this small temperature range. The rate of deposition increases with temperature. Temperatures as high as 90° C. and greater can be used but are not required for reasonable deposition rates. Complete deposition of the nickel can be achieved when the silver coated structure is immersed for less than one hour. Formulations may also be created in which deposition of nickel occurs in periods of less than ten minutes are possible.",
        "No stabilizer, accelerator, buffer, nor complexing agent, in addition to ammonia, need be included. This appears to result from the higher molar ratio of nickel ion to hypophosphate ion and the pH range that is used. The incorporation of additives can be detrimental to the deposition process. For example, the inclusion of the common stabilizer, tartaric acid, reduces the rate of deposition relative to the system free of this stabilizer. The addition of these additives complicates the waste disposal process and increases the cost of the process. Conversely, the absence of these additives coupled with the absence of nickel salts in the spent electroless bath simplifies the waste disposal. The spent bath requires only neutralization of the base to permit disposal under common environmental requirements. The electroless nickel bath can be recycled by the addition of nickel salt and hypophosphite salt.",
        "The electroless nickel deposition method of the present invention is illustrated by the following non-limiting examples.",
        "A 2 L bath was charged with 700 mL of deionized water and warmed to 40° C. on a hot plate. A solution was prepared by the addition of 3.086 g of nickel sulfate, 4.40 mL of 50 volume percent sulfuric acid solution, and 6.60 mL of 29% ammonium hydroxide solution to 100 mL of deionized water. A second solution was prepared by the addition of 1.984 g of sodium hypophosphite to 100 mL of deionized water. The pH of the bath was 9.5 and the solution was blue in color. The bath was maintained between about 35° C. and about 45° C. A 6.627 g sample of silver coated nylon yarn was added to the bath. The silver coated nylon yarn was a 100 denier nylon yarn with 34 filaments per strand coated such that the mass of silver was twenty percent of the mass of the coated yarn. After submersion of the yarn, the solution faded in color and was colorless in less than one hour. Analysis of the solution displayed no nickel, 0 ppm, by atomic absorption spectrophotometry. The resulting fiber was 72% nylon, 15% silver and 13% nickel.",
        "A 2 L bath was charged with 700 mL of deionized water and warmed to 40° C. on a hot plate. A solution was prepared by the addition of 4.657 g of nickel sulfate, 6.64 mL of 50 volume percent sulfuric acid solution, and 9.96 mL of 29% ammonium hydroxide solution to 100 mL of deionized water. A second solution was prepared by the addition of 2.994 g of sodium hypophosphite to 100 mL of deionized water. The pH of the bath was 9.5 and the solution was blue in color. The bath was maintained between about 35° C. and about 45° C. A 10.0 g sample of silver coated nylon with 10% SPANDEX fabric was added to the bath. The mass of silver was twenty percent of the mass of the fabric. After submersion of the fabric, the solution faded in color and was colorless in less than one hour. Analysis of the solution displayed no nickel, 0 ppm, by atomic absorption spectrophotometry. The resulting fabric had 15% silver and 13% nickel by weight of the resulting fabric.",
        "The foregoing is provided for purposes of illustrating, explaining, and describing embodiments of this invention. Modifications and adaptations to these embodiments will be apparent to those skilled in the art and may be made without departing from the scope or spirit of this invention."
    ],
    "citations": [
        "3877965",
        "4061802",
        "4228213",
        "4444836",
        "4535032",
        "4657786",
        "4814205",
        "5389496",
        "5397599",
        "5419829",
        "6045680",
        "6468593",
        "6780467",
        "6787488",
        "6902765",
        "6924244",
        "2004/0173056",
        "1558017",
        "1587494",
        "2000014615",
        "2003-236982"
    ],
    "us_classification": "427438",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "05",
            "subclass": "D",
            "main_group": "1",
            "subgroup": "18"
        }
    ]
}