{
    "title": "Diphosphate salt of a 4″—substituted-9-deoxo-9 A—AZA—homoerythromycin derivatives and its pharmaceutical composition",
    "abstract": "This invention relates to a novel crystalline diphosphate salt of (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopryanosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one that is useful as an antibacterial and antiprotozoal agent in mammals. This invention also relates to pharmaceutical compositions containing the free base of the diphosphate salt and the methods of treating bacterial and protozoal infections in mammals by administering the free base of the diphosphate to mammals requiring such treatment. The free base of the diphosphate salt of the present invention possesses potent activity against various bacterial and protozoal infections when given by parenteral application to mammals.",
    "inventors": [
        "Rafka",
        "Ragan",
        "Allen"
    ],
    "document_number": "07297682",
    "publication_date": "20071120",
    "assignees": [
        "Pfizer Inc.",
        "Pfizer Products Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A liquid crystal polymorph of (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-0-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopyranosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one diphosphate having the formula",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A crystalline polymorph of (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopyranosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one diphosphate having the formula",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The crystalline diphosphate of claim 1 ; wherein said crystalline diphosphate absorbs water to about 48% at about 90% relative humidity; and becomes deliquescent at about 90% relative humidity.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The crystalline diphosphate of claim 1 ; wherein thermogravametric analysis discloses that three waters are lost by about 75° C., a fourth water is lost by about 120° C., a fifth water is lost by about 170° C., and three final waters are lost by about 200° C.; and the maximum number of water molecules necessary for stabilization of the crystalline lattice is eight.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The crystalline diphosphate of claim 1 ; wherein drying said crystalline diphosphate in about 70° C. in air or about 45° C. in a vacuum removes the water leaving a pseudomorph.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The crystalline diphosphate of claim 2 ; said crystalline diphosphate has an aqueous solubility of about 280 mg/ml.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A method of making the liquid crystal polymorph of claim 1 or the crystalline polymorph of claim 2 comprising the steps of dissolving (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopyranosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one in absolute ethanol at ambient temperature; adding a solution of phosphoric acid in absolute ethanol over about 2 to 5 minutes; partially dissolving the resulting solid by the addition of water; collecting the resulting crystal crop at ambient temperature; and rinsing said crystal crop with several small portions of about 10/1 (v/v) ethanol-water.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A method of making impurity-free (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopyranosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one comprising the steps of partitioning the liquid crystal polymorph of claim 1 or the crystalline polymorph of claim 2 between methylene chloride and water; raising the pH to about 8 to 10; and collecting and evaporating the organic phase.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A pharmaceutical composition having antibacterial and antiprotozoal activity in mammals comprising (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopyranosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one according to claim 8 in an amount effective in the treatment of bacterial and protozoal diseases and a pharmaceutical acceptable carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A method of treating bacterial and protozoal infections which comprises administering to cattle or swine in need of such treatment an antibacterial or antiprotozoal amount of (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopyranosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one according to claim 8 .",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 10 wherein said antibacterial or antiprotozoal amount is given by parenteral application.",
            "components": []
        }
    ],
    "description": [
        "The present Application is a continuation of U.S. Pat. application Ser. No. 10/218,154, filed Aug. 12, 2002, now U.S. Pat. No. 6,861,412, which is a divisional of U.S. Pat. application Ser. No. 09/574,160, filed May 18, 2000, now U.S. Pat. No. 6,465,437, which claims benefit of U.S. Provisional Application No. 60/141,681, filed Jun. 30, 1999.",
        "This invention relates to a novel crystalline diphosphate salt of (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopryanosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one (hereinafter the diphosphate salt) that is useful as an antibacterial and antiprotozoal agent in mammals. This invention also relates to pharmaceutical compositions containing the free base of the diphosphate salt and the methods of treating bacterial and protozoal infections in mammals by administering the free base of the diphosphate salt to mammals requiring such treatment. The free base of the diphosphate salt of the present invention possesses potent activity against various bacterial and protozoal infections when given by parenteral application to mammals.",
        "Macrolide antibiotics are known to be useful in the treatment of a broad spectrum of bacterial and protozoal infections in mammals, fish and birds. Such antibiotics include various derivatives of erythromycin A such as azithromycin which is commercially available and is referred to in U.S. Pat. Nos. 4,474,768 and 4,517,359 both of which are incorporated herein by reference in their entirety.",
        "The present invention relates to two polymorphs of (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopryanosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one diphosphate (hereinafter the diphosphate salt) shown below:",
        "Wherein n is 0 to 8",
        "In one embodiment of the invention, the diphosphate salt is a liquid crystal that has a lath-like habit and exhibits longitudinal cleavage but no lateral cleavage. X-ray diffraction shows little or no order.",
        "In another embodiment, the disphosphate salt is crystalline. Microscopy of the diphosphate salt indicates a plate or prism habit, both of which are highly birefringent. The diphosphate salt is a well-ordered crystal characterized by the X-ray diffraction pattern below:",
        "Peak No.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd space\n16.2\n12.4\n10.8\n9.0\n6.9\n6.5\n6.2\n5.4\n5.1\n4.9",
        "The crystalline diphosphate salt gradually absorbs water to about 13% at 87% relative humidity with a rapid uptake of water to about 48% occurring at about 90% relative humidity. Thermogravametric analysis on the diphosphate salt discloses that three waters are lost by about 75° C., a fourth water is lost by about 120° C., the fifth water is lost by about 170° C., and the final three waters are lost by about 200° C. The maximum number of water molecules necessary for the stabilization of the crystalline lattice appears to be about eight. Drying the diphosphate salt in about 70° C. in air or about 45° C. in a vacuum removed the water leaving a pseudomorph. The crystalline diphosphate salt has an aqueous solubility of about 280 mg/mL.",
        "A method of preparing the diphosphate salt comprises dissolving the anhydrous free base with magnetic stirring in absolute ethanol at ambient temperature, adding a solution of phosphoric acid in absolute ethanol over about 2 to 5 minutes to afford a precipitate, then partially dissolving the resulting solid in a small proportion of water. Stirring for several hours at ambient temperature affords a crystal crop that is collected by filtration then rinsed with several small portions of about 10/1 (v/v) ethanol-water. After the diphosphate salt has been synthesized it is reconverted to a pharmaceutically acceptable free base by a method which comprises dissolution in water, addition of methylene chloride, increasing the pH to about 8.5 to 10, collection and concentration of the organic phase, and crystallization of the amorphous free base from a hydrocarbon solvent.",
        "A pharmaceutical composition which has antibacterial and antiprotozoal activity in mammals comprises the free base of the diphosphate salt in an amount effective in the treatment of bacterial and protozoal diseases and a pharmaceutically acceptable carrier. A method of treating bacterial and protozoal infections comprises administering to mammals in need of such treatment an antibacterial amount of the free base of the diphosphate salt. The antibacterial amount of the free base is given by parenteral application to mammals.",
        "The present invention relates to two polymorphs of (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopryanosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one diphosphate shown below:",
        "wherein n is 0 to 8",
        "In one embodiment of the invention, the diphosphate salt is a liquid crystal that has a lath-like habit and exhibits longitudinal cleavage but no lateral cleavage. X-ray diffraction shows little or no order.",
        "In another embodiment, the diphosphate salt is a crystalline hygroscopic salt. Microscopy of the diphosphate salt indicates a plate or prism habit both of which are highly birefringent. The diphosphate salt is a well ordered crystal characterized by the X-ray diffraction pattern below:",
        "Peak No.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd space\n16.2\n12.4\n10.8\n9.0\n6.9\n6.5\n6.2\n5.4\n5.1\n4.9",
        "The invention also relates to processes for preparing the liquid crystal and the crystalline diphosphate salt as well as the pharmaceutical composition of the free base of the diphosphate salt as shown in Scheme 1 below:",
        "Wherein n is 0-8",
        "Differential scanning calorimetry of the crystalline diphosphate salt shows a single event at about 119° C. which coincides with water loss as well as the dissolution of the salt in the released water. No crystallization follows the event.",
        "Drying in the VTI at 20-25° C. indicated a weight loss of 10%; the dried salt gradually adsorbed water to 15% at 85% RH (relative humidity), followed by a rapid uptake to 48% at 90% RH. At 90% RH, the compound deliquesced.",
        "The diphosphate salt was also studied by thermogravametic analysis (TGA). On samples rehydrated at 87% RH [13% water by Karl Fisher (KF) titration], four distinct breaks were noted. There were 3 waters lost by about 75° C.; 4 by about 120° C., 5 by about 170° C., and 8 lost by about 200° C. The maximum water molecules necessary for the stabilization of the crystalline lattice appears to be eight. A reduction in the water level of the hydrate caused no change in the X-ray diffraction data indicating the formation of a pseudomorph of the hydrate.",
        "The mobility of the water within the crystalline lattice is directly related to the relative humidity of the environment the diphosphate salt comes in contact with. For example, at about 87% relative humidity, the compound contains about 13% water; at 60% relative humidity the compound contains about 8% water; and at 40% relative humidity the diphosphate salt contains about 5% water (all calculations by KF).",
        "Drying the diphosphate salt at 70° C. in air or at 45° C. under vacuum removed all the water leaving a psuedomorph. Rehydrating the salt at about 87% relative yielded the octahydrate form.",
        "The following examples illustrate the methods and compounds of the present invention. It will be understood that the invention is not limited to the specific examples.",
        "(2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopryanosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one (7.5 g, 97%, 9.0 mmol) was dissolved in absolute ethanol (190 mL) at ambient temperature. A 15 mL portion of a solution of phosphoric acid in absolute ethanol (7.15 g of commercial H3PO4 diluted to 100 mL, 9.3 mmol, 1.03 eq) was then added. A white precipitate formed immediately. Water (10 mL) was added after stirring the suspension at ambient temperature for 1 hour. The mixture then stirred for 6 days, after which the solids were collected on a Buchner funnel and rinsed twice with small portions of absolute ethanol. The damp filter cake was dried under high vacuum at ambient temperature. The resultant solids exhibited birefringence under cross polarizing light but did not exhibit an X-ray diffraction pattern.",
        "KF analysis on the liquid crystals indicated that they contained 5.5% water. Calculated and actual values for elemental analysis are shown below:",
        "% calculated\n% observed\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC\n46.44\n48.15\n\n\nH\n8.69\n9.22\n\n\nN\n3.96\n4.11\n\n\nP\n5.84\n5.83",
        "An HPLC potency assay was also performed. The expected potency of a diphosphate salt containing 5.5% water was 76.4%; the observed value was 76.9%.",
        "Subsequent lots that were air-dried only also exhibited no X-ray pattern. A small portion of the liquid crystals was placed in a test tube and was dissolved (with warming) in 1-propanol (containing a small proportion of water) then left out in a hood to slowly evaporate. Solids from this trial were used as seed crystals in Example 2.",
        "The free base (10 g, 98.8%, 12.3 mmol) was dissolved, with magnetic stirring, in absolute ethanol (180 mL) at ambient temperature. A solution of phosphoric acid in absolute ethanol [18 mL, 11.2 mmol, 0.9 eq (7.15 g H3PO4 diluted to 100 mL)] was added over about 3 minutes which caused the formation of a white, sticky precipitate. Water (10 mL) was added and the mixture was stirred at ambient temperature overnight. The crystal crop was collected on a Buchner funnel and the solids rinsed with three small portions of 10/1 (v/v) ethanol-water. The recovered, air-dried solids weighed 2.09 g. X-Ray analysis of the solids indicated the presence of the liquid crystal form. A 500 mg sample of the liquid crystals was dissolved (with warming) in 2 mL of 10:1 (v/v) ethanol-water. The resultant solution was cooled to ambient temperature and seeded with solids from the small-scale trial involving wet 1-propanol. The mixture stirred at ambient temperature overnight. The resultant solids were collected on a Buchner funnel and rinsed with a small proportion of 10:1 (v/v) ethanol-water and air-dried to a weight of 370 mg. X-Ray analysis indicated that the material was now well-ordered and exhibited a well-defined powder pattern as shown below:",
        "Peak No.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd space\n16.2\n12.4\n10.8\n9.0\n6.9\n6.5\n6.2\n5.4\n5.1\n4.9",
        "Both the liquid crystal and the crystalline form of the diphosphate were hygroscopic. When attempts were conducted in hydrophilic solvents, the addition of 4% to 5% (v/v) water to the amorphous slurry caused the compound to crystallize as an octahydate. Crystallization in ethanol/water indicated that a metastable ethanol solvate could form.",
        "A 1.18 g portion of amorphous diphosphate octahydrate was combined with 18.5 mL of absolute ethanol and 1.05 mL of water. The mixture was heated to reflux for 15 minutes to yield a hazy solution. The heat was removed and the stirred mixture cooled to ambient temperature to promote crystallization. After a 2 hour granulation, the product was cooled, filtered, and air dried under ambient conditions to afford the pure diphosphate octahydrate salt.",
        "The Free Base of (2R,3S,4R,5R,8R,10R,11R,12S,13S,14R)-13-[[2,6-dideoxy-3-C-methyl-3-O-methyl-4-C-[(propylamino)methyl]-α-L-ribo-hexopryanosyl]oxy]-2-ethyl-3,4,10-trihydroxy-3,5,8,10,12,14-hexamethyl-11-[[3,4,6-trideoxy-3-(dimethylamino)-β-D-xylo-hexopyranosyl]oxy]-1-oxa-6-azacyclopentadecan-15-one",
        "The diphosphate salt (225 g) was partitioned between water (1200 mL) and methylene chloride (500 mL). The pH of the aqueous phase was raised from 5.9 to 8.6 by addition of solid potassium carbonate. The organic phase was collected, dried over anhydrous sodium sulfate and concentrated to a dry, amorphous foam (170 g).",
        "The amorphous free base (170 g) was crystallized from heptane (700 mL) to generate clean, crystalline free base (115 g) which was then formulated as a partially aqueous solution for parenteral use in livestock.",
        "The above process and resulting diphosphate salt possess valuable and nonobvious properties. Formation of the diphosphate salt allows a large number of impurities to be purged in the resultant mother liquor. Upon reconversion to the free base, this results in a drug substance that forms very low levels of haze upon formulation in partially aqueous media. This results in a pharmaceutically superior solution for parenteral application.",
        "The active compounds may be administered alone or in combination with pharmaceutically acceptable carriers or diluents by the routes previously indicated, and such administration may be carried out in single or multiple doses. More particularly, the active compounds may be administered in a wide variety of different dosage forms, i.e., they may be combined with various pharmaceutically acceptable inert carriers in the form of tablets, capsules, lozenges, troches, hard candies, powders, sprays, creams, salves, suppositories, jellies, gels, pastes, lotions, ointments, aqueous suspensions, injectable solutions, elixirs, syrups, and the like. Such carriers include solid diluents or fillers, sterile aqueous media and various non-toxic organic solvents, etc. Moreover, oral pharmaceutical compositions can be suitably sweetened and/or flavored. In general, the active compounds are present in such dosage forms at concentration levels ranging from about 5.0% to about 70% by weight.",
        "For parenteral administration, solutions of an active compound in an oil, a partially aqueous vehicle, or an aqueous vehicle may be employed. The oil will be selected from those which are pharmaceutically acceptable; for example sesame or peanut oil may be employed. The non aqueous component of a partially aqueous vehicle will be selected those which are pharmaceutically acceptable; for example, propylene glycol or polyethylene glycol, may be employed. The aqueous solutions should be suitably buffered (preferably pH less than 8) if necessary. The aqueous and partially aqueous solutions are suitable for intravenous injection purposes. The aqueous, partially aqueous, and oily solutions are suitable for intraarticular, intramuscular and subcutaneous injection purposes. The preparation of all these solutions under sterile conditions is readily accomplished by standard pharmaceutical techniques well known to those skilled in the art."
    ],
    "citations": [
        "6465437",
        "6861412",
        "WO 98/56802"
    ],
    "us_classification": "514 29",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "01",
            "subclass": "N",
            "main_group": "43",
            "subgroup": "04"
        }
    ]
}