{
    "title": "Thermal response correction system",
    "abstract": "Techniques are disclosed for performing thermal history control in a thermal printer in which a single thermal print head prints sequentially on multiple color-forming layers in a single pass. Each pixel-printing interval may be divided into subintervals, which may be of unequal duration. Each sub-interval may be used to print a different color. The manner in which the input energy to be provided to each print head element is selected may be varied for each of the subintervals. For example, although a single thermal model may be used to predict the temperature of the print head elements in each of the subintervals, different parameters may be used in the different subintervals. Similarly, different energy computation functions may be used to compute the energy to be provided to the print head in each of the subintervals based on the predicted print head temperature.",
    "inventors": [
        "Busch",
        "Saquib",
        "Vetterling"
    ],
    "document_number": "07298387",
    "publication_date": "20071120",
    "assignees": [
        "Polaroid Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method comprising steps of:",
            "components": [
                {
                    "component": "(A) identifying a density of a pixel in a digital image, the density including: (1) a first color component associated with a first printing subinterval of a printing line time and having a first value, and (2) a second color component associated with a second printing subinterval of the printing line time and having a second value, said first color being different than said second color;",
                    "subcomponents": []
                },
                {
                    "component": "(B) identifying a first print head element temperature;",
                    "subcomponents": []
                },
                {
                    "component": "(C) identifying a first energy computation function associated with the first color component;",
                    "subcomponents": []
                },
                {
                    "component": "(D) identifying a first input energy using the first energy computation function based on the first value and the first print head element temperature;",
                    "subcomponents": []
                },
                {
                    "component": "(E) identifying a second print head element temperature;",
                    "subcomponents": []
                },
                {
                    "component": "(F) identifying a second energy computation function associated with the second color component; and",
                    "subcomponents": []
                },
                {
                    "component": "(G) identifying a second input energy using the second energy computation function based on the second value and the second print head element temperature.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein the pixel comprises one of a plurality of pixels in the digital image, and wherein the method further comprises a step of performing steps (A)-(G) for each of the plurality of pixels.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , further comprising steps of:",
            "components": [
                {
                    "component": "(H) providing the first input energy to a print head element; and",
                    "subcomponents": []
                },
                {
                    "component": "(I) providing the second input energy to the print head element.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein the step (B) comprises a step of predicting the first print head element temperature; and wherein the step (E) comprises a step of predicting the second print head element temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 4 , wherein the step (B) comprises a step of predicting the print head element temperature based on a temperature of a print head of which the print head element is a component.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 4 , wherein the step (B) comprises a step of:",
            "components": [
                {
                    "component": "(B)(1) predicting the first print head element temperature based on the first printing subinterval; and wherein the step (E) comprises a step of:",
                    "subcomponents": []
                },
                {
                    "component": "(E)(1) predicting the second print head element temperature based on the second printing subinterval;",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein the first printing subinterval and the second printing subinterval differ in duration.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , wherein the first energy computation function comprises a first plurality of one-dimensional functions of desired output density.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 8 , wherein the second energy computation function comprises a second plurality of one dimensional functions of desired output density, the second plurality of one dimensional functions being different than the first plurality of one-dimensional functions.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 1 , further comprising a step of:",
            "components": [
                {
                    "component": "(H) identifying at least one property selected from the group consisting of an ambient printer temperature and a current humidity; and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the step (D) comprises a step of identifying the first input energy using the first energy computation function based on the first value, the print head element temperature, and the at least one identified property.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A device comprising:",
            "components": [
                {
                    "component": "first identification means for identifying a density of a pixel in a digital image, the density including: (1) a first color component associated with a first printing subinterval of a printing line time and having a first value, and (2) a second color component associated with a second printing subinterval of the printing line time and having a second value, said first color being different than said second color;",
                    "subcomponents": []
                },
                {
                    "component": "second identification means for identifying a first print head element temperature;",
                    "subcomponents": []
                },
                {
                    "component": "third identification means for identifying a first energy computation function associated with the first color component;",
                    "subcomponents": []
                },
                {
                    "component": "fourth identification means for identifying a first input energy using the first energy computation function based on the first value and the first print head element temperature;",
                    "subcomponents": []
                },
                {
                    "component": "fifth identification means for identifying a second print head element temperature;",
                    "subcomponents": []
                },
                {
                    "component": "sixth identification means for identifying a second energy computation function associated with the second color component; and",
                    "subcomponents": []
                },
                {
                    "component": "seventh identification means for identifying a second input energy using the second energy computation function based on the second value and the second print head element temperature.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The device of claim 11 , further comprising:",
            "components": [
                {
                    "component": "means for providing the first input energy to a print head element; and",
                    "subcomponents": []
                },
                {
                    "component": "means for providing the second input energy to the print head element.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The device of claim 11 , wherein the second identification means comprises means for predicting the first print head element temperature; and wherein the fifth identification means comprises means for predicting the second print head element temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The device of claim 13 , wherein the second identification means comprises means for predicting the print head element temperature based on a temperature of a print head of which the print head element is a component.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The device of claim 13 , wherein the second identification means comprises:",
            "components": [
                {
                    "component": "means for predicting the first print head element temperature based on the first printing subinterval; and wherein the fifth identification means comprises:",
                    "subcomponents": []
                },
                {
                    "component": "means for predicting the second print head element temperature based on the second printing subinterval;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the fourth identification means comprises means for identifying the first input energy using the first energy computation function based on the first value and the first print head element temperature; and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the seventh identification means comprises means for identifying the second input energy using the second energy computation function based on the second value and the second print head element temperature.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The device of claim 11 , wherein the first printing subinterval and the second printing subinterval differ in duration.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The device of claim 11 , further comprising:",
            "components": [
                {
                    "component": "eighth identification means for identifying at least one property selected from the group consisting of an ambient printer temperature and a current humidity; and wherein the fourth identification means comprises means for identifying the first input energy using the first energy computation function based on the first value, the print head element temperature, and the at least one identified property.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. A method comprising steps of:",
            "components": [
                {
                    "component": "(A) identifying a density of a pixel in a digital image, the density including a first color component having a first value and a second color component having a second value, said first color being different than said second color);",
                    "subcomponents": []
                },
                {
                    "component": "(B) predicting a first temperature of a print head element at the beginning of a first subinterval associated with the first color component; and",
                    "subcomponents": []
                },
                {
                    "component": "(C) predicting a second temperature of a print head element at the beginning of a second subinterval associated with the second color component;",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 18 , further comprising steps of:",
            "components": [
                {
                    "component": "(D) identifying a first energy based on the first temperature and the first value;",
                    "subcomponents": []
                },
                {
                    "component": "(E) providing the first energy to the print head element during the first subinterval;",
                    "subcomponents": []
                },
                {
                    "component": "(F) identifying a second energy based on the second temperature and the second value; and",
                    "subcomponents": []
                },
                {
                    "component": "(G) providing the second energy to the print head element during the second subinterval.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method, of claim 18 , wherein the pixel comprises one of a plurality of pixels in a digital image, and wherein the method further comprises a step of performing steps (A)-(C) for each of the plurality of pixels.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The method of claim 18 , wherein the step (B) comprises a step of predicting the first temperature based on the first value and a temperature of a print head of which the print head element is a component.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The method of claim 21 , wherein the step (B) comprises a step of predicting the first temperature based on the first value, the temperature of the print head, and at least one property selected from the group consisting of an ambient printer temperature and a current humidity.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The method of claim 18 , wherein the step (B) comprises a step of predicting the first temperature using a temperature model with a first set of parameters associated with the first color component, and wherein the step (C) comprises a step of predicting the second temperature using the temperature model with a second set of parameters associated with the second color component, the first set differing from the second set.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. A device comprising:",
            "components": [
                {
                    "component": "first identification means for identifying a density of a pixel in a digital image, the density including a first color component having a first value and a second color component having a second value, said first color being different than said second color;",
                    "subcomponents": []
                },
                {
                    "component": "first prediction means for predicting a first temperature of a print head element at the beginning of a first subinterval associated with the first color component; and",
                    "subcomponents": []
                },
                {
                    "component": "second prediction means for predicting a second temperature of a print head element at the beginning of a second subinterval associated with the second color component;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the first subinterval differs in duration from the second subinterval.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The device of claim 24 , further comprising:",
            "components": [
                {
                    "component": "second identification means for identifying a first energy based on the first temperature and the first value; first energy provision means for providing the first energy to the print head element during the first subinterval;",
                    "subcomponents": []
                },
                {
                    "component": "third identification means for identifying a second energy based on the second temperature and the second value; and",
                    "subcomponents": []
                },
                {
                    "component": "second energy provision means for providing the second energy to the print head element during the second subinterval.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The device of claim 24 , wherein the first prediction means comprises means for predicting the first temperature based on the first value and a temperature of a print head of which the print head element is a component.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The device of claim 26 , wherein the first prediction means comprises means for predicting the first temperature based on the first value, the temperature of the print head, and at least one Property selected from the group consisting of an ambient printer temperature and a current humidity.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The device of claim 24 , wherein the first prediction means comprises means for predicting the first temperature using a temperature model with a first set of parameters associated with the first color component, and wherein the second prediction means comprises means for predicting the second temperature using the temperature model with a second set of parameters associated with the second color component, the first set differing from the second set.",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation-in-part of U.S. patent application Ser. No. 10/831,925, filed on Apr. 26, 2004, entitled “Thermal Response Correction System,” which is a continuation-in-part of U.S. patent application Ser. No. 09/934,703, filed on Aug. 22, 2001, entitled “Thermal Response Correction System,” now U.S. Pat. No. 6,819,347 B2 which are both hereby incorporated by reference.",
        "This application is related to a copending and commonly owned U.S. patent application Ser. No. 10/151,432, filed on May 20, 2002, entitled “Thermal Imaging System,”, now U.S. Pat. No. 6,801,233 B2 which is hereby incorporated by reference.",
        "1. Field of the Invention",
        "The present invention relates to thermal printing and, more particularly, to techniques for improving thermal printer output by compensating for the effects of thermal history on thermal print heads.",
        "2. Related Art",
        "Thermal printers typically contain a linear array of heating elements (also referred to herein as “print head elements”) that print on an output medium by, for example, transferring pigment or dye from a donor sheet to the output medium or by activating a color-forming chemistry in the output medium. The output medium is typically a porous receiver receptive to the transferred pigment, or a paper coated with the color-forming chemistry. Each of the print head elements, when activated, forms color on the medium passing underneath the print head element, creating a spot having a particular density. Regions with larger or denser spots are perceived as darker than regions with smaller or less dense spots. Digital images are rendered as two-dimensional arrays of very small and closely-spaced spots.",
        "A thermal print head element is activated by providing it with energy. Providing energy to the print head element increases the temperature of the print head element, causing either the transfer of pigment to the output medium or the formation of color in the receiver. The density of the output produced by the print head element in this manner is a function of the amount of energy provided to the print head element. The amount of energy provided to the print head element may be varied by, for example, varying the amount of power to the print head element within a particular time interval or by providing power to the print head element for a longer time interval.",
        "In conventional thermal printers, the time during which a digital image is printed is divided into fixed time intervals referred to herein as “print head cycles.” Typically, a single row of pixels (or portions thereof) in the digital image is printed during a single print head cycle. Each print head element is typically responsible for printing pixels (or sub-pixels) in a particular column of the digital image. During each print head cycle, an amount of energy is delivered to each print head element that is calculated to raise the temperature of the print head element to a level that will cause the print head element to produce output having the desired density. Varying amounts of energy may be provided to different print head elements based on the varying desired densities to be produced by the print head elements.",
        "One problem with conventional thermal printers results from the fact that their print head elements retain heat after the conclusion of each print head cycle. This retention of heat can be problematic because, in some thermal printers, the amount of energy that is delivered to a particular print head element during a particular print head cycle is typically calculated based on an assumption that the print head element's temperature at the beginning of the print head cycle is a known fixed temperature. Since, in reality, the temperature of the print head element at the beginning of a print head cycle depends on (among other things) the amount of energy delivered to the print head element during previous print head cycles, the actual temperature achieved by the print head element during a print head cycle may differ from the desired temperature, thereby resulting in a higher or lower output density than is desired. Further complications are similarly caused by the fact that the current temperature of a particular print head element is influenced not only by its own previous temperatures—referred to herein as its “thermal history”—but by the ambient (room) temperature and the thermal histories of other print head elements in the print head.",
        "As may be inferred from the discussion above, in some conventional thermal printers, the average temperature of each particular thermal print head element tends to gradually rise during the printing of a digital image due to retention of heat by the print head element and the over-provision of energy to the print head element in light of such heat retention. This gradual temperature increase results in a corresponding gradual increase in density of the output produced by the print head element, which is perceived as increased darkness in the printed image. This phenomenon is referred to herein as “density drift.”",
        "Furthermore, conventional thermal printers typically have difficulty accurately reproducing sharp density gradients between adjacent pixels both across the print head and in the direction of printing. For example, if a print head element is to print a black pixel following a white pixel, the ideally sharp edge between the two pixels will typically be blurred when printed. This problem results from the amount of time that is required to raise the temperature of the print head element to print the black pixel after printing the white pixel. More generally, this characteristic of conventional thermal printers results in less than ideal sharpness when printing images having regions of high density gradient.",
        "The above-referenced patent applications disclose a model of a thermal print head that predicts the thermal response of thermal print head elements to the provision of energy to the print head elements over time. The amount of energy to provide to each of the print head elements during a print head cycle in order to produce a spot having the desired density is calculated based on: (1) the desired density to be produced by the print head element during the print head cycle, (2) the predicted temperature of the print head element at the beginning of the print head cycle, (3) the ambient printer temperature at the beginning of the print head cycle, and (4) the ambient relative humidity.",
        "The techniques disclosed therein assume that printing is performed in equal time steps, and therefore calculate the input energy in equal time steps, each corresponding to the time taken to print a single pixel on the thermal medium. In particular, the disclosed techniques implement a thermal model for the thermal print head. The thermal model is composed of multiple layers, each having a different spatial and temporal resolution. The resolutions for the layers are chosen for a combination of accuracy and computational efficiency.",
        "Furthermore, the techniques disclosed in the above-referenced patent applications implement a media model that computes the energy needed to print a desired optical density on the medium, given the current temperature profile of the print element. The media model is expressed in terms of two functions of the desired density, G(d) and S(d). G(d) corresponds to the inverse gamma function at a specified reference temperature, and S(d) is the sensitivity of the inverse gamma function to temperature at a fixed density.",
        "The assumption that all print intervals are of equal duration may not be valid under all circumstances. For example, in the system disclosed in the above-referenced patent application entitled “Thermal Imaging System,” the print head is capable of writing two colors in a single pass on a single print medium. Each print line time is divided into two parts. It is possible to write one color in one part of the line time and another color in another part of the line time. The time division between the two colors, however, may not be equal. For example, if printing yellow and magenta, the yellow may be printed during a smaller fraction of the line time interval than magenta. An attempt to apply the thermal history control techniques disclosed above to such a print mechanism may, therefore, produce suboptimal results, because the assumption of equally-sized print intervals would be violated.",
        "What is needed, therefore, are improved techniques for controlling the temperature of print head elements in a thermal printer having unequally-sized print intervals to more accurately render digital images.",
        "Techniques are disclosed for performing thermal history control in a thermal printer in which a single thermal print head prints sequentially on multiple color-forming layers in a single pass. Each pixel-printing interval may be divided into subintervals, which may be of unequal duration. Each sub-interval may be used to print a different color. The manner in which the input energy to be provided to each print head element is selected may be varied for each of the subintervals. For example, although a single thermal model may be used to predict the temperature of the print head elements in each of the subintervals, different parameters may be used in the different subintervals. Similarly, different energy computation functions may be used to compute the energy to be provided to the print head in each of the subintervals based on the predicted print head element temperature.",
        "For example, in one aspect of the present invention, a method is provided which includes steps of: (A) identifying a density of a pixel in a digital image, the density including: (1) a first color component associated with a first printing subinterval of a printing line time and having a first value, and (2) a second color component associated with a second printing subinterval of the printing line time and having a second value; (B) identifying a first print head element temperature; (C) identifying a first energy computation function associated with the first color component; (D) identifying a first input energy using the first energy computation function based on the first value and the first print head element temperature; (E) identifying a second print head element temperature; (F) identifying a second energy computation function associated with the second color component; and (G) identifying a second input energy using the second energy computation function based on the second value and the second print head element temperature.",
        "In another aspect of the present invention, a method is provided which includes steps of: (A) identifying a density of a pixel in a digital image, the density including a first color component having a first value and a second color component having a second value; (B) predicting a first temperature of a print head element at the beginning of a first subinterval associated with the first color component; and (C) predicting a second temperature of a print head element at the beginning of a second subinterval associated with the second color component; wherein the first subinterval differs in duration from the second subinterval.",
        "Additional aspects and embodiments of the present invention will be described in more detail below.",
        "FIG. 1A is a diagram illustrating pixel-printing intervals in a thermal printer in which pixels are printed in successive time steps of equal duration;",
        "FIG. 1B is a diagram illustrating pixel-printing intervals in a printer in which each pixel is printed using a plurality of time steps of possibly unequal duration;",
        "FIG. 1C is a diagram of a multi-color digital image according to one embodiment of the present invention;",
        "FIG. 2A is a flowchart of a method performed in one embodiment of the present invention to perform thermal history control on a digital image;",
        "FIG. 2B is a flowchart of a method that is used in one embodiment of the present invention to predict a print head element temperature using parameters associated with one of a plurality of pixel-printing subintervals;",
        "FIG. 2C is a flowchart of a method performed in one embodiment of the present invention to calculate the input energy to provide to a print head element using functions associated with one of a plurality of pixel-printing subintervals;",
        "FIG. 2D is a flowchart of a method that is used in one embodiment of the present invention to compute the input energy to provide to a thermal printer based on the current media temperature;",
        "FIG. 2E is a flowchart of a method performed in one embodiment of the present invention to precompute functions used in the method of FIG. 2A and thereby to obtain an increase in computational efficiency; and",
        "FIG. 2F is a flowchart of a method performed in one embodiment of the present invention to modify the method of FIG. 2A to take into account changes in ambient printer temperature over time.",
        "Techniques are disclosed for performing thermal history control in a thermal printer in which a single thermal print head prints sequentially on multiple color-forming layers in a single pass. Each pixel-printing interval may be divided into subintervals, which may be of unequal duration. Each sub-interval may be used to print a different color. The manner in which the input energy to be provided to each print head element is selected may be varied for each of the subintervals. For example, although a single thermal model may be used to predict the temperature of the print head elements in each of the subintervals, different parameters may be used in the different subintervals. Similarly, different energy computation functions may be used to compute the energy to be provided to the print head in each of the subintervals based on the predicted print head element temperature.",
        "For example, in the above-referenced patent applications, techniques are disclosed for performing thermal history control by computing the input energy to provide to a print head element at each of a plurality of successive time steps based on the predicted temperature of the print head element at the beginning of each of the time steps and a plurality of 1-D functions of desired density. All of the time steps are assumed to be of equal duration, and each time step is assumed to be equal in duration to the amount of time required to print a single pixel. For example, referring to FIG. 1A, a diagram is shown illustrating such a pixel printing scheme. The diagram illustrates a plurality of successive time steps 102a-c of equal duration. Each of the time steps 102a-c corresponds to one of a plurality of pixel-printing times 104a-c. In other words, a single pixel is printed during each of the successive time steps 102a-c.",
        "A thermal model may be used to predict the temperature of each thermal print head element at the beginning of each of the time steps 102a-c. An energy computation function may then be used to compute the input energy to provide to each of the print head elements during each of the time steps 102a-c. The computed energies may be provided to the print head elements during each of the corresponding pixel-printing intervals to print pixels of the appropriate densities.",
        "The above-referenced patent application entitled “Thermal Imaging System” describes a thermal printing system in which a single thermal print head prints sequentially on multiple color-forming layers in a single pass. In such a system, each pixel-printing time may be divided into two or more sub-intervals, each corresponding to the time during which printing is accomplished on each of the different color-forming layers. Such subintervals typically are of different durations.",
        "For example, referring to FIG. 1B, a diagram is shown illustrating such a pixel printing scheme, in which a single print head alternately prints two colors in a single pass. For purposes of example, the diagram illustrates a plurality of successive time steps 106a-f of unequal duration. Each successive pair of time steps 106a-f corresponds to one of a plurality of pixel-printing times 108a-c. In particular, time steps 106a-b correspond to pixel-printing time 108a, time steps 106c-d correspond to pixel-printing time 108b, and time steps 106e-f correspond to pixel-printing time 108c.",
        "In each pair of time steps 106a-f, the first step corresponds to a pixel-printing subinterval in which a first color is printed, and the second step corresponds to a pixel-printing subinterval in which a second color is printed. For example, the first color may be printed during subintervals corresponding to time steps 106a, 106c, and 106e, while the second color may be printed during subintervals corresponding to time steps 106b, 106d, and 106f.",
        "Note that the system illustrated in FIG. 1B differs from the system illustrated in FIG. 1A in two ways: (1) the time steps 102a-c in FIG. 1A are of equal duration, while the time steps 106a-f in FIG. 1B are of unequal duration; and (2) the print head prints a single color in FIG. 1A, while the print head alternately prints two colors on two color-forming layers in FIG. 1B.",
        "The thermal history control techniques disclosed in the above-referenced patent applications may be modified to accommodate the features of the system shown in FIG. 1B. For example, in one embodiment of the present invention, techniques are provided for predicting the temperature of the print head elements at the beginnings of successive time steps of unequal duration. In another embodiment of the present invention, techniques are provided for computing the energies to provide to the print head elements based on properties of the color-forming layer on which the print head elements are printing. Both techniques may be combined with each other, thereby providing the ability to perform thermal history control in a printer which is capable of printing sequentially on multiple color-forming layers using printing subintervals of unequal durations.",
        "Referring to FIG. 2A, a flowchart is shown of a method 200 that is performed in one embodiment of the present invention to perform thermal history control on a digital image. As described in more detail below, the method 200 may predict the temperature of each of a plurality of print head elements at the beginning of each of a plurality of pixel-printing time subintervals. The subintervals may, for example, be of unequal duration, as in the case of the subintervals 106a-f shown in FIG. 1B. Furthermore, the method 200 may vary the energy computation function that is used to calculate the input energy to provide to the print head elements during the subintervals.",
        "Assume that the method 200 is used to print a multi-color digital image including a plurality of pixels. Assume further that the image is represented in three dimensions: width, length, and color. Such an image may be transformed into an equivalent two-dimensional image with interleaved lines of alternating color, effectively combining the length and the color into a single dimension.",
        "For example, referring to FIG. 1C, a diagram is shown illustrating a two-dimensional 2-color digital image 110, which includes alternating lines of pixels with colors 0 and 1. Each line is tagged to indicate its color. For example, image 110 includes a first tag 112a specifying color 0, thereby indicating that the subsequent line 114a of pixels has color 0. Second tag 112b specifies color 1, thereby indicating that the subsequent line 114b of pixels has color 1. Third tag 112c specifies color 0, thereby indicating that the subsequent line 114c of pixels has color 0. Tag 112d specifies color 1, thereby indicating that the subsequent line 114d of pixels has color 1. It should be appreciated from FIG. 1C that the image 110 may include subsequent lines of similarly-tagged pixels. The digital image 110 may thereby represent a multi-color image using a single linear array of tags and pixel lines. Assume in the following discussion of FIG. 2 that the digital image to be printed is represented in this manner.",
        "Representing the image 110 in the format illustrated in FIG. 1C enables the thermal history control techniques disclosed in the above-referenced patent applications to be applied straightforwardly to the image 110, assuming that the line times are equal for all colors and that the color-forming chemistry is the same for all colors. If, however, either or both of these assumptions are not valid, then the differences in line times and/or color-forming chemistry should be taken into account when performing thermal history control to obtain optimal results. Examples of techniques will now be described for applying the previously-disclosed thermal history control techniques when the line times and/or color forming chemistry differs from color to color. It should be assumed that aspects of the thermal history control algorithm which are not described explicitly herein may be implemented in the manner disclosed in the above-referenced patent applications.",
        "The method 200 initializes a time t to zero (step 202). The time t=0 may, for example, correspond to the beginning of subinterval 106a in FIG. 1B. The method 200 enters a loop over each line n in the image to be printed (step 204). The method 200 identifies the subinterval c of the current line n (step 206). The method 200 may, for example, identify the subinterval c using the color tag preceding line n, assuming that there is a one-to-one correspondence between colors and subintervals (FIG. 1C).",
        "In one embodiment of the present invention, each of the subintervals is associated with a possibly distinct energy computation function. The method 200 identifies an energy computation function Fc corresponding to the subinterval c (step 208). Examples of techniques that may be used to identify the energy computation function will be described below with respect to FIG. 2C.",
        "The method 200 identifies the duration D of subinterval c (step 210). As shown in FIG. 1B, the duration of subinterval c may differ from the duration of other subintervals in the same pixel-printing time. For example, subinterval 106a is shorter in duration than subinterval 106b.",
        "The method 200 enters a loop over each pixel j in line n (step 212). In one embodiment of the present invention, a thermal model is provided for predicting the temperature of print head elements at the beginning of pixel-printing subintervals. Such a thermal model may, for example, be implemented in the manner described in the above-referenced patent applications. In one embodiment of the present invention, each pixel-printing subinterval is associated with a possibly distinct set of thermal model parameters. Returning to FIG. 2A, the method 200 uses the thermal model parameters associated with subinterval c to predict the relative temperature T of the print head element that is to print pixel j at time t (step 214). Examples of techniques that may be used to perform step 214 are described below with respect to FIG. 2B.",
        "The thermal model described in the above-referenced patent application includes a plurality of layers, each of which may be associated with one or more relative temperatures. Although step 214 only refers to the finest-resolution layer in the thermal model, those having ordinary skill in the art will appreciate that generating the relative temperature predictions in step 214 will involve updating relative temperature predictions in other layers of the model.",
        "The method 200 predicts the absolute temperature Th of the print head element that is to print pixel j at time t using the relative temperature T of the print head element (step 216). (Note that the variable Ta represented the absolute temperature in patent application Ser. No. 09/934,703, while the variable Th represented the absolute temperature in patent application Ser. No. 10/831,925.) As will be described in more detail below, the print head element temperature prediction techniques disclosed in the above-referenced patent applications may be modified to implement step 216.",
        "The method 200 computes the input energy E based on the print density d and the absolute print head element temperature Th (step 218). The method 200 provides the computed energy E to the appropriate print head element for the duration of the subinterval c (step 220).",
        "The method 200 repeats steps 214-220 for the remaining pixels in the current line n (step 222). The method 200 advances time t to the beginning of the next subinterval by adding D to t (step 224). For example, if the current value of t points to the beginning of subinterval 106a, , then adding the duration of subinterval 106a to t would cause t to point to the beginning of the next subinterval 106b.",
        "The method 200 repeats steps 206-224 for the remaining lines in the image to be printed (step 226). The method 200 thereby performs thermal history control on the digital image. As illustrated by the preceding description, the method 200 may take into account the unequal durations of the time steps 106a-f when predicting the relative and absolute temperatures of print head elements. Additionally or alternatively, the method 200 may take into account the different thermal characteristics of the different color-forming layers of the print medium when selecting either or both of: (1) the thermal model parameters, and (2) the energy computation function.",
        "In the above-referenced U.S. patent application. Ser. No. 09/934,703, entitled “Thermal Response Correction System,” the following equations were used to update relative temperature predictions:\n\nT(i)(n,j)=T(i)(n−1,j)αi+AiE(i)(n−1,j)   Equation 1\n\nT(i)(n,j)=(1−2ki)T(i)(n,j)+ki(T(i)(n,j−1)+T(i)(n,j+1))   Equation 2",
        "As described in more detail in that patent application, absolute temperatures Th of the print head elements may be predicted based on the relative temperatures T. Recall that the thermal model includes a plurality of layers. The notation T(i)(n,j) refers to the relative temperature at layer i and index j at the beginning of print head cycle n. T(0)(n,j) refers to the relative temperature of layer 0, which has a one-to-one correspondence with the print head elements.",
        "Equation 1 depends on two parameters, αi and Ai, whose values depend on the size of the time step. Therefore, to apply Equation 1 to time steps of unequal duration, the values of these two parameters may be alternated from one time-step to the next, in sequence with the change of the step size. Likewise, Equation 2 depends on a parameter ki, that is also changed in sequence with the step size.",
        "For example, let C be the number of color-forming layers (and therefore also the number of subintervals). Distinct values of αi(c), Ai(c), and ki(c) may be selected for 0≦c<C. Then, the relative print head element temperature T(0)(n,j) may be identified for each subinterval using the method shown in FIG. 2B, thereby implementing step 214 of method 200 (FIG. 2A). For subinterval c, values of αi(c) (step 230), Ai(c) (step 232), and ki(c) (step 234) are identified. The relative head element temperature T(0) at the beginning of subinterval c may then be predicted using the parameter values identified in steps 230-234 (step 236). In particular, Equation 1 and Equation 2 may be modified as follows for use in step 226:\n\nT(i)(n,j)=T(i)(n−1,j)αi(c)+Ai(c)E(i)(n−1,j)   Equation 3\n\nT(i)(n,j)=(1−2ki(c))T(i)(n,j)+ki(c)(T(i)(n,j−1)+T(i)(n,j+1))   Equation 4",
        "In one embodiment of the present invention, thermal model parameters are only varied from color to color at the finest-resolution layer (i=0) of the thermal model. One way to accomplish this result is to use the same parameter values for each subinterval in all layers of the thermal model other than layer 0.",
        "As described above, the above-referenced patent application entitled “Thermal Imaging System” describes a thermal printing system in which a single thermal print head prints sequentially on multiple color-forming layers in a single pass. Each of the color-forming layers typically has different thermal characteristics. Therefore, in one embodiment of the present invention, the input energy to provide to the print head is computed using a different energy computation function for each color-forming layer (i.e., for each color). The energy computation function may compute the input energy based on a predicted head element temperature. The head element temperature may be computed using a head element temperature model that differs for each color-forming layer (i.e., for each color). For example, one or more parameters of the head temperature model may be modified for each of the color-forming layers.",
        "As described in the above-referenced U.S. patent application Ser. No. 10/831,925, entitled “Thermal Response Correction System,” the energy computation function may be expressed as shown in Equation 5:\n\nE=F(d,Th)   Equation 5",
        "In Equation 5, E is the input energy, d is the desired density of the pixel to be printed, and Th is the (predicted or measured) absolute print head element temperature at the beginning of a subinterval. As further described in the above-referenced patent application, additional parameters may be added to the energy computation function, such as the ambient printer temperature Tr and the relative humidity RH to take such quantities into account when computing the input energy E. For purposes of simplicity, the following discussion will refer to the two-parameter Equation 5, although those having ordinary skill in the art will understand how to apply the description below to energy computation functions which further incorporate the ambient printer temperature Tr and the relative humidity RH.",
        "The energy computation function shown in Equation 5 may be approximated by the function shown in Equation 6:\n\nE=G(d)+S(d)Th   Equation 6",
        "In Equation 6, G(d) corresponds to the inverse gamma function at a specified reference temperature of zero, and S(d) is the sensitivity of the inverse gamma function to temperature variations away from the reference temperature at a fixed density. In one embodiment of the present invention, different G(d) and S(d) functions are used to compute the input energy to be provided for each of the color-forming layers. For example, in a system which uses a print medium having three color-forming layers, three distinct G(d) and S(d) functions may be used.",
        "Such multiple functions may, for example, be represented by functions Gc(d) and Sc(d), for 0≦c<C. Then, the energy computation function Fc may be identified using the method shown in FIG. 2C, thereby implementing step 208 of method 200 (FIG. 2A). For subinterval c, functions Gc(d) (step 252) and Sc(d) (step 254) are identified. The energy computation function Fc may then be identified as the function Fc(d, Th)=Gc(d)+Sc(d)Th (step 256).",
        "With the modifications described above, the thermal history control algorithm maintains a running estimate of the temperature profile of the thermal print head and applies the appropriate thermal corrections to the energies applied to the heaters while writing on each of the color-forming layers. As is apparent from the description herein, the method may be used in conjunction with any number of color-forming layers, in which case there is a longer sequence of unequal time steps, with corresponding parameters αi, Ai, and ki, for each size of time step, and functions G(d) and S(d) for each associated color-forming layer.",
        "The above-referenced patent application Ser. No. 10/831,925 discloses techniques for taking changes in ambient printer temperature into account when performing thermal history control. Examples of techniques will now be described for taking changes in ambient printer temperature into account when performing thermal history control in a thermal printer in which a single thermal print head prints sequentially on multiple color-forming layers in a single pass.",
        "As described in more detail in the above-referenced patent application Ser. No. 10/831,925, the input energy may be computed based on the media temperature Tm rather than the print head element temperature Th, using Equation 7:\n\nE=G′(d)+S′(d)Tm   Equation 7",
        "In Equation 7, G′(d) and S′(d) are related to the functions G(d) and S(d). For short printer line times, the media temperature Tm may be approximated by Equation 8:\n\nTm=Tr+Am(Th−Tr)   Equation 8",
        "Tr represents the ambient temperature of the printer. Am is a constant derived from the printer line time and thermal characteristics of the media. As noted above, the thermal characteristics of the media and the subinterval duration may vary from subinterval to subinterval. Therefore, in one embodiment of the present invention, a different value of Am is used in each of the subintervals. Am(c) refers herein to the value of Am for subinterval c.",
        "For example, referring to FIG. 2D, a flowchart is shown of a method 260 that is used in one embodiment of the present invention to compute the input energy E based on the current media temperature Tm. In the embodiment illustrated in FIG. 2D, the media temperature Tm is computed for each pixel.",
        "The method 260 begins after step 216 of the method 200 shown in FIG. 2A. The method 260 identifies the ambient printer temperature Tr, as described in the above-referenced patent applications (step 262). The method 260 identifies the value of Am(c) that corresponds to subinterval c (step 264). The method 260 identifies the media temperature Tm based on the values of Am(c), Th, and Tr, such as by using Equation 8 (step 266).",
        "Recall that the energy computation function Fc for subinterval c was previously identified in step 208. In the case of the method 260 shown in FIG. 2D, the energy computation function Fc may be a function of density d and media temperature Tm, rather than a function of density d and print head temperature Th as described above with respect to FIG. 2A. Such an energy computation function may, for example, have the form shown in Equation 7, in which case there may be distinct functions G′c(d) and S′c(d) for each subinterval c. The method 260 computes the input energy E based on the density d and the media temperature Tm using the identified energy computation function (step 270). The method 260 then proceeds to step 220 of the method 200 shown in FIG. 2A.",
        "As described in the above-referenced patent application Ser. No. 10/831,925, the ambient printer temperature Tr will typically have a long time constant and therefore may not be expected to change significantly during a single print job. Referring to FIG. 2E, a flowchart is shown of a method 272 for applying the precomputation techniques disclosed in the above-referenced patent application to the method 200 shown in FIG. 2A. The method 272 identifies the ambient temperature Tr (step 262), as described above with respect to FIG. 2D. The method 272 precomputes the functions G(·) and S(·) for all values of c using the identified value of Tr (step 276). Step 276 may, for example, be implemented using Equation 9 and Equation 10:\n\nG(d,Tr)=G′(d)+S′(d)(1−Am(c))Tr   Equation 9\n\nS(d)=S′(d)Am(c)   Equation 10",
        "The method 272 then performs steps 202, 204, and 206, as described above with respect to the method 200 of FIG. 2A. The method 272 then identifies the energy computation function Fc for subinterval c based on the precomputed functions G(·) and S(·) (step 278). Having identified these functions, the method 272 performs steps 210-226 (from method 200 of FIG. 2A) using the identified function Fc.",
        "In another embodiment described in the above-referenced patent application Ser. No. 10/831,925, a correction term is added to a thermistor temperature Ts to take into account changes in ambient printer temperature over time, using Equation 11:\n\nT′s=Ts+ftΔTr  Equation 11",
        "The adjusted thermistor temperature T′s is then used to perform thermal history control. In Equation 11, ΔTr=Tr−Trc (the difference between the current ambient printer temperature and the ambient printer temperature at which the thermal history control algorithm was calibrated). The correction factor ft, is given by Equation 12:",
        "f\n          t\n        \n        =\n        \n          \n            (\n            \n              1\n              -\n              \n                A\n                m\n              \n            \n            )\n          \n          \n            A\n            m\n          \n        \n      \n    \n    \n      \n        Equation\n        ⁢\n        \n          \n        \n        ⁢\n        12",
        "The correction factor ft shown in Equation 11 and Equation 12, however, is valid only for a particular color (i.e., for a particular value of c) corresponding to the value of Am. Attempts to apply such a correction factor to other colors will produce suboptimal results. In one embodiment of the present invention, the use of the correction factor ft is modified to apply to a printer that prints sequentially on multiple color-forming layers in a single pass. For example, ft may be made an express function of c, by using the subinterval-dependent values of Am(c), as shown in Equation 13:",
        "f\n            t\n          \n          ⁡\n          \n            (\n            c\n            )\n          \n        \n        =\n        \n          \n            (\n            \n              1\n              -\n              \n                \n                  A\n                  m\n                \n                ⁡\n                \n                  (\n                  c\n                  )\n                \n              \n            \n            )\n          \n          \n            \n              A\n              m\n            \n            ⁡\n            \n              (\n              c\n              )\n            \n          \n        \n      \n    \n    \n      \n        Equation\n        ⁢\n        \n          \n        \n        ⁢\n        13",
        "A distinct correction factor ft(c) may thereby be obtained for each value of c. If we select the value of ft in Equation 11 based on the thermal characteristics of a single one of the color-forming layers, for example c=c0, then the corrected thermistor temperature is given by Equation 14:\n\nT′s=Ts+ft(c0)ΔTr   Equation 14",
        "Any value may be selected for c0. Since the corrected thermistor temperature propagates down to the absolute temperature of all the sub-intervals as described in the above referenced U.S. patent application Ser. No. 09/934,703, the correction is inaccurate for all color forming layers other than c=c0.",
        "In one embodiment of the present invention, additional corrections δ(c) are then selected for each of the color-forming layers (i.e., for 0≦c<C), as shown in Equation 15:\n\nδ(c)=(ft(c)−ft(c0))ΔTr   Equation 15",
        "The net correction may then be added to the absolute temperatures of each of the color-forming layers as in Equation 16.\n\nT′h=Th+δ(c)   Equation 16",
        "The appropriate value of δ(c) may then be selected and used in Equation 16 for each subinterval when performing thermal history control. For example, referring to FIG. 2F, a flowchart is shown of a method 280 for modifying the method 200 of FIG. 2A in the manner just described. The method 280 identifies the ambient temperature Tr (step 262) in the manner described above with respect to FIG. 2D. The method 280 selects a value for c0 (step 282) and calculates ft(c) using Equation 13 with c=c0 (step 284). The method 280 calculates δ(c) for all values of c using Equation 15 (step 286).",
        "The method 280 performs steps 202-216 as described above with respect to FIG. 2A. After predicting the absolute temperature Th (step 216), the method 280 identifies the modified absolute temperature T′h using Equation 16 (step 288). The method 280 computes the input energy E based on the print density d and the modified print head element temperature T′h (step 290). The method 280 performs steps 220-226 as described above with respect to FIG. 2A.",
        "Note that for c=c0, δ(c)=0. Therefore, as may be seen from Equation 16, no correction to Th is needed for the color-forming layer for which c=c0, thereby obtaining some savings in computation in steps 288-290. The techniques disclosed herein may be combined with the techniques disclosed in the above-referenced patent application to take the relative humidity into account when performing thermal history control.",
        "The techniques disclosed herein have a variety of advantages. For example, the techniques disclosed herein may be applied to perform thermal history control in a thermal printer in which a single thermal print head prints sequentially on multiple color-forming layers in a single pass. By applying different energy computation functions to different color-forming layers, the techniques disclosed herein enable the thermal history control to be optimized for each of the color-forming layers, thereby improving the quality of printed output. By applying different thermal model parameters to different color-forming layers, the techniques disclosed herein may be used to model the thermal response of the output medium during printing subintervals of unequal duration. As a result, the thermal history control algorithm may be used in conjunction with printers having such unequal subintervals, thereby improving the quality of printed output. Such use of varying energy computation functions and thermal model parameters may be used in combination, thereby optimizing the thermal history control algorithm for use with thermal printers in which a single thermal print head prints sequentially on multiple color-forming layers in a single pass using pixel-printing subintervals of unequal duration.",
        "Furthermore, the techniques disclosed herein have the advantages disclosed in the above-referenced patent applications. For example, the techniques disclosed herein reduce or eliminate the problem of “density drift” by taking the current ambient temperature of the print head and the thermal and energy histories of the print head into account when computing the energy to be provided to the print head elements, thereby raising the temperatures of the print head elements only to the temperatures necessary to produce the desired densities. A further advantage of various embodiments of the present invention is that they may either increase or decrease the input energy provided to the print head elements, as may be necessary or desirable to produce the desired densities.",
        "In general, the techniques described above may be implemented, for example, in hardware, software, firmware, or any combination thereof. The techniques described above may be implemented in one or more computer programs executing on a programmable computer and/or printer including a processor, a storage medium readable by the processor (including, for example, volatile and non-volatile memory and/or storage elements), at least one input device, and at least one output device. Program code may be applied to data entered using the input device to perform the functions described herein and to generate output information. The output information may be applied to one or more output devices.",
        "Printers suitable for use with various embodiments of the present invention typically include a print engine and a printer controller. The printer controller may, for example, receive print data from a host computer and generates page information to be printed based on the print data. The printer controller transmits the page information to the print engine to be printed. The print engine performs the physical printing of the image specified by the page information on the output medium.",
        "Elements and components described herein may be further divided into additional components or joined together to form fewer components for performing the same functions.",
        "Each computer program within the scope of the claims below may be implemented in any programming language, such as assembly language, machine language, a high-level procedural programming language, or an object-oriented programming language. The programming language may be a compiled or interpreted programming language.",
        "Each computer program may be implemented in a computer program product tangibly embodied in a machine-readable storage device for execution by a computer processor. Method steps of the invention may be performed by a computer processor executing a program tangibly embodied on a computer-readable medium to perform functions of the invention by operating on input and generating output.",
        "It is to be understood that although the invention has been described above in terms of particular embodiments, the foregoing embodiments are provided as illustrative only, and do not limit or define the scope of the invention. Other embodiments are also within the scope of the present invention, which is defined by the scope of the claims below. Other embodiments that fall within the scope of the following claims includes include, but are not limited to, the following."
    ],
    "citations": [
        "4070587",
        "4284876",
        "4309712",
        "4347518",
        "4364063",
        "4391535",
        "4415908",
        "4443121",
        "4464669",
        "4514738",
        "4524368",
        "4563691",
        "4607262",
        "4688051",
        "5006866",
        "5066961",
        "5086306",
        "5115252",
        "5132703",
        "5132709",
        "5162813",
        "5184150",
        "5248995",
        "5268706",
        "5422662",
        "5539443",
        "5576745",
        "5623297",
        "5625399",
        "5642148",
        "5644351",
        "5646672",
        "5706044",
        "5719615",
        "5800075",
        "5808653",
        "5841461",
        "5889546",
        "5999204",
        "6186683",
        "6537410",
        "2003/0043251",
        "2003/0125206",
        "0 110 675",
        "0 790 131",
        "58-164368",
        "59-127781",
        "02-248264",
        "02-289364",
        "3-024972",
        "03-024972",
        "H03-24972"
    ],
    "us_classification": "347194",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "41",
            "subclass": "J",
            "main_group": "2",
            "subgroup": "00"
        }
    ]
}