{
    "title": "Opalescent glass-ceramic product",
    "abstract": "An opalescent glass-ceramic product, especially for use as a dental material or as an additive to or component of dental material, including SiO",
    "inventors": [
        "Krumbholz"
    ],
    "document_number": "07297645",
    "publication_date": "20071120",
    "assignees": [
        "Degudent GmbH"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An opalescent glass ceramic which is devoid of ZrO",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The opalescent glass ceramic according to claim 1 , wherein Me(II)O is present in an amount of 23.5% by weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The opalescent glass ceramic according to claim 1 , having a composition of:",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The opalescent glass ceramic according to claim 1 , which is a dental material or an additive for a dental material.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The opalescent glass ceramic according to claim 1 , wherein the thermal expansion coefficient (TEC) is in the range of 10.5-12.0×10",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A method for producing an opalescent glass ceramic which is devoid of ZrO",
            "components": [
                {
                    "component": "mixing together components consisting essentially of:",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method according to claim 6 , wherein the tempering of the frit comprises the steps of:",
            "components": [
                {
                    "component": "stacking the ground frit on quartz-coated fire-clay plates,",
                    "subcomponents": []
                },
                {
                    "component": "placing the fire-proof plates in a furnace heated to a temperature T with 850° C.≦T≦1000° C., thereby fusing the ground frit,",
                    "subcomponents": []
                },
                {
                    "component": "removing the plates from the furnace after a time t with 30 min≦t≦60 min, and",
                    "subcomponents": []
                },
                {
                    "component": "quenching the fused frit in a water bath.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method according to claim 6 , wherein the components are mixed in a gyro mixer.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method according to claim 6 , wherein the mixture is melted in a gas-heated drip-feed crucible furnace.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method according to claim 6 , wherein the filling and grinding step comprises filling the frit into a ball mill and grinding at about 10,000 revolutions per minute.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method according to claim 6 , wherein the ground frit is sifted through a sieve having a mesh size M in the range of 80 μm≦M≦120 μm.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method according to claim 7 , wherein the ground frit is fused at a temperature of 870 to 970° C.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method according to claim 6 , wherein the thermal expansion coefficient is set to 9.0-13.5×10",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method according to claim 6 , wherein the melting temperature of the opalescent glass ceramic is controlled to 870° C. to 970° C.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method according to claim 6 , wherein % by weight Al",
            "components": []
        }
    ],
    "description": [
        "This application is a filing under 35 USC 371 of PCT/EP2003/006644, filed Jun. 24, 2003.",
        "The invention relates to an opalescent glass ceramic, in particular an opalescent glass ceramic as a dental material or as an additive to or component of dental material, comprising at least the components SiO2, Al2O3, P2O5, Na2O, K2O, CaO and Me(IV)O2. Furthermore, the invention relates to a method for producing an opalescent glass ceramic as well as to the use of such a ceramic.",
        "Opalescent glasses are known, for example, from EP 0 622 342 B1. EP 0 622 342 B1 discloses an opalescent glass based on SiO2—B2O3—Al2O3—K2O—Na2O—CaO—BaO—SrO—TiO2—ZrO2—P2O5—CeO2. The linear thermal expansion coefficients (TEC) therein are either much too high (Examples 5, 15, 26, 27 with TEC≧15.1) or much too low (TEC≦10.8) to be usable for the preferred use of the material as a veneer ceramic for metal tooth restoration in pure form. To coat current alloys, a blending with further glasses is required.",
        "Moreover, tests have shown that the glass ceramic products known from EP 0 622 342 B1 are too dull, so that a good aesthetic appearance is not ensured. Overall, the opalescent glass ceramic products known from EP 0 622 342 B1 exhibit a too weak and only slightly bake-stable opalescence, and a too high opacity and have no fluorescence.",
        "A porcelain material intended for the dental field is known from U.S. Pat. No. 6,022,819. It has TiO2 or ZrO2 as components. The SiO2 content is preferably 50 to 85% by weight.",
        "The object of the present invention is to make available an opalescent glass ceramic product, a method for producing same as well as its use, which has improved opalescence with simultaneously improved transparency and a baking temperature or thermal expansion coefficients adapted to other materials as well as fluorescence.",
        "According to the invention, the object is essentially achieved by an opalescent glass ceramic product of the aforementioned type in which the opalescent glass ceramic is devoid of ZrO2 and TiO2, the glass ceramic product has a Me(II)O content of less than 4% by weight and the Me(IV)O2% by weight is from 0.5 to about 3% by weight. Preferably, it is provided that the Me(IV)O2 content is composed of 0-1% by weight CeO2 and O—2.5% by weight SnO2.",
        "In particular, the Me(II)O content is 2-3.5% by weight, preferably 2.5-3% by weight.",
        "A preferred composition contains the following components:",
        "Component\n% by weight\n\n\n\n\n\n\n\n\n\nSiO2\n 55-62\n\n\n\nAl2O3\n 13-17\n\n\n\nB2O3\n  0-2\n\n\n\nP2O5\n1.5-3\n\n\n\nLi2O\n  0-2\n\n\n\nNa2O\n  7-12\n\n\n\nK2O\n  8-12\n\n\n\nMgO\n  0-2\n\n\n\nCaO\n  1-≦4\n\n\n\nBaO\n  0-2\n\n\n\nTb2O3\n  0-3\n\n\n\nMe(IV)O2\n0.5-3\n\n\n\n\n\n\n\n\n\n\nthe indicated amount of Me(IV)O2 being composed of 0-1% by weight of CeO2 and 0-2.5% by weight SnO2.",
        "In particular, the composition of the glass ceramic is distinguished by:",
        "Component\n% by weight\n\n\n\n\n\n\n\n\n\nSiO2\n 58-60\n\n\n\nAl2O3\n 14-15\n\n\n\nP2O5\n2.3-2.6\n\n\n\nNa2O\n9.5-10.5\n\n\n\nK2O\n  9-10\n\n\n\nCaO\n2.8-3.0\n\n\n\nSnO2\n1.3-1.6\n\n\n\nCeO2\n0.3-0.4\n\n\n\nTb2O3\n  0-2.0",
        "According to the invention, an improved opalescence is obtained by demixing of the glasses based on P2O5 and SnO2 contents. The thermal expansion coefficient (TEC) of the ceramic according to the invention is in the range of 9.0-13.5×10−6/K and can be controlled by the K2O content.",
        "By additionally fusing CeO2 and/or Tb2O3, it can be attained that the glass ceramic fluoresces, a desirable property for dental ceramics. A strong, neutral fluorescence is obtained by combining both oxides.",
        "Furthermore, the applicable baking temperature of the ceramic can be controlled by the portion of B2O3, Li2O and Na2O and adapted to desired values. The applicable relevant baking temperature of the ceramics according to the invention are in the range of 870 to 970° C.",
        "On the whole, a glass ceramic is provided which satisfies all requirements with regard to aesthetic coating ceramics.",
        "A method for producing the glass ceramic according to the invention is characterized by the following procedural steps:\n\n    1) weighing in the components;\n    2) preferably mixing the mixture in a gyro mixer;\n    3) melting the mixture in a preferably gas-heated furnace such as a drip-feed crucible furnace, preferably at about 1500° C.;\n    4) quenching the molten mass coming out of the furnace in a water bath and subsequent drying;\n    5) short grinding of the frit thus obtained in a mill (e.g. ball mill);\n    6) tempering the frit;\n    7) after drying, filling the frit in a mill, such as a ball mill, and grinding, preferably to about 10000 revolutions;\n    8) sifting the ground frit through a sieve, the sieve opening forming the end.",
        "Preferably, the frit is tempered in the following manner:\n\n    a. stacking the ground frits on quartz-coated fire-clay plates,\n    b. placing the fire-clay plates in a furnace (e.g. electric furnace) heated to about 850-1000° C., and preferably 960° C.\n    c. removing the plates from the furnace after about 30-60 minutes, preferably 40 minutes,\n    d. quenching the fused frit cakes in a water bath.",
        "The ground frit is preferably sifted through a sieve having a mesh size M in the range of 80 μm≦M≦120 μm, preferably M=100 μm.",
        "Unlike the glass ceramic known from EP 0 622 342 B1, the glass ceramic according to the invention needs no ZrO2 and TiO2 and the Me (II)O content remains less than 3% by weight. Moreover, by melting in CeO2 and Tb2O3, the opal ceramic of the invention exhibits fluorescence. Furthermore, the baking temperature can be adapted to the desired application. The thermal expansion can be set by selective leucite crystallization in the ceramic according to the invention in such a way that it can be used especially for coating metal frame materials.",
        "Further details, advantages and features of the invention can be found in the preferred embodiments in the following description.",
        "The invention will be described with reference to the following embodiments, wherein the Tests 1, 2, 8 to 21 are preferred and Tests 11 and 13 especially preferred. The compositions of the opal ceramic can be found in Table 1.",
        "TABLE I\n\n\n\n\n\n\n\nTest\nIvo. 15\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n\n\n\n\n\n\n\n\n\n\n% by weight\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSiO2\n55.34\n59.78\n59.05\n60.01\n58.03\n56.22\n59.83\n55.53\n58.44\n58.93\n58.02\n59.08\n58.72\n\n\nAl2O3 \n16.09\n14.52\n14.63\n16.45\n15.91\n16.83\n16.4\n14.71\n14.23\n14.44\n14.34\n14.48 \n14.78\n\n\nB2O3\n0.22\n0.44\n0.44\n\n\n1.09\n1.07\n2.23\n0.44\n\n1.1\n\n\nP2O5\n2.59\n2.32\n2.42\n2.33\n2.38\n2.06\n1.4\n2.46\n2.44\n2.43\n2.43\n2.43\n2.44\n\n\nLi2O\n\n\n\n1.28\n1.31\n1.1\n1.29\n0.45\n\n\nNa2O\n9.08\n9.36\n9.3\n4.44\n6.39\n5.91\n6\n9.97\n9.84\n10.03\n10.01\n10.04\n9.13\n\n\nK2O\n11.88\n9.09\n9.23\n13.49\n12.96\n13.11\n12.86\n10\n9.63\n9.21\n9.15\n9.24\n10.19\n\n\nMgO\n\n\nCaO\n2.6\n2.97\n2.95\n0.09\n1.3\n1.91\n0.09\n2.88\n2.98\n2.97\n2.97\n2.97\n2.97\n\n\nBaO\n\n\nTb2O3\n\n\nSnO2\n\n1.52\n0.88\n0.85\n0.86\n0.87\n\n1.45\n0.89\n0.88\n0.88\n1.43\n1.44\n\n\nCeO2\n\n\n1.1\n1.06\n0.86\n0.87\n1.07\n0.33\n1.11\n1.1\n1.1\n0.33\n0.33\n\n\nZrO2\n1.9\n\n\nTiO2\n0.3\n\n\n\n\n\n\n\nCalculated thermal expansion coefficient (Alpha ×10 exp. −6/K)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10.73\n9.91\n9.98\n9.64\n10.53\n10.23\n9.96\n10.58\n10.35\n10.31\n10.02\n10.32\n10.28\n\n\n\n\n\n\n\nApplicable relevant baking temperature in ° C.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n960\n940\n940\n980\n920\n940\n940\n870\n920\n940\n920\n940\n950\n\n\n\n\n\n\n\nTempering of the glass frit (Min./° C.)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n60/950\n30/950\n30/950\n\n30/950\n\n30/950\n30/980\n30/930\n30/960\n30/940\n60/950\n40/960\n\n\n\n\n\n\n\nMeasured thermal expansion coefficient\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nunknown\nun-\n9.71\n\nunknown\n\n17\nunknown\n12.01\nunknown\nunknown\n11.08\n12.8\n\n\n\n\nknown\n\n\n\n\n\n\n\nOptical values\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nL*tran\n69.7\n77.1\n76.6\n\ncloudy\n\n81.4\n65.8\n79.8\n80.5\n80.9\n81\n79\n\n\nb*trans.\n26.5\n31.6\n32.8\n\n\n\n9.4\n27.4\n25.6\n29.3\n34.9\n30.3\n32.9\n\n\nb*ref\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTest\n13\n13 Zr/Ti\n14\n15\n16\n17\n18\n19\n20\n21\n22\n\n\n\n\n\n\n\n\n\n\n% by weight\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSiO2\n58.48\n58.48\n57.19\n58.97\n58.1\n57.19\n57.67\n57.86\n57.86\n58.22\n58.22\n\n\nAl2O3\n14.61\n14.61\n14.31\n14.66\n14.51\n14.31\n14.41\n14.43\n14.43\n14.62\n14.7\n\n\nB2O3\n\n\nP2O5\n2.44\n2.44\n2.44\n2.04\n2.85\n2.44\n2.44\n2.44\n2.44\n2.46\n2.51\n\n\nLi2O\n\n\n\n\n\n\n\n\n\n\n0.67\n\n\nNa2O\n9.9\n9.9\n9.85\n9.91\n9.88\n9.85\n9.86\n9.87\n9.87\n9.19\n9.21\n\n\nK2O\n9.93\n9.93\n9.79\n9.8\n10.03\n9.79\n9.82\n9.86\n9.86\n10.94\n10.1\n\n\nMgO\n\n\n\n\n\n\n\n\n\n\n1.43\n\n\nCaO\n2.86\n2.86\n2.67\n2.86\n2.86\n2.67\n2.67\n2.67\n2.67\n2.83\n0.07\n\n\nBaO\n\n\n\n\n\n\n\n\n\n\n1.3\n\n\nTb2O3\n\n\n1.99\n\n\n1.99\n1.99\n1.99\n1.99\n\n\nSnO2\n1.44\n\n1.44\n1.44\n1.44\n1.77\n0.88\n0.44\n\n1.42\n1.45\n\n\nCeO2\n0.33\n\n0.33\n0.33\n0.33\n\n0.22\n0.44\n0.88\n0.33\n0.33\n\n\nZrO2\n\n1.22\n\n\nTiO2\n\n0.55\n\n\n\n\n\n\n\nCalculated Thermal Expansion coefficient (Alpha ×10 exp. −6)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10.49\n10.45\n10.52\n10.41\n10.56\n10.52\n10.54\n10.54\n10.54\n10.55\n10.44\n\n\n\n\n\n\n\nApplicable relevant baking temperature in ° C.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n950\n950\n960\n950\n950\n950\n950\n950\n950\n950\n930\n\n\n\n\n\n\n\nTempering of the glass frit *(Min./° C.)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n40\n40/960\n40/960\n40/960\n40/960\n40/960\n40/960\n40/960\n40/960\n40/960\n40/940\n\n\n\n\n\n\n\nMeasured thermal expansion coefficient\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n12.6\n10.59\n11.5\n11.24\n11.08\n10.53\nunknown\nunknown\n12.34\n13.23\nunknown.\n\n\n\n\n\n\n\nOptical values\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nL*trans\n80\n78.9\n80.3\n83.3\n78.1\n82.6\n79.5\n80.2\n75.2\n76\n71.3\n\n\nb*trans\n32.9\n33.6\n27.6\n24.4\n36.1\n28.5\n32.5\n31\n33.2\n33.8\n15.2\n\n\nb*ref",
        "A comparison of the tests shows that the thermal expansion coefficient of the glass ceramic according to the invention is controllable. Thus, a thermal expansion coefficient (TEC) in the range of 9.0 to 13.5×10−6, preferably 10.5 to 12×10−6, can be set. In comparison to the ceramics known from EP 0 622 342 B1, which have either too low a TEC (≦11×10−6/K) or a too high TEC (≧16×10−6/K), the glass ceramic according to the invention can be set in the TEC range of 11.0 to 13.0×10−6/K for coating ceramics, which is especially important in the dental field.",
        "Tests have shown that the SnO2- and/or CeO2-content is suitable for stimulating the crystallization of small amounts of leucite which are required for increasing the TEC.",
        "A comparison of Test 13 with 1.44% SnO2 with a Test in which the SnO2 was replaced by ZrO2 and TiO2 according to the claims of EP 0 622 342 B1 (Test “13 Zr/Ti” in the Table), clearly shows that, in the latter Test, the TEC corresponds approximately to the mathematically determined value, assuming a homogeneous glass, which can indicate the lack of a leucite crystallization.",
        "The examples show that the TEC in the glass ceramic of the invention can be controlled by the K2O content when there is a sufficient Al2O3 content. In particular, Tests 11 to 14 and 21 show this property. Tests 15 and 16 indicate that the P2O5 content, which determines the extent of the phase separation of the glass, also has an effect.",
        "By additionally fusing in CeO2 and/or Tb2O3, the glass ceramic can be caused to fluoresce. It could thereby be ascertained that fusing in only CeO2 results in weak bluish fluorescence and Tb2O2 in a stronger yellow fluorescence which is not typical for natural teeth. A strong, neutral fluorescence is only obtained with a combination of both oxides, as Tests 17 to 20 show. The Tests 19 and 20 are optimal for fluorescence.",
        "The baking temperature of the glass ceramic can be controlled by the proportion of B2O3, Li2O and Na2O and adapted to the desired value, as Tests 10 and 12 show. The applicable relevant baking temperatures of the glass ceramics according to the invention are in the range of 870° C. to 970° C.",
        "Test 13 has all of the preferred properties. The baking temperature and the TEC are ideal and, at the same time, the optical values with a transparency of L* (Transparency)=80 and a Δb*=32.9 are very good. In comparison thereto, the ceramic (Ivo. 15) prepared according to EP 0 622 342 B1 only has a Δb* of 26.5 at a transparency of L* (transp.)=69.7.",
        "It should be noted that the chemical stability and bending strength of the illustrated examples meet the requirements of the relevant standards for dental ceramics (ISO 9693).",
        "The exemplary embodiments according to Tests 13, 15 and 16 show the effect of the P2O5 content. Example 13 with a P2O3 content of 2.44% by weight is considered optimal, while the transparency is increased at the expense of opalescence in Example 15 with a P2O5 content of 2.04% by weight and an increased opalescence with reduced transparency can be ascertained in Example 16 with a P2O5 content of 2.85% by weight.",
        "Table 1 also shows embodiments (Tests 3, 4, 5, 6, 7 and 22) whose compositions are outside of the claimed range. In this case, Tests 3 to 5 have a too high K2O content and additionally Test 3 has too little CaO. It has been found shown that these exemplary embodiments are already too dull in the untempered state, presumably due to a too strong leucite crystallization. In spite of a too high leucite content, Test 6 is transparent since it only has a slight tendency to demix due to a P2O5 content of less than 1.5% by weight, but its opalescence is too low. In Test 7, a too high B2O3 content results in a strong dullness and, in Test 22, CaO was replaced by MgO nd BaO which resulted in a reduced opalescence.",
        "The glass ceramics according to the invention were produced according to the following method:\n\n    1. Weighing in the raw materials as noted in Table 1.\n    2. Mixing the mixture in a gyro mixer.\n    3. Melting the mixture in a gas-heated drip-feed crucible furnace at about 1500° C.\n    4. Quenching the molten mass running out of the furnace in a water bath.\n    5. Drying the molten mass.\n    6. Brief grinding of the frit thus obtained in a ball mill.\n    7. Tempering the frit in the following manner:\n    \n        stacking the ground frits on quartz-coated fire-clay plates\n        placing these plates in an electric furnace heated to 960° C.\n        removing the plates from the furnace after about 40 minutes\n        quenching the fused frit cakes in the water bath.\n    \n    \n    8. After drying, filling the frit into the ball mill and grinding, preferably to about 10,000 revolutions.\n    9. Sifting the ground frits through a sieve, preferably having 100 μm mesh size.",
        "To measure opalescence and transparency of the opal ceramic, it should be noted that 3 grams of the powdery opal ceramics were compacted in a press to form a round blank and these were sintered together in a dental vacuum baking furnace at the same temperature as in Test 13 of 950° C. The round blank thus obtained has a thickness of about 2.5 mm. In the case of opalescence, these round blanks appear orange/yellow with transmitted light since the unscattered long-wave light catches the eye. On the other hand, when looking at it against a dark background, the round blank appears bluish, since the more strongly scattered short-wave light is seen in this case.",
        "This phenomenon can be determined quantitatively with a spectrophotometer. For this purpose, the L*, a*, b* values were measured in transmission and in reflection on a black base in the photometer of, for example, the Minolta corporation (CM-3610d), whereby a 2° observer and standard light D65 are required. In the L*, a*, b* colour system, a positive b* value represents the yellow part of the light, on the other hand, a negative b* value represents its blue part. The higher the absolute amount, the more intense the colour.",
        "Accordingly, the opalescent round blanks thus produce positive b* values during transmission and negative b* values during reflection. The more the two b* values deviate from one another, the strong the opalescence.",
        "Moreover, the L* value measured in transmission can be used as a measure for the transparency of the round blank.",
        "Aesthetically satisfying results in dental restoration are obtained with opal ceramics whose round blanks have a Δb* of at least 25 and L* (transm.) of at least 75."
    ],
    "citations": [
        "5432130",
        "5702514",
        "6022819",
        "6120591",
        "6200137",
        "6280863"
    ],
    "us_classification": "501  2",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "03",
            "subclass": "C",
            "main_group": "3",
            "subgroup": "097"
        }
    ]
}