{
    "title": "Photoluminescent tile and method for fabricating the same",
    "abstract": "Disclosed are photoluminescent tiles containing photoluminescent materials, and manufacturing methods thereof. A tile is filled or glazed with photoluminescent glaze powder including photoluminescent phosphor comprising a MAl",
    "inventors": [
        "Lee"
    ],
    "document_number": "07297416",
    "publication_date": "20071120",
    "assignees": [
        "Seoul Ceramics Co., Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A photoluminescent tile fabricated by filling or dry-glazing a photoluminescent glaze powder in a tile, wherein the photoluminescent glaze powder is obtained by dry-mixing a 50˜90 wt % photoluminescent phosphor which comprises a compound expressed by MAl",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The photoluminescent tile according to claim 1 , wherein metal M is selected from a group consisting of calcium (Ca), strontium (Sr), barium (Ba), and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The photoluminescent tile according to claim 1 , wherein metal M is an alloy of magnesium (Mg) and a metal selected from a group consisting of Ca, Sr, Ba and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The photoluminescent tile according to claims 1 , wherein the photoluminescent phosphor comprises europium (Eu) as an activator, and at least one or more co-activator selected from a group consisting of cerium (Ce), praseodymium (Pr), neodymium (Nd), samarium (Sm), dysprosium (Dy), holomium (Ho), erbium (Er), thulium (Tm), ytterbium (Yb) and lutetium (Lu).",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The photoluminescent tile according to claims 1 , wherein the tile filled with the photoluminescent glaze powder is a tile wherein grooves are hollowed at a depth ranging from 0.3 to 2.0 mm.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The photoluminescent tile according to claim 5 , wherein the grooves have shapes of various patterns or representative signs.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The photoluminescent tile according to claim 1 , wherein the photoluminescent glaze powder is dry-glazed at a thickness ranging from 0.3 to 2.0 mm.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The photoluminescent tile according to claims 1 , wherein the filling or dry-glazing process is performed by a silk screen method.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A photoluminescent tile fabricated by dry-glazing photoluminescent glaze powder on the whole surface of a tile coated with an adhesive material, wherein the photoluminescent glaze powder is obtained by dry-mixing a 10˜50 wt % photoluminescent phosphor which comprises a compound expressed by MAl",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The photoluminescent tile according to claim 9 , wherein the mixture composition ratio of photoluminescent phosphor:frit:surface-protective frit in the photoluminescent glaze powder is 20˜30 wt %:20˜30 wt %:50˜60 wt %.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The photoluminescent tile according to claims 9 , wherein the photoluminescent glaze powder is dry-glazed at a thickness ranging from 0.3 to 2.0 mm.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A photoluminescent tile fabricated by wet-glazing photoluminescent glaze aqueous solution on the whole surface of a tile and then burning the tile wet-glazed with the photoluminescent glaze aqueous solution at a temperature ranging from 500 to 1200° C., the photoluminescent glaze aqueous solution being prepared by adding 30˜100 weight parts of water in 100 weight parts of photoluminescent glaze powder obtained by dry-mixing a 10˜50 wt % photoluminescent phosphor which comprises a compound expressed by MAl",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The photoluminescent tile according to claim 1 , wherein a photoluminescent tile is fabricated by filling or dry-glazing a photoluminescent glaze powder in a tile, wherein the photoluminescent glaze powder is obtained by dry-mixing a 50˜90 wt % photoluminescent phosphor which comprises a compound expressed by MAl",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A method for fabricating a photoluminescent tile, comprising the steps of:",
            "components": [
                {
                    "component": "(a) preparing a tile wherein grooves are hollowed in predetermined shapes;",
                    "subcomponents": []
                },
                {
                    "component": "(b) filling a photoluminescent glaze powder in the grooves, wherein the photoluminescent glaze powder is obtained by dry-mixing a 50˜90 wt % photoluminescent phosphor which comprises a compound expressed by MAl",
                    "subcomponents": []
                },
                {
                    "component": "(c) dry-glazing a surface-protective frit on the upper portion of the tile where the photoluminescent glaze powder is filled; and",
                    "subcomponents": []
                },
                {
                    "component": "(d) burning the tile dry-glazed with the surface-protective frit at a temperature ranging from 500 to 1200° C.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method according to claim 14 , wherein the grooves of the tile in the step (a) are formed to have various patterns or representative signs with cast molding or carving.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method according to claim 14 , wherein the grooves of the tile in the step (a) have a depth ranging from 0.3 to 2.0 mm.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method according to claims 14 , wherein the filling process in the step (b) is performed by a silk screen device.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method according to claims 14 , wherein the surface-protective frit in the step (c) is a low temperature burning frit usable at a temperature ranging from 500 to 900° C. or a high temperature burning frit usable at a temperature ranging from 900 to 1200° C.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method according to claims 14 , wherein metal M is (i) selected from a group consisting of calcium (Ca), strontium (Sr), barium (Ba) and mixtures thereof, or is (ii) an alloy of the metal of (i) and magnesium (Mg).",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method according to claims 14 , wherein the photoluminescent phosphor comprises europium (Eu) as an activator, and at least one or more co-activator selected from the group consisting of cerium (Ce), praseodymium (Pr), neodymium (Nd), samarium (Sm), dysprosium (Dy), holomium (Ho), erbium (Er), thulium (Tm), ytterbium (Yb) and lutetium (Lu).",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. A method for fabricating a photoluminescent tile, comprising the steps of:",
            "components": [
                {
                    "component": "(a) preparing a flat tile having no pattern;",
                    "subcomponents": []
                },
                {
                    "component": "(b) dry-glazing photoluminescent glaze powder on the tile in predetermined shapes, wherein the photoluminescent glaze powder is obtained by dry-mixing a 50˜90 wt % photoluminescent phosphor which comprises a compound expressed by MAl",
                    "subcomponents": []
                },
                {
                    "component": "(c) dry-glazing a surface-protective frit on the upper portion of the tile where the photoluminescent glaze powder is dry-glazed; and",
                    "subcomponents": []
                },
                {
                    "component": "(d) burning the tile dry-glazed with the surface-protective frit at a temperature ranging from 500 to 1200° C.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The method according to claim 21 , wherein the photoluminescent glaze powder in the step (b) is dry-glazed as various patterns or representative signs by a silk screen method.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The method according to claim 21 , wherein the photoluminescent glaze powder is dry-glazed at a thickness ranging from 0.3 to 2.0 mm.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The method according to claims 21 , wherein the surface-protective frit in the step (c) is a low temperature burning frit usable at a temperature ranging from 500 to 900° C. or a high temperature burning frit usable at a temperature ranging from 900 to 1200° C.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The method according to claims 21 , wherein metal M is (i) selected from calcium (Ca), strontium (Sr), barium (Ba) and mixtures thereof, or is (ii) an alloy of the metal of (i) and magnesium (Mg).",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The method according to claims 21 , wherein the photoluminescent phosphor comprises europium (Eu) as an activator, and at least one or more co-activator selected from the group consisting of cerium (Ce), praseodymium (Pr), neodymium (Nd), samarium (Sm), dysprosium (Dy), holomium (Ho), erbium (Er), thulium (Tm), ytterbium (Yb) and lutetium (Lu).",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. A method for fabricating a photoluminescent tile, comprising the steps of:",
            "components": [
                {
                    "component": "(a) preparing a tile having elaborate patterns and/or various colors;",
                    "subcomponents": []
                },
                {
                    "component": "(b) coating an adhesive material on the whole surface of the tile;",
                    "subcomponents": []
                },
                {
                    "component": "(c) dry-glazing photoluminescent glaze powder on the whole surface of the tile coated with the adhesive material, wherein the photoluminescent glaze powder obtained by dry-mixing a 10˜50 wt % photoluminescent phosphor which comprises a compound expressed by MAl",
                    "subcomponents": []
                },
                {
                    "component": "(d) burning the tile whose whole surface is dry-glazed with the photoluminescent glaze powder at a temperature ranging from 500 to 1200° C.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The method according to claim 27 , wherein the adhesive material of the step (b) is fabricated by mixing 0.5˜5 weight parts of sodium carboxylmethyl cellulose in 100 weight parts of water.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The method according to claim 27 , wherein the mixture composition ratio of photoluminescent phosphor:frit:surface-protective frit in the photoluminescent glaze powder by a dry-mixing method is 20˜30 wt %:20˜30 wt %:50˜60 wt %.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The method according to claims 27 , wherein the surface-protective frit of the step (c) is a low temperature burning frit usable at a temperature ranging from 500 to 900° C. or a high temperature burning frit usable at a temperature ranging from 900 to 1200° C.",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The method according to claims 27 , wherein the photoluminescent glaze powder is dry-glazed at a thickness ranging from 0.3 to 2.0 mm.",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. The method according to claims 27 to 31 , wherein the dry-glazing processes is performed by a silk-screen method.",
            "components": []
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. A method for fabricating a photoluminescent tile, comprising the steps of:",
            "components": [
                {
                    "component": "(a) preparing a tile having elaborate patterns or colors;",
                    "subcomponents": []
                },
                {
                    "component": "(b) wet-glazing photoluminescent glaze aqueous solution on the whole surface of the tile, wherein the photoluminescent glaze aqueous solution is prepared by adding 30˜100 weight parts of water in 100 weight parts of photoluminescent glaze powder obtained by dry-mixing a 10˜50 wt % photoluminescent phosphor which comprises a compound expressed by MAl",
                    "subcomponents": []
                },
                {
                    "component": "(c) burning the tile wet-glazed with the photoluminescent glaze aqueous solution at a temperature ranging from 500 to 1200° C.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The method according to claim 33 , wherein the mixture composition ratio of photoluminescent phosphor:frit:surface-protective frit in the photoluminescent glaze powder is 20˜30 wt %:20˜30 wt %:50˜60 wt %.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. The method according to claim 33 , wherein the wet-glazing process is performed by a spraying method using a sprayer.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. The method according to claims 33 , wherein the photoluminescent glaze aqueous solution is wet-glazed at a thickness ranging from 0.3 to 2.0 mm.",
            "components": []
        }
    ],
    "description": [
        "This application is based on and claims priority under 35 U.S.C. §119 (a)-(d), based on Korean Patent Application No. 10-2003-0026734, filed on Apr. 28, 2003, the entire contents of which are incorporated herein by reference.",
        "1. Field of the Invention",
        "The present invention generally relates to a photoluminescent tile and a method for preparing the same, and more specifically, to a photoluminescent tile prepared by filling or glazing photoluminescent glaze powder on a tile, wherein the photoluminescent glaze powder is obtained by dry-mixing a photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with frit, and then burning the tile filled and glazed with the photoluminescent glaze powder, and a method for fabricating the same using a dry method.",
        "2. Background of the Prior Art",
        "Generally, tiles are highlighted as excellent building materials to protect the coated surface of the structure because they have excellent physical characteristics such as durability, water-resistance and abrasion resistance, enable simple construction, and are not cracked or discolored.",
        "However, since ties do not show their shapes in a dark place, they have a demerit that their construction or shapes are not shown.",
        "Meanwhile, when an internal power is not supplied to underground construction or buildings in an emergency, there is no means for indicating an emergency exit path, which may result in a large accident.",
        "Currently, various kinds of luminous signs have been known, and positioned on a specific base by using luminous paints or luminous plastic materials such as a luminous tape, a sticker or an acryl plate. Radiation effects of these signs are not continued for a long time after light disappears, and they do not display their original functions when they are burned in case of fire. When mounted on the bottom, conventional signs are worn away by various factors in a short time. Due to these problems, the conventional photoluminescent signs need to be maintained frequently, which costs large maintenance expenses.",
        "Korean Patent Publication No. 1999-58711 (1999. 7. 15) discloses a method for fabricating a conventional luminous tile. In the method, luminous glaze obtained by mixing 20˜60 wt % SrAl2O3 with 40˜80 wt % frit is mixed with water, and wet-glazed on the tile. Then, the tile wet-glazed with the luminous glaze is burned at a temperature ranging from 600 to 800° C. The wet-glazing process of such luminous glaze by hands causes cracking, surface blotting and pin-holes, thereby degrading the yield of products. Specifically, in every 100 products, the number of defectives resulting from the cracking reaches about 17, the number of defectives resulting from the surface blotting reaches about 13, and the number of defectives resulting from the surface pin-holes reaches about 10. In addition, due to physical property of luminous glaze, the tile is burned at a low temperature, thereby degrading abrasion resistance of the tile. When the luminous glaze is wet-glazed on a tile having elaborate decorative patterns and various colors, the beauty of native patterns and colors are halved.",
        "Accordingly, the present inventors have developed a novel photoluminescent tile and a method for fabricating the same in order to avoid the above described problems.",
        "Disclosed is a photoluminescent tile prepared by filling or glazing photoluminescent glaze powder on a partial tile or the whole surface of the tile, wherein the glaze powder is obtained by dry-mixing a photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with frit, and then burning the tile filled or glazed with the photoluminescent glaze powder, and a method for preparing the same.",
        "In an embodiment, there is provided a photoluminescent tile fabricated by filling or dry-glazing photoluminescent glaze powder on a tile, wherein the photoluminescent glaze powder is obtained by dry-mixing a 50˜90 wt % photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with a 10˜50 wt % frit, and then burning the tile filled or dry-glazed with the photoluminescent glaze powder at a temperature ranging from 500 to 1200° C. A preparing method thereof is also provided.",
        "As described above, the photoluminescent glaze powder is fabricated by dry mixing a 50˜90 wt % photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with a 10˜50 wt % frit.",
        "Preferably, metal M is (i) selected from calcium (Ca), strontium (Sr), barium (Ba) and mixtures thereof, or is (ii) an alloy of the metal of (i) and magnesium (Mg).",
        "Preferably, the photoluminescent phosphor comprises europium (Eu) as an activator, and at least one or more co-activator selected from the group consisting of cerium (Ce), praseodymium (Pr), neodymium (Nd), samarium (Sm), dysprosium (Dy), holomiun (Ho), erbium (Er), thulium, (Tm), ytterbium (Yb) and lutetium (Lu).",
        "A photoluminescent phosphor is a material whose light accumulating element accumulates light and radiates in a dark place. In an embodiment, LumiNova® produced by Stone Nemoto Co., Ltd., which satisfies the above condition and have an excellent sunproof characteristic and a long-time afterglow characteristic is used as a photoluminescent phosphor.",
        "A frit, as a commercial mixture-obtained by burning silica and soluble flux and pulverizing them, is a pulverized material obtained by previously melting raw materials and making them as a glass state. In general, the frit is used as a single ingredient or by mixing other ingredients when tile glaze is fabricated.",
        "In an embodiment, a particle having a predetermined size (60 mesh) is made by pulverizing a frit (HeGwang Ceramics. Co., Ltd.) for 800° C. (200 mesh), and drying the frit. Then, a photoluminescent glaze powder is fabricated by mixing the photoluminescent phosphor with the particle at a predetermined ratio.",
        "A photoluminescent tile according to an embodiment of the present invention is fabricated by a dry method to fill or dry-glaze photoluminescent glaze powder in a tile. Due to the dry method, a photoluminescent tile may be fabricated by glazing photoluminescent glaze powder as a desired pattern on a flat tile depending on intended usage of tiles, or by filling photoluminescent glaze powder in grooves hollowed as predetermined shapes in a tile.",
        "In an embodiment, the first and second methods for fabricating a photoluminescent tile are differentiated depending on the process of dry-glazing photoluminescent glaze powder on a flat tile or the process of filling photoluminescent glaze powder in grooves.",
        "First, a method for fabricating a photoluminescent tile by filling photoluminescent glaze powder in grooves hollowed in a tile comprises the steps of (see FIG. 1):",
        "(a) preparing a tile 1 wherein grooves 2 are hollowed with predetermined shapes;",
        "(b) filling photoluminescent glaze powder 3 in the grooves 2, wherein the photoluminescent glaze powder 3 is obtained by dry-mixing a 50˜90 wt % photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with a 10˜50 wt % frit;",
        "(c) dry-glazing a surface-protective frit 4 on the upper portion of the tile where the photoluminescent glaze powder 3 is filled; and",
        "(d) burning the tile dry-glazed with the surface-protective frit 4 at a temperature ranging from 500 to 1200° C.",
        "In the step (a), the grooves of the tile are formed to have various patterns or representative signs. Grooves hollowed in a tile are previously prepared so that photoluminescent glaze may be filled in the grooves having decorative patterns or various representative sign patterns thereon.",
        "Here, the grooves having predetermined shapes may be formed to have various patterns or representative signs with cast molding or carving. Preferably, the grooves of the tile are hollowed at a depth ranging from 0.3 to 2.0 mm.",
        "In the step (b), the dried and powdered photoluminescent glaze is filled in the grooves of the tile prepared in the step (a). Although the filling step may be performed by hand, the filling process may be preferably performed using an automatic operation by machinery such as a silk screen device because the photoluminescent glaze is of a dry powder type.",
        "In order to protect the grooves filled with the photoluminescent glaze powder, the surface-protective frit is dry-glazed to cover the filling region in the step (c). Since a dry method is used in an embodiment of the present invention, any of a low temperature burning frit usable at a temperature ranging from 500 to 900° C. or a high temperature burning frit usable at a temperature ranging from 900 to 1200° C. can be used. However, a high temperature burning frit is preferably used in an embodiment of the present invention in order to improve abrasion resistance of the tile.",
        "The surface-protective flit used in the step (c) may be Vetrosa® for 830° C. or 950° C. produced by Korea Ceramics Co., Ltd. having a size ranging from 0.1 to 0.32 mm.",
        "In the step (d), a photoluminescent tile is prepared by burning the tile dry-glazed with the surface-protective frit at a high temperature ranging from 500 to 1200° C. for about 30˜80 minutes. The burning process is performed at a low temperature if the surface-protective flit used in the step (c) is a low temperature burning flit arid at a high temperature if the surface-protective frit used in the step (c) is a high temperature burning frit. However, it is preferable that the tile is burned at a high temperature ranging from 900 to 1200° C. in order to improve abrasion resistance of the tile.",
        "Preferably, the tile fabricated by filling photoluminescent glaze powder in grooves of the tile is used as flooring tiles which require relatively more abrasion resistance because photoluminescent glaze is filled in the tile.",
        "Second, a method for fabricating a photoluminescent tile by dry-glazing photoluminescent glaze powder on a flat tile comprises the steps of (see FIG. 2):",
        "(a) preparing a flat tile 21 having no pattern;",
        "(b) dry-glazing photoluminescent glaze powder 22 on the tile 21 in predetermined shapes, wherein the photoluminescent glaze powder 22 is obtained by dry-mixing a 50˜90 wt % photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with a 10˜50 wt % frit;",
        "(c) dry-glazing a surface-protective frit 23 on the upper portion of the tile where the photoluminescent glaze powder is dry-glazed; and",
        "(d) burning the tile dry-glazed with the surface-protective frit 23 at a temperature ranging from 500 to 1200° C.",
        "In the above-described process, a photoluminescent tile according to the present invention is fabricated by dry-glazing photoluminescent glaze powder on a flat tile instead of filling photoluminescent glaze powder in grooves hollowed in a tile.",
        "In the step (b), photoluminescent glaze powder is put on the upper portion of the flat tile in various patterns or representative sign shapes by a silk screen method. The dry-glazing thickness of glaze powder is determined depending on the size, pattern and usage of tiles. Preferably, the dry-glazing thickness ranges from 0.3 to 2.0 mm.",
        "When the photoluminescent glaze powder is dry-glazed by the above-described process, the region dry-glazed with the photoluminescent glaze powder protrudes from the flat tile at the dry-glazed thickness. Accordingly, the tile fabricated by the above-described process is suitable for manufacture of wall tiles which requires relatively less abrasion resistance.",
        "The steps (c) and (d) are the same as those of the previously described method using grooves hollowed in a tile.",
        "Third, there is also provided a photoluminescent tile fabricated by dry-glazing photoluminescent glaze powder on the whole surface of a tile coated with an adhesive material, wherein the photoluminescent glaze powder is obtained by dry-mixing a 10˜50 wt % photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with a 10˜50 wt % frit and a 40˜80 wt % surface-protective frit, and then burning the tile dry-glazed with the photoluminescent glaze powder at a temperature ranging from 500 to 1200° C.",
        "To begin with, photoluminescent glaze powder is prepared by dry-mixing a 10˜50 wt % photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with a 10˜50 wt % frit and a 40˜80 wt % surface-protective frit.",
        "Then, a photoluminescent tile is fabricated by dry-glazing the above photoluminescent glaze powder on the whole surface of a tile having elaborate patterns and/or various colors. As a result, a photoluminescent tile having a photoluminescent characteristic with its native color and patterns can be obtained.",
        "In another embodiment a third method for fabricating a photoluminescent tile obtained by dry-glazing photoluminescent glaze powder on the whole surface of a common tile having elaborate patterns and/or various colors, comprises the steps of (see FIG. 3):",
        "(a) preparing a tile 31 having elaborate decorative patterns 32 and/or various colors;",
        "(b) coating an adhesive material on the whole surface of the tile 31;",
        "(c) dry-glazing photoluminescent glaze powder 33 on the tile 31 coated with the adhesive material, wherein the photoluminescent glaze powder is obtained by dry-mixing a 10˜50 wt % photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with a 10˜50 wt % frit and a 40˜80 wt % surface-protective frit; and",
        "(d) burning the tile whose whole surface is dry-glazed with the photoluminescent glaze powder at a temperature ranging from 500 to 1200° C. for 30˜80 minutes.",
        "The tile of the step (a) having elaborate decorative patterns or various colors include a common tile, a tile whose surface has predetermined grooves, a tile whose surface has predetermined patterns, a tile whose surface has no patterns with various colors, and a mosaic tile.",
        "In the step (b), there are various materials usable for the adhesive material. For example, the adhesive material may be a sodium carboxylmethyl cellulose (CMC) aqueous solution prepared by mixing 0.5˜5 weight parts of sodium carboxylmethyl cellulose in 100 weight parts of water, and then stirring for a predetermined period.",
        "Here, the CMC, which is a tasteless, scentless and harmless chemical, increases viscosity of general aqueous products by improving viscosity transferability, formation of 3-dimensional gel structure, moisture balance, and fluid stress of aqueous solution and suspended solids when the CMC is dissolved in aqueous solution. Therefore, the CMC is frequently used in many industries as adhesives, detergents, cosmetics and medicines. When the CMC aqueous solution having the above-described characteristics is coated on the surface of a tile, the CMC aqueous solution is completely decomposed and vanished without changing the tile or its photoluminescent characteristic after a burning process at a predetermined temperature for a period of time. Accordingly, the CMC aqueous solution may be easily used when photoluminescent glaze powder is glazed on the whole surface of a tile.",
        "The adhesive material of the step (b) is coated at a thickness below 0.05 mm to slightly cover the surface of the tile. If the adhesive material is coated too thickly, the CMC aqueous solution may flow from the edge of the tile surface, and fluidity is too great for dry-glazing photoluminescent glaze powder, which prevents delicate operations.",
        "In the step (c), the mixture composition ratio of photoluminescent phosphor:frit:surface-protective frit in the photoluminescent glaze powder is preferably 20˜30 wt %:20˜30 wt %:50˜60 wt %, and the photoluminescent glaze powder is dry-glazed at a thickness ranging from 0.3 to 2.0 mm.",
        "The dry-glazing process is performed by a silk-screen method. The burning temperature and time may be changed depending on mixture ratios of photoluminescent glaze powder. When the surface of the tile is dry-glazed with photoluminescent glaze powder obtained by mixing a small amount of organic pigments for ceramics, a photoluminescent tile having various colors may be fabricated.",
        "Fourth, there is also provided a photoluminescent tile fabricated by wet-glazing photoluminescent glaze aqueous solution on the whole surface of a tile and then burning the tile glazed with the photoluminescent wet-glaze aqueous solution at a temperature ranging from 500 to 1200° C. Here, the photoluminescent glaze aqueous solution is prepared by adding 30˜100 weight parts of water to 100 weight parts of photoluminescent glaze powder obtained by dry-mixing a 10˜50 wt % photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with a 10˜50 wt % frit and a 40˜80 wt % surface-protective frit. Here, the photoluminescent glaze power has the different structure from that of the conventional luminous glaze used in fabrication of the conventional luminous tile, and is fabricated by a different method from the conventional process.",
        "In still another embodiment, a fourth method for fabricating the above photoluminescent tile comprises the steps of:",
        "(a) preparing a tile having elaborate patterns or colors;",
        "(b) wet-glazing photoluminescent glaze aqueous solution prepared by adding 30˜100 weight parts of water to 100 weight parts of photoluminescent glaze powder obtained by dry-mixing a 10˜50 wt % photoluminescent phosphor which comprises a compound expressed by MAl2O4 (M: metal) as a host crystal with a 10˜50 wt % frit and a 40˜80 wt % surface-protective frit on the whole surface of the tile; and",
        "(c) burning the tile wet-glazed with the photoluminescent glaze aqueous solution at a temperature ranging from 500 to 1200° C.",
        "In the step (b), the mixture composition ratio of photoluminescent phosphor:frit:surface-protective frit in the photoluminescent glaze powder is 20˜30wt %:20˜30 wt %:50˜60 wt %.",
        "In the step (b), the photoluminescent glaze powder may be stirred with water by using a stirrer or mixing in a ball mill. The composition ratio of powder and water may vary depending on the composition ratio of the photoluminescent glaze powder.",
        "Preferably, the wet-glazing process is performed by a spraying method using a sprayer to result in a uniform thickness of the photoluminescent glaze powder on the whole surface of the tile. The photoluminescent glaze aqueous solution is glazed at a thickness ranging from 0.3 to 2.0 mm.",
        "FIG. 1 is a diagram illustrating a method for fabricating a photoluminescent tile by using a tile where grooves are hollowed with predetermined shapes according to an embodiment of the present invention.",
        "FIG. 2 is a diagram illustrating a method for fabricating a photoluminescent tile by using a flat tile having no pattern according to an embodiment of the present invention.",
        "FIG. 3 is a diagram illustrating a method for fabricating a photoluminescent tile by using a tile having elaborate patterns or various colors according to an embodiment of the present invention.",
        "FIG. 4 is a photograph illustrating a photoluminescent tile shown in a light place according to an embodiment of the present invention.",
        "FIG. 5 is a photograph illustrating the photoluminescent tile of FIG. 4 shown in a dark place.",
        "FIG. 6 is a graph illustrating a result obtained by afterglow brightness of the photoluminescent tile according to an embodiment of the present invention.",
        "Hereinafter, the present invention will be described in detail. However, it should be understood that the invention is not limited to the particular forms disclosed.",
        "LumiNova® produced by Stone Nemoto Co., Ltd., which comprises a compound expressed by SrAl2O4 was used as a photoluminescent phosphor to obtain photoluminescent glaze powder according to the present invention. A particle with a predetermined size (60 mesh) obtained by pulverizing (200 mesh) a frit for 800° C. (HeKwang Ceramics Co., Ltd.) and drying the frit was used.",
        "The photoluminescent glaze powder according to the present invention was fabricated by mixing the photoluminescent phosphor powder with the frit powder at predetermined ratios shown in Table 1.",
        "TABLE 1\n\n\n\n\n\n\n\n\nPhotoluminescent\n\n\n\n\n\nPhosphor\n\n\n\n\n\n(wt %)\nFrit (wt %)\n\n\n\n\n\n\n\n\n\nPreparation\n90\n10\n\n\n\nExample 1\n\n\n\nPreparation\n80\n20\n\n\n\nExample 2\n\n\n\nPreparation\n70\n30\n\n\n\nExample 3\n\n\n\nPreparation\n60\n40\n\n\n\nExample 4",
        "For a photoluminescent phosphor, LumiNova® (produced by Stone Nemoto Co., Ltd.) including SrAl2O4 as a host crystal was used. For a frit, a particle with a predetermined size (60 mesh) obtained by pulverizing (200 mesh) a frit (HeGwang Ceramics. Co., Ltd.) for 800° C. and drying the pulverized frit was used. For a surface-protective frit, Vetrosa® (produced by Korea Ceramics Co., Ltd.) for 830° C. was used. The disclosed photoluminescent glaze powder was obtained by mixing the above ingredients.",
        "The photoluminescent glaze powder was fabricated by mixing photoluminescent phosphor, frit and Vetrosa® in the below ratios.",
        "TABLE 2\n\n\n\n\n\n\nPhotoluminescent\n\n\n\n\n\nphosphor (wt %)\nFrit (wt %)\nVetrosa (wt %)\n\n\n\n\n\n\n\nPreparation\n10\n20\n70\n\n\nExample 5\n\n\nPreparation\n20\n20\n60\n\n\nExample 6\n\n\nPreparation\n30\n20\n50\n\n\nExample 7\n\n\nPreparation\n40\n20\n40\n\n\nExample 8",
        "For a photoluminescent phosphor, LumiNova® (produced by Stone Nemoto Co., Ltd.) including SrAl2O4 as a host crystal was used. For a frit, a particle with a predetermined size (60 mesh) obtained by pulverizing (200 mesh) a frit (HeGwang Ceramics. Co., Ltd.) for 800° C. and drying the pulverized frit was used. For a surface-protective frit, Vetrosa® (produced by Korea Ceramics Co., Ltd.) for 830° C. was used. The disclosed photoluminescent glaze powder was obtained by mixing the above ingredients.",
        "The photoluminescent glaze powder was fabricated by mixing photoluminescent phosphor, frit and Vetrosa® at the below ratios, and then photoluminescent glaze aqueous solution was obtained by adding 50 weight parts of water to 100 weight parts of photoluminescent glaze powder.",
        "TABLE 3\n\n\n\n\n\n\n\n\n\nWater\n\n\n\n\n\n\n(weight parts\n\n\n\n\n\n\nbased on 100\n\n\n\n\n\nSurface-\nweight parts of\n\n\n\nPhotoluminescent\nFrit\nprotective\nphotoluminescent\n\n\n\nphosphor (wt %)\n(wt %)\nfrit (wt %)\nglaze powder)\n\n\n\n\n\n\n\nPreparation\n10\n20\n70\n50\n\n\nExample 9\n\n\nPreparation\n20\n20\n60\n50\n\n\nExample 10\n\n\nPreparation\n30\n20\n50\n50\n\n\nExample 11\n\n\nPreparation\n40\n20\n40\n50\n\n\nExample 12",
        "The conventional luminous glazes were fabricated by mixing luminous material SrAl2O3 with frit at the below ratios shown in Table 4, and then adding 50 weight parts of water to 100 weight parts of the mixture.",
        "TABLE 4\n\n\n\n\n\n\n\n\nSrAl2O3 (wt %)\nFrit (wt %)\n\n\n\n\n\n\n\n\n\nPreparation Example 13\n40\n60\n\n\n\nPreparation Example 14\n30\n70\n\n\n\nPreparation Example 15\n20\n80",
        "Raw tile powder was formed as a mold where an arrow pattern (→) was hollowed out. The photoluminescent glaze powders obtained from the Preparation Examples 1˜4 were filled in the grooves by using a silk screen device, and the upper portion filled with the photoluminescent glaze powder was dry-glazed with the surface-protective fit (Vetrosa®, Korea Ceramics Co., Ltd.), and burned at a temperature ranging from 500 to 1200° C., thereby obtaining a flooring tile according to the present invention.",
        "Table 5 below shows specific preparation examples depending on the depth of the grooves and kinds of photoluminescent glaze powder.",
        "TABLE 5\n\n\n\n\n\n\n\n\nBurning\n\n\nExample\nDepth of\nPhotoluminescent\ntemperature and\n\n\nClassification\ngroove (mm)\nglaze powder used\ntime\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 1\n1-1\n0.3\nPreparation Example 1\n 700° C./40 min.\n\n\n\n1-2\n\nPreparation Example 2\n 720° C./50 min.\n\n\n\n1-3\n\nPreparation Example 3\n 860° C./60 min.\n\n\n\n1-4\n\nPreparation Example 4\n 950° C./60 min.\n\n\n\n1-5\n\nPreparation Example 4\n1050° C./60 min.\n\n\nExample 2\n2-1\n0.7\nPreparation Example 1\n 700° C./40 min.\n\n\n\n2-2\n\nPreparation Example 2\n 720° C./50 min.\n\n\n\n2-3\n\nPreparation Example 3\n 860° C./60 min.\n\n\n\n2-4\n\nPreparation Example 4\n 950° C./60 min.\n\n\n\n2-5\n\nPreparation Example 4\n1050° C./60 min.\n\n\nExample 3\n3-1\n1.1\nPreparation Example 1\n 700° C./40 min.\n\n\n\n3-2\n\nPreparation Example 2\n 720° C./50 min.\n\n\n\n3-3\n\nPreparation Example 3\n 860° C./60 min.\n\n\n\n3-4\n\nPreparation Example 4\n 950° C./60 min.\n\n\n\n3-5\n\nPreparation Example 4\n1050° C./60 min.\n\n\nExample 4\n4-1\n1.6\nPreparation Example 1\n 700° C./40 min.\n\n\n\n4-2\n\nPreparation Example 2\n 720° C./50 min.\n\n\n\n4-3\n\nPreparation Example 3\n 860° C./60 min.\n\n\n\n4-4\n\nPreparation Example 4\n 950° C./60 min.\n\n\n\n4-5\n\nPreparation Example 4\n1050° C./60 min.\n\n\nExample 5\n5-1\n2.0\nPreparation Example 1\n 700° C./40 min.\n\n\n\n5-2\n\nPreparation Example 2\n 720° C./50 min.\n\n\n\n5-3\n\nPreparation Example 3\n 860° C./60 min.\n\n\n\n5-4\n\nPreparation Example 4\n 950° C./60 min.\n\n\n\n5-5\n\nPreparation Example 4\n1050° C./60 min.",
        "The photoluminescent glaze powders obtained from the Preparation Examples 1˜4 were dry-glazed to have an arrow pattern (→) on a flat tile having no pattern by using a silk screen device. The upper portion dry-glazed with the photoluminescent glaze powder was dry-glazed with the surface-protective frit (Vetrosa®, Korea Ceramics Co., Ltd.), and burned at a temperature ranging from 500 to 1200° C., thereby obtaining a wall tile according to the present invention.",
        "Table 6 below shows specific tile preparation examples depending on the dry-glazing thickness and kinds of photoluminescent glaze powder used.",
        "TABLE 6\n\n\n\n\n\n\nDry-glazed\n\nBurning\n\n\nExample\nthickness\nPhotoluminescent\ntemperature and\n\n\nClassification\n(mm)\nglaze powder used\ntime\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 6\n6-1\n0.3\nPreparation Example 1\n 700° C./40 min.\n\n\n\n6-2\n\nPreparation Example 2\n 720° C./50 min.\n\n\n\n6-3\n\nPreparation Example 3\n 860° C./60 min.\n\n\n\n6-4\n\nPreparation Example 4\n 950° C./60 min.\n\n\n\n6-5\n\nPreparation Example 4\n1050° C./60 min.\n\n\nExample 7\n7-1\n0.7\nPreparation Example 1\n 700° C./40 min.\n\n\n\n7-2\n\nPreparation Example 2\n 720° C./50 min.\n\n\n\n7-3\n\nPreparation Example 3\n 860° C./60 min.\n\n\n\n7-4\n\nPreparation Example 4\n 950° C./60 min.\n\n\n\n7-5\n\nPreparation Example 4\n1050° C./60 min.\n\n\nExample 8\n8-1\n1.1\nPreparation Example 1\n 700° C./40 min.\n\n\n\n8-2\n\nPreparation Example 2\n 720° C./50 min.\n\n\n\n8-3\n\nPreparation Example 3\n 860° C./60 min.\n\n\n\n8-4\n\nPreparation Example 4\n 950° C./60 min.\n\n\n\n8-5\n\nPreparation Example 4\n1050° C./60 min.\n\n\nExample 9\n9-1\n1.5\nPreparation Example 1\n 700° C./40 min.\n\n\n\n9-2\n\nPreparation Example 2\n 720° C./50 min.\n\n\n\n9-3\n\nPreparation Example 3\n 860° C./60 min.\n\n\n\n9-4\n\nPreparation Example 4\n 950° C./60 min.\n\n\n\n9-5\n\nPreparation Example 4\n1050° C./60 min.",
        "A mosaic tile having elaborate patterns or colors was prepared by molding general raw powder of a tile. CMC aqueous solution containing 0.5 weight parts of CMC per 100 weight parts of water was coated on the whole surface of the mosaic tile, and then the photoluminescent glaze powder obtained from the Preparation Examples 5˜8 was dry-glazed on the whole surface of the tile coated with the CMC aqueous solution using a silk-screen device. Thereafter, the tile dry-glazed with the photoluminescent glaze powder was burned at a temperature ranging from 500 to 1200° C., thereby obtaining a mosaic tile according to an embodiment of the present invention.",
        "The specific tile preparation examples are shown in Table 7.",
        "TABLE 7\n\n\n\n\n\n\nDry-\n\n\n\n\n\nglazed\n\n\n\nthick-\n\nBurning\n\n\nExample\nness\nPhotoluminescent\ntemperature and\n\n\nClassification\n(mm)\nglaze solution used\ntime\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 10\n10-1\n0.3\nPreparation Example 5\n 700° C./40 min.\n\n\n\n10-2\n\nPreparation Example 6\n 720° C./50 min.\n\n\n\n10-3\n\nPreparation Example 7\n 860° C./60 min.\n\n\n\n10-4\n\nPreparation Example 8\n 950° C./60 min.\n\n\n\n10-5\n\nPreparation Example 8\n1050° C./60 min.\n\n\nExample 11\n11-1\n0.7\nPreparation Example 5\n 700° C./40 min.\n\n\n\n11-2\n\nPreparation Example 6\n 720° C./50 min.\n\n\n\n11-3\n\nPreparation Example 7\n 860° C./60 min.\n\n\n\n11-4\n\nPreparation Example 8\n 950° C./60 min.\n\n\n\n11-5\n\nPreparation Example 8\n1050° C./60 min.\n\n\nExample 12\n12-1\n1.1\nPreparation Example 5\n 700° C./40 min.\n\n\n\n12-2\n\nPreparation Example 6\n 720° C./50 min.\n\n\n\n12-3\n\nPreparation Example 7\n 860° C./60 min.\n\n\n\n12-4\n\nPreparation Example 8\n 950° C./60 min.\n\n\n\n12-5\n\nPreparation Example 8\n1050° C./60 min.\n\n\nExample 13\n13-1\n1.5\nPreparation Example 5\n 700° C./40 min.\n\n\n\n13-2\n\nPreparation Example 6\n 720° C./50 min.\n\n\n\n13-3\n\nPreparation Example 7\n 860° C./60 min.\n\n\n\n13-4\n\nPreparation Example 8\n 950° C./60 min.\n\n\n\n13-5\n\nPreparation Example 8\n1050° C./60 min.",
        "A mosaic tile having elaborate patterns or colors was prepared by molding general raw powder of a tile. The photoluminescent glaze solution obtained from the Preparation Examples 9˜12 was wet-glazed on the whole surface of the mosaic tile using a sprayer. Thereafter, the tile wet-glazed with the photoluminescent glaze solution was burned at a temperature ranging from 500 to 1200° C., thereby obtaining a mosaic tile according to an embodiment of the present invention.",
        "The specific tile preparation examples are shown in Table 8.",
        "TABLE 8\n\n\n\n\n\n\nDry-\n\n\n\n\n\nglazed\n\n\n\nthick-\n\nBurning\n\n\nExample\nness\nPhotoluminescent\ntemperature and\n\n\nClassification\n(mm)\nglaze solution used\ntime\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 14\n14-1\n0.3\nPreparation Example 9\n 700° C./40 min.\n\n\n\n14-2\n\nPreparation Example\n 720° C./50 min.\n\n\n\n\n\n10\n\n\n\n14-3\n\nPreparation Example\n 860° C./60 min.\n\n\n\n\n\n11\n\n\n\n14-4\n\nPreparation Example\n 950° C./60 min.\n\n\n\n\n\n12\n\n\n\n14-5\n\nPreparation Example\n1050° C./60 min.\n\n\n\n\n\n12\n\n\nExample 15\n15-1\n0.7\nPreparation Example 9\n 700° C./40 min.\n\n\n\n15-2\n\nPreparation Example\n 720° C./50 min.\n\n\n\n\n\n10\n\n\n\n15-3\n\nPreparation Example\n 860° C./60 min.\n\n\n\n\n\n11\n\n\n\n15-4\n\nPreparation Example\n 950° C./60 min.\n\n\n\n\n\n12\n\n\n\n15-5\n\nPreparation Example\n1050° C./60 min.\n\n\n\n\n\n12\n\n\nExample 16\n16-1\n1.1\nPreparation Example 9\n 700° C./40 min.\n\n\n\n16-2\n\nPreparation Example\n 720° C./50 min.\n\n\n\n\n\n10\n\n\n\n16-3\n\nPreparation Example\n 860° C./60 min.\n\n\n\n\n\n11\n\n\n\n16-4\n\nPreparation Example\n 950° C./60 min.\n\n\n\n\n\n12\n\n\n\n16-5\n\nPreparation Example\n1050° C./60 min.\n\n\n\n\n\n12\n\n\nExample 17\n17-1\n1.5\nPreparation Example 9\n 700° C./40 min.\n\n\n\n17-2\n\nPreparation Example\n 720° C./50 min.\n\n\n\n\n\n10\n\n\n\n17-3\n\nPreparation Example\n 860° C./60 min.\n\n\n\n\n\n11\n\n\n\n17-4\n\nPreparation Example\n 950° C./60 min.\n\n\n\n\n\n12\n\n\n\n17-5\n\nPreparation Example\n1050° C./60 min.\n\n\n\n\n\n12",
        "The conventional luminous glaze obtained from the Preparation Examples 13˜15 was wet-glazed on the general tiles. Then, the tile was dried at room temperature, and burned at a temperature ranging from 600 to 800° C., thereby obtaining a luminous tile.",
        "The specific tile preparation examples depending on depth of grooves and luminous glaze used are shown in Table 9.",
        "TABLE 9\n\n\n\n\n\n\nwet-glazed\n\nBurning\n\n\nExample\nthickness\nLuminous glaze\ntemperature and\n\n\nClassification\n(mm)\nused\ntime\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nComparative\n1-1\n0.3\nPreparation Example\n600° C./40 min.\n\n\nExample 1\n\n\n13\n\n\n\n1-2\n\nPreparation Example\n650° C./50 min.\n\n\n\n\n\n14\n\n\n\n1-3\n\nPreparation Example\n700° C./60 min.\n\n\n\n\n\n15\n\n\n\n1-4\n\nPreparation Example\n750° C./60 min.\n\n\n\n\n\n15\n\n\nComparative\n2-1\n1.5\nPreparation Example\n600° C./40 min.\n\n\nExample 2\n\n\n13\n\n\n\n2-2\n\nPreparation Example\n650° C./50 min.\n\n\n\n\n\n14\n\n\n\n2-3\n\nPreparation Example\n700° C./60 min.\n\n\n\n\n\n15\n\n\n\n2-4\n\nPreparation Example\n750° C./60 min.\n\n\n\n\n\n15",
        "Table 10 shows results obtained by measuring afterglow brightness of photoluminescent tiles obtained from the Examples 2˜5 and 7.",
        "The afterglow brightness of Table 10 was obtained by irradiating 25 W fluorescent light at a distance of 20 cm from the photoluminescent tile for 20 minutes and measuring the light at a reading of 2° of LUMINANCE METER TOPCON BM-8 lens of WookSung Chemicals Co., Ltd. The experiment was performed at a temperature of 21±1° C.",
        "TABLE 10\n\n\n\n\n\n\n\nElapsed\nAfterglow brightness (mcd/m2)\n\n\n\n\n\n\n\n\n\n\n\n\ntime\nExample\nExample\nExample\nExample\nExample\n\n\n(min.)\n2-3\n3-3\n4-3\n5-3\n7-3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInitial (0)\n11,000\n11,620\n12,050\n12,400\n9,030\n\n\n 2\n8,050\n8,410\n8,830\n9,080\n6,590\n\n\n 4\n6,200\n6,460\n6,800\n7,010\n5,070\n\n\n 6\n4,780\n4,980\n5,250\n5,400\n3,900\n\n\n 8\n3,540\n3,690\n3,890\n4,000\n2,890\n\n\n 10\n2,210\n2,290\n2,410\n2,490\n1,790\n\n\n 20\n1,180\n1,210\n1,280\n1,320\n950\n\n\n 30\n810\n820\n855\n890\n630\n\n\n 60\n640\n720\n670\n710\n500\n\n\n120\n530\n540\n560\n590\n415\n\n\n180\n430\n440\n450\n480\n340\n\n\n240\n283\n290\n300\n320\n230\n\n\n300\n190\n193\n200\n220\n151\n\n\n360\n103\n110\n115\n130\n86\n\n\n420\n80\n84\n90\n100\n65\n\n\n480\n60\n63\n70\n80\n50\n\n\n540\n33\n37\n40\n48\n24\n\n\n600\n24\n27\n30\n36\n18\n\n\n660\n10\n13\n15\n18\n8\n\n\n720\n5\n6\n8\n9\n3",
        "Table 11 shows results obtained by measuring afterglow brightness of photoluminescent tiles obtained from the Examples 10˜13.",
        "The afterglow brightness of Table 11 was obtained by irradiating 25 W fluorescent light at a distance of 20 cm from the photoluminescent tile for 20 minutes and measuring the light at a reading of 2° of LUMINANCE METER TOPCON BM-8 lens of WookSung Chemicals Co., Ltd. The experiment was performed at a temperature of 21±1° C.",
        "TABLE 11\n\n\n\n\n\n\n\n\n\nAfterglow brightness (mcd/m2)\n\n\n\n\n\n\n\n\n\n\n\nElapsed\nExample\nExample\nExample\nExample\n\n\ntime (min.)\n10-3\n11-3\n12-3\n13-3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInitial (0)\n3,180\n3,900\n4,330\n5,420\n\n\n 2\n1,710\n1,756\n1,950\n3,440\n\n\n 4\n1,020\n1,050\n1,270\n1,580\n\n\n 6\n610\n630\n760\n950\n\n\n 8\n455\n470\n590\n740\n\n\n 10\n330\n350\n440\n550\n\n\n 20\n210\n225\n310\n390\n\n\n 30\n142\n155\n200\n250\n\n\n 60\n85\n95\n125\n160\n\n\n120\n45\n51\n68\n88\n\n\n180\n22\n26\n45\n60\n\n\n240\n13\n17\n22\n31\n\n\n300\n7\n9\n12\n20\n\n\n360\n3\n5\n6\n10",
        "Table 12 shows results obtained by measuring afterglow brightness of photoluminescent tiles obtained from the Examples 14˜17.",
        "The afterglow brightness shown in Table 12 was obtained by irradiating 25 W fluorescent light at a distance of 20 cm from the photoluminescent tile for 20 minutes and measuring the light at a reading of 2° of LUMINANCE METER TOPCON BM-8 lens of WookSung Chemicals Co., Ltd. The experiment was performed at a temperature of 21±1° C.",
        "TABLE 12\n\n\n\n\n\n\n\nElapsed\nAfterglow brightness (mcd/m2)\n\n\n\n\n\n\n\n\n\n\n\n\ntime\nExample\nExample\nExample\nExample\n\n\n(min.)\n14-3\n15-3\n16-3\n17-3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInitial (0)\n2,540\n3,210\n3,820\n4,500\n\n\n 2\n1,310\n1,450\n1,660\n3,110\n\n\n 4\n887\n916\n1,050\n1,210\n\n\n 6\n470\n560\n680\n830\n\n\n 8\n399\n416\n527\n696\n\n\n 10\n287\n301\n411\n503\n\n\n 20\n196\n196\n277\n325\n\n\n 30\n122\n138\n186\n214\n\n\n 60\n58\n76\n98\n123\n\n\n120\n36\n45\n63\n72\n\n\n180\n11\n19\n32\n51\n\n\n240\n8\n13\n16\n24\n\n\n300\n3\n5\n8\n13\n\n\n360\n—\n2\n3\n7",
        "Table 13 shows results obtained by measuring afterglow brightness 13 luminous tiles obtained from the Comparative Examples 1˜2.",
        "The afterglow brightness shown in Table 13 was obtained by irradiating 25 W fluorescent light at a distance of 20 cm from the photoluminescent tile for 20 minutes and measuring the light at a reading of 2° with a LUMINANCE METER TOPCON BM-8 lens of WookSung Chemicals Co., Ltd. The experiment was performed at a temperature of 21±1° C.",
        "TABLE 13\n\n\n\n\n\n\n\n\n\nAfterglow brightness\n\n\n\n\n(mcd/m2)\n\n\n\n\n\n\n\n\n\nElapsed\nComparative \nComparative\n\n\ntime (min.)\nExample 1-3\nExample 2-3\n\n\n\n\n\n\n\n\n\n\n\n\nInitial (0)\n2,240\n3,510\n\n\n 2\n1,130\n2,675\n\n\n 4\n750\n1,020\n\n\n 6\n390\n682\n\n\n 8\n324\n565\n\n\n 10\n230\n405\n\n\n 20\n153\n254\n\n\n 30\n92\n160\n\n\n 60\n41\n87\n\n\n120\n22\n43\n\n\n180\n6\n28\n\n\n240\n4\n13",
        "Table 14 shows the comparison results of defective yield between the flooring tiles obtained from the Examples 1˜5 and the Comparative Examples 1˜2 per 100 tiles.",
        "The tiles were examined with unaided eyes from a distance ranging from 50 to 60 cm under 25 W fluorescent light to judge the acceptability of the tiles, and defective products were re-examined by using venier calipers made by Mitutoyo Co., Ltd.",
        "TABLE 14\n\n\n\n\n\n\n\nComparative\nExample 1~5\n\n\n\nClassification\nexample 1~2\n(number\n\n\n\n(acceptable standard)\n(number of tiles)\nof tiles)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCrack\nWidth\nLess than\n17\n3\n\n\n\n\n0.5 mm\n\n\n\nLength\nLess than\n\n\n\n\n2.0 mm\n\n\nSurface\nDiameter\nLess than\n13\n3\n\n\nswelling\n\n1.0 mm\n\n\nSurface pin-\nDiameter\nLess than\n10\n2\n\n\nhole\n\n0.5 mm\n\n\nOther\n\n\n5\n2\n\n\nTotal\n\n\n45\n10",
        "After review of the above results obtained from the above-described experiments, as shown in Table 10, the photoluminescent tile according to the present invention showed an excellent afterglow brightness of over 100 mcd/m2 5 hours after light was blocked when irradiated with a fluorescent light for 20 minutes, and maintained the brightness of at least 3 mcd/m2 12 hours after the light was blocked.",
        "As shown in Table 11, the photoluminescent tile according to the present invention showed an excellent afterglow brightness of almost 100 mcd/m2 1 hour after light was blocked when irradiated with a fluorescent light for 20 minutes, and maintained characteristics of the photoluminescent tile with its native patterns and colors.",
        "As shown in Table 12, the photoluminescent tile according to the present invention showed an excellent afterglow brightness of over 100 mcd/m2 30 minutes after light was blocked when irradiated with a fluorescent light for 20 minutes, and maintained characteristics of the photoluminescent tile with its native patterns and colors. As a result, mass production of products is enabled through automation, thereby improving yield and productivity.",
        "As shown in Tables 13 and 14, the disclosed photoluminescent tile has a greatly improved afterglow brightness than a conventional luminous tile by two times. Furthermore, crazing of the surface of the tile is prevented by using dry-glazed photoluminescent glaze powder. Accordingly, conventional problems such as cracking, surface swelling, surface pin-hole and gloss degradation of conventional tiles obtained by using conventional luminous glaze are solved, thereby reducing defectiveness of the products.",
        "As discussed earlier, a photoluminescent tile according to the present invention which has a photoluminescent characteristic of radiating in the dark may be effectively used as a representative sign for emergency use when power is not supplied, and as an advertisement substitute, which brings about economical effects such as power reduction. Also, the photoluminescent tiles may be applied to various fields as decorative tiles and driving lanes of roads because it maintains its original elaborate patterns and various colors in the daytime, with the light on, and also obtains its photoluminescent characteristic in the dark.",
        "It will be apparent to those skilled in the art that various modifications and variations can be made in the disclosed structures and methods without departing from the scope or spirit of the invention. Other embodiments of the invention will be apparent to those skilled in the art from consideration of the specification and practice of the invention disclosed herein. It is intended that the specification and examples be considered as exemplary only, with a true scope and spirit of the invention being indicated by the following claims."
    ],
    "citations": [
        "1236754",
        "61-77690",
        "11-293123",
        "2000-72533",
        "2002-293668",
        "2003-206189",
        "10-1999-0058711",
        "1999-0058711",
        "20-0163255",
        "2003-0032407",
        "20-0314090",
        "2003-082673"
    ],
    "us_classification": "428690",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "J",
            "main_group": "1",
            "subgroup": "62"
        }
    ]
}