{
    "title": "Method and system for performing image mark recognition",
    "abstract": "A method and system for performing image mark recognition for a document is disclosed. A document is scanned into a digital image. Reference image marks are sensed from the digital image. The reference image marks may include trigger row marks and/or corner/crop marks. Coordinates denoting the location of cells within the digital image are determined based on the locations of the reference image marks. Response marks are evaluated for darkness, opacity, and/or grayness on a pixel-by-pixel basis. The response marks are each assigned a percentage value based on the ratio between a total color value for a cell and a maximum color value for a cell.",
    "inventors": [
        "Cichielo",
        "Hoffman"
    ],
    "document_number": "07298902",
    "publication_date": "20071120",
    "assignees": [
        "Educational Testing Service"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of performing image mark recognition, comprising:",
            "components": [
                {
                    "component": "(a) accessing a scanned image of a document containing a plurality of image marks;",
                    "subcomponents": []
                },
                {
                    "component": "(b) performing reference image mark recognition on the scanned image;",
                    "subcomponents": []
                },
                {
                    "component": "(c) performing coordinate mapping on the scanned image to determine coordinates for a plurality of cells within the scanned image, wherein performing coordinate mapping comprises:",
                    "subcomponents": [
                        "(i) computing logical row coordinates for a number of rows in the scanned image,",
                        "(ii) computing logical coordinates for a number of columns in the scanned image,",
                        "(iii) creating a mapping within the scanned image,",
                        "(iv) resolving the mapping into coordinate values for each of a plurality of cells;"
                    ]
                },
                {
                    "component": "(i) computing logical row coordinates for a number of rows in the scanned image,",
                    "subcomponents": []
                },
                {
                    "component": "(ii) computing logical coordinates for a number of columns in the scanned image,",
                    "subcomponents": []
                },
                {
                    "component": "(iii) creating a mapping within the scanned image,",
                    "subcomponents": []
                },
                {
                    "component": "(iv) resolving the mapping into coordinate values for each of a plurality of cells;",
                    "subcomponents": []
                },
                {
                    "component": "(d) analyzing one or more pixels in each cell; and",
                    "subcomponents": []
                },
                {
                    "component": "(e) determining a cell color value for each cell based on values assigned to the one or more pixels.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 wherein computing logical row coordinates and logical column coordinates comprises using one or more trigger marks as reference points.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 wherein computing logical row coordinates and logical column coordinates comprises using one or more corner marks as reference points.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 wherein the number of rows and the number of columns are automatically determined based on the step of performing reference image mark recognition.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 wherein the number of rows and the number of columns are pre-determined.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 wherein creating a mapping comprises determining absolute pixel positions for each cell within the scanned document as defined by an intersection of a row and a column.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A system for performing image mark recognition, comprising:",
            "components": [
                {
                    "component": "(a) a processor; and",
                    "subcomponents": []
                },
                {
                    "component": "(b) one or more computer readable mediums operatively coupled to the processor, wherein at least one of the one or more computer readable mediums contains a scanned image of a document, wherein at least one of the one or more of the computer readable mediums contains computer program instructions for performing a method of performing image mark recognition, the method comprising:",
                    "subcomponents": [
                        "(i) accessing a scanned image of a document containing a plurality of image marks,",
                        "(ii) performing reference image mark recognition on the scanned image,",
                        "(iii) performing coordinate mapping on the scanned image to determine coordinates for a plurality of cells within the scanned image, wherein the computer instructions for the step of performing coordinate mapping comprise;",
                        "(1) computing logical row coordinates for a number of rows in the scanned image,",
                        "(2) computing logical column coordinates for a number of columns in the scanned image,",
                        "(3) creating a mapping within the scanned image,",
                        "(4) resolving the mapping into coordinate values for each of a plurality of cells,",
                        "(iv) analyzing one or more pixels in each cell, and",
                        "(v) determining a cell color value for each cell based on values assigned to the one or more pixels."
                    ]
                },
                {
                    "component": "(i) accessing a scanned image of a document containing a plurality of image marks,",
                    "subcomponents": []
                },
                {
                    "component": "(ii) performing reference image mark recognition on the scanned image,",
                    "subcomponents": []
                },
                {
                    "component": "(iii) performing coordinate mapping on the scanned image to determine coordinates for a plurality of cells within the scanned image, wherein the computer instructions for the step of performing coordinate mapping comprise;",
                    "subcomponents": [
                        "(1) computing logical row coordinates for a number of rows in the scanned image,",
                        "(2) computing logical column coordinates for a number of columns in the scanned image,",
                        "(3) creating a mapping within the scanned image,",
                        "(4) resolving the mapping into coordinate values for each of a plurality of cells,"
                    ]
                },
                {
                    "component": "(1) computing logical row coordinates for a number of rows in the scanned image,",
                    "subcomponents": []
                },
                {
                    "component": "(2) computing logical column coordinates for a number of columns in the scanned image,",
                    "subcomponents": []
                },
                {
                    "component": "(3) creating a mapping within the scanned image,",
                    "subcomponents": []
                },
                {
                    "component": "(4) resolving the mapping into coordinate values for each of a plurality of cells,",
                    "subcomponents": []
                },
                {
                    "component": "(iv) analyzing one or more pixels in each cell, and",
                    "subcomponents": []
                },
                {
                    "component": "(v) determining a cell color value for each cell based on values assigned to the one or more pixels.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The system of claim 7 wherein computing logical row coordinates and logical column coordinates comprises using one or more trigger marks as reference points.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The system of claim 7 wherein computing logical row coordinates and logical column coordinates comprises using one or more corner marks as reference points.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The system of claim 7 wherein the number of rows and the number of columns are automatically determined based on the step of performing reference image mark recognition.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The system of claim 7 wherein the number of rows and the number of columns are pre-determined.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The system of claim 11 wherein the pre-determined number of rows and the pre-determined number of columns are verified.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The system of claim 7 wherein the computer program instructions for the step of creating a mapping comprise determining absolute pixel positions for each cell within the scanned document as defined by an intersection of a row and a column.",
            "components": []
        }
    ],
    "description": [
        "The present invention generally relates to the field of mark recognition. The present invention particularly relates to scanning an image of a document and performing mark recognition on the scanned image. In an embodiment, a response mark may be indicative of an intended response to a question and/or may be representative of coded information. In a preferred embodiment, the present invention provides a hardware independent methodology for evaluating the presence or absence of one or more marks on a document, which may be configured to higher or lower resolutions as needed.",
        "Conventional mark reading systems have been employed to extract information, such as pencil marks, from a document. These systems typically include a scanner configured to read marks from the document. The scanner creates a digitized representation of the document. The digitized document is then processed by a separate application to evaluate the document. In an assessment environment, this system can be used to score examination responses. For example, many students and other examinees are familiar with the typical response format for answering multiple choice questions which requires the student to fill-in a space (e.g. a circle, square, etc.) associated with the question. Mark reading systems can grade such answer sheets significantly faster and more accurately than a human grader. However, conventional mark reading systems are limited by the accuracy with which the document is digitized. Increased accuracy is available with more sophisticated and more expensive systems. When a high degree of accuracy is required, expensive scanning equipment can be purchased which will provide a digitized representation of the document within most accepted error rates. However, in addition to the expense associated with such systems, they may not be easily configured to alternate environments where differing accuracy levels are required. When accuracy in the digitizing process is sacrificed, such systems often improperly grade test answers. For example, the systems may not recognize properly marked target areas that are incompletely filled or in which the pencil marking is lighter than a threshold value. Moreover, the systems may recognize stray marks and erasures as incorrect answers when a test taker did not intend such an answer.",
        "A particularly egregious error may result when a test taker properly marks a correct answer for a question, but a mark reading system recognizes a stray mark or erasure as an incorrect answer for the same question. In this case, although the test taker correctly answered the question, the test taker would not receive credit because the system would report that the test taker provided two answers. As such, the test taker may be penalized because of the medium in which the test is presented rather than the substantive material on which the test is based.",
        "What is needed is an improved image mark recognition system that can accurately evaluate the marks on a document to be digitized which is both cost effective and independent of the hardware being used to scan the document.",
        "Before the present methods, systems, and materials are described, it is to be understood that this invention is not limited to the particular methodologies, systems and materials described, as these may vary. It is also to be understood that the terminology used in the description is for the purpose of describing the particular versions or embodiments only, and is not intended to limit the scope of the present invention which will be limited only by the appended claims.",
        "It must also be noted that as used herein and in the appended claims, the singular forms “a,” “an,” and “the” include plural references unless the context clearly dictates otherwise. Thus, for example, reference to a “mark” is a reference to one or more marks and equivalents thereof known to those skilled in the art, and so forth. Unless defined otherwise, all technical and scientific terms used herein have the same meanings as commonly understood by one of ordinary skill in the art. Although any methods, materials, and devices similar or equivalent to those described herein can be used in the practice or testing of embodiments of the present invention, the preferred methods, materials, and devices are now described. All publications mentioned herein are incorporated by reference. Nothing herein is to be construed as an admission that the invention is not entitled to antedate such disclosure by virtue of prior invention.",
        "The present invention relates to enhancing a scanned image of a document or more accurately performing mark recognition of the scanned image to determine the presence or absence of a mark. The methodology of the present invention begins after a document has been digitized. The digitized image is then mapped to a coordinate system. The mapping is performed on the digitized image by using trigger rows, which are determined using existing marks on one margin of the document. The trigger rows are then logically extended across the document. Next, the present invention completes the mapping process by logically creating columns orthogonal to the extended trigger rows. The number of columns created can vary and may be configured to the degree of accuracy required. Alternately, the mapping process may be performed by using corner marks (also known as anchor marks or crop marks), which are marks printed at each corner of the document. A coordinate system is then created by determining the number of rows desired, which may vary, and equally dividing the space into horizontal rows, and by determining the number of columns desired, which may vary, and equally dividing the space into vertical columns. Document deskew may also be performed. Those skilled in the art will understand that other methods for mapping the digitized image to a coordinate system may also be used.",
        "Next, a resolver engine evaluates each cell on a pixel-by-pixel basis. The pixel-by-pixel analysis results in a value for each cell. The value may represent the opacity of a response mark present in the cell. The result is that the digitized image has been converted into a series of numeric values each representing a potential response mark on the original document.",
        "In a preferred embodiment, a method of performing image mark recognition includes accessing a scanned image of a document containing a plurality of image marks, performing reference image mark recognition on the scanned image, performing coordinate mapping on the scanned image to determine coordinates for a plurality of cells within the scanned image, analyzing one or more pixels in each cell, and determining a cell color value for each cell based on values assigned to the one or more pixels. In an embodiment, performing reference image mark recognition includes determining a location for each of one or more alignment marks and may further include verifying image mark alignment and spacing based on a resolution of the scanned image and the locations of the one or more alignment marks. In an embodiment, determining the location of one or more alignment marks includes examining each corner of the scanned image. In an embodiment, determining the location of one or more alignment marks includes searching for trigger rows on at least one margin of the scanned image.",
        "In an embodiment, performing coordinate mapping includes computing logical row coordinates for a number of rows in the scanned image, computing logical column coordinates for a number of columns in the scanned image, creating a mapping within the scanned image, and resolving the mapping into coordinate values for each of a plurality of cells. In an embodiment, computing logical row coordinates and logical column coordinates includes using one or more trigger marks as reference points. In an embodiment, computing logical row coordinates and logical column coordinates includes using one or more corner marks as reference points. The number of rows and the number of columns may be automatically determined based on the step of performing reference image mark recognition. Alternately, the number of rows and the number of columns may be predetermined. In an embodiment, creating a mapping includes determining absolute pixel positions for each cell within the scanned document as defined by an intersection of a row and a column.",
        "In an embodiment, analyzing one or more pixels includes incrementing a total color value by a color value for each pixel in a cell. Determining a cell color value may include setting the cell color value to the ratio of the total color value to a maximum color value.",
        "In a preferred embodiment, a system for performing image mark recognition includes a processor and one or more computer readable mediums operatively coupled to the processor. At least one of the one or more computer readable mediums contains a scanned image of a document. At least one of the one or more computer readable mediums contains computer program instructions for performing a method of performing image mark recognition.",
        "The accompanying drawings, which are incorporated in and form a part of the specification, illustrate preferred embodiments of the present invention and, together with the description serve to explain the principles of the invention. The embodiments illustrated in the drawings should not be read to constitute limiting requirements, but instead are intended to assist the reader in understanding the invention.",
        "FIG. 1 depicts an exemplary process flow for the image mark recognition process according to an embodiment of the present invention.",
        "FIG. 2 depicts an exemplary cell evaluation ordering according to an embodiment of the present invention.",
        "FIGS. 3A and 3B depict exemplary computations of cell color values according to an embodiment of the present invention.",
        "FIG. 4 is a block diagram of exemplary internal hardware that may be used to contain or implement the program instructions of a system embodiment of the present invention.",
        "The present invention relates to resolving a scanner image of a document to perform mark recognition on the scanned image. The present invention provides a system and method for resolving a digitized image of a document, independent of the hardware used to create the digitized image. The digitized image is enlisted by the present invention and a sequence of values representing the presence or absence of response marks on the document is created. This sequence of values is then available for use by any application which may be created to enhance the document, such as a scoring application which may be used to return a score for an examination.",
        "An aspect of the present invention involves mapping the digitized image of a document to a coordinate system. This coordinate mapping may be performed by detecting trigger row marks and/or corner/crop marks to create a logical document mapping. A trigger row mark is a mark on an edge of a document that denotes boundaries of a row logically extending across the document. In an assessment environment, responses may be entered within the logical rows. Each row for which a test taker can potentially enter one or more responses may have a separate trigger row mark. Alternatively, a trigger row mark may be used to denote every second row, third row, or any other pattern that may be used to logically subdivide a document. An alternate method of coordinate mapping includes use of corner/crop marks placed in each corner of the document. The crop marks are located and used to define the coordinate system by subdividing the space between the crop marks into a logical coordinate system. For example, adjacent crop marks along the vertical margin of the document may be subdivided into a predetermined number of equally sized rows. Similarly, adjacent crop marks along the horizontal margin of the document may be subdivided into a predetermined number of equally sized columns intersecting with the rows. The pre-determined number of rows and columns may be verified by analyzing the location of the response marks. Alternatively, a user may enter information regarding the document, such as a document number, from which the row and column placement is determined.",
        "As shown in FIG. 1, the process begins by accessing the digital image of a previously scanned document 105. The digital image may have been created by any means available and is not dependent on any particular hardware, format or resolution. A logical coordinate system is then mapped over the digital image 110 using the trigger row technique, the corner/crop mark techniques, or any other technique. The result of the coordinate mapping process 110 is that the digital image of the document has been logically subdivided into a plurality of cells that, in combination, comprise the entire digital image. The number of cells is configurable during the mapping process, and more or fewer cells may preferably be generated depending on the type of document being scanned and the processing required. The process then begins to iteratively analyze the image on a cell-by-cell basis to generate machine-readable data representative of the response marks on the document. This iterative process begins by obtaining the image 115 in the first cell. For example, as shown in FIG. 2, the mapping process may create an (N×M) coordinate system requiring evaluation of N*M cells. This process may, for example, begin by evaluating cell (1,1) 205, proceed to cell (1,2) 210 and continue in the same manner to cell (1,M) 215. Next, cell (2,1) 220 through (2,M) 225 and so on to cell (N,M) 230 may be evaluated. Alternate cell evaluation orderings and numberings are considered to be within the scope of this invention.",
        "Returning to FIG. 1, the process may resolve the response marks in each cell into computer readable values. For each cell, a cell color value from, for example, 0 to 100, inclusive, representing the amount of darkness/lightness of a cell's coloration may be assigned 120. The cell color value may be assigned 120 based on a ratio of the sum of color values for each pixel in a cell having a non-white color (collectively, a total color value) to a maximum color value for the cell. The maximum color value may be equal to the number of pixels in a cell multiplied by a maximum pixel color value.",
        "Two exemplary computations of a cell color value are shown in FIGS. 3A and 3B. In the exemplary computations, each pixel within a cell may be assigned a pixel color value ranging from 0 to 15, inclusive. In FIG. 3A, the cell has 4 pixels having a pixel color value equal to 0, 8 pixels having a pixel color value equal to 4, 12 pixels having a pixel color value equal to 9, and 12 pixels having a pixel color value equal to 15. The total color value for the cell in FIG. 3A is tc=(4*0)+(8*4)+(12*9)+(12*15)=32+108+180=320. The maximum color value for the cell in FIG. 3A is pc=(6 rows*6 columns*15)=540. The cell color value for the cell in FIG. 3A is v=tc/pc≈59%. Thus, the cell color value for the cell in FIG. 3A is 59.",
        "Similar computations are used to compute the total color value, maximum color value and cell color value in FIG. 3B. Here, tc=172, pc=540, and v≈32%. Hence, the cell color value for the cell in FIG. 3B is 32.",
        "Preferably, a value of 0 may represent the lightest possible mark (e.g., white), and a value of 100 may represent the darkest possible mark (e.g., black). The machine-readable data values for each cell may optionally be stored 125 to an output file.",
        "FIG. 4 is a block diagram of exemplary internal hardware that may be used to contain or implement the program instructions of a system embodiment of the present invention. Referring to FIG. 4, a bus 428 serves as the main information highway interconnecting the other illustrated components of the hardware. CPU 402 is the central processing unit of the system, performing calculations and logic operations required to execute a program. Read only memory (ROM) 418 and random access memory (RAM) 420 constitute exemplary memory devices.",
        "A disk controller 404 interfaces with one or more optional disk drives to the system bus 428. These disk drives may be external or internal floppy disk drives such as 410, CD ROM drives 406, or external or internal hard drives 408. As indicated previously, these various disk drives and disk controllers are optional devices.",
        "Program instructions may be stored in the ROM 418 and/or the RAM 420. Optionally, program instructions may be stored on a computer readable medium such as a floppy disk or a digital disk or other recording medium, a communications signal or a carrier wave.",
        "An optional display interface 422 may permit information from the bus 428 to be displayed on the display 424 in audio, graphic or alphanumeric format. Communication with external devices may optionally occur using various communication ports 426. An exemplary communication port 426 may be attached to a scanner 430 used to scan an image of a document into one or more of the memory devices or disk drives.",
        "In addition to the standard computer-type components, the hardware may also include an interface 412 which allows for receipt of data from input devices such as a keyboard 414 or other input device 416 such as a remote control, pointer and/or joystick.",
        "An embedded system may optionally be used to perform one, some or all of the operations of the present invention. Likewise, a multiprocessor system may optionally be used to perform one, some or all of the operations of the present invention.",
        "Although the invention has been described with reference to the preferred embodiments, it will be apparent to one skilled in the art that variations and modifications are contemplated within the spirit and scope of the invention. The drawings and description of the preferred embodiments are made by way of example rather than to limit the scope of the invention, and it is intended to cover within the spirit and scope of the invention all such changes and modifications."
    ],
    "citations": [
        "3601906",
        "3870865",
        "4153895",
        "4217487",
        "4300123",
        "4817179",
        "4979136",
        "5038393",
        "5101448",
        "5102341",
        "5103490",
        "5129014",
        "5134669",
        "5253304",
        "5452379",
        "5568571",
        "5572601",
        "5600732",
        "5625770",
        "5649026",
        "5672060",
        "5675671",
        "5754674",
        "5818976",
        "5825947",
        "5870488",
        "5956422",
        "6079624",
        "6129278",
        "6173154",
        "6188787",
        "6213664",
        "6259814",
        "6299066",
        "6311040",
        "6325286",
        "6408106",
        "6542629",
        "6575367",
        "6580820",
        "6684052",
        "6741738",
        "6927872",
        "6970267",
        "7004393",
        "2001/0033688",
        "2002/0168090",
        "2002/0181805",
        "2003/0072019",
        "2003/0173404",
        "2004/0185424",
        "2004/0202992",
        "2005/0157930",
        "2005/0201639",
        "2006/0062453",
        "2006/0250660",
        "2006/0252023",
        "62263584",
        "6176192"
    ],
    "us_classification": "382184",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "06",
            "subclass": "K",
            "main_group": "9",
            "subgroup": "18"
        }
    ]
}