{
    "title": "Marine seismic streamer having acoustic isolation between strength members and sensor mounting",
    "abstract": "A seismic streamer includes a jacket covering an exterior of the streamer. At least one strength member extends along the length of and is disposed inside the jacket. At least one seismic sensor is disposed in a sensor spacer mounted to the at least one strength member. The streamer includes means for retaining the at least one sensor spacer to the at least one strength member. The means for retaining provides substantial acoustic isolation between the at least one spacer and the at least one strength member.",
    "inventors": [
        "Tenghamn",
        "Stenzel"
    ],
    "document_number": "07298672",
    "publication_date": "20071120",
    "assignees": [
        "PGS Geophysical"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A seismic streamer, comprising:",
            "components": [
                {
                    "component": "a jacket covering an exterior of the streamer;",
                    "subcomponents": []
                },
                {
                    "component": "at least one strength member extending along the length of and disposed inside the jacket;",
                    "subcomponents": []
                },
                {
                    "component": "at least one seismic sensor disposed in a sensor spacer mounted to the at least one strength member; and",
                    "subcomponents": []
                },
                {
                    "component": "means for retaining the at least one sensor spacer to the at least one strength member, the means for retaining providing substantial acoustic isolation between the at least one spacer and the at least one strength member.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The streamer of claim 1 wherein the means for retaining comprises a substantially rigid tube surrounding the at least one strength member, and at least one resilient ring disposed between an exterior of the tube and an opening in the respective spacer.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The streamer of claim 2 wherein the opening comprises a groove for cooperatively receiving the resilient ring.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The streamer of claim 2 wherein the tube comprises a flange on an external surface thereof to longitudinally retain the resilient ring.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The streamer of claim 1 wherein the jacket comprises polyurethane.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The streamer of claim 1 wherein the at least one strength member comprises fiber rope.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The streamer of claim 6 further comprising two strength members.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The streamer of claim 1 further comprising buoyancy spacers disposed along the strength member and inside the jacket at spaced apart locations, the spacers having a density selected to provide the streamer with a selected overall density.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The streamer of claim 8 wherein the buoyancy spacers comprise foamed polyurethane.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The streamer of claim 1 further comprising a cable disposed inside the jacket, the cable having at least one of electrical conductors and an optical fiber, the cable adapted to carry signals from the at least one seismic sensor to a recording system.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The streamer of claim 1 wherein the at least one sensor comprises a hydrophone.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The streamer of claim 1 further comprising a termination plate coupled to each axial end of the jacket, the termination plates each coupled to the strength member at an axial end thereof, the termination plates adapted to couple to a corresponding termination plate in another segment of the streamer so as to transmit axial force therethrough.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The streamer of claim 1 further comprising a curable, synthetic urethane-based polymer introduced into the jacket in liquid form and curing thereafter.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A method for making a seismic streamer, comprising:",
            "components": [
                {
                    "component": "inserting a seismic sensor into an opening therefor in a sensor spacer;",
                    "subcomponents": []
                },
                {
                    "component": "affixing a substantially rigid tube to at least one strength member at a location therealong corresponding to a position of the sensor spacer;",
                    "subcomponents": []
                },
                {
                    "component": "applying at least one resilient ring to an exterior of the tube, the ring having a diameter selected to cooperate with a receiving feature therefor in the sensor spacer and to substantially prevent contact between the spacer and the tube;",
                    "subcomponents": []
                },
                {
                    "component": "inserting the at least one strength member and the at least one sensor spacer affixed thereto into an acoustically transparent jacket; and",
                    "subcomponents": []
                },
                {
                    "component": "filling the jacket with an acoustically transparent filler material.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 14 further comprising affixing at least one buoyancy spacer to the at least one strength member prior to the inserting into the jacket.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 14 wherein the material filling the jacket is introduced in liquid form and undergoes state change thereafter.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 14 wherein the tube comprises a flange to longitudinally retrain the resilient ring.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 14 further comprising connecting a cable to the seismic sensor prior to the inserting into the jacket.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 14 further comprising affixing a termination plate to each end of the at least one strength member and coupling each termination plate to an interior surface of the jacket at the ends thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. A seismic streamer, comprising:",
            "components": [
                {
                    "component": "a jacket covering an exterior of the streamer;",
                    "subcomponents": []
                },
                {
                    "component": "at least two strength members extending along the length of and disposed inside the jacket;",
                    "subcomponents": []
                },
                {
                    "component": "at least one seismic sensor disposed in each of a plurality of sensor spacers mounted at longitudinally spaced apart positions along the strength member; and",
                    "subcomponents": []
                },
                {
                    "component": "means for retaining the sensor spacers to the strength members, the means for retaining providing substantial acoustic isolation between the sensor spacers and the strength members.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The streamer of claim 20 wherein the means for retaining comprises a substantially rigid tube surrounding each strength member at a longitudinal position of each sensor spacer, and at least one resilient ring at each longitudinal end of each tube disposed between an exterior of each tube and an opening in the respective spacer.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The streamer of claim 21 wherein the opening comprises groove for cooperatively receiving each resilient ring.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The streamer of claim 21 wherein each tube comprises a flange on an external surface at each longitudinal end thereof to longitudinally retain the corresponding resilient ring.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The streamer of claim 20 wherein the jacket comprises polyurethane.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The streamer of claim 20 wherein the strength members comprise fiber rope.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The streamer of claim 20 further comprising buoyancy spacers disposed along the strength members and inside the jacket at spaced apart locations, the spacers having a density selected to provide the streamer with a selected overall density.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The streamer of claim 26 wherein the buoyancy spacers comprise foamed polyurethane.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The streamer of claim 20 further comprising a cable disposed inside the jacket, the cable having at least one of electrical conductors and an optical fiber, the cable adapted to carry signals from the seismic sensors to a recording system.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The streamer of claim 20 wherein the seismic sensors comprises hydrophones.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The streamer of claim 20 further comprising a termination plate coupled to each axial end of the jacket, the termination plates each coupled to the strength member at an axial end thereof, the termination plates adapted to couple to a corresponding termination plate in another segment of the streamer so as to transmit axial force therethrough.",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The streamer of claim 20 further comprising a curable, synthetic urethane-based polymer introduced into the jacket in liquid form and curing thereafter.",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. A seismic streamer, comprising:",
            "components": [
                {
                    "component": "a jacket covering an exterior of the streamer;",
                    "subcomponents": []
                },
                {
                    "component": "at least one strength member extending along the length of and disposed inside the jacket;",
                    "subcomponents": []
                },
                {
                    "component": "at least one seismic sensor disposed in a sensor spacer mounted to the at least one strength member; and",
                    "subcomponents": []
                },
                {
                    "component": "an acoustic isolator disposed between the at least one seismic sensor spacer and the at least one strength member.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. The streamer of claim 32 wherein the acoustic isolator comprises a substantially rigid tube surrounding the at least one strength member, and at least one resilient ring disposed between an exterior of the tube and an opening in the respective spacer.",
            "components": []
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The streamer of claim 33 wherein the opening comprises a groove for cooperatively receiving the resilient ring.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. The streamer of claim 33 wherein the tube comprises a flange on an external surface thereof to longitudinally retain the resilient ring.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. The streamer of claim 32 wherein the jacket comprises polyurethane.",
            "components": []
        },
        {
            "claim_number": "CLM-00037",
            "preamble": "37. The streamer of claim 32 wherein the at least one strength member comprises fiber rope.",
            "components": []
        },
        {
            "claim_number": "CLM-00038",
            "preamble": "38. The streamer of claim 37 further comprising two strength members.",
            "components": []
        },
        {
            "claim_number": "CLM-00039",
            "preamble": "39. The streamer of claim 32 further comprising buoyancy spacers disposed along the strength member and inside the jacket at spaced apart locations, the spacers having a density selected to provide the streamer with a selected overall density.",
            "components": []
        },
        {
            "claim_number": "CLM-00040",
            "preamble": "40. The streamer of claim 39 wherein the buoyancy spacers comprise foamed polyurethane.",
            "components": []
        },
        {
            "claim_number": "CLM-00041",
            "preamble": "41. The streamer of claim 32 further comprising a cable disposed inside the jacket, the cable having at least one of electrical conductors and an optical fiber, the cable adapted to carry signals from the at least one seismic sensor to a recording system.",
            "components": []
        },
        {
            "claim_number": "CLM-00042",
            "preamble": "42. The streamer of claim 32 wherein the at least one sensor comprises a hydrophone.",
            "components": []
        },
        {
            "claim_number": "CLM-00043",
            "preamble": "43. The streamer of claim 32 further comprising a termination plate coupled to each axial end of the jacket, the termination plates each coupled to the strength member at an axial end thereof, the termination plates adapted to couple to a corresponding termination plate in another segment of the streamer so as to transmit axial force therethrough.",
            "components": []
        },
        {
            "claim_number": "CLM-00044",
            "preamble": "44. The streamer of claim 32 further comprising a curable, synthetic urethane-based polymer introduced into the jacket in liquid form and curing thereafter.",
            "components": []
        }
    ],
    "description": [
        "Not applicable.",
        "Not applicable.",
        "1. Field of the Invention",
        "The invention relates generally to the field of marine seismic data acquisition equipment. More specifically, the invention relates to structures for marine seismic streamers, and methods for making such streamers.",
        "2. Background Art",
        "Marine seismic surveying is typically performed using “streamers” towed near the surface of a body of water. A streamer is in the most general sense a cable towed by a seismic vessel. The cable has a plurality of seismic sensors disposed thereon at spaced apart locations along the length of the cable. The seismic sensors are typically hydrophones, but can also be any type of sensor that is responsive to the pressure in the water, or to changes therein with respect to time. The seismic sensors may also be any type of particle motion sensor or acceleration sensor known in the art. Irrespective of the type of such seismic sensors, the sensors generate an electrical or optical signal that is related to the pressure-related or motion-related parameter being measured by the sensors. The electrical or optical signals are conducted along electrical conductors or optical fibers carried by the streamer to a recording system. The recording system is typically disposed on the seismic vessel, but may be disposed elsewhere.",
        "In a typical marine seismic survey, a seismic energy source is actuated at selected times, and a record, with respect to time, of the signals detected by the one or more sensors is made in the recording system. The recorded signals are later used for interpretation to infer structure of, fluid content of, and composition of rock formations in the Earth's subsurface. Structure, fluid content and mineral composition are typically inferred from characteristics of seismic energy that is reflected from subsurface acoustic impedance boundaries. One important aspect of interpretation is identifying those portions of the recorded signals that represent reflected seismic energy and those portions which represent noise.",
        "In order to improve the quality of seismic data interpretation, one goal of marine seismic streamer design is to reduce the various forms of noise detected by the seismic sensors. A typical marine seismic streamer can be up to several kilometers in length, and can include thousands of individual seismic sensors. Because of the weight of all of the materials used in a typical marine seismic sensor, because of the friction (drag) caused by the streamer as it is moved through the water, and because of the need to protect the seismic sensors, electrical and/or optical conductors and associated equipment from water intrusion, a typical seismic streamer includes certain features. First, the streamer includes one or more strength members to transmit axial force along the length of the streamer. The strength member is operatively coupled to the seismic vessel and thus bears all the axial loading caused by drag (friction) of the streamer in the water. The streamer also includes, as previously explained, electrical and/or optical conductors to carry electrical power and/or signals to the various sensors and (in certain streamers) signal conditioning equipment disposed in the streamer and to carry signals from the various sensors to a recording station. The streamer also typically includes an exterior jacket that surrounds the other components in the streamer. The jacket is typically made from a strong, flexible plastic such as polyurethane, such that water is excluded from the interior of the jacket, and seismic energy can pass essentially unimpeded through the jacket to the sensors. A typical streamer also includes buoyancy devices at spaced apart locations along its length, so that the streamer is substantially neutrally buoyant in the water. The interior of the jacket is typically filled with oil or similar electrically insulating fluid that is substantially transparent to seismic energy.",
        "The typical fluid-filled streamer structured as described above is well proven and has been used in the seismic surveying industry for a considerable time. However, there are some drawbacks to the fluid-filled streamer structure described above. One such drawback is leakage of the fluid into the surrounding water when a streamer section is damaged or the outer jacket is cut. This allows water to enter interstices of a streamer cable and could cause electrical failure of components in the streamer. At the same time, the streamer buoyancy is compromised. Because the fluid in the streamer is typically hydrocarbon-based, such as kerosene or light oil, such leakage can cause environmental damage. Damage to the streamer can occur while the streamer is being towed through the water or it can occur while the streamer is being deployed from or retrieved onto a winch on which streamers are typically stored on the seismic tow vessel.",
        "Another drawback to using fluid-filled streamers is that detectable noise can be generated by vibrations resulting from the streamer being towed through the water. Such vibrations can cause internal pressure waves that travel through the fluid inside the streamer, such waves often being referred to as “bulge waves” or “breathing waves.” Such noise is described, for example, in S. P. Beerens et al., Flow Noise Analysis of Towed Sonar Arrays, UDT 99—Conference Proceedings Undersea Defense Technology, Jun. 29-Jul. 1, 1999, Nice, France, Nexus Media Limited, Swanley, Kent. Noise in the form of pressure waves can be detected by the seismic sensors, making identification of reflected seismic energy in the recorded signals more difficult.",
        "Still another drawback to fluid-filled seismic streamers known in the art is transient motion of the various components of the streamer. Transient motion can induce detectable noise in the streamer. Ideally, during a seismic survey the entire streamer would move through the water at substantially constant velocity, and all the streamer components (i.e., the outer jacket, connectors, spacers, strength members, and filling fluid) would also move at the same constant velocity and thus not move with respect to each other. Under actual seismic survey conditions, however, motion of the seismic streamer is not uniform throughout and thus can lead to transient motion of various components, most notably the strength members. Transient motion can be caused by such events such as pitching and heaving of the streamers; strumming of towing cables attached to the streamers (the strumming caused by vortex shedding on the cables), and operation of depth-control devices located on the streamers.",
        "Transient motion of the strength members can cause transient longitudinal displacement of the spacers or connectors, causing pressure fluctuations in the fluid that are detected by the seismic sensors. Pressure fluctuations in the fluid that radiate away from the spacers or connectors can also cause the flexible outer jacket to bulge in and out as a traveling wave, giving this phenomenon its name. So called “bulge waves” can be detected by the seismic sensors. Another type of noise that can be caused by transient motion of the strength members will be further discussed below.",
        "Other types of noise, generally called “flow noise”, can also affect the signals detected by the seismic sensors. For example, vibrations in and along the seismic streamer can cause extensional waves in the outer jacket and can cause resonance transients to travel along the strength members. A turbulent boundary layer created around the outer jacket of the streamer by the act of towing the streamer in the water can also cause pressure fluctuations in the fluid filling the streamer.",
        "In fluid-filled streamers, extensional waves in the jacket, resonance transients, and turbulence-induced noise are typically smaller in amplitude than bulge waves. Bulge waves are usually the largest source of vibration noise because these waves travel within the fluid core material filling the streamer and thus act directly on the seismic sensors. Nonetheless, all of these noise sources cumulatively can affect the detection of reflected seismic energy from the Earth formations below the water bottom, and thus affect the quality of seismic surveys.",
        "Several methods and structures for streamers have been devised to reduce the foregoing types of noise. One such structure includes compartment isolation blocks within a fluid-filled streamer section to stop the vibration-caused bulge waves from traveling continuously along the entire length of the streamer. Another such noise reducing structure includes open-cell foam disposed in the interior of the streamer. The open-cell foam restricts the movement of the fluid in response to transient pressure changes and causes transient pressure energy to be dissipated into the outer jacket and the foam over a shorter longitudinal distance. Another structure used to reduce noise includes combining (summing) the signals from several longitudinally spaced apart seismic sensors to attenuate effects of relatively slow-moving bulge waves or similar noise. In such structures, an equal number of seismic sensors are positioned between or on both sides of each of the spacers in a streamer segment so that longitudinally equally spaced apart (from the spacer) pairs of seismic sensors detected equal yet opposite polarity pressure changes. Summing the signals from all the sensors in such a group can thus effectively cancel some of the noise.",
        "Another approach to reducing the effects of bulge waves is to eliminate the fluid from the streamer sections entirely, so that no medium exists in which bulge waves can propagate. This approach is exemplified by so-called “solid” streamers, in which each streamer section is filled with a solid core material instead of a fluid. However, in any solid material, some shear waves will develop, which can increase some types of noise detected by the seismic sensors. Shear waves, of course, for the most part cannot propagate in a fluid filled streamer because fluids have substantially zero shear modulus (at least as compared with typical solid materials). Additionally, many conventional solid core materials are not substantially acoustically transparent to pressure waves, thus reducing the sensitivity of such streamers to reflected seismic energy. To deal with the foregoing limitations of using solid fill material in a streamer, another approach to reducing noise in streamers has been developed, which is to replace the fluid with a semi-solid or gelatin-like filler material. Such semi-solid filler material is flexible and acoustically transparent to seismic energy. The use of semi-solid material may reduce the development of bulge waves as compared to those in a fluid filled streamer, because the semi-solid material has much lower compressibility than fluid and thus reduces longitudinal displacement of the spacers. A semi-solid material may also reduce the transmission of shear waves as compared with that of a solid streamer.",
        "Using a semi-solid material as described in the above referenced patent application substantially attenuates bulge waves, but noise resulting from the so called “Poisson Effect” from the strength members can actually increase as compared to fluid filled streamers. The Poisson Effect is characterized by a change in diameter of the strength member as the tension applied to the strength member changes. The diameter change will be related to the magnitude of the tension change and to Poisson's ratio of the material used for the strength member. As previously explained, various effects on the streamer can cause tension transients along the strength members. Tension transients typically propagate along the length of the strength member at a velocity related to the elastic modulus of the material used to make the strength member. As such tension transients travel along the strength member, a corresponding change in diameter of the strength member occurs. Changes in diameter of the strength member can induce compressional waves in the media that fill the streamer. In a typical streamer, seismic sensors are each disposed within a suitable opening in a sensor spacer. Each sensor spacer is adhesively coupled or otherwise affixed to the strength members, wherein the strength members pass through suitable openings in the spacers. Sensor spacers are typically made from dense, rigid plastic to protect the sensor from damage during handling and use. While effective at reducing damage to the sensors, the sensor spacers also effectively couple Poisson Effect noise, among other types of noise, from the strength members to the sensors.",
        "It is desirable to have a seismic streamer that takes advantage of the benefits of semi-solid filling materials, while having reduced amplitude of compressional waves (Poisson Effect waves) resulting from tension transients and other types of noise passing along the strength members transmitted into the seismic sensors.",
        "A seismic streamer includes a jacket covering an exterior of the streamer. At least one strength member extends along the length of and is disposed inside the jacket. At least one seismic sensor is disposed in a sensor spacer mounted to the at least one strength member. The streamer includes means for retaining the at least one sensor spacer to the at least one strength member, the means for retaining provides substantial acoustic isolation between the at least one spacer and the at least one strength member.",
        "In one embodiment, the means for retaining includes a substantially rigid tube affixed to the strength member, and resilient ring disposed between the tube and an interior of the sensor spacer.",
        "A seismic streamer according to another aspect of the invention includes a jacket covering an exterior of the streamer. At least one strength member extends along the length of and is disposed inside the jacket. At least one seismic sensor is disposed in a sensor spacer mounted to the at least one strength member. An acoustic isolator is disposed between the at least one seismic sensor spacer and the at least one strength member.",
        "In one embodiment, the acoustic isolator includes a substantially rigid tube affixed to the strength member, and resilient ring disposed between the tube and an interior of the sensor spacer.",
        "A method for making a seismic streamer according to another aspect of the invention includes inserting a seismic sensor into an opening therefor in a sensor spacer. A substantially rigid tube is affixed to at least one strength member at a location therealong corresponding to a position of the sensor spacer. At least one resilient ring is applied to an exterior of the tube. The ring has a diameter selected to cooperate with a receiving feature therefor in the sensor spacer and to substantially prevent contact between the spacer and the tube. The at least one strength member is inserted into the at least one sensor spacer and is affixed thereto and the combination is inserted into an acoustically transparent jacket. The jacket is then filled with an acoustically transparent filler material.",
        "Other aspects and advantages of the invention will be apparent from the following description and the appended claims.",
        "FIG. 1 shows typical marine seismic data acquisition using a streamer according to one embodiment of the invention.",
        "FIG. 2 shows a cut away view of one embodiment of a streamer segment according to the invention.",
        "FIG. 3 shows a prior art assembly of a seismic sensor to a spacer.",
        "FIG. 4 shows an exploded view of one embodiment of a sensor spacer having acoustic isolation from a strength members in a streamer according to the invention.",
        "FIG. 5 shows the embodiment of FIG. 4 as assembled.",
        "FIG. 1 shows an example marine seismic data acquisition system as it is typically used in acquiring seismic data. A seismic vessel 14 moves along the surface of a body of water 12 such as a lake or the ocean. The marine seismic survey is intended to detect and record seismic signals related to structure and composition of various subsurface Earth formations 21, 23 below the water bottom 20. The seismic vessel 14 includes source actuation, data recording and navigation equipment, shown generally at 16, referred to for convenience as a “recording system.” The seismic vessel 14, or a different vessel (not shown), can tow one or more seismic energy sources 18, or arrays of such sources in the water 12. The seismic vessel 14 or a different vessel tows at least one seismic streamer 10 near the surface of the water 12. The streamer 10 is coupled to the vessel 14 by a lead in cable 26. A plurality of sensor elements 24, or arrays of such sensor elements, are disposed at spaced apart locations along the streamer 10. The sensor elements 24, as will be explained in more detail below with reference to FIG. 4, are formed by mounting a seismic sensor inside a sensor spacer.",
        "During operation, certain equipment (not shown separately) in the recording system 16 causes the source 18 to actuate at selected times. When actuated, the source 18 produces seismic energy 19 that emanates generally outwardly from the source 18. The energy 19 travels downwardly, through the water 12, and passes, at least in part, through the water bottom 20 into the formations 21, 23 below the water bottom 20. Seismic energy 19 is at least partially reflected from one or more acoustic impedance boundaries 22 below the water bottom 20, and travels upwardly whereupon it may be detected by the sensors in each sensor element 24. Structure of the formations 21, 23, among other properties of the Earth's subsurface, can be inferred by travel time of the energy 19 and by characteristics of the detected energy such as its amplitude and phase.",
        "Having explained the general method of operation of a marine seismic streamer, an example embodiment of a streamer according to the invention will be explained with reference to FIG. 2. FIG. 2 is a cut away view of a portion (segment) 10A of a typical marine seismic streamer (10 in FIG. 1). A streamer as shown in FIG. 1 may extend behind the seismic vessel (14 in FIG. 1) for several kilometers, and is typically made from a plurality of streamer segments 10A as shown in FIG. 2 connected end to end behind the vessel (14 in FIG. 1).",
        "The streamer segment 10A in the present embodiment may be about 75 meters in overall length. A streamer such as shown at 10 in FIG. 1 thus may be formed by connecting a selected number of such segments 10A end to end. The segment 10A includes a jacket 30, which, in the present embodiment, can be made from 3.5 mm thick transparent polyurethane and has a nominal external diameter of about 62 millimeters. In each segment 10A, each axial end of the jacket 30 may be terminated by a coupling/termination plate 36. The coupling/termination plate 36 may include rib elements 36A on an external surface of the coupling/termination plate 36 that is inserted into the end of the jacket 30, so as to seal against the inner surface of the jacket 30 and to grip the coupling/termination plate 36 to the jacket 30 when the jacket 30 is secured by an external clamp (not shown). In the present embodiment, two strength members 42 are coupled to the interior of each coupling/termination plate 36 and extend the length of the segment 10A. In a particular implementation of the invention, the strength members 42 may be made from a fiber rope made from a fiber sold under the trademark VECTRAN, which is a registered trademark of Hoechst Celanese Corp., New York, N.Y. The strength members 42 transmit axial load along the length of the segment 10A. When one segment 10A is coupled end to end to another such segment (not shown in FIG. 2), the mating coupling/termination plates 36 are coupled together using any suitable connector, so that the axial force is transmitted through the coupling/termination plates 36 from the strength members 42 in one segment 10A to the strength member in the adjoining segment.",
        "The segment 10A can include a number of buoyancy spacers 32 disposed in the jacket 30 and coupled to the strength members 42 at spaced apart locations along their length. The buoyancy spacers 32 may be made from foamed polyurethane or other suitable material having a density selected to provide the segment 10A preferably with approximately the same overall density as the water (12 in FIG. 1), so that the streamer (10 in FIG. 1) will be substantially neutrally buoyant in the water (12 in FIG. 1). As a practical matter, the buoyancy spacers 32 provide the segment 10A with an overall density very slightly less than that of fresh water. Appropriate overall density may then be adjusted in actual use by selecting the number of buoyancy spacers 32 and fill media having suitable specific gravity to be utilized in each segment 10A.",
        "The segment 10A includes a conductor cable 40, which may be centrally located, and which may include a plurality of insulated electrical conductors (not shown separately), and may include one or more optical fibers (not shown). The cable 40 conducts electrical and/or optical signals from the sensors (which will be further explained below with reference to FIGS. 3 and 4) to the recording system (16 in FIG. 1). The cable 40 may in some implementations also carry electrical power to various signal processing circuits (not shown separately) disposed in one or more segments 10A, or disposed elsewhere along the streamer (10 in FIG. 1). The length of the conductor cable 40 within a cable segment 10A is generally longer than the axial length of the segment 10A under the largest expected axial stress on the segment 10A, so that the electrical conductors and optical fibers in the cable 40 will not experience any substantial axial stress when the streamer 10 is towed through the water by a vessel. The conductors and optical fibers may be terminated in a connector 38 disposed in each coupling/termination plate 36 so that when the segments 10A are connected end to end, corresponding electrical and/or optical connections may be made between the electrical conductors and optical fibers in the conductor cable 40 in adjoining segments 10A.",
        "Sensors, which in the present embodiment may be hydrophones, can be disposed inside respective sensor spacers, shown in FIG. 2 generally at 34. The hydrophones in the present embodiment can be of a type known to those of ordinary skill in the art, including but not limited to those sold under model number T-2BX by Teledyne Geophysical Instruments, Houston, Tex. In the present embodiment, each segment 10A may include 96 such hydrophones, disposed in arrays of sixteen individual hydrophones connected in electrical series. In a particular implementation of the invention, there are thus six such arrays, spaced apart from each other at about 12.5 meters. The spacing between individual hydrophones in each array should be selected so that the axial span of the array is at most equal to about one half the wavelength of the highest frequency seismic energy intended to be detected by the streamer (10 in FIG. 1). It should be clearly understood that the types of sensors used, the electrical and/or optical connections used, the number of such sensors, and the spacing between such sensors are only used to illustrate one particular embodiment of the invention, and are not intended to limit the scope of this invention. In other embodiments, the sensors may be particle motion sensors such as geophones or accelerometers. A marine seismic streamer having particle motion sensors is described in U.S. patent application Ser. No. 10/233,266, filed on Aug. 30, 2002, entitled, Apparatus and Method for Multicomponent Marine Geophysical Data Gathering, assigned to an affiliated company of the assignee of the present invention and incorporated herein by reference.",
        "At selected positions along the streamer (10 in FIG. 1) a compass bird 44 may be affixed to the outer surface of the jacket 30. The compass bird 44 includes a directional sensor (not shown separately) for determining the geographic orientation of the segment 10A at the location of the compass bird 44. The compass bird 44 may include an electromagnetic signal transducer 44A for communicating signals to a corresponding transducer 44B inside the jacket 30 for communication along the conductor cable 40 to the recording system (16 in FIG. 1). Measurements of direction are used, as is known in the art, to infer the position of the various sensors in the segment 10A, and thus along the entire length of the streamer (10 in FIG. 1). Typically, a compass bird will be affixed to the streamer (10 in FIG. 1) about every 300 meters (every four segments 10A). One type of compass bird is described in U.S. Pat. No. 4,481,611 issued to Burrage and incorporated herein by reference.",
        "In the present embodiment, the interior space of the jacket 30 may be filled with an acoustically transparent filler material 46 such as buoyancy void filler (“BVF”), which may be a curable, synthetic urethane-based polymer. The BVF 46 serves to exclude fluid (water) from the interior of the jacket 30, to electrically insulate the various components inside the jacket 30, to add buoyancy to a streamer section and to transmit seismic energy freely through the jacket 30 to the sensors 34. The BVF 46 in its uncured state is essentially in liquid form and may be introduced into the interior of the jacket 30 in such liquid form for cure afterward. Upon cure, the BVF 46 no longer flows as a liquid, but instead becomes substantially solid. However, the BVF 46 upon cure retains some flexibility to bending stress, is substantially elastic, and freely transmits seismic energy to the seismic sensors. It should be understood that the BVF used in the present embodiment only is one example of an acoustically transparent filler material that can be used to fill the interior of the streamer. Other materials could be also used. For example, a selected substance, such as a thermoplastic, that is heated above its melting point, and introduced into the interior of the jacket 30, and subsequent cooled, may also be used in a streamer according to the invention.",
        "The sensor spacers 34, as explained in the Background section herein, are typically molded from a rigid, dense plastic to better protect the seismic sensors therein from damage during handling and use. While effective in reducing incidence of damage to the seismic sensors, the rigid plastic used in the sensor spacers 34 also efficiently couples noise from the strength members 42 to the seismic sensor therein. Also as explained in the Background section herein, one source of noise is the Poisson Effect, wherein stretching of the strength members 42 under axial tension causes them to undergo a reduction in diameter. When the axial tension is reduced on the strength members 42, they increase diameter. The strength members 42 are typically tightly fit in, and adhesively bonded to through passages (52 in FIG. 3) in the sensor spacers 34. Thus diameter changes in the strength members 42 are efficiently transferred to the sensor spacers 34, providing a source of noise that can be detected by the seismic sensors.",
        "FIG. 3 illustrates a system known in the art prior to the present invention in which seismic sensors are mounted in the sensor spacers. The sensor spacer 34 includes an opening 50 shaped to accept a seismic sensor 56. The sensor 56 in this embodiment can be the model number T-2BX hydrophone made by Teledyne Geophysical Instruments, explained above with reference to FIG. 2. The housing of the sensor 56 includes ribs 56A on its lateral edges, such that when the sensor 56 is inserted into the opening 50, the sensor 56 is retained in the opening 50 by interference fit. The spacer 34 also includes through passages 52 through which the strength members (42 in FIG. 2) are inserted. An adhesive port 54 is provided on the spacer 34, and into which adhesive (not shown) is injected after the strength members (42 in FIG. 2) are inserted into the through passages 52.",
        "Having explained generally the construction of a marine seismic sensor streamer, one embodiment of a structure for a streamer according to the invention will be explained with reference to FIGS. 4 and 5, of which FIG. 4 is an exploded view to show the relevant components. A sensor spacer 34 shown in FIG. 4 may be molded from rigid polypropylene or similar plastic as previously explained herein, and may include an opening 50 having size and shape configured to receive a seismic sensor 56 therein. In the present embodiment, the seismic sensor 56 may be retained in the opening 50 by interference fit as explained above with reference to FIG. 3, or, in a particular embodiment, by the action of the BVF (46 in FIG. 2) upon cure thereof such that there is substantially no direct contact between the sensor 56 and the interior surface of the opening 50. Prior to and during cure of the BVF (46 in FIG. 2) in such embodiments, the sensor 56 may be suspended from contacting the interior surface of the opening 50 by using soft elastomer rings (not shown) or the like. The seismic sensor 50 may be a hydrophone or any other type of seismic sensor known in the art.",
        "The exterior of the sensor spacer 34 may include on each side thereof a substantially semi cylindrically shaped channel 52A extending along the longitudinal dimension of the spacer 34. The channel 52A has a diameter selected to receive the strength member 42 therein substantially without contact between the strength member 42 and the interior of the channel 52A. In the longitudinal position at which the strength member 42 is to be inserted into the channel 52A, the strength member 42A may be covered on its exterior by a tube 60 made from dense, rigid plastic, such as a thermoplastic sold under the trademark ISOPLAST, which is a registered trademark of The Upjohn Company, 7000 Portage Rd., Kalamazoo, Mich. 49001. The tube 60 may be adhesively bonded or otherwise affixed to the strength member 42. The tube 60 preferably includes a flange 62 or similar enlarged diameter feature at each longitudinal end thereof to retain an associated elastomer ring 64 or ring made of similarly soft, compressible material from moving beyond the longitudinal end of the tube 60. The elastomer rings 64 have an uncompressed external diameter larger than the diameter of the flanges 62 such that when the strength member 42 is inserted into the channel 52A, there is substantially no contact between any part of the tube 60, the flanges 62 or the strength member 42, and the body of the spacer 34. Preferably, the interior of the channel 52A includes grooves 66 or similarly shaped features that cooperatively engage and retain the elastomer rings 64. The elastomer rings 64 are prevented from movement along the interior of the channel 52A by the grooves 66, and are retained longitudinally along the exterior of the tube 60 by the flanges 62. Thus, the spacer 34 is longitudinally fixed with respect to the strength member 42 when the strength member 42, tube 60 and elastomer rings 64 are inserted into the channel 52A.",
        "When Poisson waves travel along the strength member 42, they are to a substantial extent attenuated in radial amplitude by the tube 60. The tube 60 will expand to some extent under the expansion force of the strength member 42 as Poisson waves travel therealong, but because the tube has a much higher rigidity than the strength member, a substantial portion of the radial expansion of the strength member 42 will not result in corresponding expansion of the tube 60. Further, because the tube 60 is separated from the spacer 34 by the elastomer rings 64, any diameter change in the tube 60 will be substantially isolated from the spacer 34. As a result, the effects of Poisson waves traveling along the strength member will be substantially isolated from the spacer 34, and thus from the sensor 56. An assembled view of the sensor spacer 34 according to this embodiment is shown in FIG. 5. In the present embodiment, it is contemplated that the strength members 42 will be retained in the channels 52A by the jacket (30 in FIG. 2).",
        "It should be clearly understood that while it is preferable to use gel as explained herein to fill the interior of the jacket, using such gel for filling the interior of the jacket is not necessary to cause the streamer of the invention to perform its intended function. Gel is only required to fill the opening (50 in FIG. 4) in the sensor spacer 34 in the present embodiment to retain the sensor 56 therein and isolate the sensor 56 acoustically from the sensor spacer 34. As explained above, it is only necessary to mount the spacer 34 such that it is substantially acoustically isolated from the strength member(s) in order to accomplish the intended function of a streamer according to the various aspects of this invention.",
        "Streamers and streamer segments made according to the various aspects of the invention may have reduced noise resulting from transient tension of the strength members, for increased accuracy in seismic surveying.",
        "While the invention has been described with respect to a limited number of embodiments, those skilled in the art, having benefit of this disclosure, will appreciate that other embodiments can be devised which do not depart from the scope of the invention as disclosed herein. Accordingly, the scope of the invention should be limited only by the attached claims."
    ],
    "citations": [
        "3615961",
        "3675193",
        "4268912",
        "4779852",
        "4809244",
        "4821241",
        "4910715",
        "5007030",
        "5044460",
        "5062085",
        "5367499",
        "5442594",
        "5463193",
        "5600608",
        "5745436",
        "5757726",
        "6108274",
        "6334608",
        "6684160",
        "6827597",
        "6879546",
        "2004/0017731",
        "2004/0042341",
        "2005/0194201",
        "2006/0133202",
        "2006/0193203",
        "2006/0215490"
    ],
    "us_classification": "367176",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "06",
            "subclass": "B",
            "main_group": "1",
            "subgroup": "06"
        }
    ]
}