{
    "title": "Bellows with molded panels",
    "abstract": "A multi-sided bellows cover has panel sections formed of extruded plastic panels that are connected end-to-end by bead-in-slot connections. The panel sections can be made of one or more rigid wall sections that are connected at the fold lines by flexible web sections or by the bead-in-slot connection. The panel sections are integrally molded by extrusion, and many serial wall sections alternating with web sections may be integrally co-extruded with one another.",
    "inventors": [
        "Day",
        "Mattson",
        "Piacsek"
    ],
    "document_number": "07297392",
    "publication_date": "20071120",
    "assignees": [
        "A & A Mfg. Co., Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. In a multi-sided bellows cover of the type that extends between relatively movable parts of a machine to which the bellows is mounted to enclose the space between the movable parts as they move relative to one another, one end of the bellows being affixed to one of the parts and an opposite end of the bellows being affixed to the other of the parts so that the bellows is extended when the parts move relatively apart and the bellows contracts when the parts move relatively together, said bellows substantially enclosing the space between the parts as the parts move relatively together and apart, each side of the bellows including an accordion folded panel, the improvement wherein each said panel includes a plurality of panel sections that are connected to one another by a bead-in-slot connection, and wherein at least some of the panel sections include at least one relatively rigid wall section and at least one relatively flexible web section integrally molded with the wall section.",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The improvement of claim 1 , wherein at least two adjacent sides of the bellows have corners between them that are formed by a web of flexible material that is affixed to each of the sides.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The improvement of claim 1 , wherein the panel sections are molded plastic.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The improvement of claim 1 , wherein at least some of the panel sections include a relatively rigid wall section.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The improvement of claim 1 , wherein at least some of the panel sections include at least two relatively rigid wall sections and at least one relatively flexible web section integrally molded with the two wall sections joining the two wall sections with a flexible hinge joint.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The improvement of claim 5 , wherein one of the wall sections has a bead at an edge opposite from the web section and the other wall section has a slot at an edge opposite from the web section.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The improvement of claim 1 , further comprising a tie strap attached to the bellows that limits the extension of the bellows.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The improvement of claim 1 , wherein the bead-in-slot connection provides a hinge connection.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The improvement of claim 1 , wherein said panel sections are extruded profiles.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The improvement of claim 1 , wherein each panel section includes a rigid wall section having a bead at one end and a slot at an opposite end.",
            "components": []
        }
    ],
    "description": [
        "This is a continuation-in-part of U.S. patent application Ser. No. 09/970,316 filed Oct. 3, 2001 now U.S. Pat. No. 6,986,938.",
        "This invention relates to multi-sided bellows covers of the type which extend between relatively movable parts of a machine to which the bellows is mounted.",
        "Bellows are well known in industrial and other applications to enclose the space between two relatively movable parts of a machine. One such application is a lift table of the type that has a scissors or other lift mechanism to lift a table relative to a base. One end of the bellows is connected to one of the relatively movable parts of the machine, for example in a lift table to the table, and the other end of the bellows is connected to the other relatively movable portion, for example the base in a lift table, and the bellows encloses the machine between the two portions, i.e. between the base and the table in a lift table, typically where the mechanism resides. The bellows encloses this to protect it from dirt, coolants, cutting fluids, light, humidity and so forth.",
        "Bellows have typically been made by providing accordion folded sewn panels, made of for example rubberized or vinyl coated canvas or other fabric strips joined edge to edge to form the pleats of the panel, and connecting adjacent panels at the corners with flexible or foldable fabric which encloses the corners. As such, the bellows has a typically four-sided pleated construction. While a bellows must be expandable and contractible to enclose an axially variable space, a bellows must also provide resistance to lateral forces which may be exerted against the sides of the bellows to protect the enclosed space. The bellows must do this when it is both extended and retracted, and at all the positions in between.",
        "The individual slats which make up the pleats of a bellows have typically been joined at their longitudinal edges either by bonding to a continuous sheet of flexible material and folding, by sewing or by a similar operation. The material of the bellows at the edges of the individual slats, i.e., at the apexes of the pleats, must be sufficiently flexible to permit expansion and contraction of the pleats as the bellows expands and contracts. However, the slats must also be rigid enough to support the weight of the bellows without sagging and to resist lateral forces which tend to deflect the bellows in the lateral direction perpendicular to the axial direction, which is the direction of expansion and contraction. The result in many of the prior art bellows has been to make the bellows of multi-layer constructions, including flexible layers and rigid layers, or to re-enforce the bellows with wires or rigid panel components, resulting in expensive fabrication operations and considerable weight of the bellows.",
        "The present invention provides a multi-sided bellows cover of the above-described type in which each panel includes a number of panel sections, and the panel sections are connected to one another along their longitudinal edges by bead-in-slot connections. Therefore, the bead-in-slot connections provide a joint that is easy to assemble and disassemble, and also that adds rigidity without adding excessive weight. In addition, the panel sections may be made by a low cost plastic molding process such as extrusion, injection molding, vacuum forming, press molding, blow molding or any other molding process.",
        "In a preferred aspect, the panel sections are extruded profiles, meaning that they can be made by an extrusion process that results in them being longitudinally continuous for the length of the sections.",
        "In another aspect, the panel sections can include rigid wall sections that provide rigidity and flexible web sections that provide living hinges. Alternatively, the bead in slot connections can be made to pivot so as to provide a hinge joint and in such embodiments the panel sections can be made either with or without flexible web sections. In addition, the panel sections can include more than one wall section and/or more than one web section in each panel member.",
        "Bellows of the invention have their adjacent panels connected by corner sections, which can be a flexible piece of sheet material folded so as to provide the corner. The corner may be either a square corner or a chamfered corner, as is ordinary in other types of bellows. Bellows of the invention may also have a strap connected from peak to peak of the pleats to limit the extension of the bellows.",
        "These and other objects and advantages of the invention will be apparent from the detailed description and drawings.",
        "FIG. 1 is a perspective view of a bellows incorporating the invention;",
        "FIG. 1A is a partial cross-sectional view illustrating a possible end mounting configuration that may be applied to the bellows of FIG. 1;",
        "FIG. 2 is a side plan view of the bellows of FIG. 1;",
        "FIG. 3 is a top plan view of the bellows of FIGS. 1 and 2;",
        "FIG. 4 is a cross-sectional view from the plane of the line for 4-4 of FIG. 1;",
        "FIG. 5 is a partial view of a corner of the bellows showing a square corner construction;",
        "FIG. 6 is a top plan view of the corner of FIG. 5;",
        "FIG. 7 is a partial perspective view illustrating a chamfered corner embodiment;",
        "FIG. 8 is a top plan view of the corner of FIG. 7;",
        "FIG. 9 is an end plan view of the panel shown in FIG. 10 laid flat;",
        "FIG. 10 is a top plan view of two panels for a bellows of the invention laid flat over a strip of corner material for joining the two panels at a corner;",
        "FIG. 11 is a partial perspective view illustrating how one embodiment of a panel for a bellows of the invention fits together;",
        "FIG. 12 is a detail view of one of the connections of the panel of FIG. 11;",
        "FIG. 13 is a view similar to FIG. 11 but illustrating an alternative embodiment of a panel;",
        "FIG. 14 is a detail view illustrating one of the integrally connected corners of the panel section shown in FIG. 13;",
        "FIG. 15 is a fragmentary end view of an alternative embodiment of panel sections; and",
        "FIG. 16 is a fragmentary end view of another alternative embodiment of panel sections like FIG. 15 but without any flexible web sections.",
        "Referring to FIGS. 1-4, a bellows cover 10 of the invention has four sides 12, 14, 16 and 18 which define an open-ended box like structure with accordion folded, or pleated, sides. The adjacent sides, 12, 14, 16 and 18 are connected to one another at their ends, i.e., at the corners of the bellows 10, by strips of folded fabric or other flexible sheet material 20. The sheet material 20 may be provided both on the inside and on the outside surfaces of the sides 12, 14, 16 and 18. In addition, the apexes of the pleats may be connected by limiting straps 22 (FIG. 4), as required (for example, two) on each side, on the inside of the bellows 10. The limiting strips 22 may be adhered to the peaks, or maybe affixed by stitching, stapling, rivets or other mechanical fasteners. In this context, mechanical fasteners should be interpreted to include adhesives, as well as other types of mechanical fasteners such as stitching, staples, rivets, bolts, screws, heat sealing or other means by which two components are secured.",
        "FIG. 1A illustrates one possible end mounting configuration for the bellows 10. The top slat 23 is axially directed and affixed by bolts, rivets, adhesive or other fasteners to the table 25 or other relatively movable component of the machine to which the bellows is assembled, and the bottom slat 27 is laterally directed and affixed by bolts, rivets, adhesive or other fasteners to the base 29 or other relatively movable component of the machine to which the bellows is assembled. Alternatively, both top and bottom slats may be axially directed or laterally directed, or any combination. Any suitable mounting configuration may be used with the invention, and it need not necessarily be a molded slat which is attached directly to the movable component. For example, an end slat of the bellows could be affixed to an adaptor array, such as loops of material supported on a bar, which is attached to the movable component.",
        "Referring to FIGS. 5-8, FIGS. 5 and 6 illustrate a square corner construction and FIGS. 7 and 8 illustrate a chamfered corner construction. Both of these corner constructions have been applied to bellows in the prior art, and can also be applied to a bellows of the invention. Referring to FIGS. 9 and 10, sides 16 and 18 are shown laid flat, and FIG. 10 illustrates one of the corner pieces 20 below the sides 16, 18, in position for fixation to the sides 16, 18. End 26 of panel 18 is cut straight and end 28 of panel 16 is cut in zig zag fashion with the peaks and valleys of the zig zag corresponding to fold lines of the panel 16, which fold lines line up with fold lines of the panel 18. A small minimum spacing, for example one-quarter inch, is provided between the end 26 and the end 28. Fabric panel 20, for example vinyl coated canvas or other fabric, is stitched, heat sealed, adhered, RF sealed, sonic welded, clipped or otherwise secured to the facing sides of the panels 16 and 18, and a panel 20 may be provided on each side of the panels 16 and 18. The assembly is then folded so as to form the pleats, and how it is folded determines whether the corner is square as shown in FIGS. 5 and 6 or chamfered as shown in FIGS. 7 and 8. As shown in FIG. 5, if the peaks on one side are made to correspond with the peaks on the other side, then the corner appears square in top view. However, if the valleys on one side are made to correspond to the peaks on the other side, then the corner appears chamfered as shown in FIG. 8 in top view. Note that in FIG. 10, the straight side 26 could have also been cut in zig zag fashion so as to fill in the v-shaped gaps between the straight side 26 and the valleys at the end of side 28. In addition, both sides 26 and 28 could have been cut straight as well, in which case the panels 16 and 18 would be spaced further apart than as shown in FIG. 10.",
        "Referring to FIGS. 11 and 12, a section of a panel 12, 14, 16 or 18 is shown. Each panel 12, 14, 16 and 18 includes a number of edge to edge connected panel sections 30, each of which has a relatively rigid wall section 32 integrally connected along one edge to a relatively flexible web section 34. The web sections 34 form the folds which are the peaks and valleys of the accordion folded panel. The wall sections and web sections are integrally molded so that at least one web section is integral along a longitudinal edge of at least one web section. The plastic of the wall sections 32 is harder and more rigid than the plastic of the web sections 34. For example, the wall sections 32 may be molded by extrusion of rigid PVC and the web sections 34 may be similarly and simultaneously molded by extrusion of flexible PVC, in one piece with the rigid PVC wall sections 32. Other materials may also be used for molding the panel such as polystyrene, polyethylene, polypropylene or other plastic materials. In some cases, the softer web sections are made softer either with an additive or by making them thinner, or making them of a different material than the wall section, for example, urethane. In any event, each panel section will typically be an extruded section, since it is longitudinally consistent, i.e., its lateral cross section is the same for the entire length of the section. As such, the panel sections can be made quite long, using the same extrusion dies.",
        "As shown best in FIG. 12, a longitudinally extending bead 36 is provided at the free longitudinal edge of the web 34. The bead 36 is received in a longitudinally extending slot 38 at the free longitudinal edge of the wall section 32 of the adjacent panel section 30, the slot 38 being open on its side opposite from the main portion of the wall section 32 of the adjacent panel section 30. Thus, the web 34 can be slipped into the opening of the slot 38, with the bead 36 captured within the slot 38.",
        "Molded wall and web sections as shown in FIGS. 11 and 12 are known and heretofore have been used for making accordion-folded folding doors. Such materials are available in many hardware or home improvement stores.",
        "FIGS. 13 and 14 illustrate an alternative construction of the panel sections 30. The construction of FIGS. 13 and 14 is essentially the same as that of FIGS. 11 and 12, except the panel sections 39 have multiple rigid wall sections 32 that are integrally connected with multiple flexible web sections 34. In the embodiment of FIG. 13, four wall sections 32 are integrally connected by four web sections 34 in each panel section 39. It is noted that in the embodiment of FIG. 11, each fold of the pleated panel section is supported by two enlarged sections, one being the enlarged section which defines the slot 38 and another being an enlarged section 40 which is solid and integrally molded with the adjacent wall section 32 and web sections 34. These sections provide stiffening at the folds. In the embodiment of FIG. 13, only one enlarged section, either the enlarged section which defines the slot 38, or the enlarged solid section 40, is provided adjacent to each fold of the pleated panel section 39.",
        "FIG. 15 illustrates another alternative panel section 50 that comprises rigid wall sections 32 connected to one another by a flexible web section 34 (denoted by section lines), with a bead 36 formed at the end of a curved projection 52 that extends at approximately a right angle to the plane of the wall section 32. The bead 36 is received in a tear-drop-shaped slot 38 of the next adjacent panel section 50, which is provided in a slot forming tube 39 (relatively rigid material) that is integrally molded at the end of the panel section 50 that is opposite from the bead 36. The slot 38 is formed at the end of the wall section 32 that is opposite from the bead 36, and is sized and shaped so as to capture the bead 36 in the slot 38 while permitting pivoting of the two wall sections 32 that are connected by the bead-in-slot connection. This is facilitated by the free edge 47 of tube 39 fitting into the concavity 53 of the extension 52 in one extreme position of pivoting (the position illustrated in FIG. 15) and the bead 36 having a flattened outer surface 43 that abuts the inner surface 55 of rib 41 molded at the base of the tube 39, where it joins with the wall section 32. In the opposite extreme position, the bead 36 and extension 52 can enter the slot 38 so that the bellows will fold up flat or nearly flat.",
        "In addition, a tie strap could be integrally molded with the bellows, with sections of the tie strap extending from one peak on the inside of the bellows at which the strap section is integrally molded to another peak, where a free end of the strap could be connected to the peak, for example with a releasable connection, for example a snap connection, connecting free ends of the strap sections to the next adjacent peaks. Alternatively, male or female snap connections could be molded integral with the internal peaks and a separate strap having mating connectors could be connected to the peak connections.",
        "FIG. 16 illustrates another alternative embodiment 80 of a panel section in which there are no flexible web sections 34, it being made of rigid plastic material with hinge joints at both ends. Parts of the panel sections 80 that correspond to previously described parts are identified with the same reference number, as in the previously described embodiments. Thus, the panel section 80 includes a rigid wall section 32 with a slot 38 at one end and a bead 36 at the other end, all of which are longitudinally continuous so that it can be made by extrusion, that when put together form a hinge joint to permit pivoting of one panel section 80 relative to the adjacent panel sections 80. Since these hinge joints are self-limiting, no tie straps may be needed in some applications.",
        "Preferred embodiments of the invention have been described in considerable detail. Many modifications and variations to the preferred embodiments described will be apparent to those skilled in the art. For example, any number of rigid wall sections 32 and flexible web sections 34 could be co-extruded in one piece. Therefore, the invention should not be limited to the embodiments described, but should be defined by the claims which follow."
    ],
    "citations": [
        "2797112",
        "3234996",
        "4323078",
        "4336747",
        "4570964",
        "4579045",
        "4745848",
        "5021271",
        "5413831",
        "555207",
        "1509657",
        "3731770",
        "29514350",
        "1268424",
        "1073078",
        "2072294",
        "2296952",
        "10331791",
        "WO9307406"
    ],
    "us_classification": "428212",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "32",
            "subclass": "B",
            "main_group": "7",
            "subgroup": "02"
        }
    ]
}