{
    "title": "Liquid crystal display apparatus",
    "abstract": "Disclosed is an LCD apparatus including a receiving container for receiving a light guide plate and a lamp assembly, a first chassis for fixing the light guide plate and an LCD panel, and a second chassis for fixing the first chassis and the LCD panel. The receiving container and the first and second chassis are made of metal material so that the LCD apparatus may have reduced size and weight.",
    "inventors": [
        "Kwon",
        "Kim",
        "Ha",
        "Bae",
        "Lee",
        "Lee"
    ],
    "document_number": "07298432",
    "publication_date": "20071120",
    "assignees": [
        "Samsung Electronics Co., Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An LCD apparatus comprising:",
            "components": [
                {
                    "component": "a receiving container having a bottom surface and a sidewall extended from the bottom surface to provide a receiving space;",
                    "subcomponents": []
                },
                {
                    "component": "a light guide plate having a side surface corresponding to the sidewall, a light reflecting surface facing to the bottom surface of the receiving container, and a light emitting surface opposite to the light reflecting surface;",
                    "subcomponents": []
                },
                {
                    "component": "a first chassis combined with an outer surface of the sidewall of the receiving container, the first chassis pressing an edge portion of the light emitting surface;",
                    "subcomponents": []
                },
                {
                    "component": "an LCD panel assembly disposed on the first chassis and facing to the light emitting surface; and",
                    "subcomponents": []
                },
                {
                    "component": "a second chassis outwardly combined to the sidewall of the receiving container, the second chassis pressing an edge portion of the LCD panel assembly,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the light guide plate is disposed between the receiving container and the first chassis, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the first chassis is made of a metal material.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The LCD apparatus of claim 1 , wherein the receiving container, first chassis and second chassis have a thickness from about 0.1 mm to about 0.5 mm, respectively.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The LCD apparatus of claim 1 , wherein the receiving container has a thickness from about 0.2 mm to about 0.5 mm, the first chassis has a thickness from about 0.1 mm to about 0.2 mm, and the second chassis has a thickness from about 0.2 mm to about 0.5 mm.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The LCD apparatus of claim 1 , wherein the receiving container and the second chassis are made of a metal material including aluminum or aluminum alloy.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The LCD apparatus of claim 1 , wherein the metal material is aluminum or aluminum alloy.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The LCD apparatus of claim 1 , further comprising:",
            "components": [
                {
                    "component": "a lamp tube having an L shape disposed between the sidewall of the receiving container and the side surface of the light guide plate;",
                    "subcomponents": []
                },
                {
                    "component": "a first lamp wire connected to a first electrode of the lamp tube; and",
                    "subcomponents": []
                },
                {
                    "component": "a second lamp wire connected to a second electrode of the lamp tube, the second electrode being separated from the first electrode.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The LCD apparatus of claim 6 , further comprising a receiving member having a receiving groove to receive the second lamp wire longer than the first lamp wire, the receiving member making contact with the first chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The LCD apparatus of claim 6 , further comprising a reflecting plate having a first reflecting plate disposed between the sidewall of the receiving container and the side surface of the light guide plate to reflect light from the lamp tube to the side surface, and a second reflecting plate extended from the first reflecting plate and disposed between the light reflecting surface of the light guide plate and the bottom surface of the receiving container to reflect light leaked from the light reflecting surface.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The LCD apparatus of claim 6 , further comprising a reflecting plate disposed inside the first chassis facing to the receiving container to reflect light from an upper portion of the lamp tube.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The LCD apparatus of claim 6 , further including a lamp holder disposed at a bending portion of the lamp tube, wherein the fixing boss is disposed between the lamp holder and the engaging portion of the light guide plate.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The LCD apparatus of claim 1 , further comprising an optical sheet having a body disposed on the light emitting surface of the light guide plate and a protrusion extended from an edge of the body and disposed in association with the first chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The LCD apparatus of claim 11 , wherein the first chassis further comprises a receiving portion to receive the protrusion, and a fixing member is applied onto the first chassis to prevent the protrusion from being deviated from the receiving portion.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The LCD apparatus of claim 12 , wherein the fixing member is a band strip having an adhesive bottom surface to cover the protrusion and the receiving portion.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The LCD apparatus of claim 1 , wherein the first chassis further comprises a guide member to guide the LCD panel assembly and fixing the LCD panel assembly onto the first chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The LCD apparatus of claim 14 , wherein the guide member comprises:",
            "components": [
                {
                    "component": "a first guide body that makes contact with a corner portion of the first chassis;",
                    "subcomponents": []
                },
                {
                    "component": "a second guide body outwardly disposed on a corner portion of the bottom surface of the receiving container; and",
                    "subcomponents": []
                },
                {
                    "component": "a connection body to connect the first and second guide bodies.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The LCD apparatus of claim 15 , wherein the first guide body includes a lamp wire receiving groove to receive a wire connected to a lamp to emit light, and a screw engaging hole to engage a screw to fix the first guide body to the first chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The LCD apparatus of claim 15 , wherein the second guide body includes a body engaging hole, and the bottom surface of the receiving container is provided with a bending portion inserted into the body engaging hole, the bending portion being formed by partially cutting the bottom surface.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The LCD apparatus of claim 1 , wherein the first chassis further comprises a supporting portion protruded toward the second chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The LCD apparatus of claim 18 , wherein the supporting portion is formed by partially cutting the first chassis and bending the cut portion toward the second chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The LCD apparatus of claim 18 wherein the supporting portion is formed by partially protruding the first chassis in a predetermined length that comes in contact with the second chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The LCD apparatus of claim 1 , wherein the sidewall of the receiving container includes a first engaging hole formed by partially cutting the sidewall and bending the cut portion of the sidewall to be protruded outward with respect to the receiving space, and the first chassis includes a first engaging portion formed by partially cutting the first chassis and bending the cut portion of the first chassis to be protruded inward with respect to the receiving space, the first engaging portion being engaged to the first engaging hole.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The LCD apparatus of claim 21 , wherein the sidewall of the receiving container includes a second engaging portion having a second engaging hole by partially cutting the sidewall and outwardly protruding the cut portion from the receiving space, the first chassis includes an opening to expose the second engaging portion, and the second chassis includes a third engaging portion engaged to the second engaging hole.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The LCD apparatus of claim 1 , wherein the receiving container further comprises an engaging protrusion disposed between a sidewall and the bottom surface of the receiving container in a direction parallel to the bottom surface, and the second chassis further comprises an engaging surface engaged to the engaging protrusion.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The LCD apparatus of claim 1 , wherein the sidewall of the receiving container comprises first and second sidewalls extended from opposite end portions, respectively, of the bottom surface, and third and fourth sidewalls extended from another opposite end portions, respectively, of the bottom surface, the third and fourth sidewalls being outwardly bent with respect to the receiving space to provide an engaging space.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The LCD apparatus of claim 24 , wherein the third and fourth sidewalls each include a first engaging hole to expose the engaging space, the first chassis includes a second engaging hole, and the second chassis further comprises a tapping portion inserted into the first and second engaging holes.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The LCD apparatus of claim 1 , wherein the first chassis is disposed on the receiving container, and the second chassis is disposed on the first chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The LCD apparatus of claim 1 , wherein the LCD panel assembly makes contact with the first chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The LCD apparatus of claim 1 , wherein a portion of the first chassis fits into the sidewall of the receiving container.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. An LCD apparatus comprising:",
            "components": [
                {
                    "component": "a first metal chassis having a bottom surface and a sidewall extended from the bottom surface to provide a receiving space;",
                    "subcomponents": []
                },
                {
                    "component": "a light guide plate having a side surface to receive light and be disposed corresponding to the sidewall, a light reflecting surface facing to the bottom surface, and a light emitting surface to emit the light, and the light emitting surface being opposite to the light reflecting surface;",
                    "subcomponents": []
                },
                {
                    "component": "a second metal chassis combined with an outer surface of the sidewall of the first metal chassis, the second metal chassis pressing an edge portion of the light emitting surface;",
                    "subcomponents": []
                },
                {
                    "component": "an LCD panel assembly disposed on the second chassis and facing to the light emitting surface;",
                    "subcomponents": []
                },
                {
                    "component": "a third metal chassis outwardly combined to the sidewall of the first metal chassis, the third metal chassis pressing an edge portion of the LCD panel assembly; and",
                    "subcomponents": []
                },
                {
                    "component": "a guide member to guide the LCD panel assembly to a receiving position thereof, the guide member being disposed at corner portions of the first metal chassis combined to the second metal chassis;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the light guide plate is disposed between the first metal chassis and the second metal chassis.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The LCD apparatus of claim 29 , wherein the first metal chassis comprises four sidewalls to provide the receiving space in which a lamp having an L shape is disposed such that two adjacent sidewalls of the four sidewalls are disposed to surround the L shape lamp.",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The LCD apparatus of claim 29 , wherein the second chassis comprises a supporting portion to support the third chassis, the supporting portion being formed by partially cutting and bending the second chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. The LCD apparatus of claim 29 , wherein the second metal chassis is disposed on the first metal chassis, and the third metal chassis is disposed on the second metal chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. The LCD apparatus of claim 29 , wherein the LCD panel assembly makes contact with the first chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The LCD apparatus of claim 29 , wherein a portion of the first metal chassis fits into the sidewall of the receiving container.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. An LCD apparatus comprising:",
            "components": [
                {
                    "component": "a receiving container having a bottom surface and a sidewall extended from the bottom surface to provide a receiving space, the receiving container including a first engaging hole;",
                    "subcomponents": []
                },
                {
                    "component": "a light guide plate having a side surface corresponding to the sidewall, a light reflecting surface facing the bottom surface of the receiving container, and a light emitting surface opposite to the light reflecting surface;",
                    "subcomponents": []
                },
                {
                    "component": "a first chassis combined with an outer surface of the sidewall of the receiving container, the first chassis pressing an edge portion of the light emitting surface, the first chassis including a second engaging hole corresponding to the first engaging hole, the first chassis including a guide member to guide the LCD panel assembly and fixing the LCD panel assembly onto the first chassis;",
                    "subcomponents": []
                },
                {
                    "component": "an LCD panel assembly disposed on the first chassis and facing the light emitting surface; and",
                    "subcomponents": []
                },
                {
                    "component": "a second chassis outwardly combined to the sidewall of the receiving container, the second chassis pressing an edge portion of the LCD panel assembly, the second chassis including a tapping portion inserted into the first and second engaging holes;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the light guide plate is disposed between the receiving container and the first chassis, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the receiving container further comprises a fixing boss protruding from a corner portion of the bottom surface, and the light guide plate further comprises an engaging portion to be engaged with the fixing boss.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. The LCD apparatus of claim 35 , wherein the LCD panel assembly makes contact with the first chassis.",
            "components": []
        },
        {
            "claim_number": "CLM-00037",
            "preamble": "37. The LCD apparatus of claim 35 , wherein a portion of the first chassis fits into the sidewall of the receiving container.",
            "components": []
        }
    ],
    "description": [
        "1. Field of the Invention",
        "The present invention relates to an LCD (Liquid Crystal Display) apparatus, and more particularly to an LCD apparatus having metal chassis to reduce the size and weight of the LCD apparatus.",
        "2. Description of the Related Art",
        "An LCD apparatus, in general, is a display apparatus for displaying images using liquid crystal. The LCD apparatus has advantages such as lighter weight and smaller size in comparison with a CRT (Cathode Ray Tube) display apparatus.",
        "The LCD apparatus is generally divided into a liquid crystal controlling part for controlling the liquid crystal and a light supplying part for supplying light to the liquid crystal.",
        "The liquid crystal controlling part includes an LCD panel for displaying images and a driving module for driving the LCD panel. The LCD panel includes a TFT (Thin Film Transistor) substrate, liquid crystal and a color filter substrate. The TFT substrate is a transparent glass substrate on which TFTs are disposed in association with a voltage providing line and a first electrode. Each of the TFTs includes a gate electrode, a channel layer, a source electrode and a drain electrode. The first electrode is made of ITO (Indium Tin Oxide) or IZO (Indium Zinc Oxide) and disposed corresponding to each of drain electrodes of the TFTs. The voltage providing line includes gate lines and data lines to provide a driving signal to the TFTs. The gate lines are disposed corresponding to columns of the TFTs, and each of the gate lines provides a gate turn-on signal to the TFTs arranged in a column direction. The data lines are disposed corresponding to rows of the TFTs, and each of the data lines provides a data signal to the TFTs arranged in a row direction. The driving module receives an image signal generated from an external information-processing device and generates the driving signal to timely apply the driving signal to the gate and data lines. The color filter substrate combined to the TFT substrate includes a transparent substrate, a color filter and a second electrode. The color filter includes a red color filter, a green color filter and a blue color filter disposed on the transparent substrate in a matrix configuration. The second electrode made of the ITO or IZO is disposed over the transparent substrate to cover the color filter. The second electrode receives a predetermined reference voltage, so that an electric field is applied between the first and second electrodes. The liquid crystal is interposed between the color filter substrate and TFT substrate.",
        "The light supplying part includes a middle receiving container, a bottom receiving container, a light guide plate, a lamp assembly and an optical sheet. The lamp assembly employs a CCFL (Cold Cathode Fluorescent Lamp) for generation the light. The light guide plate receives the light from the lamp and changes optical properties and light path of the light. The bottom receiving container provides a receiving space in which the lamp assembly and light guide plate are received. The optical sheet is disposed on the light guide plate and controls brightness distribution of the light emitted from the light guide plate. The middle receiving container is combined to the bottom receiving container to fix the LCD panel to the bottom receiving container. The LCD panel is fixed to the middle receiving container by a top chassis combined to the middle and bottom receiving containers.",
        "Generally, the bottom and middle receiving containers are made of synthetic resin using an injection-molding manner. In order to form the bottom and middle receiving containers using the injection-molding manner, the bottom and middle receiving containers need a thickness of at least 0.4 mm. The bottom and middle receiving containers, generally, have a thickness of 0.4 mm at a first portion, where little strength is needed and a thickness of 1.2 mm to 1.5 mm at a second portion where certain strength is necessary. Also, the bottom and middle receiving containers are contracted at the time of cooling melted synthetic resin, and the first and second portions of the bottom and middle receiving containers each have a different contractile rate. As a result, the bottom and middle receiving containers are easily distorted in a manufacturing process.",
        "Further, the bottom and middle receiving containers made of the synthetic resin have low heat conductivity, so that it is difficult to control a light transmittance of the liquid crystal because the liquid crystal is liquidized by heat emitted from the lamp assembly.",
        "The present invention provides an LCD apparatus having a reduced size and weight.",
        "In one aspect of the invention, there is provided an LCD apparatus comprising: a receiving container having a bottom surface and a sidewall extended from the bottom surface to provide a receiving space; a light guide plate having a side surface corresponding to the sidewall, a light reflecting surface facing to the bottom surface, and a light emitting surface opposite to the light reflecting surface; a first chassis outwardly combined to the sidewall of the receiving container while pressing an edge portion of the light emitting surface; an LCD panel assembly disposed on the first chassis, which is facing to the light emitting surface; and a second chassis outwardly combined to the sidewall of the receiving container while pressing an edge portion of the LCD panel assembly.",
        "According to the LCD apparatus, the receiving container for receiving the light guide plate and lamp assembly, the first chassis for fixing the light guide plate and LCD panel, and the second chassis for fixing the first chassis and LCD panel, are made of metal material. Thus, the LCD apparatus may have a reduced size and weight and may emit heat generated from the lamp assembly.",
        "The above and other advantages of the present invention will become readily apparent by reference to the following detailed description when considered in conjunction with the accompanying drawings wherein:",
        "FIG. 1 is an exploded perspective view showing an LCD apparatus according to the present invention;",
        "FIG. 2 is a perspective view showing a structure of a receiving container shown in FIG. 1;",
        "FIG. 3 is a perspective view showing a structure of a light guide plate shown in FIG. 1;",
        "FIG. 4 is a perspective view showing a structure of a first chassis shown in FIG. 1;",
        "FIG. 5 is a perspective view showing a structure of an LCD panel assembly shown in FIG. 1;",
        "FIG. 6 is a partially enlarged view of a TFT substrate of the LCD panel according to the present invention;",
        "FIG. 7 is a partially cut perspective view showing a structure of a second chassis shown in FIG. 1;",
        "FIG. 8A is a perspective view showing a structure of a lamp shown in FIG. 1;",
        "FIG. 8B is a schematic view showing the lamp assembled with the receiving container shown in FIG. 1;",
        "FIG. 8C is a cross-sectional view showing an internal structure of the lamp shown in FIG. 8A;",
        "FIG. 9 is a perspective view showing a structure of a first chassis shown in FIG. 1;",
        "FIG. 10 is a perspective view showing a structure of a reflecting plate shown in FIG. 1;",
        "FIG. 11 is a schematic view showing a structure of another reflecting plate according to the present invention;",
        "FIG. 12 is a partially enlarged view of the receiving container shown in FIG. 1;",
        "FIG. 13 is a perspective view showing a structure of optical sheets shown in FIG. 1;",
        "FIG. 14 is a schematic view showing an assembled structure of the optical sheets and the first chassis;",
        "FIG. 15 is a perspective view showing a guide member of an LCD panel according to the present invention;",
        "FIG. 16 is a perspective view showing a structure of the guide member shown in FIG. 15;",
        "FIG. 17 is a schematic view showing an assembled structure of the guide member and the receiving container;",
        "FIGS. 18A and 18B are schematic views showing an assembled structure of the receiving container and the first chassis;",
        "FIGS. 19 and 20 are schematic views showing an assembled structure of the receiving container and the second chassis; and",
        "FIG. 21 is a schematic view showing an assembled structure of a receiving container, a first chassis and a second chassis according to another embodiment of the present invention.",
        "FIG. 1 is an exploded perspective view showing an LCD apparatus according to the present invention.",
        "Referring to FIG. 1, the LCD apparatus 1100 includes a receiving container 100, a light guide plate 200, a first chassis 300, an LCD panel assembly 400 and a second chassis 500.",
        "FIG. 2 is a perspective view showing a structure of the receiving container shown in FIG. 1.",
        "Referring to FIG. 2, the receiving container 100 includes a bottom surface 110 and first to fourth sidewalls 120, 130, 140 and 150. The bottom surface 110 has a rectangular shape and first to fourth edges 112, 114, 116 and 118. The first to fourth sidewalls 120, 130, 140 and 150 are extended from the first to fourth edges 112, 114, 116 and 118 in a same direction to have a same height, respectively. Accordingly, the receiving container 100 provides a receiving space formed with the bottom surface 110 and the first to fourth sidewalls 120, 130, 140,150.",
        "FIG. 3 is a perspective view showing a structure of the light guide plate shown in FIG. 1.",
        "Referring to FIG. 3, the light guide plate 200 includes a light reflecting surface 260, a light emitting surface 270 and first to fourth side surfaces 220, 230, 240 and 250. The first to fourth side surface 220, 230, 240 and 250 are disposed to face to and apart from the first to fourth sidewalls 120, 130, 140 and 150 (referring to FIG. 2), respectively. The light reflecting surface 260 is connected with the first, second, third and fourth side surfaces 220, 230, 240 and 250 and faces to the bottom surface 110 of the receiving container 100 (referring to FIG. 2). The light reflecting surface 260 changes optical properties and light paths of light input through the first to fourth side surfaces 220, 230, 240 and 250. The light emitting surface 270 is also connected with the first, second, third and fourth side surfaces 220, 230, 240 and 250 and faces to the light reflecting surface 260. The light emitting surface 270 provides the light reflected from the light reflecting surface 260 to the LCD panel assembly 400.",
        "FIG. 4 is a perspective view showing a structure of the first chassis shown in FIG. 1.",
        "Referring to FIGS. 1 and 4, the first chassis 300 is disposed to prevent the light guide plate 200 from being deviated from the receiving container 100 by pressing edge portions of the light guide plate 200. The first chassis 300 is combined to the first to fourth sidewalls 120, 130, 140 and 150 (referring to FIG. 2) of the receiving container 100.",
        "FIG. 5 is a perspective view showing a structure of the LCD panel assembly shown in FIG. 1.",
        "Referring to FIG. 5, the LCD panel assembly 400 is received on the first chassis 300 and faces to the light emitting surface 270 of the light guide plate 200 (referring to FIG. 3). The LCD panel assembly 400 includes an LCD panel 450 and a driving module 490. The LCD panel 450 includes a TFT substrate 410, a liquid crystal 440 and a color filter substrate 420.",
        "FIG. 6 is a partially enlarged view of the TFT substrate of the LCD panel according to the present invention.",
        "Referring to FIG. 6, the TFT substrate 410 is a transparent glass substrate on which TFTs 401 each associated with a voltage providing line 404 and a first electrode 405 are disposed in a matrix configuration. A TFT 401 includes a gate electrode “G”, a channel layer “C”, a source electrode “S” and a drain electrode “D”. The first electrode 405 is made of, for example, ITO (indium tin oxide) or IZO (indium zinc oxide) and disposed to be connected with the drain electrode “D” of the TFT 401. The voltage providing line 404 includes a gate line 403 and a data line 402 to provide a driving signal to the TFT 401. The gate lines 403 are disposed in a column direction corresponding to the columns of the matrix configuration of the TFTs 401. A gate line 403 provides a gate turn-on signal to the TFTs 401 arranged in a column corresponding to the gate line 403. The data lines 402 are disposed in a row direction corresponding to the rows of the matrix configuration of the TFTs 401. A data line 402 provides a data signal to the TFTs 401 arranged in a row corresponding to the data line 402.",
        "Referring to FIG. 5 again, the driving module 490 includes a PCB (Printed Circuit Board) 492 and a TCP (Tape Carrier Package) 494. The TCP 494 is connected to the gate and data lines 403 and 402 (referring to FIG. 6) and the PCB 492 is connected to the TCP 494. The driving module 490 receives an image signal generated from an external information-processing device and generates the driving signal to timely apply the driving signal to the gate and data lines 403 and 402.",
        "The color filter substrate 420 combined to the TFT substrate 410 includes color-filters (not shown) and a second electrode (not shown) disposed on a transparent substrate. The color filters each include a red color filter, a green color filter and a blue color filter and are disposed on the transparent substrate in a matrix configuration. The second electrode is disposed over the transparent substrate to cover the color filters. The second electrode receives a predetermined reference voltage, so that an electric field is applied between the first electrode 405 (referring to FIG. 6) and the second electrode (not shown). The liquid crystal 440 is interposed between the color filter substrate 420 and the TFT substrate 410.",
        "FIG. 7 is a partially cut perspective view showing a structure of the second chassis shown in FIG. 1.",
        "Referring to FIGS. 1 and 7, the second chassis 500 is disposed to press edge portions of the LCD panel 400 and is outwardly combined to the first to fourth sidewalls 120, 130, 140 and 150 of the receiving container 100 (referring to FIG. 2).",
        "Referring again to FIG. 1, as an exemplary embodiment of the present invention, the receiving container 100, first chassis 300 and second chassis 500 are manufactured by pressing plates having a first thickness, a second thickness and a third thickness, respectively. The first thickness, second thickness and third thickness each are, for example, from about 0.1 mm to about 0.5 mm.",
        "The receiving container 100, first chassis 300 and second chassis 500 are, for example, made of metal material. Thus, although the receiving container 100, first chassis 300 and second chassis 500 have the thickness of about 0.1 mm to about 0.5 mm, they may have strength enough to endure an externally applied impact. Also, the receiving container 100, first chassis 300 and second chassis 500 may be made of metal material such as aluminum or aluminum alloy, so that the LCD apparatus 1100 may have the strength while the entire thickness thereof is reduced.",
        "In case that a receiving container and a first chassis are made of synthetic resin, the receiving container and first chassis each have a thickness in the range of 0.4 mm to 1.2˜1.5 mm. In contrast, since the receiving container 100 and first chassis 300 are made of the metal material in the present invention, the receiving container 100 and first chassis 300 may have the thickness of about 0.1 mm to about 0.5 mm. That is, in the LCD apparatus 1100 the thickness of each of the receiving container 100 and first chassis 300 may be reduced by about 0.3 mm to about 0.7-1.0 mm, so that the entire thickness of the LCD apparatus 1100 is reduced by about 0.6 mm to about 2 mm.",
        "In order to further reduce the thickness of the LCD apparatus 1100, the second thickness of the first chassis 300 may be thinner than the first thickness of the receiving container 100 and the third thickness of the second chassis 500. For example, the first thickness of the receiving container 100 is in the range of about 0.2 mm to about 0.5 mm, the third thickness of the second chassis 500 is in the range of about 0.2 mm to about 0.5 mm, and the second thickness of the first chassis 300 is in the range of about 0.1 mm to about 0.2 mm. This is because the first chassis 300 is little subject to an external force or an external impact in comparison with the receiving container 100 and the second chassis 500.",
        "As another exemplary embodiment, the first chassis 300 may be formed to have a second thickness in the range of about 0.4 mm to about 1.5 mm using the synthetic resin, and the receiving container 100 and second chassis 500 is formed to have a first and a second thickness in the range of about 0.1 mm to about 0.5 mm using the metal material, respectively. In this case, the entire thickness of the LCD apparatus 1100 is reduced in comparison with the case that the receiving container 100, first chassis 300 and second chassis 500 are made of the synthetic resin.",
        "The LCD apparatus 1100 needs light to display images thereon.",
        "FIG. 8A is a perspective view showing a structure of a lamp shown in FIG. 1. FIG. 8B is a schematic view showing the lamp assembled with the receiving container shown in FIG. 1. FIG. 8C is a cross-sectional view of the lamp shown in FIG. 8A.",
        "Referring to FIGS. 8A to 8C, the lamp 600 includes a lamp tube 610, first and second electrodes 611 and 612 and first and second lamp wires 614 and 615.",
        "The lamp tube 610 has an L shape and includes a transparent tube 610a, a fluorescent material 610b deposited on an inner wall of the tube 610a and a discharge gas 610c injected inside the tube 610a.",
        "The first and second electrodes 611 and 612 are disposed at opposite end portions, respectively, inside the tube 610a. The first and second electrodes 611 and 612 receive a discharge voltage applied through the first and second lamp wires 614 and 615.",
        "The first and second lamp wires 614 and 615 are connected to the first and second electrodes 611 and 612, respectively. The first and second lamp wires 614 and 615 provide the discharge voltage generated from an external power supply device (not shown) to the first and second electrodes 611 and 612. The LCD apparatus 1100 may further include another lamp such as the lamp 600, so that there are two lamps between the first to fourth side surfaces 220, 230, 240 and 250 of the light guide plate 200 and the first to fourth sidewalls 120, 130, 140 and 150 of the receiving container 100 (referring to FIGS. 2 and 3). The lamp 600 is provided with a lamp holder 620 disposed at a bending portion thereof to fix the lamp 600 to the receiving container 100 and prevent the lamp 600 from being damaged. The first lamp wire 614, generally, has a length longer than that of the second lamp wire 615 to which a low voltage of the discharge voltage is applied.",
        "FIG. 9 is a perspective view showing a structure of a first chassis having a lamp wire receiving member according to the present invention.",
        "Referring to FIG. 9, the first chassis 300 is provided with a lamp wire receiving member 380 for fixing the first lamp wire 614 to a predetermined position. The lamp wire receiving member 380 is disposed on the first chassis 300 in such a manner as not to interfere with the LCD panel assembly 400 disposed on the first chassis 300.",
        "The lamp wire receiving member 380 may be made of, for example, synthetic resin. The lamp wire receiving member 380 includes a lamp wire receiving groove 382 disposed thereof. The lamp wire receiving groove 382 is formed in a direction parallel to a direction that guides the first lamp wire 614.",
        "FIG. 10 is a perspective view showing a structure of a reflecting plate shown in FIG. 1.",
        "Referring to FIGS. 1 and 10, a reflecting plate 700 includes a first reflecting surface 710 and first to fourth side reflecting surfaces 720, 730, 740 and 750. The reflecting plate 700 may be made of, for example, synthetic resin.",
        "The first reflecting surface 710 is disposed between the bottom surface 110 of the receiving container 100 and the light reflecting surface 260 of the light guide plate 200. The first reflecting surface 710 reflects the light leaked from the light guide plate 200 through the light reflecting surface 260 to the light guide plate 200.",
        "The first to fourth side reflecting surfaces 720, 730, 740 and 750 are respectively disposed between the first to fourth sidewalls 120,130, 140 and 150 of the receiving container 100 and the lamp 600. The first to fourth side reflecting surfaces 720, 730, 740 and 750 reflect the light emitted from the lamp 600 to the first to fourth side surfaces 220, 230, 240 and 250 of the light guide plate 200, respectively. That is, the first to fourth side reflecting surfaces 720, 730, 740 and 750 of the reflecting plate 700 perform a role of a lamp reflector.",
        "As an exemplary embodiment, the first reflecting surface 710 and the first to fourth side reflecting surfaces 720, 730, 740 and 750 are disposed separately. In other words, the first reflecting surface 710 is adhered to the bottom surface 110 of the receiving container 100, and the first to fourth side reflecting surfaces 720, 730, 740 and 750 are adhered to the first to fourth sidewalls 120, 130, 140 and 150, respectively, of the receiving container 100.",
        "In the present invention, the reflecting plate may be removed because the receiving container 100 and the first chassis 300 are made of metal material having a high light reflectance.",
        "FIG. 11 is a schematic view showing a structure of a reflecting plate according to another embodiment of the present invention.",
        "Referring to FIG. 11, the first chassis 300 is provided with a separated reflecting plate 760. The separated reflecting plate 760 is disposed under the first chassis 300 to cover an upper portion of the lamp 600, thereby increasing the light efficiency.",
        "FIG. 12 is a partially enlarged view of the receiving container shown in FIGS. 1 and 2.",
        "Referring to FIG. 12, the receiving container 100 further includes a fixing boss 160 disposed on the bottom surface 110. The fixing boss 160 prevents the light guide plate 200 and lamp 600 from being moved in the receiving container 100. For example, the fixing boss 160 is disposed at each corner portion of the receiving container 100. In this case, since the bottom surface 110 of the receiving container 100 has four corner portions, four fixing bosses are disposed on the four corner portions, respectively.",
        "The lamp holder 620 is inserted between the fixing boss 160 and the receiving container 100, and the light guide plate 200 is disposed inwardly with respect to the four fixing bosses in the receiving container 100. The light guide plate 200 is provided with an engaging portion 260. The engaging portion 260 is formed by cutting four corner portions of the light guide plate 200, respectively. The engaging portion 260 is engaged to the fixing boss 160, so that the light guide plate 200 is fixed to the receiving container 100.",
        "FIG. 13 is a perspective view showing a structure of optical sheets shown in FIG. 1.",
        "Referring to FIGS. 1 and 13, the optical sheets 800 are disposed on the light emitting surface 270 of the light guide plate 200. The optical sheets 800 include a diffusing sheet 810 having a diffusing sheet body 812 and a diffusing sheet engaging protrusion 814 and a prism sheet 820 having a prism sheet body 822 and a prism sheet engaging protrusion 824. In the present invention, as an exemplary embodiment, the optical sheets 800 include two prism sheets.",
        "The diffusing sheet body 812 diffuses the light emitted from the light emitting surface 270 to increase uniformity of the brightness thereof. The diffusing sheet engaging protrusion 814 is extended from a selected portion at an edge of the diffusing sheet body 812 and serves to prevent the diffusion sheet body 812 from being moved. For example, the diffusing sheet body 812 has four diffusing sheet engaging protrusions formed at the opposite edges of the diffusing sheet body 812, as shown in FIG. 13.",
        "The prism sheet body 822 is disposed facing to the diffusing sheet body 812. The prism sheet body 822 has a prism shape to reset the direction of the light diffused by the diffusing sheet 810. The prism sheet engaging protrusion 824 is extended from a selected portion at an edge of the prism sheet body 822 and serves to prevent the prism sheet body 822 from being moved. As shown in FIG. 13, the prism sheet body 822 may have four prism sheet engaging protrusions formed at the opposite edges of the prism sheet body 822. The prism sheet engaging protrusion 824, generally, is provided corresponding to the diffusing sheet engaging protrusion 814.",
        "FIG. 14 is a schematic view showing an assembled structure of the optical sheets and the first chassis.",
        "Referring to FIG. 14, the diffusing sheet engaging protrusion 814 and the prism sheet engaging protrusion 824 are fixed to the first chassis 300. The first chassis 300 is provided with an engaging recess 310 corresponding to the diffusing sheet engaging protrusion 814 and the prism sheet engaging protrusion 824. The first chassis 300 is further provided with a fixing member 320 for fixing the diffusing sheet 810 and the prism sheet 820 to the first chassis 300. The fixing member 320 is disposed on the first chassis 300 to cover the diffusing sheet engaging protrusion 814 and the prism sheet engaging protrusion 824 inserted into the engaging recess 310, so that the diffusing sheet engaging protrusion 814 and the prism sheet engaging protrusion 824 are not deviated from the engaging recess 310. For example, the fixing member 320 is a band strip having an adhesive bottom surface.",
        "FIG. 15 is a perspective view showing a guide member of an LCD panel according to the present invention.",
        "Referring to FIG. 15, the LCD panel assembly 400 is disposed on the first chassis 300 and fixed to the first chassis 300 by the second chassis 200 that is combined to the receiving container 100. In case of receiving an impact or damage onto the LCD apparatus 1100, the LCD panel assembly 400 may be moved. In order to prevent the LCD panel assembly 400 from being moved, the first chassis 300 may further include a guide member 900. For example, the guide member 900 is disposed at each corner portion of the first chassis 300 to guide the corner portions of the LCD panel assembly 400.",
        "FIG. 16 is a perspective view showing a structure of the guide member shown in FIG. 15.",
        "Referring to FIG. 16, the guide member 900 includes a first guide body 910, a second guide body 920 and a connection body 930.",
        "The first guide body 910 having an L shape. The first guide body 910 is provided with a first receiving groove 912a and a second receiving groove 912b for receiving the first and second lamp wires 614 and 615 of the lamp 600, respectively. The second receiving groove 912b is provided with a first engaging portion 914. The second guide body 920 is provided with a second engaging portion 922. The first engaging portion 914 is, for example, a screw engaging hole for engaging a screw to fix the first guide body 910 onto the first chassis 300.",
        "The connection body 930 is connected with the first and second guide bodies 910 and 920. The connection body 930 has a length appropriate to allow the first and second guide bodies 910 and 920 to press the first chassis 300 and the rear surface of the receiving container 100, respectively.",
        "FIG. 17 is a schematic view showing an assembled structure of the guide member and the receiving container.",
        "Referring to FIG. 17, in order to prevent the guide member 900 from being deviated from the receiving container 100, a portion of the bottom surface 110 of the receiving container 100 corresponding to the second guide body 920 is partially cut and is engaged into the second engaging portion 922.",
        "Referring to FIGS. 4 and 15, the first chassis 300 further includes a supporting portion 350 to support the second chassis 350. The supporting portion 350 is formed by partially protruding or cutting a portion on the first chassis 300 toward the second chassis 500.",
        "The supporting portion 350 includes a first supporting portion 330 and a second supporting portion 340 having shapes different to each other. For example, the first supporting portion 330 is formed by partially cutting the first chassis 300 and bending the cut portion in a triangle shape and is disposed between the TCPs 494. The second supporting portion 340 is disposed on another portion of the first chassis 300, where the first supporting portion 330 is not disposed. The second supporting portion 340 is formed by partially pressing the first chassis 300 toward the second chassis 500. The second supporting portion 340 may have a surface area larger than that of the first supporting portion 330.",
        "Hereinafter, an assembled structure of the receiving container 100, first chassis 300 and second chassis 500 will be described.",
        "Referring to FIGS. 2 and 4, the first to fourth sidewalls 120, 130, 140 and 150 of the receiving container 100 are provided with a first engaging hole 170, and the first chassis 300 is provided with a first combining portion 360 corresponding to the first engaging hole 170.",
        "FIGS. 18A and 18B are schematic views showing an assembled structure of the receiving container 100 and the first chassis 300.",
        "Referring to FIGS. 18A and 18B, each sidewall of the receiving container 100 has an engaging portion 175 at the position of the first engaging hole 170. In the engaging portion 175, the side and bottom edges are cut and the top edge is bent to be protruded outward with respect to the receiving space. The first chassis 300 has the first combining portion 360 of which side and top edges are cut and bottom edge is bent to be protruded inward with respect to the receiving space. Thus, the engaging portion 175 and the first combining portion 360 are engaged to each other at the time of combining the receiving container 100 and the first chassis 300 together.",
        "Referring again to FIG. 2, the receiving container 100 may further include a second combining portion 180 separated from the first engaging hole 170 in a predetermined distance. The second combining portion 180 is outwardly protruded after cutting a portion of the first and third sidewalls 120 and 140. The thickness of the protruded portion of the second combining portion 180 is identical to that of the first chassis 300 combined to the receiving container 100, so that the second combining portion 180 and the first chassis are disposed on a same planar level. The second combining portion 180 is provided with a second engaging hole 185. Also, a portion facing the second combining portion 180 of the first chassis 300 is open to expose the second combining portion 180 and combine the second combining portion 180 to the second chassis 500.",
        "Referring again to FIG. 7, the second chassis 500 may further include a third combining portion 510. The third combining portion 510 of the second chassis 500 is combined to the second engaging hole 185 of the receiving container 100 and formed by cutting a selected portion of the second chassis 500 and inwardly bending the cut portion.",
        "Referring to FIG. 19, the receiving container 100 is provided with a second chassis engaging protrusion 190 disposed on a portion that the bottom surface 110 is in contact with first, second, third or fourth sidewalls 120, 130, 140 and 150. The second chassis engaging protrusion 190 makes the second chassis 500 to be strongly combined to the receiving container 100.",
        "Referring to FIGS. 7 and 19, the second chassis 500 may further include an engaging surface 520 engaged to the second chassis engaging protrusion 190. When the second chassis 500 is assembled after engaging the engaging surface 520 of the second chassis 500 to the second chassis engaging protrusion 190, the third combining portion 510 facing the second chassis engaging protrusion 190 of the second chassis 500 is engaged to the second engaging hole 185 of the receiving container 100.",
        "In another aspect, the receiving container 100 may be formed to have another structure.",
        "Referring to FIGS. 2 and 20, the first to fourth sidewalls 120, 130, 140 and 150 are extended from edge portions of the bottom surface 110 of the receiving container 100. The second and fourth sidewalls 130 and 150 facing to each other are outwardly extended in a direction parallel to the bottom surface 110. The extended portions of the second and fourth sidewalls 130 and 150 are bent to a direction perpendicular to the bottom surface 110 and extended in a predetermined length.",
        "Accordingly, the receiving container 100 may provide the receiving space on the bottom surface 100 and simultaneously provide engaging spaces 155 disposed adjacent to the second and fourth sidewalls 130 and 150, respectively. The second and fourth sidewalls 130 and 150 are provided with a first combining hole 158, and the first chassis 300 is provided with a second combining hole 370 corresponding to the first combining hole 158 as shown in FIGS. 2 and 4. Also, the second chassis 500 may include a tapping portion 530 inserted into the first and second combining holes 158 and 370 to cover inner surfaces of the first and second combining holes 158 as shown in FIG. 21.",
        "According to the LCD apparatus, the receiving container for receiving the light guide plate and lamp assembly, the first chassis for fixing the light guide plate and LCD panel, and the second chassis for fixing the first chassis and LCD panel, are made of metal material. Thus, the LCD apparatus may have a reduced size (or thickness) and weight and readily emit heat generated from the lamp assembly.",
        "Although the exemplary embodiments of the present invention have been described, it is understood that the present invention should not be limited to these exemplary embodiments but various changes and modifications can be made by one ordinary skilled in the art within the spirit and scope of the present invention as hereinafter claimed."
    ],
    "citations": [
        "5835139",
        "6064455",
        "6147724",
        "6166788",
        "6231202",
        "6430039",
        "6466283",
        "2002/0080298",
        "2001013484"
    ],
    "us_classification": "349 58",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "02",
            "subclass": "F",
            "main_group": "1",
            "subgroup": "1333"
        }
    ]
}