{
    "title": "Method of detecting RF powder delivered to a load and complex impedance of the load",
    "abstract": "Methods and systems of detecting one or more characteristics of a load are disclosed. One or more characteristics of a first signal may be detected at the output of a Radio Frequency (RF) power generator. The first signal may have a fundamental frequency. The one or more characteristics of the first signal may be sampled at a sampling frequency to produce a digital sampled signal. The sampling frequency may be determined based on a function of the fundamental frequency of the first signal. One or more characteristics of a load in communication with the RF power generator may then be determined from the digital sampled signal.",
    "inventors": [
        "Bhutta"
    ],
    "document_number": "07298128",
    "publication_date": "20071120",
    "assignees": [
        "Innovation Engineering LLC"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of detecting one or more characteristics of a load, the method comprising:",
            "components": [
                {
                    "component": "detecting one or more characteristics of a first signal at the output of a Radio Frequency (RF) power generator, wherein the first signal exhibits a fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "sampling the one or more characteristics of the first signal at a sampling frequency to produce a digital sampled signal, wherein the sampling frequency is determined based on a function of the fundamental frequency of the first signal, wherein the sampling frequency is less than the fundamental frequency of the first signal; and",
                    "subcomponents": []
                },
                {
                    "component": "determining one or more characteristics of a load from the digital sampled signal, wherein the load is in communication with the RF power generator.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 wherein the one or more characteristics of the first signal comprise one or more of the following:",
            "components": [
                {
                    "component": "a voltage; and",
                    "subcomponents": []
                },
                {
                    "component": "a current.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 wherein the sampling frequency is determined based on a function having the form",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 wherein determining one or more characteristics of a load from the digital sampled signal comprises determining one or more characteristics of a load from the digital sampled signal using a digital signal processor.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 wherein the one or more characteristics of a load comprise one or more of the following:",
            "components": [
                {
                    "component": "an amplitude of the load voltage at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "an amplitude of the load voltage at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "an amplitude of the load current at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "an amplitude of the load current at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "a phase angle between the load voltage and the load current at the fundamental frequency; and",
                    "subcomponents": []
                },
                {
                    "component": "a phase angle between the load voltage and the load current at a harmonic of the fundamental frequency.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 wherein the one or more characteristics of a load comprise one or more of the following:",
            "components": [
                {
                    "component": "delivered power to the load at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "delivered power to the load at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "forward power at the load at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "forward power at the load at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "reflected power from the load at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "reflected power from the load at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "a magnitude of the load impedance at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "a magnitude of the load impedance at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "a complex form for the load impedance at the fundamental frequency; and",
                    "subcomponents": []
                },
                {
                    "component": "a complex form for the load impedance at a harmonic of the fundamental frequency.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A system for determining one or more characteristics of a load, the system comprising:",
            "components": [
                {
                    "component": "a Radio Frequency (RF) power generator;",
                    "subcomponents": []
                },
                {
                    "component": "a load in communication with the RF power generator;",
                    "subcomponents": []
                },
                {
                    "component": "a detecting device located at the output of the RF power generator;",
                    "subcomponents": []
                },
                {
                    "component": "an analog-to-digital (A-D) converter in communication with the detecting device; and",
                    "subcomponents": []
                },
                {
                    "component": "a digital signal processor (DSP) in communication with the A-D converter,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the detecting device detects one or more characteristics of a first signal, wherein the A-D converter converts the one or more characteristics of the first signal into a digital form, wherein the A-D converter comprises a sampling device having a sampling frequency that is less than a fundamental frequency of the first signal, wherein the DSP determines one or more characteristics of the load from the digital form of the one or more characteristics of the first signal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The system of claim 7 wherein the load comprises a plasma chamber.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The system of claim 7 wherein the load comprises a gaseous tube.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The system of claim 7 wherein the load comprises a resistive load.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The system of claim 7 wherein the load comprises one or more reactive components.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The system of claim 7 wherein the first signal exhibits a fundamental frequency.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The system of claim 12 wherein the sampling frequency of the sampling device has the form",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The system of claim 7 wherein the one or more characteristics of a load comprise one or more of the following:",
            "components": [
                {
                    "component": "an amplitude of the load voltage at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "an amplitude of the load voltage at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "an amplitude of the load current at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "an amplitude of the load current at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "a phase angle between the load voltage and the load current at the fundamental frequency; and",
                    "subcomponents": []
                },
                {
                    "component": "a phase angle between the load voltage and the load current at a harmonic of the fundamental frequency.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The system of claim 7 wherein the one or more characteristics of a load comprise one or more of the following:",
            "components": [
                {
                    "component": "delivered power to the load at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "delivered power to the load at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "forward power at the load at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "forward power at the load at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "reflected power from the load at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "reflected power from the load at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "a magnitude of the load impedance at the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "a magnitude of the load impedance at a harmonic of the fundamental frequency;",
                    "subcomponents": []
                },
                {
                    "component": "a complex form for the load impedance at the fundamental frequency; and",
                    "subcomponents": []
                },
                {
                    "component": "a complex form for the load impedance at a harmonic of the fundamental frequency.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The system of claim 7 , further comprising:",
            "components": [
                {
                    "component": "an impedance matching network in communication with the RF power generator and the load.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This patent application claims priority to, and incorporates by reference in its entirety, U.S. Provisional Patent Application No. 60/643,014 entitled “Method of Detecting RF Power Delivered to a Load and Complex Impedance of the Load, Using Fast Fourier Transform (FFT)” and filed Jan. 11, 2005.",
        "1. Technical Field",
        "The disclosed embodiments generally relate to the field of power and impedance measurement.",
        "2. Description of the Related Art",
        "In a typical RF plasma generator arrangement, a high-power RF source (RF power generator) produces an RF signal at a known frequency that is supplied along a power conduit to a plasma chamber. Typically, a severe impedance mismatch between the RF power generator and the plasma chamber is present. Accordingly, an impedance matching network is conventionally interposed between the RF power generator and the plasma chamber.",
        "Because of non-linearities in the plasma chamber and losses in the line and/or in the impedance matching network, the complete RF signal does not reach the plasma chamber. As such, a probe is conventionally employed at the power input to the plasma chamber to detect the voltage and current of the RF signal. By accurately measuring the voltage and current, a user can obtain a better indication of the quality of the plasma and better control etching characteristics for a silicon wafer or other device in the plasma chamber.",
        "Conventional methods of detecting the voltage and current of the RF wave have been proposed. For example, U.S. Reissued Patent Number RE 38,273 to Gerrish et al. describes the use of a sampling probe at the input to a plasma chamber for detecting plasma RF voltage and current. The voltage and current RF signals are mixed with another signal, such as a signal differing from the main signal by between 0.2 KHz and 20 KHz, to produce a heterodyned signal. The heterodyned signal is then processed using a Fast Fourier transform (FFT) algorithm to calculate voltage and current magnitudes and relative phase angle information.",
        "U.S. Pat. No. 5,565,737 to Keane describes the use of an aliasing sampler probe at the input to the plasma chamber for detecting plasma RF voltage and current. The sampler probe uses a sampling signal with a sampling frequency that is slower than the RF fundamental frequency. The sampling frequency is determined by summing the fundamental frequency with an aliasing frequency that is independent of the fundamental frequency and dividing the sum by a positive integer.",
        "One problem with the above-described methods and systems is that the signal generated by the RF power generator can severely degrade due to an impedance mismatch between the RF power generator (or other components) and the plasma chamber. Another problem occurs when an impedance matching network is used between the output of the RF power generator and the input of the plasma chamber. In this case, the RF power-delivered to the plasma chamber can vary due to either adjustments within the impedance matching network and/or losses in the components and circuitry connected between the output of the RF power generator and the input of the plasma chamber. As such, the output of the RF power generator may become unstable due to interaction between the control loop of the RF power generator and the control loop of the impedance matching network. In addition, the use of an aliasing frequency that is independent of the RF fundamental frequency can result in a non-uniform sampled signal.",
        "Other proposed systems include that described in U.S. Pat. No. 6,046,594 to Mavretic describes a method and apparatus for measuring electrical characteristics (e.g. current, voltage, phase, etc.) between a power source and a load at a set of harmonic frequencies to determine information about the load (e.g., load impedance, power dissipation, etc). As described therein, a first circuit detects a set of electrical characteristics of a signal between the power source and the load; a second circuit provides data representing the set of electrical characteristics at a harmonic frequency associated with the signal; and a third circuit receives the data and determines information about the load at the harmonic frequency. However, such a system requires filtering at a particular harmonic frequency. While this may provide information at the particular harmonic frequency, information at the fundamental frequency or other harmonic frequencies may not be obtainable using such a system.",
        "Accordingly, what is needed is a method and system for sampling a detected signal at a location where the signal is tightly coupled to the RF output of the RF power generator and is less affected by the losses in the RF path between the RF power generator and the input of the plasma chamber.",
        "A need exists for a method and system for sampling a detected signal at a sampling frequency that is dependent upon the fundamental frequency of a detected signal.",
        "A further need exists for a method and system for sampling a detected signal such that information pertaining to the fundamental frequency and one or more harmonics is obtainable from the sampling process.",
        "The present disclosure is directed to solving one or more of the above-listed problems.",
        "Before the present methods, systems and materials are described, it is to be understood that this disclosure is not limited to the particular methodologies, systems and materials described, as these may vary. It is also to be understood that the terminology used in the description is for the purpose of describing the particular versions or embodiments only, and is not intended to limit the scope.",
        "It must also be noted that as used herein and in the appended claims, the singular forms “a,” “an,” and “the” include plural references unless the context clearly dictates otherwise. Thus, for example, reference to a “load” is a reference to one or more loads and equivalents thereof known to those skilled in the art, and so forth. Unless defined otherwise, all technical and scientific terms used herein have the same meanings as commonly understood by one of ordinary skill in the art. Although any methods, materials, and devices similar or equivalent to those described herein can be used in the practice or testing of embodiments, the preferred methods, materials, and devices are now described. All publications mentioned herein are incorporated by reference. Nothing herein is to be construed as an admission that the embodiments described herein are not entitled to antedate such disclosure by virtue of prior invention.",
        "In an embodiment, a method of detecting characteristics of a load may include detecting one or more characteristics of a signal having a fundamental frequency at the output of a RF power generator, sampling the one or more characteristics of the signal at a sampling frequency to produce a digital sampled signal, and determining one or more characteristics of a load. The sampling frequency may be determined based on a function of the fundamental frequency of the detected signal. The load may be in communication with the RF power generator.",
        "In an embodiment, a system for determining one or more characteristics of a load may include a RF power generator, a load in communication with the RF power generator, a detecting device connected to the output of the RF power generator, an analog to digital (A-D) converter in communication with the detecting device, and a digital signal processor (DSP) in communication with the A-D converter. The detecting device may detect one or more characteristics of a signal. The A-D converter may convert the one or more characteristics of the signal into a digital form. The DSP may determine one or more characteristics of the load from the digital form of the one or more characteristics of the signal.",
        "Aspects, features, benefits and advantages of the embodiments described herein will be apparent with regard to the following description, appended claims and accompanying drawings where:",
        "FIG. 1 depicts an exemplary detected signal using a voltage and/or current detecting device according to an embodiment.",
        "FIG. 2 depicts an exemplary signal sampled from the detected signal of FIG. 1 according to an embodiment.",
        "FIG. 3 depicts a block diagram of an exemplary system for a detection and processing circuit according to an embodiment.",
        "An RF generator may be used to deliver RF power to a load. In an embodiment, the RF generator may directly deliver the RF power to the load via a coaxial cable. In an alternate embodiment, the RF generator may directly deliver the RF power to the load via a transformation network. Other means of directly or indirectly delivering power to a load may also be used within the scope of the present disclosure.",
        "In an embodiment, the load may include one or more of a plasma chamber, a gaseous tube, a resistive load, and/or a complex load including resistive and/or reactive components, such as a capacitor and/or an inductor. Additional or alternate load devices may also be used within the scope of the present disclosure.",
        "A voltage and/or current detecting device, such as 305 in FIG. 3, may be placed at a point where the RF power or impedance is to be measured. For example, the voltage and/or current detecting device 305 may be placed at the output of the RF generator, within the generator or at any point between the RF generator and the load.",
        "Signal characteristics, such as the voltage and/or current delivered by the RF power generator, may be detected through the voltage and/or current detecting device 305 as analog signals. In an embodiment, placing the voltage and/or current detecting device 305 at the output of the RF generator may result in a more stable detected signal than placing the device at other locations within an appropriate electrical circuit. Placing the device at the output of the RF generator may include: (i) positions that physically contact the output; (ii) positions in which the device is in electrical contact with the output with negligible line loss between the output and the location of the detection device; and (iii) positions in which an overall line loss occurs between the RF generator output and the plasma generator input and the detection device is placed at a position where the line loss from the RF generator output to the plasma generator input is no more than half of the overall line loss. FIG. 1 depicts an exemplary detected signal using a voltage and/or current detecting device according to an embodiment.",
        "The detected signal may be passed to a sampling circuit, such as an analog-to-digital converter (310 in FIG. 3). The sampling circuit 310 may sample the voltage and/or current signals at a sampling frequency. In an embodiment, the sampling frequency may be less than a fundamental frequency of the detected signal and it may be a function of the fundamental frequency of the detected signal.",
        "The sampling frequency may be determined by selecting a desired number of sample points for one period of the sampled signal. For example, the number of sample points may be selected such that the total number of samples in one period of the sampled signal is divisible by 2n, where n is a non-negative integer. For example, if n=6, 64 sample points may be generated per period of the sampled signal. In such an embodiment, the sampling frequency may be determined using the equation",
        "f\n      s\n    \n    =\n    \n      \n        \n          2\n          n\n        \n        ⁢\n        \n          f\n          0\n        \n      \n      \n        \n          2\n          n\n        \n        +\n        1\n      \n    \n  \n  ,\n\n\n\n\nwhere f 0is the fundamental frequency of the detected signal, and fs is the sampling frequency. FIG. 2 depicts an exemplary signal sampled from the detected signal of FIG. 1 according to an embodiment.",
        "The sampling circuit 310 may be used to convert, for example, analog voltage and/or current signals into digital signals. The sampled voltage and current signals, in digital form, may be passed to a digital signal processor (DSP) 315. An algorithm, such as a Fast Fourier transform (FFT) algorithm, may be performed using the sampled voltage and/or current signal in the DSP 315.",
        "In an embodiment, if both voltage and current signals are sampled, the signals may be provided to a single DSP (as shown in FIG. 3) or to two DSPs (not shown). If two DSPs are used, the clock frequency and cycle may be synchronized between the DSPs. More than two DSPs may also be used within the scope of the present disclosure.",
        "The output of the one or more DSPs 315 may be in a digital form. In an embodiment, the output of the one or more DSPs 315 may include the amplitude of the sampled voltage and/or current signals at one or more frequencies. In an embodiment, the output of the one or more DSPs 315 may include a phase angle between two or more signals. For example, the output of the one or more DSPs 315 may include one or more of the following:\n\n    \n    \n        |Vf0|=Amplitude of the voltage at the fundamental frequency.\n        |If0|=Amplitude of the current at the fundamental frequency.\n        |Vf2|=Amplitude of the voltage at the second harmonic frequency.\n        |If2|=Amplitude of the current at the second harmonic frequency.\n        |Vf3|=Amplitude of the voltage at the third harmonic frequency.\n        |If3|=Amplitude of the current at the third harmonic frequency.\n        θVf0-If0=Phase angle between the voltage and the current at the fundamental frequency.\n        θVf2-If2=Phase angle between the voltage and the current at the second harmonic frequency.\n        θVf3-If3=Phase angle between the voltage and the current at the third harmonic frequency.\n\nAdditional and/or alternate amplitudes and/or phase angles may be determined by the one or more DSPs.",
        "Based on the output of the one or more DSPs 315, one or more of the following values may be determined:\n\n    \n    \n        PD=Delivered Power to the Load at the fundamental frequency.\n        PF=Forward Power at the Load at the fundamental frequency.\n        PR=Reflected Power from the Load at the fundamental frequency.\n        |Zf0|=Magnitude of the Load Impedance at the fundamental frequency.\n        Zf0=Load Impedance at the fundamental frequency in complex form.\n        Zch=Impedance at the input of the plasma chamber at the fundamental frequency in complex form. This impedance can be calculated based on Zf0 and the length and characteristic impedance of the connection between the RF power generator and the input to the plasma chamber. If an impedance matching network is used between the RF power generator and the input to the plasma chamber, then additional information about the values of the components comprising the impedance matching network is also needed.",
        "Similarly, power and impedance calculations may also be performed using other data generated by the one or more DSPs 315. For example, power and impedance calculations may be determined for one or more harmonic frequencies. Additional and/or alternate power and/or impedance calculations may be determined by the one or more DSPs 315.",
        "One advantage of using a FFT algorithm to measure RF power and impedance may be that the FFT algorithm may separate the effect of other frequencies on the frequency of interest. As a result, higher measurement precision may result.",
        "One or more of the power and/or impedance measurements determined above may be used to determine process related information in, for example, a semiconductor manufacturing process. In an embodiment, the power and impedance at the fundamental frequency and/or one or more harmonic frequencies may be used to determine information related to a semiconductor manufacturing process. In an embodiment, mixed product frequencies may additionally or alternately be used to determine information related to a semiconductor manufacturing process.",
        "In an embodiment, changes in one or more power and/or impedance measurements over time may be utilized to determine manufacturing process changes. In an embodiment, one or more power and/or impedance measurements may be used to characterize the load. Alternate and/or additional operations may be performed using the information described above within the scope of the present disclosure.",
        "It will be appreciated that various of the above-disclosed and other features and functions, or alternatives thereof, may be desirably combined into many other different methods, systems or applications. It will also be appreciated that various presently unforeseen or unanticipated alternatives, modifications, variations or improvements therein may be subsequently made by those skilled in the art which are also intended to be encompassed by the following claims."
    ],
    "citations": [
        "4542336",
        "4967159",
        "5127405",
        "5565737",
        "5576629",
        "5630227",
        "5705931",
        "5770922",
        "5808415",
        "5861752",
        "6046594",
        "6449568",
        "6522121",
        "6608446",
        "RE38273",
        "6657394",
        "6707255",
        "6708123",
        "6841124",
        "6873114",
        "6887339",
        "2004/0044486",
        "2004/0150386",
        "2007/0004349",
        "0753876",
        "1248361",
        "2315620",
        "970367"
    ],
    "us_classification": "324 7612",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "01",
            "subclass": "R",
            "main_group": "23",
            "subgroup": "16"
        }
    ]
}