{
    "title": "Pyrazolopyridines and pyrazolopyridazines as antidiabetics",
    "abstract": "The present invention includes compound of formula (I),",
    "inventors": [
        "Garland",
        "Haigh",
        "Hickey",
        "Liddle",
        "Smith",
        "Ward",
        "Witherington"
    ],
    "document_number": "07297792",
    "publication_date": "20071120",
    "assignees": [
        "SmithKline Beecham Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A compound of formula (I),",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A compound of formula (I) as claimed in claim 1 , wherein:",
            "components": [
                {
                    "component": "R",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A compound of formula (I) as claimed in claim 1 , wherein:",
            "components": [
                {
                    "component": "R",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A compound of formula (I) as defined in claim 1 , wherein:",
            "components": [
                {
                    "component": "R",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A compound of formula (I) as claimed in claim 1 , wherein:",
            "components": [
                {
                    "component": "R1is cyclopropyl, cyclopentyl, cyclobutyl, cyclohexyl, pyridin-3-ylmethyl, 3-pentyl, α,α-dimethylbenzyl, 2-butyl, 3-(meso-3,5-dimethylmorpholin-4-yl)propyl, 4-(N,N-diethylamino)butyl, 4-(1-pyridinium)butyl bromide salt, trans-phenylethenyl, 4-dimethylaminophenyl, 1,3-benzodioxolan-5-yl, 2,4,6-trimethylphenyl, 2-thienyl, trifluoromethyl, 2,2,2-trifluoroethyl, methyl, ethyl, n-propyl, n-butyl, n-pentyl, n-hexyl, methoxymethyl, 2-carboxyethyl, n-propenyl, iso-butenyl, styryl, phenyl, 2-furyl, benzyl, phenylethyl, 3-(N,N-dimethylamino)propyl, pyridin-4-yl, 3-(piperidin-1-yl)propyl, 3-(4-ethylpiperazin-1-yl)propyl, 3-(morpholin-1-yl)propyl, N-methylpiperidin-4-yl, iso-propyl, 2-(3-pyridinyl)ethyl, tert-butyl, or phenoxymethyl; and",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application is a divisional of U.S. Ser. No. 10/381,292 filed on Aug. 14, 2003, now U.S. Pat. No. 7,109,119, which was filed pursuant to 35 U.S.C. § 371 as a United States National Phase Application of international Application No. PCT/GB01/04186 filed Sep. 19, 2001 which claims priority from GB 0023358.5 filed Sep. 22, 2000; GB 0023361.9 filed Sep. 22, 2000; GB 0107391.5 filed Mar. 23, 2001; GB 0110671.5 filed May 1, 2001; and GB 0112799.2 filed May 25, 2001.",
        "This invention relates to novel compounds, in particular to novel pyrazolopyridine and pyrazolopyridazine derivatives, to processes for the preparation of such compounds, to pharmaceutical compositions containing such compounds and to the use of such compounds in medicine.",
        "GSK-3 is a serine/threonine protein kinase composed of two isoforms (α and β) which are encoded by distinct genes. GSK-3 is one of several protein kinases which phosphorylates glycogen synthase (GS) (Embi et al Eur. J. Biochem. (107) 519-527 (1980)). The α and β isoforms have a monomeric structure and are both found in mammalian cells. Both isoforms phosphorylate muscle glycogen synthase (Cross et al Biochemical Journal (303) 21-26 (1994)) and these two isoforms show good homology between species (e.g. human and rabbit GSK-3α are 96% identical).",
        "Type II diabetes (or Non-Insulin Dependent Diabetes Mellitus, NIDDM) is a multifactorial disease. Hyperglycaemia is due to insulin resistance in the liver, muscle and other tissues coupled with inadequate or defective secretion of insulin from pancreatic islets. Skeletal muscle is the major site for insulin-stimulated glucose uptake and in this tissue, glucose removed from the circulation is either metabolised through glycolysis and the TCA cycle, or stored as glycogen. Muscle glycogen deposition plays the more important role in glucose homeostasis and Type II diabetic subjects have defective muscle glycogen storage.",
        "The stimulation of glycogen synthesis by insulin in skeletal muscle results from the dephosphorylation and activation of glycogen synthase (Villar-Palasi C. and Lamer J. Biochim. Biophys. Acta (39) 171-173 (1960), Parker P J et al., Eur. J. Biochem. (130) 227-234 (1983), and Cohen P. Biochem. Soc. Trans. (21) 555-567 (1993)). The phosphorylation and dephosphorylation of GS are mediated by specific kinases and phosphatases. GSK-3 is responsible for phosphorylation and deactivation of GS, while glycogen bound protein phosphatase 1 (PP1G) dephosphorylates and activates GS. Insulin both inactivates GSK-3 and activates PP1G (Srivastava A K and Pandey S K Mol. and Cellular Biochem. (182) 135-141 (1998)).",
        "Chen et al Diabetes (43) 1234-1241 (1994) found that there was no difference in the mRNA abundance of PP1G between patients with Type II diabetes and control patients, suggesting that an increase in GSK-3 activity might be important in Type II diabetes. It has also recently been demonstrated that GSK-3 is overexpressed in Type II diabetic muscle and that an inverse correlation exists between skeletal muscle GSK-3α activity and insulin action (Nikoulina et al Diabetes 2000, 49 263-271). Overexpression of GSK-3β and constitutively active GSK-3β (S9A, S9E) mutants in HEK-293 cells resulted in suppression of glycogen synthase activity (Eldar-Finkelman et al., PNAS (93) 10228-10233 (1996)) and overexpression of GSK-3β in CHO cells, expressing both insulin receptor and insulin receptor substrate 1 (IRS-1), resulted in an impairment of insulin action (Eldar-Finkelman and Krebs PNAS (94) 9660-9664 (1997)). Recent evidence for the involvement of elevated GSK-3 activity and the development of insulin resistance and type II diabetes in adipose tissue has emerged from studies undertaken in diabetes and obesity prone C57BL/6J mice (Eldar-Finkelman et al., Diabetes (48) 1662-1666 (1999)).",
        "GSK-3 has been shown to phosphorylate other proteins in vitro including the eukaryotic initiation factor eIF-2B at Serine540 (Welsh et al., FEBS Letts (421) 125-130 (1998)). This phosphorylation results in an inhibition of eIF-2B activity and leads to a reduction in this key regulatory step of translation. In disease states, such as diabetes, where there is elevated GSK-3 activity this could result in a reduction of translation and potentially contribute to the pathology of the disease.",
        "Several aspects of GSK-3 functions and regulation in addition to modulation of glycogen synthase activity indicate that inhibitors of this enzyme may be effective in treatment of disorders of the central nervous system. GSK-3 activity is subject to inhibitory phosphorylation by PI 3 kinase-mediated or Wnt-1 class-mediated signals that can be mimicked by treatment with lithium, a low mM inhibitor of GSK-3 (Stambolic V., Ruel L. and Woodgett J. R. Curr. Biol. 1996 6(12): 1664-8).",
        "GSK-3 inhibitors may be of value as neuroprotectants in treatment of acute stroke and other neurotraumatic injuries. Roles for PI 3-kinase signalling through PKB/akt to promote neuronal cell survival are well established, and GSK-3 is one of a number of PKB/akt substrates to be identified that can contribute to the inhibition of apoptosis via this pathway (Pap & Cooper, (1998) J. Biol. Chem. 273: 19929-19932). Evidence suggests that astrocytic glycogen can provide an alternative energy source to facilitate neuronal survival under conditions of glucose deprivation (for example see Ransom, B. R. and Fern, R. (1997) Glia 21: 134-141 and references therein). Lithium is known to protect cerebellar granule neurons from death (D'Mello et al., (1994) Exp. Cell Res. 211: 332-338 and Volonte et al (1994) Neurosci. Letts. 172: 6-10) and chronic lithium treatment has demonstrable efficacy in the middle cerebral artery occlusion model of stroke in rodents (Nonaka and Chuang, (1998) Neuroreport 9(9): 2081-2084). Wnt-induced axonal spreading and branching in neuronal culture models has been shown to correlate with GSK-3 inhibition (Lucas & Salinas, (1997) Dev. Biol. 192: 31-44) suggesting additional value of GSK-3 inhibitors in promoting neuronal regeneration following neurotraumatic insult.",
        "Tau and β-catenin, two known in vivo substrates of GSK-3, are of direct relevance in consideration of further aspects of the value of GSK-3 inhibitors in relation to treatment of chronic neurodegenerative conditions. Tau hyperphosphorylation is an early event in neurodegenerative conditions such as Alzheimer's disease (AD), and is postulated to promote microtubule disassembly. Lithium has been reported to reduce the phosphorylation of tau, enhance the binding of tau to microtubules, and promote microtubule assembly through direct and reversible inhibition of glycogen synthase kinase-3 (Hong M., Chen D. C., Klein P. S. and Lee V. M. J. Biol. Chem. 1997 272(40) 25326-32). β-catenin is phosphorylated by GSK-3 as part of a tripartite complex with axin, resulting in β-catenin being targetted for degradation (Ikeda et al., (1998) EMBO J. 17: 1371-1384). Inhibition of GSK-3 activity is a key mechanism by which cytosolic levels of catenin are stabilised and hence promote β-catenin-LEF-1/TCF transcriptional activity (Eastman, Grosschedl (1999) Curr. Opin. Cell Biol. 11: 233). Rapid onset AD mutations in presenilin-1 (PS-1) have been shown to decrease the cytosolic β-catenin pool in transgenic mice. Further evidence suggests that such a reduction in available β-catenin may increase neuronal sensitivity to amyloid mediated death through inhibition of β-catenin-LEF-1/TCF transcriptional regulation of neuroprotective genes (Zhang et al., (1998) Nature 395: 698-702). A likely mechanism is suggested by the finding that mutant PS-1 protein confers decreased inactivation of GSK-3 compared with normal PS-1 (Weihl, C. C., Ghadge, G. D., Kennedy, S. G., Hay, N., Miller, R. J. and Roos, R. P. (1999) J. Neurosci. 19: 5360-5369).",
        "International Patent Application Publication Number WO 97/41854 (University of Pennsylvania) discloses that an effective drug for the treatment of manic depression is lithium, but that there are serious drawbacks associated with this treatment. Whilst the precise mechanism of action of this drug for treatment of bipolar disorder remains to be fully defined, current models suggest that inhibition of GSK-3 is a relevant target that contributes to the modulation of AP-1 DNA binding activity observed with this compound (see Manji et al., (1999) J. Clin. Psychiatry 60 (suppl 2): 27-39 for review).",
        "GSK-3 inhibitors may also be of value in treatment of schizophrenia. Reduced levels of β-catenin have been reported in schizophrenic patients (Cotter D, Kerwin R, al-Sarraji S, Brion J P, Chadwich A, Lovestone S, Anderton B, and Everall I. 1998 Neuroreport 9:1379-1383) and defects in pre-pulse inhibition to startle response have been observed in schizophrenic patients (Swerdlow et al (1994) Arch. Gen. Psychiat. 51: 139-154). Mice lacking the adaptor protein dishevelled-1, an essential mediator of Wnt-induced inhibition of GSK-3, exhibit both a behavioural disorder and defects in pre-pulse inhibition to startle response (Lijam N, Paylor R, McDonald M P, Crawley J N, Deng C X, Herrup K, Stevens K E, Maccaferri G, McBain C J, Sussman D J, and Wynshaw-Boris A. (1997) Cell 90: 895-905). Together, these findings implicate deregulation of GSK-3 activity as contributing to schizophrenia. Hence, small molecule inhibitors of GSK-3 catalytic activity may be effective in treatment of this mood disorder.",
        "The finding that transient β-catenin stabilisation may play a role in hair development (Gat et al Cell (95) 605-614(1998)) suggests that GSK-3 inhibitors could be used in the treatment of baldness.",
        "Studies on fibroblasts from the GSK-3β knockout mouse (Hoeflich K P et al., Nature 2000, 406, 86-90) support a role for this kinase in positively regulating the activity of NFkB. This transcription factor mediates cellular responses to a number of inflammatory stimuli. Therefore, pharmacologic inhibition of GSK-3 may be of use in treating inflammatory disorders through the negative regulation of NFkB activity.",
        "We have now discovered that a series of pyrazolo[3,4-b]pyridines and pyrazolo[3,4-c]pyridazines are particularly potent and selective inhibitors of GSK-3. These compounds are indicated to be useful for the treatment and/or prophylaxis of conditions associated with a need for inhibition of GSK-3, such as diabetes, conditions associated with diabetes, chronic neurodegenerative conditions including dementias such as Alzheimer's disease, Parkinson's disease, progressive supranuclear palsy, subacute sclerosing panencephalitic parkinsonism, postencephalitic parkinsonism, pugilistic encephalitis, guam parkinsonism-dementia complex, Pick's disease, corticobasal degeneration, frontotemporal dementia, Huntingdon's disease, AIDS associated dementia, amyotrophic lateral sclerosis, multiple sclerosis and neurotraumatic diseases such as acute stroke, mood disorders such as schizophrenia and bipolar disorders, promotion of functional recovery post stroke, cerebral bleeding (for example, due to solitary cerebral amyloid angiopathy), hair loss, obesity, atherosclerotic cardiovascular disease, hypertension, polycystic ovary syndrome, syndrome X, ischaemia, traumatic brain injury, cancer, leukopenia, Down's syndrome, Lewy body disease, inflammation, and immunodeficiency.",
        "Accordingly, in a first aspect, the present invention provides a compound of formula (I),",
        "or a derivative thereof,\n\nwherein;",
        "Y is CH or N;",
        "R1 is unsubstituted or substituted alkyl, unsubstituted or substituted cycloalkyl, unsubstituted or substituted alkenyl, unsubstituted or substituted cycloalkenyl, unsubstituted or substituted aryl, aralkyl wherein the aryl and the alkyl moieties may each independently be unsubstituted or substituted, aralkenyl wherein the aryl and alkenyl moieties may each independently be unsubstituted or substituted, unsubstituted or substituted heterocyclyl, or heterocyclylalkyl wherein the heterocyclyl and the alkyl moieties may each independently be unsubstituted or substituted;",
        "R2 is unsubstituted or substituted aryl or unsubstituted or substituted heteroaryl.",
        "Suitably, Y is CH. Suitably, Y is N.",
        "Preferably, R1 is unsubstituted or substituted alkyl, unsubstituted or substituted cycloalkyl, unsubstituted or substituted alkenyl, unsubstituted or substituted aryl, aralkyl wherein the aryl and the alkyl moieties may each independently be unsubstituted or substituted, aralkenyl wherein the aryl and alkenyl moieties may each independently be unsubstituted or substituted, unsubstituted or substituted heterocyclyl, and heterocyclylalkyl wherein the heterocyclyl and the alkyl moieties may each independently be unsubstituted or substituted.",
        "When R1 is unsubstituted or substituted alkyl, examples include C1-6alkyl, for example methyl, ethyl, propyl, iso-propyl, butyl, pentyl and hexyl.",
        "When R1 is unsubstituted or substituted cycloalkyl, examples include cycloC3-8alkyl, for example cyclopropyl, cyclobutyl, cyclopentyl and cyclohexyl.",
        "When R1 is unsubstituted or substituted alkenyl, examples include C2-6alkenyl, for example propenyl and butenyl.",
        "When R1 is unsubstituted or substituted cycloalkenyl, examples include cycloC3-8alkenyl.",
        "When R1 is unsubstituted or substituted aryl, examples include phenyl and naphthalenyl.",
        "When R1 is unsubstituted or substituted aralkyl, examples include arylC1-6 alkyl, for example benzyl and phenethyl.",
        "When R1 is unsubstituted or substituted aralkenyl, examples include arylC2-6alkenyl, for example phenethenyl.",
        "When R1 is unsubstituted or substituted heterocyclyl, examples include C3-7heterocyclyl, for example furyl, pyridinyl, piperidinyl, pyrrolidinyl, benzodioxalanyl, thienyl and dihydrobenzofuranyl. When R1 is unsubstituted or substituted heterocyclylalkyl, examples include C3-7 heterocyclylC1-6alkyl, for example piperindinylmethyl, piperidinylpropyl, piperazinylpropyl, piperazinylbutyl, morpholinylpropyl, pyridinylethyl, pyridinylmethyl, pyrrolidinylpropyl, (1-pyridinium)butyl bromide salt, thiomorpholinylpropyl, (1-oxo-thiomorpholinyl)propyl, (1,1-dioxo-thiomorpholinyl)propyl and piperidinylbutyl.",
        "When R1 is substituted alkyl, suitable substituents include halo, C1-6alkoxy, carboxy, di(C1-6alkyl)amino, C1-6alkoxyC2-6alkoxy, haloC1-6alkoxy, aryloxy such as phenoxy, C1-6alkoxyC2-6alkyl(C1-6alkyl)amino, di(C1-6alkoxyC2-6alkyl)amino.",
        "When R1 is substituted cycloalkyl, suitable substituents include up to five groups independently selected from the list consisting of hydroxy, C1-6alkoxy, di(C1-6alkyl)amino, cyano, C1-6alkyl, carboxy, C1-6alkoxycarbonyl, C1-6alkylaminocarbonyl, C1-6alkylcarbonylamino, amino, halo and nitro.",
        "When R1 is substituted alkenyl, suitable substituents include halo, C1-6alkoxy, carboxy, di(C1-6alkyl)amino, C1-6alkoxyC2-6alkoxy, haloC1-6alkoxy, aryloxy such as phenoxy, C1-6alkoxyC2-6alkyl(C1-6alkyl)amino, di(C1-6alkoxyC2-6alkyl)amino.",
        "When R1 is substituted cycloalkenyl, suitable substituents include up to five groups independently selected from the list consisting of hydroxy, C1-6alkoxy, di(C1-6alkyl)amino, cyano, C1-6alkyl, carboxy, C1-6alkoxycarbonyl, C1-6alkylaminocarbonyl, C1-6alkylcarbonylamino, amino, halo and nitro.",
        "When R1 is substituted aryl, suitable substituents include up to five groups independently selected from the list consisting of hydroxy, C1-6alkoxy, mono- and di(C1-6alkyl)amino, cyano, C1-6alkyl, carboxy, C1-6alkoxycarbonyl, C1-6alkylaminocarbonyl, C1-6alkylcarbonylamino, amino, halo and nitro.",
        "When R1 is substituted heterocyclyl, suitable substituents include up to five groups independently selected from the list consisting of hydroxy, C1-6alkoxy, mono- and di(C1-6alkyl)amino, cyano, C1-6alkyl, carboxy, C1-6alkoxycarbonyl, C1-6alkylaminocarbonyl, C1-6alkylcarbonylamino, amino, halo and nitro.",
        "When Y is CH or N, suitably R1 is trifluoromethyl, 2,2,2-trifluoroethyl, methyl, ethyl, n-propyl, n-butyl, 2-butyl, n-pentyl, 3-pentyl, n-hexyl, methoxymethyl, 2-carboxyethyl, n-propenyl, iso-butenyl, styryl, phenyl, 2-furyl, 2-thienyl, benzyl, phenylethyl, 3-(N,N-dimethylamino)propyl, pyridin-4-yl, 3-(piperidin-1-yl)propyl, 3-(4-ethylpiperazin-1-yl)propyl, 3-(morpholin-4-yl)propyl, 1,3-benzodioxolan-5-yl, N-methylpiperidin-4-yl, iso-propyl, pyridin-3-ylmethyl, α,α-dimethylbenzyl, 3-(meso-3,5-dimethylmorpholin-4-yl)propyl, 4-(1-pyridinium)butyl bromide salt, 2-(3-pyridinyl)ethyl, tert-butyl, phenoxymethyl, cyclopropyl, cyclobutyl, cyclopentyl, cyclohexyl, 4-dimethylaminobenzyl, 4-(dimethylaminomethyl)benzyl, methoxyethoxymethyl, 2,2,2-trifluoroethoxymethyl, 3-dimethylaminophenoxymethyl, (1-methylpiperidin-4-yl)methyl, (1-ethylpiperidin-4-yl)methyl, (1-phenylpiperidin-4-yl)methyl, (1-benzylpiperidin-4-yl)methyl, (1-(4-fluorobenzyl)piperidin-4-yl)methyl, (1-(phenoxyethyl)piperidin-4-yl)methyl, 4-fluorophenethyl, (6-methylpyridn-3-yl)ethyl, methoxyethyl, 3-(N,N-diethylamino)propyl, N-methoxyethyl(N-methyl)aminopropyl, di-(N-methoxyethyl)aminopropyl, 3-(1,1-dioxo-1-thiomorpholin-4-yl)propyl, 3-(pyrrolidin-1-yl)propyl, 3-(4-benzylpiperazin-1-yl)propyl, 3-(4-(4-chlorophenoxy)piperidin-1-yl)propyl, 3-(4-methanesulfonylpiperazin-1-yl)propyl, 4-(N,N-diethylamino)butyl, 4-(piperidin-1-yl)butyl, piperidin-4-yl, 1-ethylpiperidin-4-yl, 1-benzylpiperidin-4-yl, 1-(4-chlorobenzyl)piperidin-4-yl, 1-(4-fluorobenzyl)piperidin-4-yl, 1-(methoxyethyl)piperidin-4-yl, 1-(phenoxyethyl)piperidin-4-yl, 1-(4-chlorophenoxyethyl)piperidin-4-yl, 1-phenylpiperidin-4-yl, 1-benzylpyrrolidin-3-yl, trans-phenethenyl, trans-4-fluorophenethenyl, 4-fluorophenyl, 4-dimethylaminophenyl, 2,4,6-trimethylphenyl, 4-(diethylaminomethyl)phenyl, 4-(piperidin-1-ylmethyl)phenyl, 4-(pyrolidin-1-ylmethyl)phenyl, 4-(thiomorpholin-4-ylmethyl)phenyl, 2,3-dihydrobenzofuran-5-yl, 3-(4-(2-phenylethyl)piperazin-1-yl)propyl, 3-(4-cyclohexylmethylpiperazin-1-yl)propyl, 3-(4-cyclopentylpiperazin-1-yl)propyl, 3-(4-iso-propylpiperazin-1-yl)propyl, 3-(4-phenylpiperazin-1-yl)propyl, 4-(4-ethylpiperazin-1-yl)butyl, 3-(piperidin-1-ylmethyl)phenyl, 4-(diethylaminomethyl)phenyl, 4-(4-ethylpiperazin-1-ylmethyl)phenyl, benzothien-2-yl, 4-methoxybenzyl or benzyloxymethyl.",
        "When Y is CH, preferably R1 is cyclopropyl, cyclopentyl, cyclobutyl, cyclohexyl, pyridin-3-ylmethyl, 3-pentyl, α,α-dimethylbenzyl, 2-butyl, 3-(meso-3,5-dimethylmorpholin-4-yl)propyl, 4-(N,N-diethylamino)butyl, 4-(1-pyridinium)butyl bromide salt, trans-phenethenyl, 4-dimethylaminophenyl, 1,3-benzodioxolan-5-yl, 2,4,6-trimethylphenyl, 2-thienyl, trifluoromethyl, 2,2,2-trifluoroethyl, methyl, ethyl, n-propyl, n-butyl, n-pentyl, n-hexyl, methoxymethyl, 2-carboxyethyl, n-propenyl, iso-butenyl, styryl, phenyl, 2-furyl, benzyl, phenylethyl, 3-(N,N-dimethylamino)propyl, pyridin-4-yl, 3-(piperidin-1-yl)propyl, 3-(4-ethylpiperazin-1-yl)propyl, 3-(morpholin-4-yl)propyl, N-methylpiperidin-4-yl, iso-propyl, 2-(3-pyridinyl)ethyl, tert-butyl, or phenoxymethyl.",
        "When Y is N, preferably R1 is methyl, n-propyl, iso-propyl, cyclopropyl, cyclopentyl, benzyl, 3-(N,N-dimethylamino)propyl, 3-(morpholin-4-yl)propyl, 4-dimethylaminobenzyl, 4-(dimethylaminomethyl)benzyl, methoxymethyl, methoxyethoxymethyl, 2,2,2-trifluoroethoxymethyl, phenoxymethyl, 3-dimethylaminophenoxymethyl, (1-methylpiperidin-4-yl)methyl, (1-ethylpiperidin-4-yl)methyl, (1-phenylpiperidin-4-yl)methyl, (1-benzylpiperidin-4-yl)methyl, (1-(4-fluorobenzyl)piperidin-4-yl)methyl, (1-(phenoxyethyl)piperidin-4-yl)methyl, phenethyl, 4-fluorophenethyl, (6-methylpyridin-3-yl)ethyl, methoxyethyl, 3-(N,N-diethylamino)propyl, N-methoxyethyl(N-methyl)aminopropyl, di-(N-methoxyethyl)aminopropyl, 3-(1,1-dioxo-1-thiomorpholin-4-yl)propyl, 3-(piperidin-1-yl)propyl, 3-(pyrrolidin-1-yl)propyl, 3-(4-ethylpiperazin-1-yl)propyl, 3-(4-benzylpiperazin-1-yl)propyl, 3-(4-(4-chlorophenoxy)piperidin-1-yl)propyl, 3-(4-methanesulfonylpiperazin-1-yl)propyl, 4-(N,N-diethylamino)butyl, 4-(piperidin-1-yl)butyl, piperidin-4-yl, 1-methylpiperidin-4-yl, 1-ethylpiperidin-4-yl, 1-benzylpiperidin-4-yl, 1-(4-chlorobenzyl)piperidin-4-yl, 1-(4-fluorobenzyl)piperidin-4-yl, 1-(methoxyethyl)piperidin-4-yl, 1-(phenoxyethyl)piperidin-4-yl, 1-(4-chlorophenoxyethyl)piperidin-4-yl, 1-phenylpiperidin-4-yl, 1-benzylpyrrolidin-3-yl, trans-phenethenyl, trans-4-fluorophenethenyl, phenyl, 4-fluorophenyl, 4-dimethylaminophenyl, 2,4,6-trimethylphenyl, 4-(diethylaminomethyl)phenyl, 4-(piperidin-1-ylmethyl)phenyl, 4-(pyrolidin-1-ylmethyl)phenyl, 4-(thiomorpholin-4-ylmethyl)phenyl, 2,3-dihydrobenzofuran-5-yl, 3-(4-(2-phenylethyl)piperazin-1-yl)propyl, 3-(4-cyclohexylmethylpiperazin-1-yl)propyl, 3-(4-cyclopentylpiperazin-1-yl)propyl, 3-(4-iso-propylpiperazin-1-yl)propyl, 3-(4-phenylpiperazin-1-yl)propyl, 4-(4-ethylpiperazin-1-yl)butyl, 3-(piperidin-1-ylmethyl)phenyl, 4-(diethylaminomethyl)phenyl, 4-(4-ethylpiperazin-1-ylmethyl)phenyl, benzothien-2-yl, 4-methoxybenzyl or benzyloxymethyl.",
        "When R2 is unsubstituted or substituted aryl, examples include phenyl, biphenyl and naphthalenyl.",
        "When R2 is substituted aryl, suitable substituents include up to five groups independently selected from the list consisting of benzyloxy, halo, C1-6alkyl, C1-6alkoxy, C1-3alkylenedioxy, C1-6alkylcarbonylamino, perhaloC1-6alkyl, nitro, perhaloC1-6alkoxy, formyl, C1-6alkoxycarbonyl, carboxy, cyano, morpholinylalkyl, hydroxy, di-(C1-6alkyl)aminoalkoxy, morpholinylalkoxy, or di-(C1-6alkyl)amino.",
        "When R2 is unsubstituted heteroaryl, examples include thienyl, furanyl, indolyl, pyridin-2-yl, pyridin-3-yl, quinolin-3-yl, benzodioxolanyl, pyrimidinyl, pyrazinyl and benzthiophenyl.",
        "When R2 is substituted heteroaryl, suitable substituents include up to five groups independently selected from the list consisting of C1-6alkoxycarbonylamino, cyanoC1-6alkyl, amino, pyrrolyl, ureido, phenyl, hydroxyC1-6alkylamino, formylaminoC1-6alkylamino, piperidinyl, aminocarbonyl, C1-6alkoxycarbonylC1-6alkylcarbonyl, C1-6alkoxycarbonyl, C1-6alkoxy, halo, and C1-6alkyl.",
        "When Y is CH or N, suitably R2 is phenyl, pyridin-3-yl, pyridin-4-yl, 2-thienyl, 2-benzyloxyphenyl, 2-chlorophenyl, 2-fluorophenyl, 2-methylphenyl, 2-methoxypyrid-3-yl, 2-methoxyphenyl, 3,4-methylenedioxyphenyl, 3,5-dichlorophenyl, 3-acetamidophenyl, 3-trifluoromethylphenyl, 3-chlorophenyl, 3-fluorophenyl, furan-3-yl, 3-methoxyphenyl, 3-nitrophenyl, 3-thienyl, 4-trifluoromethylphenyl, 4-chlorophenyl, 4-fluorophenyl, 4-methoxyphenyl, 4-methylphenyl, 4-trifluoromethoxyphenyl, indol-5-yl, 4-methoxypyridin-3-yl, 2-chloro-3-fluorophenyl, 2,3-difluorophenyl, 2,3,6-trifluorophenyl, 3-methylphenyl, pyridin-2-yl, quinolin-3-yl, 2-formylphenyl, 3-formylphenyl, 3-methoxycarbonylphenyl, 3-carboxyphenyl, 3-cyanophenyl, 2-[(morpholin-4-yl)methyl]phenyl, 3-[(morpholin-4-yl)methyl]phenyl, 4-[(morpholin-4-yl)methyl]phenyl, 2-[2-(morpholin-4-yl)ethyl]phenyl, 3-[2-(morpholin-4-yl)ethyl]phenyl, 4-[2-(morpholin-4-yl)ethyl]phenyl, 3-hydoxyphenyl, 4-hydroxyphe 3-methoxyphenyl, 2-(dimethylaminoethoxy)phenyl, 3-(dimethylaminoethoxy)phenyl, 4-(dimethylaminoethoxy)phenyl, 2-(3-dimethylaminopropoxy)phenyl, 3-(3-dimethylaminopropoxy)phenyl, 4-(3-dimethylaminopropoxy)phenyl, 2-[(morpholin-4-yl)ethoxy]phenyl, 3-[(morpholin-4-yl)ethoxy]phenyl, 4-[(morpholin-4-yl)ethoxy]phenyl, 2-[3-(morpholin-4-yl)propoxy]phenyl, 3-[3-(morpholin-4-yl)propoxy]phenyl, 4-[3-(morpholin-4-yl)propoxy]phenyl, 1,3-benzodioxolan-5-yl, 2,5-difluorophenyl, 2,6-difluorophenyl, 3,4-difluorophenyl, 3,5-difluorophenyl, 2-fluoro-4-chlorophenyl, 3-fluoro-4-chlorophenyl, 2-chloro-4-fluorophenyl, 3-chloro-4-fluorophenyl, 2,5-dichlorophenyl, 2,4-dichlorophenyl, 2,6-dichlorophenyl, 2,3,5-trifluorophenyl, 2,3,4-trifluorophenyl, 2,4,6-trifluorophenyl, 2,4,5-trifluorophenyl, 3,4,5-trifluorophenyl, 3-dimethylaminophenyl, 2-chloropyridin-3-yl, 6-chloropyridin-3-yl, 2-chloro-5-methylpyridin-3-yl, 2-chloro-4,5-dimethylpyridin-3-yl, 2,5-dimethylpyridin-3-yl, 2-(t-butoxycarbonylamino)pyridin-3-yl, 2-(cyanomethyl)pyridin-3-yl, 6-aminopyridin-3-yl, 6-(pyrrol-1-yl)pyridin-3-yl, 6-ureidopyridin-3-yl, 5-phenylpyridin-3-yl, 2-amino-5-methylpyridin-3-yl, 2-methyl-6-aminopyridin-3-yl, 5-methyl-6-aminopyridin-3-yl, 5-methyl-6-(3-hydroxypropylamino)pyridin-3-yl, 5-methyl-6-[3-(formylamino)propylamino]pyridin-3-yl, 5-(piperidin-1-yl)pyridin-3-yl, 5-aminocarbonylpyridin-3-yl, 5-(methoxycarbonylmethylcarbonyl)pyridin-3-yl, 5-ethoxycarbonylpyridin-3-yl, 5-methoxypyridin-3-yl, 4-methylpyridin-3-yl, pyrimidin-5-yl, pyrimidin-2-yl, pyrazin-2-yl naphthalen-1-yl, furan-2-yl, biphenyl-4-yl, or benzo[b]thiophen-3-yl.",
        "When Y is CH preferably R2 is phenyl, pyridin-3-yl, 2-thienyl, 2-benzyloxyphenyl, 2-chlorophenyl, 2-fluorophenyl, 2-methylphenyl, 2-methoxypyrid-3-yl, 2-methoxyphenyl, 3,4-methylenedioxyphenyl, 3,5-dichlorophenyl, 3-acetamidophenyl, 3-trifluoromethylphenyl, 3-chlorophenyl, 3-fluorophenyl, furan-3-yl, 3-methoxyphenyl, 3-nitrophenyl, 3-thienyl, 4-trifluoromethylphenyl, 4-chlorophenyl, 4-fluorophenyl, 4-methoxyphenyl, 4-methylphenyl, 4-trifluoromethoxyphenyl, indol-5-yl 4-methoxypyridin-3-yl, 2-formylphenyl, 3-formylphenyl, 3-methoxycarbonylphenyl, 3-carboxyphenyl, 3-cyanophenyl, 2-[(morpholin-4-yl)methyl]phenyl, 3-[(morpholin-4-yl)methyl]phenyl, 4-[(morpholin-4-yl)methyl]phenyl, 2-[2-(morpholin-4-yl)ethyl]phenyl, 3-[2-(morpholin-4-yl)ethyl]phenyl, 4-[2-(morpholin-4-yl)ethyl]phenyl, 3-hydoxyphenyl, 4-hydroxyphenyl, 3-methoxyphenyl, 2-(dimethylaminoethoxy)phenyl, 3-(dimethylaminoethoxy)phenyl, 4-(dimethylaminoethoxy)phenyl, 2-(3-dimethylaminopropoxy)phenyl, 3-(3-dimethylaminopropoxy)phenyl, 4-(3-dimethylaminopropoxy)phenyl, 2-[(morpholin-4-yl)ethoxy]phenyl, 3-[(morpholin-4-yl)ethoxy]phenyl, 4-[(morpholin-4-yl)ethoxy]phenyl, 2-[3-(morpholin-4-yl)propoxy]phenyl, 3-[3-(morpholin-4-yl)propoxy]phenyl, 4-[3-(morpholin-4-yl)propoxy]phenyl, 1,3-benzodioxolan-5-yl, 2,3-difluorophenyl, 2,5-difluorophenyl, 2,6-difluorophenyl, 3,4-difluorophenyl, 3,5-difluorophenyl, 2-fluoro-4-chlorophenyl, 3-fluoro-4-chlorophenyl, 2-chloro-4-fluorophenyl, 3-chloro-4-fluorophenyl, 2,5-dichlorophenyl, 2,4-dichlorophenyl, 2,6-dichlorophenyl, 2,3,6-trifluorophenyl, 2,3,5-trifluorophenyl, 2,3,4-trifluorophenyl, 2,4,6-trifluorophenyl, 2,4,5-trifluorophenyl, 3,4,5-trifluorophenyl, 3-dimethylaminophenyl, pyridin-2-yl, pyridin-4-yl, 2-chloropyridin-3-yl, 6-chloropyridin-3-yl, 2-chloro-5-methylpyridin-3-yl, 2-chloro-4,5-dimethylpyridin-3-yl, 2,5-dimethylpyridin-3-yl, 2-(t-butoxycarbonylamino)pyridin-3-yl, 2-(cyanomethyl)pyridin-3-yl, 6-aminopyridin-3-yl, 6-(pyrrol-1-yl)pyridin-3-yl, 6-ureidopyridin-3-yl, 5-phenylpyridin-3-yl, 2-amino-5-methylpyridin-3-yl, 2-methyl-6-aminopyridin-3-yl, 5-methyl-6-aminopyridin-3-yl, 5-methyl-6-(3-hydroxypropylamino)pyridin-3-yl, 5-methyl-6-[3-(formylamino)propylamino]pyridin-3-yl, 5-(piperidin-1-yl)pyridin-3-yl, 5-aminocarbonylpyridin-3-yl, 5-(methoxycarbonylmethylcarbonyl)pyridin-3-yl, 5-ethoxycarbonylpyridin-3-yl, 5-methoxypyridin-3-yl, 4-methylpyridin-3-yl, quinolin-3-yl, pyrimidin-5-yl, pyrimidin-2-yl, pyrazin-2-yl, naphthalen-1-yl, furan-2-yl, biphenyl-4-yl, benzo[b]thiophen-3-yl,",
        "When Y is N, preferably R2 is phenyl, 2-chlorophenyl, 2-chloro-3-fluorophenyl, 2,3-difluorophenyl, 2,3,6-trifluorophenyl, 3-methylphenyl, pyridin-2-yl, pyridin-3-yl or quinolin-3-yl.",
        "Further preferred compounds of formula (I) include those wherein, R1 is methyl, ethyl, n-propyl, iso-propyl, cyclopropyl, cyclobutyl, cyclopentyl, pyridin-3-ylmethyl, 3-(morpholin-4-yl)propyl, 3-(meso-3,5-dimethylmorpholin-4-yl)propyl, benzyl, 3-(N,N-dimethylamino)propyl, 3-(pyrrolidin-1-yl)propyl, piperidin-4-yl, 1-methylpiperidin-4-yl, 3-(piperidin-1-yl)propyl, 3-(4-ethylpiperazin-1-yl)propyl, 4-(diethylaminomethyl)phenyl, 3-(N,N-diethylamino)propyl, 3-(1,1-dioxo-1-thiomorpholin-4-yl)propyl, 1-(methoxyethyl)piperidin-4-yl, methoxymethyl, methoxyethyl, phenoxymethyl, benzyloxymethyl, 1-ethylpiperidin-4-yl, methoxyethoxymethyl, 1-benzylpiperidin-4-yl, 3 (4-methanesulfonylpiperazin-1-yl)propyl, N-methoxyethyl(N-methyl)aminopropyl, 4-(piperidin-1-yl)butyl, 2,2,2-trifluoroethoxymethyl, (1-(4-fluorobenzyl)piperidin-4-yl)methyl, 1-benzylpyrrolidin-3-yl, (1-ethylpiperidin-4-yl)methyl, 4-dimethylaminophenyl, 4-fluorophenethyl, 4-(piperidin-1-ylmethyl)phenyl, (1-methylpiperidin-4-yl)methyl, 4-(dimethylaminomethyl)benzyl, (6-methylpyridin-3-yl)ethyl, 1-(4-fluorobenzyl)piperidin-4-yl, 4-(4-ethylpiperazin-1-yl)butyl, 4-(4-ethylpiperazin-1-ylmethyl)phenyl, 3-(4-cyclopentylpiperazin-1-yl)propyl, 3-(4-cyclohexylmethylpiperazin-1-yl)propyl and 4-methoxybenzyl; and",
        "R2 is pyridin-2-yl, pyridin-3-yl, phenyl, 3-fluorophenyl, 3-thienyl, 4-methoxypyridin-3-yl, 2,3-difluorophenyl, 2,5-difluorophenyl, 3,5-difluorophenyl, 2,6-difluorophenyl, furan-2-yl, 2,3,4-trifluorophenyl, 2,3,5-trifluorophenyl, 2,3,6-trifluorophenyl, pyrimidin-2-yl, quinolin-3-yl, 3-hydroxyphenyl, 4-methylpyridin-3-yl, 2-chloro-5-methylpyridin-3-yl, 6-aminopyridin-3-yl, 6-ureidopyridin-3-yl, 2-chloropyridin-3-yl, 6-chloropyridin-3-yl 5-(piperidin-1-yl)pyridin-3-yl, 5-methyl-6-aminopyridin-3-yl, 5-(methoxycarbonylmethylcarbonyl)pyridin-3-yl, 5-methoxypyridin-3-yl, 5-aminocarbonylpyridin-3-yl, 5-phenylpyridin-3-yl, 3-formylphenyl, 3-methylphenyl, 2-chlorophenyl and 2-chloro-3-fluorophenyl.",
        "Particularly preferred compounds of formula (I) where Y is CH include those wherein,",
        "R1 is ethyl, n-propyl, iso-propyl, cyclopropyl, cyclobutyl, cyclopentyl, pyridin-3-ylmethyl, 3-(morpholin-4-yl)propyl and 3-(meso-3,5-dimethylmorpholin-4-yl)propyl; and",
        "R2 is pyridin-2-yl, pyridin-3-yl, phenyl, 3-fluorophenyl, 3-thienyl, 4-methoxypyridin-3-yl, 2,3-difluorophenyl, 2,5-difluorophenyl, 3,5-difluorophenyl, 2,6-difluorophenyl, furan-2-yl, 2,3,4-trifluorophenyl, 2,3,5-trifluorophenyl, 2,3,6-trifluorophenyl, pyrimidin-2-yl, quinolin-3-yl, 3-hydroxyphenyl, 4-methylpyridin-3-yl, 2-chloro-5-methylpyridin-3-yl, 6-aminopyridin-3-yl, 6-ureidopyridin-3-yl, 2-chloropyridin-3-yl, 6-chloropyridin-3-yl, 5-(piperidin-1-yl)pyridin-3-yl, 5-methyl-6-aminopyridin-3-yl, 5-(methoxycarbonylmethylcarbonyl)pyridin-3-yl, 5-methoxypyridin-3-yl, 5-aminocarbonylpyridin-3-yl, 5-phenylpyridin-3-yl and 3-formylphenyl.",
        "Particularly preferred compounds of formula (I) where Y is N include those wherein,",
        "R1 is methyl, n-propyl, iso-propyl, cyclopropyl, cyclopentyl, benzyl, 3-(N,N-dimethylamino)propyl, 3-(morpholin-4-yl)propyl, 3-(pyrrolidin-1-yl)propyl, piperidin-4-yl,1-methylpiperidin-4-yl, 3-(piperidin-1-yl)propyl, 3-(4-ethylpiperazin-1-yl)propyl, 4-(diethylaminomethyl)phenyl, 3-(N,N-diethylamino)propyl, 3-(1,1-dioxo-1-thiomorpholin-4-yl)propyl, 1-(methoxyethyl)piperidin-4-yl, methoxymethyl, methoxyethyl, phenoxymethyl, benzyloxymethyl, 1-ethylpiperidin-4-yl, methoxyethoxymethyl, 1-benzylpiperidin-4-yl, 3-(4-methanesulfonylpiperazin-1-yl)propyl, N-methoxyethyl(N-methyl)aminopropyl, 4-(piperidin-1-yl)butyl, 2,2,2-trifluoroethoxymethyl, (1-(4-fluorobenzyl)piperidin-4-yl)methyl, 1-benzylpyrrolidin-3-yl, (1-ethylpiperidin-4-yl)methyl, 4-dimethylaminophenyl, 4-fluorophenethyl, 4-(piperidin-1-ylmethyl)phenyl, (1-methylpiperidin-4-yl)methyl, 4-(dimethylaminomethyl)benzyl, (6-methylpyridin-3-yl)ethyl, 1-(4-fluorobenzyl)piperidin-4-yl, 4-(4-ethylpiperazin-1-yl)butyl, 4-(4-ethylpiperazin-1-ylmethyl)phenyl, 3-(4-cyclopentylpiperazin-1-yl)propyl, 3-(4-cyclohexylmethylpiperazin-1-yl)propyl and 4-methoxybenzyl; and\n\nR2 is phenyl, 3-methylphenyl, 2,3-difluorophenyl, 2-chlorophenyl, 2-chloro-3-fluorophenyl, 2,3,6-trifluorophenyl, pyridin-3-yl and quinolin-3-yl.",
        "Certain of the compounds of formula (I) may contain chiral atoms and/or multiple bonds, and hence may exist in one or more stereoisomeric forms. The present invention encompasses all of the isomeric forms of the compounds of formula (I) whether as individual isomers or as mixtures of isomers, including geometric isomers and racemic modifications.",
        "Alkyl groups referred to herein, including those forming part of other groups, include straight or branched chain alkyl groups containing up to twelve, suitably up to six carbon atoms. These alkyl groups may be optionally substituted with up to five, suitably up to three, groups selected from the list consisting of aryl, heterocyclyl, alkylthio, alkenylthio, alkynylthio, arylthio, heterocyclylthio, alkoxy, arylalkoxy, arylalkylthio, amino, mono- or di-alkylamino, cycloalkyl, cycloalkenyl, carboxy and esters thereof, phosphonic acid and esters thereof, mono- or dialkylaminosulphonyl, aminosulphonyl, cyano, alkylcarbonylamino, arylcarbonylamino, arylaminocarbonyl, arylalkylaminocarbonyl, arylalkylcarbonylamino, thiazolidinedionyl, piperazinylcarbonyl wherein the piperazine may be unsubstituted or substituted, morpholinylcarbonyl, piperidinylcarbonyl, hydroxyalkylaminocarbonyl, dialkylaminocarbonyl, aminocarbonyl, dialkylaminoalkylaminocarbonyl, alkoxycarbonylamino, alkoxyalkylcarbonylamino, alkylcarbonylaminoalkylcarbonylamino, alkoxycarbonylalkylcarbonylamino, alkylaminocarbonyl, aminosulphonyl, arylsulphonylamino, alkylsulphonylamino, hydroxy, morpholinylalkylaminocarbonyl, hydroxyaminocarbonyl, aryloxy, heteroaryloxy, heteroarylalkoxy, heteroarylthio, heteroarylalkylthio and halogen.",
        "Alkenyl and alkynyl groups referred to herein include straight and branched chain groups containing from two to twelve, suitably from two to six, carbon atoms. These alkenyl and alkynyl groups may be optionally substituted with up to five, suitably up to three, groups including those substituents described hereinbefore for the alkyl groups.",
        "Cycloalkyl and cycloalkenyl groups referred to herein include groups having between three and eight ring carbon atoms. These cycloalkyl and cycloalkenyl groups may be optionally substituted with up to five, suitably up to three, groups including those substituents hereinbefore described for the alkyl groups.",
        "As used herein, the term “aryl” includes phenyl, naphthenyl, and biphenyl groups, especially phenyl. Suitable optional substituents for any aryl group include up to five substituents selected from the list consisting of perhaloalkyl, arylaminocarbonyl, aralkyaminocarbonyl, hydroxyalkylaminocarbonyl, arylamino, aminosulphonyl, alkylsulphonylamino, mono- and di-alkylamino, mono- and di-alkylaminocarbonyl, arylaminocarbonylalkyl, arylcarbonyl, aralkoxy, heteroaryloxy, heteroarylalkoxy, heteroarylthio, heteroarylalkylthio, arylcarbonylamino, alkoxyalkylaminocarbonyl, aralkylcarbonylamino, aralkylcarbonylaminoalkyl, aminocarbonyl, morpholinylalkylaminocarbonylalkyl, arylaminosulphonyl, arylcarbonylaminoalkyl, arylsulphonylamino, aminocarbonylalkyl, hydroxyaminocarbonylalkyl, aryl, alkylcarbonylamino, alkylenedioxy, perhaloalkoxy, thiazolidinedionylalkyl, carboxyalkoxy, (methylpiperazinyl)carbonylalkyl, morpholinyl, morpholinylcarbonylalkyl, piperidinylcarbonylalkyl, hydroxyalkylaminocarbonylalkyl, mono- and di-alkylaminocarbonylalkyl, alkoxyalkylaminosulphonyl, alkoxyamino, perhaloalkylcarbonylamino, alkylaminosulphonylalkyl, mono- and di-alkylaminoalkylaminocarbonylalkyl, carboxyalkoxy, alkoxycarbonylaminoalkyl, aminocarbonylalkenyl, alkoxyalkylcarbonylamino, alkylcarbonylaminoalkylcarbonylamino, alkylcarbonylaminoalkyl, hydroxyalkylcarbonylamino, alkoxycarbonylalkylcarbonylamino, carboxyalkylcarbonylamino, alkoxyalkylcarbonylaminoalkyl, alkylcarbonylaminoalkylcarbonylaminoalkyl, hydroxyalkylcarbonylaminoalkyl, carboxyalkenyl, aminocarbonylalkylcarbonylamino, alkylaminocarbonylalkoxy, alkylaminosulphonylalkyl, aminocarbonylalkyl, oxazolyl, pyridinylalkylcarbonylamino, methyloxazolyl, alkylthio, alkylaminocarbonylalkyl, halo, alkyl, alkenyl, substituted alkenyl, arylalkyl, alkoxy, alkoxyalkyl, haloalkyl, haloalkyloxy, hydroxy, hydroxyalkyl, nitro, amino, cyano, cyanoalkyl, mono- and di-N-alkylamino, acyl, acylamino, N-alkylacylamino, acyloxy, carboxy, carboxyalkyl, carboxyalkylcarbonyl, carboxyalkenyl, ketoalkylester, carbamoyl, carbamoylalkyl, mono- and di-N-alkylcarbamoyl, alkoxycarbonyl, alkoxycarbonylalkyl, aryloxy, arylthio, aralkyloxy, aryloxycarbonyl, ureido, guanidino, morpholino, adamantyl, oxazolyl, aminosulphonyl, alkylaminosulphonyl, alkylthio, haloalkylthio, alkylsulphinyl, alkylsulphonyl, cycloalkyl, heterocyclyl, heterocyclylalkyl alkoxycarbonyl, trityl, substituted trityl, mono- or bis-alkylphosphonate or mono- or bis-alkylphosphonateC1-6alkyl or any two adjacent substituents on the phenyl ring together with the carbon atoms to which they are attached form a carbocyclic ring or a heterocyclic ring.",
        "As used herein the terms “heterocyclyl” and “heterocyclic” suitably include, unless otherwise defined, aromatic and non-aromatic, single and fused, rings suitably containing up to four heteroatoms in each ring, each of which is selected from oxygen, nitrogen and sulphur. Each ring suitably has from 4 to 7, preferably 5 or 6, ring atoms. These heterocyclyl and heterocyclic rings may be unsubstituted or substituted by up to five substituents. A fused heterocyclic ring system may include carbocyclic rings and need include only one heterocyclic ring. Examples include furyl, piperazinyl, thienyl, piperidinyl, pyridazinyl, morpholinyl, pyridinyl, indolinyl, quinolinyl, indolyl, benzoxazolyl, benzothiazolyl, benzothiazolinonyl, benzoxazolinonyl, and quarternised pyridinyl and salts thereof. Suitable substituents for any heterocyclyl or heterocyclic group are selected from cyano, carboxyalkoxy, morpholinyl, hydroxyalkylaminocarbonyl, alkoxyalkylaminosulphonyl, alkylaminosulphonyl, arylcarbonylamino, aralkylcarbonylamino, aralkenylcarbonylamino, perhalocarbonylamino, perhaloalkyl, aminocarbonyl, nitro, aminocarbonylalkenyl, alkoxyalkylcarbonylamino, alkylcarbonylaminoalkylcarbonylamino, hydroxyalkylcarbonylamino, carboxyalkenyl, aminocarbonylalkylcarbonylamino, alkylaminocarbonylalkoxy, aryl, arylcarbonyl, alkylenedioxy, aryloxy, aralkyloxy, perhaloalkylthio, alkylcarbonyl, alkoxycarbonylalkylthio, carboxyalkylthio, hydroxyalkyl, alkoxyalkyl, cyanoalkyl, carboxyalkyl, alkoxycarbonyl, halogen, alkyl, arylalkyl, alkoxy, alkoxyalkyl, haloalkyl, hydroxy, amino, mono- and di-N-alkylamino, acylamino, carboxy and salts and esters thereof, carbamoyl, mono- and di-N-alkylaminocarbonyl, aryloxycarbonyl, alkoxycarbonylalkyl, aryl, oxy groups, ureido, guanidino, sulphonylamino, aminosulphonyl, alkylthio, alkylsulphinyl, alkylsulphonyl, hydroxy, alkylcarbonylamino, heterocyclyl and heterocyclylalkyl.",
        "As used herein the term “heteroaryl” suitably includes, unless otherwise defined, aromatic single and fused rings suitably containing up to four heteroatoms in each ring, e ch of which is selected from oxygen, nitrogen and sulphur. Each ring suitably has from 4 to 7, preferably 5 or 6, ring atoms. These heteroaryl rings may be unsubstituted or substituted by up to five substituents. A fused heteroaryl ring system may include carbocyclic rings and need include only one heteroaryl ring. Examples include furyl, thienyl, pyridazinyl, pyridyl, quinolinyl, indolyl, benzoxazolyl and benzothiazolyl. Suitable substituents for any heteroaryl group are selected from cyano, carboxyalkoxy, morpholinyl, hydroxyalkylaminocarbonyl, alkoxyalkylaminosulphonyl, alkylaminosulphonyl, arylcarbonylamino, aralkylcarbonylamino, aralkenylcarbonylamino, perhalocarbonylamino, perhaloalkyl, aminocarbonyl, nitro, aminocarbonylalkenyl, alkoxyalkylcarbonylamino, alkylcarbonylaminoalkylcarbonylamino, hydroxyalkylcarbonylamino, carboxyalkenyl, aminocarbonylalkylcarbonylamino, alkylaminocarbonylalkoxy, aryl, arylcarbonyl, alkylenedioxy, aryloxy, aralkyloxy, perhaloalkylthio, alkylcarbonyl, alkoxycarbonylalkylthio, carboxyalkylthio, hydroxyalkyl, alkoxyalkyl, cyanoalkyl, carboxyalkyl, alkoxycarbonyl, halogen, alkyl, arylalkyl, alkoxy, alkoxyalkyl, haloalkyl, hydroxy, amino, mono- and di-N-alkylamino, acylamino, carboxy and salts and esters thereof, carbamoyl, mono- and di-N-alkylaminocarbonyl, aryloxycarbonyl, alkoxycarbonylalkyl, aryl, oxy groups, ureido, guanidino, sulphonylamino, aminosulphonyl, alkylthio, alkylsulphinyl, alkylsulphonyl, hydroxy, alkylcarbonylamino, heterocyclyl and heterocyclylalkyl.",
        "As used herein the terms “halogen” or “halo” include iodo, bromo, chloro or fluoro, especially chloro or fluoro.",
        "Suitable derivatives of the compounds of the invention are pharmaceutically acceptable derivatives.",
        "Suitable derivatives of the compounds of the invention include salts and solvates.",
        "Suitable pharmaceutically acceptable derivatives include pharmaceutically acceptable salts and pharmaceutically acceptable solvates.",
        "Suitable pharmaceutically acceptable salts include metal salts, such as for example aluminium, alkali metal salts such as lithium, sodium or potassium, alkaline earth metal salts such as calcium or magnesium and ammonium or substituted ammonium salts, for example those with lower alkylamines such as triethylamine, hydroxy alkylamines such as 2-hydroxyethylamine, bis-(2-hydroxyethyl)amine or tri-(2-hydroxyethyl)amine, cycloalkylamines such as bicyclohexylamine, or with procaine, dibenzylpiperidine, N-benzyl-β-phenethylamine, dehydroabietylamine, N,N′-bisdehydroabietylamine, glucamine, N-methylglucamine or bases of the pyridine type such as pyridine, collidine, quinine or quinoline.",
        "Suitable pharmaceutically acceptable salts also includes pharmaceutically acceptable acid addition salts, such as those provided by pharmaceutically acceptable inorganic acids or organic acids.",
        "Suitable pharmaceutically acceptable acid addition salts provided by pharmaceutically acceptable inorganic acids includes the sulphate, nitrate, phosphate, borate, hydrochloride and hydrobromide and hydroiodide.",
        "Suitable pharmaceutically acceptable acid addition salts provided by pharmaceutically acceptable organic acids includes the acetate, tartrate, maleate, fumarate, malonate, citrate, succinate, lactate, oxalate, benzoate, ascorbate, methanesulphonate, α-keto glutarate and α-glycerophosphate.",
        "Suitable pharmaceutically acceptable solvates include hydrates.",
        "For the avoidance of doubt when used herein the term “diabetes” includes diabetes mellitus, especially Type 2 diabetes, and conditions associated with diabetes mellitus.",
        "The term “conditions associated with diabetes” includes those conditions associated with the pre-diabetic state, conditions associated with diabetes mellitus itself and complications associated with diabetes mellitus.",
        "The term “conditions associated with the pre-diabetic state” includes conditions such as insulin resistance, impaired glucose tolerance and hyperinsulinaemia.",
        "The term “conditions associated with diabetes mellitus itself” include hyperglycaemia, insulin resistance and obesity. Further conditions associated with diabetes mellitus itself include hypertension and cardiovascular disease, especially atherosclerosis and conditions associated with insulin resistance. Conditions associated with insulin resistance include polycystic ovarian syndrome and steroid induced insulin resistance.",
        "The term “complications associated with diabetes mellitus” includes renal disease, especially renal disease associated with Type II diabetes, neuropathy and retinopathy. Renal diseases associated with Type II diabetes include nephropathy, glomerulonephritis, glomerular sclerosis, nephrotic syndrome, hypertensive nephrosclerosis and end stage renal disease.",
        "A further aspect of the invention provides a process for the preparation of a compound of formula (I), or a derivative thereof, which process comprises reaction of a compound of formula (II),",
        "wherein;",
        "Y and R2 are as defined in formula (I), with a compound of formula (III)",
        "wherein;",
        "R1 is as defined in formula (I) and X is a leaving group, and thereafter, if required, carrying out one or more of the following optional steps:\n\n    (i) converting a compound of formula (I) to a further compound of formula (I);\n    (ii) removing any necessary protecting group;\n    (iii) preparing an appropriate derivative of the compound so formed.",
        "An example of a suitable leaving group, X, is chloro.",
        "The reaction between the compounds of formulae (II) and (III) is carried out in a suitable solvent under conventional amidation conditions at a suitable temperature providing a suitable rate of formation of the required product, generally at an elevated temperature, over a suitable reaction time. Suitable solvents include pyridine. Suitable reaction temperatures include those in the range of 60° C. to 220° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 12-72 hours. If the compound of formula (II) is a weak nucleophile, then the reaction may be assisted by, for example, using temperatures at the upper end of this range, or by using a hindered base catalyst such as dimethylaminopyridine (DMAP). A hindered base is a base which does not act as a competing nucleophile. The reaction products are isolated using conventional methods. Alternatively, the reaction may be assisted by the use of an excess of the compound of formula (III). It will be appreciated that where R1 and/or R2 are non-basic, a suitable method of isolation involves cooling the reaction mixture, acidifying the resulting residue using a suitable acid and isolating the product by filtration. A suitable acid is a dilute mineral acid, for example dilute hydrochloric acid. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction products are purified by conventional methods, such as crystallisation, chromatography and trituration. Crystalline product may be obtained by standard methods.",
        "In the reaction of a compound of formula (II) with a compound of formula (III), a compound of formula (IV) may be formed",
        "wherein;",
        "R1 and R2 are as hereinbefore defined.",
        "A compound of formula (IV) may be converted into a compound of formula (I) either in situ or in a separate step, by reaction with a suitable nucleophile, such as piperidine.",
        "Compounds of formula (IV) are considered to be novel and accordingly form a further aspect of the invention.",
        "In a preferred aspect, the compound of formula (III) is added to a solution of the compound of formula (II) in pyridine. The reaction mixture is stirred at reflux for 16 hours and allowed to cool. The mixture is acidified to pH 1 with 5N HCl and the solid isolated by filtration. Where Y is CH, the crude product is purified by conventional methods, for example chromatography, trituration or crystallisation from one or more suitable solvents such as DMF/methanol. Where Y is N one of the following steps is employed:\n\n    \n    \n        a) The mixture is acidified to pH 1 with 5N HCl and the solid isolated by filtration; or\n        b) The mixture is concentrated in vacuo; or\n        c) The mixture is concentrated in vacuo and the residue azeotroped with water and then with ethanol; or\n        d) The mixture is concentrated in vacuo and the residue azeotroped with ethanol and then dissolved in methanol and absorbed onto a column pre-packed with a suitable acidic ion-exchange resin. The column is washed with methanol and the product subsequently eluted with 0.5N ammonia in methanol solution; and",
        "The resulting crude product is purified by chromatography, for example, silica gel chromatography or reverse-phased preparative HPLC. It will be appreciated that the purification of a compound of formula (I) may require more than one chromatography step, and may additionally require subsequent purification with a suitable acidic ion-exchange resin. It will be appreciated that suitable acidic ion-exchange resins include those commercially available, for example, SCX resin.",
        "In a further preferred aspect, the compound of formula (III) is added to a solution of a compound of formula (II) in pyridine. The reaction mixture is stirred at reflux for 72 hours and allowed to cool, then evaporated in vacuo. Piperidine is added and the mixture stirred for a further 16 hours at ambient temperature. The solvents are removed under vacuum, and the residue azeotroped with ethanol. The crude product is purified by silica gel chromatography.",
        "Compounds of formula (II) are believed to be novel and accordingly form a further aspect of the invention.",
        "A still further aspect of the invention provides a process for the preparation of a compound of formula (I) where Y is CH, or a derivative thereof, which process comprises reaction of a compound of formula (V),",
        "wherein;",
        "R1 is as defined in formula (I), with a compound of formula (VI)\n\nR2—B(OR3)2  (VI)\n\nwherein;",
        "R2 is as defined in formula (I) and R3 is hydrogen or C1-6alkyl and thereafter, if required, carrying out one or more of the following optional steps:\n\n    (i) converting a compound of formula (I) to a further compound of formula (I);\n    (ii) removing any necessary protecting group;\n    (iii) preparing an appropriate derivative of the compound so formed.",
        "Suitably, R3 is hydrogen.",
        "The reaction between the compounds of formulae (V) and (VI) is carried out in a suitable degassed solvent in the presence of a suitable catalyst and a suitable base at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable solvents include DMF/ethanol. Suitable catalysts include tetrakis(triphenylphosphine)palladium(0). Suitable bases include aqueous sodium bicarbonate. Suitable reaction temperatures include those in the range of 60° C. to 220° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 8-24 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is cooled, water added, and the products isolated by filtration. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction products are purified by conventional methods, such as crystallisation, chromatography and trituration. Crystalline product may be obtained by standard methods.",
        "In a preferred aspect, tetrakis(triphenylphosphine)palladium(0) is added to a degassed solution of the compound of formula (V), the compound of formula (VI), and aqueous sodium bicarbonate in DMF/ethanol. The reaction mixture is stirred at reflux for 12 hours, cooled, and water added. The crude product is isolated by filtration and purified by column chromatography.",
        "Compounds of formula (V) are believed to be novel and accordingly form a further aspect of the invention.",
        "A still further aspect of the invention provides a process for the preparation of a compound of formula (I), or a derivative thereof, which process comprises reaction of a compound of formula (VII),",
        "wherein;",
        "R1 is as defined in formula (I) and Z is the moiety (R4O)2B—, wherein R4 is hydrogen or C1-6alkyl, or Z is the moiety (VIII),",
        "wherein;",
        "R5 is C1-6alkyl",
        "with a compound of formula (IX),\n\nR2—X′  (IX)\n\nwherein;",
        "R2 is as defined in formula (I) and X′ is a leaving group, for example halogen, and thereafter, if required, carrying out one or more of the following optional steps:\n\n    (i) converting a compound of formula (I) to a further compound of formula (I);\n    (ii) removing any necessary protecting group;\n    (iii) preparing an appropriate derivative of the compound so formed.",
        "Suitably, X′ is bromo.",
        "Suitably, Z is a moiety of formula (VIII).",
        "Suitably, R5 is methyl.",
        "The reaction between the compounds of formulae (VII) and (IX) is carried out in a suitable degassed solvent in the presence of a suitable catalyst and a suitable base at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable solvents include a mixture of DMF/ethanol/water. Suitable catalysts include tetrakis(triphenylphosphine)palladium(0). Suitable bases include potassium acetate. Suitable reaction temperatures include those in the range of 60° C. to 220° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 8-24 hours. Typically, the reaction mixture is cooled, and the product isolated by conventional means. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction products are purified by conventional methods, such as crystallisation, chromatography and trituration. Crystalline product may be obtained by standard methods.",
        "In a preferred aspect, tetrakis(triphenylphosphine)palladium(0) is added to a stirred and degassed solution of the compound of formula (VII), the compound of formula (IX), and aqueous potassium acetate in DMF/ethanol/water. The reaction mixture is stirred at reflux for 18 hours, cooled, ethyl acetate added, and the mixture washed with aqueous sodium bicarbonate and brine. The organic layer is isolated, dried with magnesium sulphate, and evaporated. The crude product is purified by column chromatography.",
        "Compounds of formula (VII) are believed to be novel and accordingly form a further aspect of the invention.",
        "The above-mentioned conversions of a compound of formula (I) into another compound of formula (I) includes any conversion which may be effected using conventional procedures, but in particular the said conversions include any combination of:\n\n    (i) converting one group R1 into another group R1;\n    (ii) converting one group R2 into another group R2.",
        "The above-mentioned conversions (i) and (ii) may be carried out using any appropriate method under conditions determined by the particular groups chosen.",
        "The above mentioned conversions (i) and (ii) may as appropriate be carried out on any of the intermediate compounds mentioned herein.",
        "For example, a compound of formula (I) wherein R1 represents 1-benzylpiperidin-4-yl may be converted into a compound of formula (I) wherein R1 represents piperidin-4-yl, by treatment of the compound of formula (I) wherein R1 represents 1-benzylpiperidin-4-yl with ammonium formate in refluxing ethanol in the presence of 10% Pd/C.",
        "Suitable conversions of one group R1 into another group R1, as in conversion (i), include converting a group R1 which represents a 4-bromobutyl group into a group R1 which represents (1-pyridinium)butyl bromide salt, such conversion may be carried out in situ by reacting a compound of formula (III), wherein R1 is 4-bromobutyl, with a compound of formula (II) in the presence of pyridine.",
        "The above-mentioned conversions may as appropriate be carried out on any of the intermediate compounds mentioned herein.",
        "Suitable protecting groups in any of the above-mentioned reactions are those used conventionally in the art. The methods of formation and removal of such protecting groups are those conventional methods appropriate to the molecule being protected. Thus for example a benzyloxy group may be prepared by treatment of the appropriate compound with a benzyl halide, such as benzyl bromide, and thereafter, if required, the benzyl group may be conveniently removed using catalytic hydrogenation or a mild ether cleavage reagent such as trimethylsilyl iodide or boron tribromide.",
        "Where appropriate individual isomeric forms of the compounds of formula (I) may be prepared as individual isomers using conventional procedures.",
        "The absolute stereochemistry of compounds may be determined using conventional methods, such as X-ray crystallography.",
        "The derivatives of the compounds of formula (I), including salts and/or solvates, may be prepared and isolated according to conventional procedures.",
        "Compounds of formula (II) may be prepared by reaction of a compound of formula (X),",
        "wherein;",
        "Y and R2 are as defined in formula (I), with hydrazine, or a hydrate thereof.",
        "The reaction between the compound of formula (X) and hydrazine, or a hydrate thereof is carried out in a suitable solvent at a suitable temperature providing a suitable rate of formation of the required product, generally at an elevated temperature, over a suitable reaction time. Suitable solvents include pyridine and ethanol. Suitable reaction temperatures include those in the range of 60° C. to 220° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 1-48 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is cooled, the product isolated by filtration, and dried. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction products may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, hydrazine hydrate is added to a stirred solution of the compound of formula (X) in pyridine. The reaction mixture is stirred at reflux for 6 hours and cooled. The crude product is isolated by filtration and dried. The crude product may be used without purification.",
        "Compounds of formula (X) where Y is CH may be prepared by reaction of a compound of formula (XI),",
        "wherein;",
        "R2 is as defined in formula (I), with a mixture of phosphorus oxychloride and phosphorus pentachloride.",
        "The reaction between the compound of formula (XI) and a mixture of phosphorus oxychloride and phosphorus pentachloride is carried out at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable reaction temperatures include the reflux temperature of the mixture. Suitable reaction times are those in the range 1-48 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is cooled, and added cautiously to iced water. The solution is then basified with a suitable base such as sodium carbonate and the product isolated by filtration. The product is then washed and dried. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction product may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, the compound of formula (XI) is added to a suspension of phosphorus oxychloride and phosphorus pentachloride. The suspension is stirred at reflux for 1 hour, cooled, and cautiously added to iced water. The solution is adjusted to pH 11 with sodium carbonate and the product isolated by filtration, washed with water, and dried. The crude product may be used without purification.",
        "Compounds of formula (XI) are either commercially available or are prepared by analogy with known conventional literature procedures, for example those disclosed in Recl. Trav. Chim. Pays-Bas, 1974, 93, 233, or in standard reference texts of synthetic methodology such as J. March, Advanced Organic Chemistry, 3rd Edition (1985), Wiley Interscience.",
        "Compounds of formula (X) where Y is N are either commercially available or are prepared by analogy with known conventional literature procedures, for example those disclosed in J. Med Chem 1989, 32, 528, or in standard reference texts of synthetic methodology such as J. March, Advanced Organic Chemistry, 3rd Edition (1985), Wiley Interscience.",
        "Compounds of formula (X) where Y is N may also be prepared by the reaction of a compound of formula (XII),",
        "wherein;",
        "R2 is as defined in formula (I), with phosphoryl chloride.",
        "The reaction between the compound of formula (XII) and phosphoryl chloride, is carried out optionally in a suitable solvent at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable reaction temperatures include those in the range of 60° C. to 220° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 1-48 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is cooled and evaporated, and the residue dissolved in a suitable solvent and washed with a suitable aqueous base. The organic solution is then dried with a suitable drying agent and evaporated. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction products may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, the compound of formula (XII) is dissolved in phosphoryl chloride and heated at reflux for 3 hours, then cooled and evaporated and the residue dissolved in dichloromethane and washed with saturated sodium bicarbonate solution. The organic solution is then dried with magnesium sulphate and evaporated. The crude product may be used without purification.",
        "Compounds of formula (XII) may be prepared by reaction of a compound of formula (XIII),",
        "wherein;",
        "R2 is as defined in formula (I), with,\n\n    1) phosphoryl chloride; followed by,\n    2) aqueous ammonia.",
        "The reaction between the compound of formula (XIII) and phosphoryl chloride (according to step 1 above), is carried out optionally in a suitable solvent at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time, optionally in the presence of a suitable catalyst. Suitable reaction temperatures include those in the range of 60° C. to 220° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 1-48 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is cooled and evaporated. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively.",
        "The reaction between the product of step (1) above and aqueous ammonia (according to step 2 above), is carried out optionally in a suitable solvent at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable reaction temperatures include those in the range of 20° C. to 100° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 1-48 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is diluted with water and extracted with a suitable solvent. The product is isolated from the organic solution by drying with a suitable drying agent followed by evaporation. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction products may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, the compound of formula (XIII) is dissolved in phosphoryl chloride containing 3 drops of dry N,N-dimethylformamide and heated at 80° C. for 4 hours, then cooled and evaporated. The residue is dissolved in dry THF and added with vigorous stirring to concentrated aqueous ammonia solution. After 1 hour the mixture is diluted with water, extracted with ethyl acetate and the organic solution washed with brine, dried over magnesium sulphate and evaporated. The crude product may be used without purification.",
        "Compounds of formula (XIII) may be prepared by reaction of a compound of formula (XIV),",
        "wherein;",
        "R2 is as defined in formula (I), and R6 represents a straight or branched chain C1-6alkyl moiety, with sodium hydroxide.",
        "The reaction between the compound of formula (XIV) and sodium hydroxide, is carried out optionally in a suitable solvent at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable reaction temperatures include those in the range of 20° C. to 100° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 1-48 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is cooled and evaporated, and the residue diluted with water and filtered. Acidification of the filtrate affords a precipitate which is filtered, washed with water and dried. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction products may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, the compound of formula (XIV) is dissolved in ethanol and aqueous sodium hydroxide solution and heated at reflux for 2 hours, then cooled and evaporated. The residue is diluted with water, filtered, and the filtrate acidified with 2M HCl to afford a precipitate which is filtered, washed with water and dried in vacuo. The crude product may be used without purification.",
        "Compounds of formula (XIV) may be prepared by reaction of a compound of formula (XV),",
        "wherein;",
        "R2 is as defined in formula (I), and R6 represents a straight or branched chain C1-6alkyl moiety, with hydrazine, or a hydrate, or the hydrochloride thereof.",
        "The reaction between the compound of formula (XV) and hydrazine, or a hydrate, or the hydrochloride thereof, is carried out optionally in a suitable solvent at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable reaction temperatures include those in the range of 20° C. to 100° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 24-120 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is cooled and evaporated to dryness. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction products may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, the compound of formula (XV) is dissolved in ethanol containing hydrazine monohydrochloride and heated at reflux for 96 hours, then cooled and evaporated to dryness. The crude product may be used without purification.",
        "Compounds of formula (XV) may be prepared by reaction of a compound of formula (XVI),",
        "wherein;",
        "R2 is as defined in formula (I), with a diC1-6alkyl ketomalonate.",
        "The reaction between the compound of formula (XVI) and diC1-6alkyl ketomalonate is carried out optionally in a suitable solvent, at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable reaction temperatures include those in the range of 60° C. to 200° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 24-96 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is diluted with a suitable solvent and purified by chromatography, for example, silica gel chromatography. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively.",
        "In a preferred aspect, the compound of formula (XVI) and diethyl ketomalonate are heated at 140° C. for 48 hours, then cooled. The reaction mixture is diluted with toluene and chromatographed on silica gel using 20% v/v ethyl acetate in hexane.",
        "Compounds of formula (V) may be prepared by reaction of the compound of formula (XVII),",
        "with a compound of formula (III).",
        "The reaction between the compounds of formulae (XVII) and (III) is carried out in a suitable solvent at a suitable temperature providing a suitable rate of formation of the required product, generally at an elevated temperature, over a suitable reaction time. A suitable solvent is pyridine. Suitable reaction temperatures include the reflux temperature of the mixture. Suitable reaction times are those in the range 8-24 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is concentrated in vacuo and water added. The product isolated by filtration, washed, and dried. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction product may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, the compound of formula (III) is added to a solution of the compound of formula (XVII) in pyridine. The mixture is stirred at reflux for 16 hours then concentrated in vacuo. Water is added and the product isolated by filtration and dried. The crude product may be used without purification.",
        "The compound of formula (XVII) is believed to be novel and accordingly forms a further aspect of the invention.",
        "The compound of formula (XVII) may be prepared by reaction of the compound of formula (XVIII),",
        "with hydrazine, or a hydrate thereof.",
        "The reaction between the compound of formula (XVIII) and hydrazine, or a hydrate thereof, is carried out in a suitable solvent at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. A suitable solvent is ethanol. Suitable reaction temperatures include the reflux temperature of the mixture. Suitable reaction times are those in the range 1-48 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is concentrated in vacuo and water added. The product isolated by filtration, washed, and dried. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction product may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, hydrazine hydrate is added to a stirred solution of the compound of formula (XVIII) in ethanol. The mixture is stirred at reflux for 4 hours then concentrated in vacuo. Water is added and the product isolated by filtration and dried. The crude product may be used without purification.",
        "The compound of formula (XVIII) may be prepared from the compound of formula (XIX),",
        "by reaction with a mixture of phosphorus oxychloride and phosphorus pentachloride.",
        "The reaction between the compound of formula (XIX) and a mixture of phosphorus oxychloride and phosphorus pentachloride is carried out at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable reaction temperatures include the reflux temperature of the mixture. Suitable reaction times are those in the range 1-48 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is cooled and added cautiously to iced water. The product isolated by filtration, washed, and dried in vacuo. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction product may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, the compound of formula (XIX) is added to a suspension of phosphorus oxychloride and phosphorus pentachloride. The suspension is stirred at reflux for 3 hours, cooled, and cautiously added to iced water. The product isolated by filtration, washed with water, and dried in vacuo. The crude product may be used without purification.",
        "The compound of formula (XIX) is believed to be novel and accordingly forms a further aspect of the invention.",
        "The compound of formula (XIX) may be prepared from the compound of formula (XX),",
        "by reaction with bromine.",
        "The reaction between the compound of formula (XX) and bromine is carried out in a suitable solvent at a suitable temperature providing a suitable rate of formation of the required product, generally ambient temperature, over a suitable reaction time. A suitable solvent is acetic acid. Suitable reaction times are those in the range 12-24 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is concentrated in vacuo and the resulting oil triturated with a suitable solvent. A suitable solvent for trituration is ethanol. The reaction product may, if desired, be purified by conventional methods, such as crystallisation, chromatography and trituration.",
        "In a preferred aspect, bromine is added to a solution of the compound of formula (XX) in acetic acid. The suspension is stirred for 14 hours, concentrated in vacuo, and the resulting oil triturated with ethanol. The crude product may be used without purification.",
        "The compound of formula (XX) is prepared by procedures disclosed in J. Heterocycl. Chem., 1985, 22, 771.",
        "Compounds of formula (VII) may be prepared from compounds of formula (V) by conventional methods of preparing boronic acids or esters thereof, for example those discloed in standard reference texts of synthetic methodology such as J. March, Advanced Organic Chemistry, 3rd Edition (1985), Wiley Interscience.",
        "An example of the preparation of a compound of formula (VII) involves the reaction of a compound of formula (I) with bis(pinacolato)diboron in a suitable degassed solvent in the presence of a suitable catalyst and a suitable base at a suitable temperature providing a suitable rate of formation of the required product, generally an elevated temperature, over a suitable reaction time. Suitable solvents include DMSO. Suitable catalysts include [1,1′-bis(diphenylphosphino)ferrocene]palladium(II) chloride. Suitable bases include potassium acetate. Suitable reaction temperatures include those in the range of 60° C. to 220° C. and, as appropriate, the reflux temperature of the solvent. Suitable reaction times are those in the range 8-24 hours. The reaction products are isolated using conventional methods. Typically, the reaction mixture is cooled, filtered through diatomaceous earth, and diluted with ethyl acetate, and washed with brine. The organic layer is isolated, dried and evaporated. Conventional methods of heating and cooling may be employed, for example electric heating mantles and ice/salt baths respectively. The reaction products are purified by conventional methods, such as crystallisation, chromatography and trituration. Crystalline product may be obtained by standard methods.",
        "Compounds of formulae (I), (II), (V), (VII), (XI), (XIII), (XIV), (XVII) (XIX) and (XX) may exist as tautomers. The present invention encompasses all tautomeric forms of the compounds of formulae (I), (II), (V), (VII), (XI), (XIII), (XIV), (XVII) (XIX) and (XX).",
        "Compounds of formulae (III), (VI), (VIII)-(XVIII) and (XX) are either commercially available or are prepared by analogy with known conventional literature procedures, for example those disclosed in J. Med Chem 1989, 32, 528, J Med Chem 1999, 42, 730 or in standard reference texts of synthetic methodology such as J. March, Advanced Organic Chemistry, 3rd Edition (1985), Wiley Interscience.",
        "As stated above, the compounds of formula (I), or pharmaceutically acceptable derivatives thereof, are indicated to be useful as inhibitors of glycogen synthase kinase-3.",
        "The invention therefore provides a compound of formula (I), or a pharmaceutically acceptable derivative thereof, for use as an inhibitor of GSK-3.",
        "Accordingly, the present invention also provides a method for the treatment of conditions associated with a need for inhibition of CSK-3 such as diabetes, conditions associated with diabetes, chronic neurodegenerative conditions including dementias such as Alzheimer's disease, Parkinson's disease, progressive supranuclear palsy, subacute sclerosing panencephalitic parkinsonism, postencephalitic parkinsonism, pugilistic encephalitis, guam parkinsonism-dementia complex, Pick's disease, corticobasal degeneration, frontotemporal dementia, Huntingdon's disease, AIDS associated dementia, amyotrophic lateral sclerosis, multiple sclerosis and neurotraumatic diseases such as acute stroke, mood disorders such as schizophrenia and bipolar disorders, promotion of functional recovery post stroke, cerebral bleeding (for example, due to solitary cerebral amyloid angiopathy), hair loss, obesity, atherosclerotic cardiovascular disease, hypertension, polycystic ovary syndrome, syndrome X, ischaemia, traumatic brain injury, cancer, leukopenia, Down's syndrome, Lewy body disease, inflammation, and immunodeficiency, which method comprises the administration of a pharmaceutically effective, non-toxic amount of a compound of formula (I) or a pharmaceutically acceptable derivative thereof,",
        "The present invention further provides a compound of formula (I), or a pharmaceutically acceptable derivative thereof, for use as an inhibitor of glycogen synthase kinase-3, and especially for use in the treatment of conditions associated with a need for the inhibition of GSK-3, such as diabetes, conditions associated with diabetes, chronic neurodegenerative conditions including dementias such as Alzheimer's disease, Parkinson's disease, progressive supranuclear palsy, subacute sclerosing panencephalitic parkinsonism, postencephalitic parkinsonism, pugilistic encephalitis, guam parkinsonism-dementia complex, Pick's disease, corticobasal degeneration, frontotemporal dementia, Huntingdon's disease, AIDS associated dementia, amyotrophic lateral sclerosis, multiple sclerosis and neurotraumatic diseases such as acute stroke, mood disorders such as schizophrenia and bipolar disorders, promotion of functional recovery post stroke, cerebral bleeding (for example, due to solitary cerebral amyloid angiopathy), hair loss, obesity, atherosclerotic cardiovascular disease, hypertension, polycystic ovary syndrome, syndrome X, ischaemia, traumatic brain injury, cancer, leukopenia, Down's syndrome, Lewy body disease, inflammation, and immunodeficiency.",
        "The present invention also provides the use of a compound of formula (I), or a pharmaceutically acceptable derivative thereof, for the manufacture of a medicament for the treatment of conditions associated with a need for the inhibition of GSK-3, such as diabetes, conditions associated with diabetes, chronic neurodegenerative conditions including dementias such as Alzheimer's disease, Parkinson's disease, progressive supranuclear palsy, subacute sclerosing panencephalitic parkinsonism, postencephalitic parkinsonism, pugilistic encephalitis, guam parkinsonism-dementia complex, Pick's disease, corticobasal degeneration, frontotemporal dementia, Huntingdon's disease, AIDS associated dementia, amyotrophic lateral sclerosis, multiple sclerosis and neurotraumatic diseases such as acute stroke, mood disorders such as schizophrenia and bipolar disorders, promotion of functional recovery post stroke, cerebral bleeding (for example, due to solitary cerebral amyloid angiopathy), hair loss, obesity, atherosclerotic cardiovascular disease, hypertension, polycystic ovary syndrome, syndrome X, ischaemia, traumatic brain injury, cancer, leukopenia, Down's syndrome, Lewy body disease, inflammation, and immunodeficiency.",
        "In a further aspect of this invention, there is provided a compound of formula (I), or a pharmaceutically acceptable derivative thereof for use as an active therapeutic substance.",
        "Preferably, the compounds of formula (I), or pharmaceutically acceptable derivatives thereof, are administered as pharmaceutically acceptable compositions.",
        "Accordingly, the invention also provides a pharmaceutical composition which comprises a compound of formula (I), or a pharmaceutically acceptable derivative thereof, and a pharmaceutically acceptable carrier.",
        "Neurotraumatic diseases include both open or penetrating head trauma, such as caused by surgery, or a closed head trauma injury, such as caused by an injury to the head region, ischaemic stroke including acute stroke, particularly to the brain area, transient ischaemic attacks following coronary by-pass and cognitive decline following other transient ischaemic conditions.",
        "The active compounds are usually administered as the sole medicament agent but they may be administered in combination with other medicament agents as dictated by the severity and type of disease being treated. For example in the treatment of diabetes, especially Type 2 diabetes, a compound of formula (I), or a pharmaceutically acceptable derivative thereof, may be used in combination with other medicament agents, especially antidiabetic agents such as insulin secretagogues, especially sulphonylureas, insulin sensitisers, especially glitazone insulin sensitisers (for example thiazolidinediones), or with biguanides or alpha glucosidase inhibitors or the compound of formula (I), or a pharmaceutically acceptable derivative thereof, may be administered in combination with insulin.",
        "The said combination comprises co-administration of a compound of formula (I), or a pharmaceutically acceptable derivative thereof, and an additional medicament agent or the sequential administration of a compound of formula (I), or a pharmaceutically acceptable derivative thereof, and the additional medicament agent.",
        "Co-administration includes administration of a pharmaceutical composition which contains both a compound of formula (I), or a pharmaceutically acceptable derivative thereof, and the additional medicament agent or the essentially simultaneous administration of separate pharmaceutical compositions of a compound of formula (I), or a pharmaceutically acceptable derivative thereof, and the additional medicament agent.",
        "The compositions of the invention are preferably adapted for oral administration. However, they may be adapted for other modes of administration. The compositions may be in the form of tablets, capsules, powders, granules, lozenges, suppositories, reconstitutable powders, or liquid preparations, such as oral or sterile parenteral solutions or suspensions. In order to obtain consistency of administration it is preferred that a composition of the invention is in the form of a unit dose. Preferably the composition are in unit dosage form. A unit dose will generally contain from 0.1 to 1000 mg of the active compound.",
        "Generally an effective administered amount of a compound of the invention will depend on the relative efficacy of the compound chosen, the severity of the disorder being treated and the weight of the sufferer. However, active compounds will typically be administered once or more times a day for example 2, 3 or 4 times daily, with typical total daily doses in the range of from 0.1 to 800 mg/kg/day.",
        "Suitable dose forms for oral administration may be tablets and capsules and may contain conventional excipients such as binding agents, for example syrup, acacia, gelatin, sorbitol, tragacanth, or polyvinylpyrrolidone; fillers, for example lactose, sugar, maize starch, calcium phosphate, sorbitol or glycine; tabletting lubricants, for example magnesium stearate; disintegrants, for example starch, polyvinylpyrrolidone, sodium starch glycollate or microcrystalline cellulose; or pharmaceutically acceptable wetting agents such as sodium lauryl sulphate.",
        "The solid oral compositions may be prepared by conventional methods of blending, filling or tabletting. Repeated blending operations may be used to distribute the active agent throughout those compositions employing large quantities of fillers. Such operations are of course conventional in the art. The tablets may be coated according to methods well known in normal pharmaceutical practice, in particular with an enteric coating.",
        "Oral liquid preparations may be in the form of, for example, emulsions, syrups, or elixirs, or may be presented as a dry product for reconstitution with water or other suitable vehicle before use. Such liquid preparations may contain conventional additives such as suspending agents, for example sorbitol, syrup, methyl cellulose, gelatin, hydroxyethylcellulose, carboxymethylcellulose, aluminium stearate gel, hydrogenated edible fats; emulsifying agents, for example lecithin, sorbitan monooleate, or acacia; non-aqueous vehicles (which may include edible oils), for example almond oil, fractionated coconut oil, oily esters such as esters of glycerine, propylene glycol, or ethyl alcohol; preservatives, for example methyl or propyl p-hydroxybenzoate or sorbic acid; and if desired conventional flavouring or colouring agents.",
        "For parenteral administration, fluid unit dosage forms are prepared utilizing the compound and a sterile vehicle, and, depending on the concentration used, can be either suspended or dissolved in the vehicle. In preparing solutions the compound can be dissolved in water for injection and filter sterilized before filling into a suitable vial or ampoule and scaling. Advantageously, adjuvants such as a local anaesthetic, a preservative and buffering agents can be dissolved in the vehicle. To enhance the stability, the composition can be frozen after filling into the vial and the water removed under vacuum. Parenteral suspensions are prepared in substantially the same manner, except that the compound is suspended in the vehicle instead of being dissolved, and sterilization cannot be accomplished by filtration. The compound can be sterilized by exposure to ethylene oxide before suspending in the sterile vehicle. Advantageously, a surfactant or wetting agent is included in the composition to facilitate uniform distribution of the compound.",
        "The formulations mentioned herein are carried out using standard methods such as those described or referred to in reference texts such as the British and US Pharmacopoeias, Remington's Pharmaceutical Sciences (Mack Publishing Co.), Martindale The Extra Pharmacopoeia (London, The Pharmaceutical Press) or the above-mentioned publications.",
        "Suitable methods for preparing and suitable unit dosages for the additional medicament agent, such as the antidiabetic agent mentioned herein include those methods and dosages described or referred to in the above-mentioned reference texts.",
        "GSK-3 Assay",
        "GSK-3 assays used to test the compounds of the invention include the following protocol which is based on the ability of the kinase to phosphorylate a biotinylated 26 mer peptide, Biot-KYRRAAVPPSPSLSRHSSPHQ(S)EDEEE, the sequence of which is derived from the phosphorylation site of glycogen synthase, where (S) is a pre-phosphorylated serine as in glycogen synthase in vivo and the three consensus sites for GSK-3 specific phosphorylation are underlined. The phosphorylated biotinylated peptide is then captured onto Streptavidin coated SPA beads (Amersham Technology), where the signal from the 33P is amplified via the scintillant contained in the beads.",
        "Using microtitre plates, GSK-3 was assayed in 50 mM MOPS buffer, pH 7.0, containing 5% glycerol, 0.01% Tween-20, 7.5 mM 2-mercaptoethanol, 10 mM magnesium acetate, 8 uM of the above peptide, and 10 uM [33P]-ATP. After incubation at room temperature, the reaction was stopped by addition of 50 mM EDTA solution containing the Streptavidin coated SPA beads to give a final 0.2 mgs. Following centrifugation, the microtitre plates are counted in a Trilux 1450 microbeta liquid scintillation counter (Wallac). IC50 values are generated for each compound by fitting to a four parameter model.",
        "The most potent compounds of the present invention show IC50 values in the range of 1 to 500 nM.",
        "No adverse toxicological effects are expected for the compounds of the invention, when administered in accordance with the invention.",
        "The following Descriptions and Examples illustrate the invention, but do not limit it in any way. Examples 1-151 are pyrazolo[3,4-b]pyridine derivatives and Examples 152-307 are pyrazolo[3,4-c]pyridazine derivatives.",
        "Synthetic Method A",
        "N-(5-Phenyl-1H-pyrazolo[3,4-b]pyridin-3-yl)butyramide",
        "n-Butyryl chloride (40 μl, 0.36 mmol) was added to a solution of 5-phenyl-1H-pyrazolo[3,4-b]pyridin-3-ylamine (Description 2; 100 mg, 0.47 mmol) in pyridine (0.5 ml). The reaction mixture was stirred at reflux for 16 hours, then allowed to cool. The solution was acidified to pH 1 with 5N HCl, and the resulting solids were filtered and dried. Crystallization from DMF/MeOH afforded the title compound as a solid.",
        "MS calculated for (C16H16N4O+H)+: 281. Found: 281.",
        "1H NMR δ (d6 DMSO) 13.3 (s, 1H), 10.7 (s, 1H), 8.8 (1H, s), 8.6 (s, 1H), 7.7 (d, 2H), 7.5 (appt, 2H), 7.4 (d, 1H), 2.4 (t, 2H), 1.6 (td, 2H), 0.9 (t, 3H).",
        "The starting material for Example 1 may be prepared according to Description 1 and Description 2 below.",
        "Description 1",
        "2-Chloro-5-phenylnicotinonitrile",
        "2-Oxo-5-phenyl-1,2-dihydropyridine-3-carbonitrile (2.50 g, 12.7 mmol) was added to a suspension of POCl3 (1.5 ml) and PCl5 (7.35 g) at room temperature. The suspension was then stirred at reflux for 1 hour. The reaction mixture was cooled to room temperature and added cautiously to iced water. The solution was then adjusted to pH 11 with sodium carbonate and the resulting white solid was filtered, washed with water, then dried in vacuo to afford the title compound as a solid.",
        "1H NMR δ (d6 DMSO) 8.8 (d, 1H), 8.2 (d, 1H), 7.6-7.5 (m, 5H).",
        "Description 2",
        "5-Phenyl-1H-pyrazolo[3,4-b]pyridin-3-ylamine",
        "Hydrazine hydrate (1.42 g, 28 mmol) was added to a stirred solution of 2-chloro-5-phenylnicotinonitrile (2.45 g, 11.4 mmol) in pyridine (25 ml). The reaction mixture was stirred at reflux for 6 hours, cooled and the resulting solid was filtered and dried in vacuo, affording the title compound as a solid.",
        "1H NMR δ (d6 DMSO) 12.0 (br, 1H), 8.7 (d, 1H), 8.4 (d, 1H), 7.7 (d, 2H), 7.5 (appt, 2H), 7.4 (d, 1H), 5.6 (s, 2H).",
        "Synthetic Method B",
        "N-(5-Pyridin-3-yl-1H-pyrazolo[3,4-b]pyridin-3-yl)butyramide",
        "Pd(PPh3)4 (30 mg) was added to a degassed solution of N-(5-bromo-1H-pyrazolo[3,4-b]pyridin-3-yl-butyramide (Description 6; 150 mg, 0.5 mmol), 3-pyridyl boronic acid (95 mg, 0.8 mmol), aq. Na2CO3 (0.75 ml, 2M) in ethanol (0.75 ml) and DMF (1.5 ml). The mixture was stirred at reflux for 12 hours, cooled and then water was added. The resulting solids were filtered and purified by column chromatography (5% MeOH/CHCl3) affording the title compound as a powder.",
        "LC/MS 100%, MS calcd for (C15H15N5O+H)+: 282. Found: 282.",
        "1H NMR δ (d6 DMSO) 13.3 (s, 1H), 10.8 (s, 1H), 8.9 (1H, s), 8.8 (s, 1H), 8.6 (s, 1H), 8.6 (d, 1H), 8.1 (d, 1H), 7.5 (dd, 1H), 2.4 (t, 2H), 1.6 (td, 2H), 0.9 (t, 3H).",
        "The starting material for Example 2 may be prepared according to Descriptions 3-6 below.",
        "Description 3",
        "5-Bromo-2-oxo-1,2-dihydro-pyridine-3-carbonitrile",
        "Bromine (29 ml, 560 mmol) was added to a stirred solution of 2-oxo-1,2-dihydro-pyridine-3-carbonitrile (34 g, 280 mmol) in acetic acid (180 ml) at room temperature. After 14 hours the reaction mixture was concentrated in vacuo and the resulting oil was trituated with ethanol to afford the title compound as a solid.",
        "1H NMR δ (d6 DMSO) 12.8 (brs, 1H), 8.4 (d, 1H), 8.1 (d, 1H).",
        "Description 4",
        "5-Bromo-2-chloro-nicotinonitrile",
        "5-Bromo-2-oxo-1,2-dihydro-pyridine-3-carbonitrile (33 g, 166 mmol) was added to a suspension of PCl5 (96.6 g, 464 mmol) in POCl3 (20 ml, 216 mmol). The mixture was stirred at reflux for 3 hours, cooled to room temperature and then poured slowly into ice/water. The resulting solid was fitered, washed with water, and dried in vacuo to afford the title compound.",
        "1H NMR δ (d6 DMSO) 8.7 (d, 1H), 8.1 (d, 1H).",
        "Description 5",
        "5-Bromo-1H-pyrazolo[3,4-b]pyridin-3-ylamine",
        "Hydrazine hydrate (19 ml, 391 mmol) was added to a stirred solution of 5-bromo-2-chloronicotinonitrile (34 g, 156 mmol) in ethanol (300 ml). The reaction mixture was stirred at reflux for 4 hours then the solvent was removed in vacuo. Water was added and the resulting solids were filtered, washed with water, and dried in vacuo to afford the title compound as a solid.",
        "1H NMR δ (d6 DMSO) 12.2 (s, 1H), 8.4 (appd, 2H), 5.7 (s, 2H).",
        "Description 6",
        "N-(5-Bromo-1H-pyrazolo[3,4-b]pyridin-3-yl-butyramide",
        "Butyryl chloride (2.1 ml, 20.7 mmol) was added to a stirred solution of 5-bromo-1H-pyrazolo[3,4-b]pyridin-3-ylamine (4.0 g, 18.8 mmol) in pyridine (50 ml). The solution was heated at reflux for 12 hours then concentrated in vacuo. Addition of water afforded a solid which was filtered and dried to afford the title compound.",
        "LC/MS 100%, MS calcd for (C10H11BrN4O+H)+: 284. Found: 284.",
        "1H NMR δ (d6 DMSO) 13.4 (s, 1H), 10.8 (s, 1H), 8.6 (1H, s), 8.5 (s, 1H), 2.4 (t, 2H), 1.6 (td, 2H), 0.9 (t, 3H).",
        "Synthetic Method C",
        "1-[4-(5-Phenyl-1H-pyrazolo[3,4-b]pyridin-3-ylcarbamoyl)butyl]pyridinium bromide",
        "Oxalyl chloride (0.1 mL, 1.2 mmol) was added to a solution of 5-bromovaleric acid (86 mg, 0.48 mmol) in dichloromethane (10 mL). N,N-Dimethylformamide (1 drop) was added and the mixture was stirred at ambient temperature for 16 hours. The solvent was removed under vacuum, the residue was azeotroped with toluene (3×30 mL) and evaporated to dryness. To this crude acid chloride was added 5-phenyl-1H-pyrazolo[3,4-b]pyridin-3-ylamine (Description 2; 100 mg, 0.48 mmol), pyridine (20 mL). and 4-dimethylaminopyridine (cat). The solution was refluxed at 120° C. for 16 hours then evaporated. The residual material was purified by preparative HPLC on a C18 column, using a gradient elution with 10-90% v/v of acetonitrile (containing 0.01% v/v trifluoroacetic acid) and water (containing 0.1% v/v trifluoroacetic acid) to afford the title compound.",
        "1H NMR δ (CD3OD): 1.84 (2H, m), 2.18 (2H, m), 2.65 (2H, t), 4.73 (2H, t), 7.42 (1H, m) 7.51 (2H, t), 7.68 (2H, d), 8.12 (2H, t), 8.60 (1H, s), 8.60 (1H, t), 8.76 (1H, d), 9.05 (2H, d).",
        "NH protons are assumed to have exchanged with the solvent.",
        "MS (APCI +ve): [M]+ at m/z 372 (C22H22N5O requires [M]+ at m/z 372).",
        "Synthetic Method D",
        "Cyclopropanecarboxylic acid (5-pyridin-3-yl-1H-pyrazolo[3,4-b]pyridin-3-yl)amide Hydrochloride Salt",
        "Tetrakis(triphenylphosphine)palladium(0) (20 mg, 0.02 mmol) was added to a stirred and degassed solution of cyclopropanecarboxylic acid [5-(4,4,5,5,-tetramethyl-[1,3,2]dioxaborolan-2-yl)-1H-pyrazolo[3,4-b]pyridin-3-yl]amide (Description 7; 200 mg, 0.61 mmol), 3-bromopyridine (193 mg, 1.22 mmol) and potassium acetate (179 mg, 1.83 mmol) in DMF (2 mL), EtOH (1 mL) and H2O (1 mL) and the reaction mixture was stirred at 100° C. for 18 h. The reaction mixture was dissolved in EtOAc (100 mL) and washed with saturated aqueous sodium bicarbonate solution (100 mL) and brine (100 mL). The organic extracts were dried (magnesium sulfate) and concentrated. The crude residue was triturated with dichloromethane and a white solid was obtained. This solid was treated with hydrogen chloride (g) in diethyl ether to afford the corresponding salt as a powder.",
        "MS calcd for (C15H13N5O+H)+: 280. Found: 280.",
        "1H NMR δ (D2O) 8.94 (1H, s), 8.69-8.70 (2H, m), 8.62 (1H, s), 8.39 (1H, s), 8.04-8.07 (1H, dd), 1.75 (1H, m), 0.88-0.91 (4H, m). NH signals assumed exchanged with solvent.",
        "The starting material for Example 65 may be prepared according to Description 7, below.",
        "Description 7",
        "Cyclopropanecarboxylic acid [5-(4,4,5,5,-tetramethyl-[1,3,2]dioxaborolan-2-yl)-1H-pyrazolo[3,4-b]pyridin-3-yl]amide",
        "[1,1′-Bis(diphenylphosphino)ferrocene]palladium(II) chloride (PdCl2(dppf)2; 0.46 g, 0.5 mmol) was added to a stirred and degassed solution of cyclopropanecarboxylic acid (5-bromo-1H-pyrazolo[3,4-b]pyridin-3-yl)amide (prepared by analogy with Description 6; 5 g, 17.8 mmol), bis(pinacolato)-diboron (5 g, 19.6 mmol) and potassium acetate (5.2 g, 53.4 mmol) in dry DMSO (50 mL). The solution was heated at 100° C. overnight then reaction mixture was allowed to cool. The reaction mixture was filtered through celite, taken up in EtOAc (200 mL) and washed with brine (3×200 mL). The organic extract was dried (magnesium sulfate) and concentrated to afford a brown solid. This solid was triturated in EtOAc and filtered to afford the title compounds as a powder.",
        "1H NMR δ (DMSO-d6) 13.28 (1H, s), 11.02 (1H, s), 8.79 (1H, d), 8.63-8.64 (1H, d), 1.96-1.99 (1H, m), 1.33 (12H, s), 0.84-0.87 (4H, m).",
        "Synthetic Method E",
        "5-Diethylaminopentanoic acid [5-(2-fluorophenyl)-1H-pyrazolo[3,4-b]1-pyridin-3-yl]amide Trifluoroacetate Salt",
        "Oxalyl chloride (0.39 mL, 4.5 mmol) was added to a solution of 5-diethylamino-valeric acid (380 mg, 1.81 mmol) in dichloromethane (15 mL). N,N-Dimethyl-formamide (1 drop) was added and the mixture was stirred at ambient temperature for 16 hours. The solvent was removed under vacuum, azeotroped with toluene (3×30 mL) and evaporated to dryness. To this acid chloride was added 5-(2-fluorophenyl)-1H-pyrazolo[3,4-b]pyridin-3-ylamine (prepared by analogy with Description 2; 0.05 g, 0.22 mmol) and pyridine (2 mL). The solution was refluxed for 16 hours. The mixture was cooled, piperidine (40 mL) was added and the mixture stirred for a further 24 hours at ambient temperature. The solvents were removed under vacuum, saturated aqueous sodium bicarbonate solution (20 mL) was added and the mixture extracted with ethyl acetate (3×50 mL). The ethyl acetate solution was evaporated and the residue purified by preparative HPLC on a C18 column, using a gradient elution with 10-90% v/v of acetonitrile (containing 0.01% v/v trifluoroacetic acid) and water (containing 0.1% v/v trifluoroacetic acid) to afford the title compound at the trifluoroacetate salt.",
        "MS (APCI +ve): [M+H]+ at m/z 384 (C21H26N5OF requires [M+H]+ at m/z 384).",
        "1H NMR (DMSO-d6): 1.20 (6H, t), 1.70 (4H, m), 2.51 (2H, br s), 3.12 (2H, m), 3.13 (4H, m), 7.36 (1H, t), 7.38 (1H, m), 7.48 (1H, m), 7.59 (1H, dt), 8.57 (1H, t), 8.66 (1H, t), 8.93 (1H, br s), 10.69 (1H, br s), 13.30 (1H, br s).",
        "Further Examples of pyrazolo[3,4-b]pyridines according to the invention are illustrated in Table 1. The further examples described herein were prepared by analogy with Synthetic Methods A and E disclosed above.",
        "TABLE 1\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCalcu-\nLC/MS\n\n\n\n\n\n\nlated\n[M + H]+\n\n\n\n\n\n\nMolec-\nObserved\n\n\n\n\n\n\nular\n(Unless [M]+,\n\n\n\n\n\n\nWeight\n[M]− or [M − H]−\n\n\nEx #\nSynth\nR1\nR2\n(M)\nare indicated)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\nA\nn-Pr\nPh\n280.329\n281\n\n\n2\nB\nn-Pr\nPyridin-3-yl\n281.318\n282\n\n\n3\nA\nCF3\nPh\n306.246\n307\n\n\n4\nA\nCH2CF3\nPh\n320.273\n321\n\n\n5\nA\nMe\nPh\n252.276\n253\n\n\n6\nA\nEt\nPh\n266.303\n267\n\n\n7\nA\nn-Bu\nPh\n294.356\n295\n\n\n8\nA\nn-Pentyl\nPh\n308.383\n309\n\n\n9\nA\nn-Hexyl\nPh\n322.41\n323\n\n\n10\nA\nCH2OMe\nPh\n282.302\n283\n\n\n11\nA\nCH2CH2COOH\nPh\n310.312\n311\n\n\n12\nA\n(E)-CH═CHCH3\nPh\n278.314\n279\n\n\n13\nA\nCH═CMe2\nPh\n292.34\n293\n\n\n14\nA\n(E)-CH═CHPh\nPh\n340.384\n341\n\n\n15\nA\nPh\nPh\n314.347\n315\n\n\n16\nA\n2-Furyl\nPh\n304.308\n305\n\n\n17\nA\nCH2Ph\nPh\n328.373\n329\n\n\n18\nA\nCH2CH2Ph\nPh\n342.4\n343\n\n\n19\nA\nCH2CH2CH2NMe2\nPh\n323.398\n324\n\n\n20\nA\nPyridin-4-yl\nPh\n315.335\n316\n\n\n21\nA\n(CH2)3-(Piperidin-\nPh\n363.462\n364\n\n\n\n\n1-yl)\n\n\n22\nA\n(CH2)3(4-Et-\nPh\n392.504\n393\n\n\n\n\nPiperazin-1-yl)\n\n\n23\nA\n(CH2)3-\nPh\n365.435\n366\n\n\n\n\n(Morpholin-4-yl)\n\n\n24\nA\nN-Me-Piperidin-4-\nPh\n335.409\n336\n\n\n\n\nyl\n\n\n25\nA\ni-Pr\nPh\n280.329\n281\n\n\n26\nA\nCH2-(Pyridin-3-yl)\nPh\n329.362\n330\n\n\n27\nA\n2-Thienyl\nPh\n320.375\n321\n\n\n28\nA\nt-Bu\nPh\n294.356\n295\n\n\n29\nA\nCH2OPh\nPh\n344.372\n345\n\n\n30\nB\nn-Pr\n(2-OCH2Ph)-Ph\n386.453\n387\n\n\n31\nB\nn-Pr\n2-Cl-Ph\n314.775\n315/317\n\n\n32\nB\nn-Pr\n2-F-Ph\n298.319\n299\n\n\n33\nB\nn-Pr\n2-Me-Ph\n294.356\n295\n\n\n34\nB\nn-Pr\n2-OMe-Pyridin-3-yl\n311.343\n312\n\n\n35\nB\nn-Pr\n2-OMe-Ph\n310.355\n311\n\n\n36\nB\nn-Pr\n3,4-[OCH2O]-Ph\n324.338\n325\n\n\n37\nB\nn-Pr\n3,5-di-Cl-Ph\n349.22\n349/351/353\n\n\n38\nB\nn-Pr\n3-NHCOMe-Ph\n337.381\n338\n\n\n39\nB\nn-Pr\n3-CF3-Ph\n348.326\n349\n\n\n40\nB\nn-Pr\n3-Cl-Ph\n314.775\n315/317\n\n\n41\nB\nn-Pr\n3-F-Ph\n298.319\n299\n\n\n42\nB\nn-Pr\nFuran-3-yl\n270.291\n271\n\n\n43\nB\nn-Pr\n3-OMe-Ph\n310.355\n311\n\n\n44\nB\nn-Pr\n3-NO2-Ph\n325.327\n326\n\n\n45\nB\nn-Pr\n3-Thienyl\n286.358\n287\n\n\n46\nB\nn-Pr\n4-CF3-Ph\n348.326\n349\n\n\n47\nB\nn-Pr\n4-Cl-Ph\n314.775\n315/317\n\n\n48\nB\nn-Pr\n4-F-Ph\n298.319\n299\n\n\n49\nB\nn-Pr\n4-OMe-Ph\n310.355\n311\n\n\n50\nB\nn-Pr\n4-Me-Ph\n294.356\n295\n\n\n51\nB\nn-Pr\n4-OCF3-Ph\n364.325\n365\n\n\n52\nB\nn-Pr\nIndol-5-yl\n319.366\n320\n\n\n53\nB\nn-Pr\n4-OMe-Pyridin-3-yl\n311.343\n312\n\n\n54\nA\nn-Pr\n2,3-di-F-Ph\n316.31\n317\n\n\n55\nA\n(CH2)3-\n2,3-di-F-Ph\n401.415\n402\n\n\n\n\n(Morpholin-4-yl)\n\n\n56\nC\n(CH2)4-(1-\nPh\n372.45\n372 [M]+\n\n\n\n\nPyridinium)\n\n\n\n\nbromide\n\n\n57\nA\nEt\n2,3-di-F-Ph\n302.283\n303\n\n\n58\nA\ni-Pr\n2,3-di-F-Ph\n316.31\n317\n\n\n59\nB\nn-Pr\n2-(CHO)-Ph\n308.339\n309\n\n\n60\nB\nn-Pr\nPyridin-4-yl\n281.318\n282\n\n\n61\nB\nn-Pr\nFuran-2-yl\n270.291\n271\n\n\n62\nB\nn-Pr\nBiphenyl-4-yl\n356.427\n357\n\n\n63\nB\nn-Pr\nNaphthalen-1-yl\n330.389\n331\n\n\n64\nB\nn-Pr\n3-(CHO)-Ph\n308.339\n309\n\n\n65\nD\ncyclo-Pr\nPyridin-3-yl\n279.302\n280\n\n\n66\nD\nn-Pr\n2,3,4-tri-F-Ph\n334.300\n335\n\n\n67\nD\nn-Pr\n2,4,5-tri-F-Ph\n334.300\n335\n\n\n68\nD\nn-Pr\n3,4,5-tri-F-Ph\n334.300\n335\n\n\n69\nD\nn-Pr\n2,3,5-tri-F-Ph\n334.300\n335\n\n\n70\nD\nn-Pr\n2,4,6-tri-F-Ph\n334.300\n335\n\n\n71\nD\nn-Pr\n2,6-di-Cl-Ph\n349.220\n347/349/351\n\n\n\n\n\n\n\n[M − H]−\n\n\n72\nD\nn-Pr\nPyrimidin-2-yl\n282.306\n281 [M − H]−\n\n\n73\nD\nn-Pr\nPyrimidin-5-yl\n282.306\n281 [M − H]−\n\n\n74\nD\nn-Pr\nQuinolin-3-yl\n331.377\n332\n\n\n75\nA\ncyclo-Pr\n2,3-di-F-Ph\n314.294\n315\n\n\n76\nA\ncyclo-Bu\n2,3-di-F-Ph\n328.321\n329\n\n\n77\nA\n(CH2)3-(meso-3,5-\n2,3-di-F-Ph\n429.469\n430\n\n\n\n\ndi-Me-Morpholin-4-\n\n\n\n\nyl)\n\n\n78\nD\nn-Pr\n2,5-di-F-Ph\n316.31\n317\n\n\n79\nD\nn-Pr\n3,5-di-F-Ph\n316.31\n317\n\n\n80\nA\ncyclo-Pentyl\nPh\n306.367\n307\n\n\n81\nA\ncyclo-Pr\nPh\n278.314\n279\n\n\n82\nA\ncyclo-Bu\nPh\n292.34\n293\n\n\n83\nA\nCHEt2\nPh\n308.383\n309\n\n\n84\nA\ncyclo-Hexyl\nPh\n320.394\n321\n\n\n85\nD\nn-Pr\n3,4-di-F-Ph\n316.310\n317\n\n\n86\nD\nn-Pr\n2,6-di-F-Ph\n316.310\n317\n\n\n87\nD\nn-Pr\n2,3,6-tri-F-Ph\n334.300\n335\n\n\n88\nA\n2-Butyl\nPh\n294.356\n295\n\n\n89\nD\nn-Pr\nPyrazin-2-yl\n282.306\n282 [M]−\n\n\n90\nD\nn-Pr\n2,4-di-Cl-Ph\n349.22\n347/349/351\n\n\n\n\n\n\n\n[M − H]−\n\n\n91\nD\nn-Pr\n2-Cl-4-F-Ph\n332.765\n331/333 [M − H]−\n\n\n92\nD\nn-Pr\n3-CN-Ph\n305.34\n306\n\n\n93\nD\nn-Pr\n3-CO2H-Ph\n324.338\n325\n\n\n94\nD\nn-Pr\n3-CO2Me-Ph\n338.365\n339\n\n\n95\nD\nn-Pr\n3-Cl-4-F-Ph\n332.765\n333/335\n\n\n96\nD\nn-Pr\n3-F-4-Cl-Ph\n332.765\n333/335\n\n\n97\nD\nn-Pr\n2,5-di-Cl-Ph\n349.220\n349/351/353\n\n\n98\nD\nn-Pr\nNaphthalen-1-yl\n330.389\n331\n\n\n99\nA\nC(Me2)Ph\nPh\n356.427\n357\n\n\n100\nD\nn-Pr\n3-OH-Ph\n296.328\n297\n\n\n101\nD\nn-Pr\n4-OH-Ph\n296.328\n297\n\n\n102\nD\nn-Pr\nPyridin-2-yl\n281.318\n282\n\n\n103\nD\nn-Pr\n2-F-4-Cl-Ph\n332.765\n333/335\n\n\n104\nD\nn-Pr\n4-(OCH2CH2NMe2)-Ph\n367.451\n368\n\n\n105\nD\nn-Pr\n2-(OCH2CH2NMe2)-Ph\n367.451\n368\n\n\n106\nD\nn-Pr\n2-[O(CH2)3NMe2]-Ph\n381.477\n382\n\n\n107\nD\nn-Pr\n4-[O(CH2)3NMe2]-Ph\n381.477\n382\n\n\n108\nD\nn-Pr\n3-(OCH2CH2NMe2)-Ph\n367.451\n368\n\n\n109\nD\nn-Pr\n3-[O(CH2)3NMe2]-Ph\n381.477\n382\n\n\n110\nD\nn-Pr\n2-[OCH2CH2-(Morpholin-4-yl)]-Ph\n409.487\n410\n\n\n111\nD\nn-Pr\n4-[OCH2CH2-(Morpholin-4-yl)]-Ph\n409.487\n410\n\n\n112\nA\n4-NMe2-Ph\n2-F-Ph\n375.405\n376\n\n\n113\nD\nn-Pr\n2-[OCH2CH2CH2-(Morpholin-4-yl)]-Ph\n423.514\n424\n\n\n114\nD\nn-Pr\n4-[OCH2CH2CH2-(Morpholin-4-yl)]-Ph\n423.514\n424\n\n\n115\nD\nn-Pr\n3-[OCH2CH2-(Morpholin-4-yl)]-Ph\n409.487\n410\n\n\n116\nD\nn-Pr\n3-[OCH2CH2CH2-(Morpholin-4-yl)]-Ph\n423.514\n424\n\n\n117\nA\n3,4-[OCH2O]-Ph\n2-F-Ph\n376.346\n377\n\n\n118\nA\n2,4,6-tri-Me-Ph\n2-F-Ph\n374.417\n375\n\n\n119\nD\nn-Pr\n2-[CH2-(Morpholin-4-yl)]-Ph\n379.461\n380\n\n\n120\nD\nn-Pr\n3-[CH2-(Morpholin-4-yl)]-Ph\n379.461\n380\n\n\n121\nD\nn-Pr\n4-[CH2-(Morpholin-4-yl)]-Ph\n379.461\n380\n\n\n122\nD\nn-Pr\n2-[CH2CH2-(Morpholin-4-yl)]-Ph\n393.488\n394\n\n\n123\nD\nn-Pr\n3-[CH2CH2-(Morpholin-4-yl)]-Ph\n393.488\n394\n\n\n124\nD\nn-Pr\n4-[CH2CH2-(Morpholin-4-yl)]-Ph\n393.488\n394\n\n\n125\nD\nn-Pr\n3-NMe2-Ph\n323.398\n324\n\n\n126\nD\nn-Pr\nBenzo[b]thiophen-3-yl\n336.417\n337\n\n\n127\nD\nMe\nPyrazin-2-yl\n254.252\n255\n\n\n128\nE\n(CH2)4NEt2\n2-F-Ph\n383.468\n384\n\n\n129\nD\ncyclo-Pr\n2,5-di-Me-Pyridin-3-yl\n307.355\n308\n\n\n130\nD\ncyclo-Pr\n4-Me-Pyridin-3-yl\n293.328\n294\n\n\n131\nD\ncyclo-Pr\n2-Cl-5-Me-Pyridin-3-yl\n327.774\n328/330\n\n\n132\nD\ncyclo-Pr\n2-Cl-4,5-di-Me-Pyridin-3-yl\n341.8\n342/344\n\n\n133\nD\ncyclo-Pr\n6-NH2-Pyridin-3-yl\n294.317\n295\n\n\n134\nD\ncyclo-Pr\n2-Me-6-NH2-Pyridin-3-yl\n308.343\n309\n\n\n135\nD\ncyclo-Pr\n6-(NHCONH2)-Pyridin-3-yl\n337.341\n295\n\n\n\n\n\n\n\nFragment ion\n\n\n\n\n\n\n\n[(C15H14N67O) +\n\n\n\n\n\n\n\nH]+\n\n\n136\nD\ncyclo-Pr\n2-NH2-5-Me-Pyridin-3-yl\n308.343\n309\n\n\n137\nD\ncyclo-Pr\n2-Cl-Pyridin-3-yl\n313.747\n314/316\n\n\n138\nD\ncyclo-Pr\n5-(Piperidin-1-yl)-Pyridin-3-yl\n362.435\n363\n\n\n139\nD\ncyclo-Pr\n2-(CH2CN)-Pyridin-3-yl\n318.339\n319\n\n\n140\nD\ncyclo-Pr\n5-Me-6-[NH(CH2)3NHCHO]-\n393.449\n394\n\n\n\n\n\nPyridin-3-yl\n\n\n141\nD\ncyclo-Pr\n5-Me-6-NH2-Pyridin-3-yl\n308.343\n309\n\n\n142\nD\ncyclo-Pr\n6-Cl-Pyridin-3-yl\n313.747\n314/316\n\n\n143\nD\ncyclo-Pr\n5-(COCH2CO2Me)-Pyridin-3-yl\n379.374\n322 Fragment ion\n\n\n\n\n\n\n\n[(C17H15N5O2) +\n\n\n\n\n\n\n\nH]+\n\n\n144\nD\ncyclo-Pr\n2-(NHCOt-Bu)-Pyridin-3-yl\n378.434\n379\n\n\n145\nD\ni-Pr\n5-Me-6-[NH(CH2)3OH]-Pyridin-3-yl\n368.439\n369\n\n\n146\nD\ni-Pr\n5-OMe-Pyridin-3-yl\n331.343\n312\n\n\n147\nD\ni-Pr\n5-(CO2Et)-Pyridin-3-yl\n353.38\n354\n\n\n148\nD\ni-Pr\n5-(CONH2)-Pyridin-3-yl\n324.342\n325\n\n\n149\nD\ni-Pr\n6-(Pyrrol-1-yl)-Pyridin-3-yl\n346.392\n347\n\n\n150\nD\ni-Pr\nPyridin-3-yl\n281.318\n282\n\n\n151\nD\ni-Pr\n5-Ph-Pyridin-3-yl\n357.415\n358\n\n\n\n\n\n\n\n\n\nSynthetic Method F",
        "N-(5-Phenyl-1H-pyrazolo[3,4-c]pyridazin-3-yl)butyramide",
        "n-Butyryl chloride (120 μl, 0.73 mmol) was added to a solution of 5-phenyl-1H-pyrazolo[3,4-c]pyridazin-3-ylamine (Description 8; 100 mg, 0.47 mmol) in pyridine (0.5 mL). The reaction mixture was stirred at reflux for 16 hours, then allowed to cool. The solution was acidified to pH 1 with 5N HCl, and the resulting solids were filtered and dried. Purification by column chromatography (5% MeOH/CHCl3) afforded the title compound as a solid.",
        "MS (APCI +ve): [M+H]+ at m/z 282 (C15H15N5O requires [M+H]+ 282).",
        "1H NMR δ (DMSO-d6) 14.0 (1H, s), 11.0 (1H, s), 8.7 (1H, s), 8.0 (2H, d), 7.6-7.4 (3H, m), 2.4 (2H, t), 1.7 (appq, 2H) and 1.0 (3H, t).",
        "The starting material for Example 153 may be prepared according to Description 8 below.",
        "Description 8",
        "5-Phenyl-1H-pyrazolo[3,4-c]pyridazin-3-ylamine",
        "Hydrazine hydrate (0.7 ml, 14.3 mmol) was added to a stirred solution of 3-chloro-6-phenyl-pyridazine-4-carbonitrile (cf J. Med. Chem., 1999, 42, 730; 1.024 g, 4.7 mmol) in pyridine (10 ml). The reaction mixture was stirred at reflux for 6 hours, cooled and the resulting solid was filtered and dried in vacuo, affording the title compound as a solid.",
        "MS (APCI +ve): [M+H]+ at m/z 212 (C11H9N5 requires [M+H]+ at m/z 212).",
        "1H NMR δ (DMSO-d6) 12.7 (1H, s), 8.5 (1H, s), 8.1 (2H, d), 7.6-7.4 (3H, m) and 6.0 (2H, s).",
        "Synthetic Method G",
        "4-Dimethylamino-N-(5-Phenyl-1H-pyrazolo[3,4-c]pyridazin-3-yl)butyramide Hydrochloride Salt",
        "4-Dimethylaminobutyryl chloride.HCl (6.0 g, 32.3 mmol) was added to a solution of 5-phenyl-1H-pyrazolo[3,4-c]pyridazin-3-ylamine (Description 8; 4.0 g, 18.9 mmol) in pyridine (200 ml). The reaction mixture was stirred at reflux for 16 hours, then allowed to cool and then concentrated in vacuo. Purification by column chromatography (5% 2M MeOH—NH3/CHCl3) afforded an off white solid. Suspension of the solid in CH2Cl2 (50 ml) and treatment with 1M ethereal HCl (200 ml) afforded the title compound as a solid.",
        "MS calcd for (C17H20N6O+H)+: 325. Found: 325.",
        "1H NMR δ (d6 DMSO) 14.0 (1H, s), 11.2 (1H, s), 10.7 (1H, s), 8.7 (1H, s), 8.1 (2H, d), 7.6-7.4 (3H, m), 3.2 (2H, m), 2.6 (2H, t), 2.5 (6H, s), 2.1-2.0 (2H, m).",
        "Synthetic Method H",
        "N-[5-(2,3-Difluorophenyl)-1H-pyrazolo[3,4-c]pyridazin-3-yl]-2,4,6-trimethylbenzamide",
        "2,4,6-Trimethylbenzoyl chloride (0.594 g, 3.24 mmol) was added to a solution of 5-(2,3-Difluorophenyl)-1H-pyrazolo[3,4-c]pyridazin-3-ylamine (Description 14; 0.400 g, 1.62 mmol) in pyridine (2 mL). The solution was heated at reflux for 72 hours, and the solvent then evaporated in vacuo. Piperidine (50 mL) was added and the solution stirred at room temperature for 16 hours. The mixture was evaporated and the residue azeotroped with ethanol. The crude product was purified firstly by chromatography on silica gel using a gradient elution with 5-20% v/v methanol in dichloromethane, and subsequently by further chromatography on silica gel using diethyl ether as eluent to afford the title compound, a solid.",
        "MS (APCI +ve): [M+H]+ at m/z 394 (C21H17ON5F2 requires [M+H]+ 394).",
        "1H NMR (DMSO-d6) δ2.28 (3H, s), 2.30 (6H, s), 6.95 (2H, s), 7.42 (1H, q), 7.58 (1H,m), 7.85 (1H, t), 8.72 (1H, s), 11.43 (1H, s), 14.33 (1H, s).",
        "The starting material for Example 174 may be prepared according to Descriptions 9-14 below.",
        "Description 9",
        "Diethyl 2-[2-(2,3-difluorophenyl)-2-oxoethyl]-2-hydroxymalonate",
        "2′,3′-Difluoroacetophenone (10.23 g, 65.6 mmol) and diethyl ketomalonate (15 mL, 98.4 mmol) were stirred at 140° C. for 48 hours. The crude mixture was diluted with toluene and purified by chromatography on silica gel, eluting with 20% v/v ethyl acetate in hexane to afford the title compound as an oil.",
        "1H NMR (CDCl3) δ1.30 (6H, t), 3.84 (2H, d), 4.18 (1H, s), 4.31 (4H, q), 7.18 (1H, m), 7.39 (1H, q) and 7.62 (1H, t).",
        "Description 10",
        "Ethyl 6-(2,3-difluorophenyl)-3-hydroxypyridazine-4-carboxylate",
        "Diethyl 2-[2-(2,3-difluorophenyl)-2-oxoethyl]-2-hydroxymalonate (18.50 g, 56.1 mmol) and hydrazine monohydrochloride (4.03 g, 58.8 mmol) were stirred at reflux in ethanol (300 mL) for 96 h, and then evaporated to dryness to afford the title compound as a solid.",
        "MS (APCI +ve): [M+H]+ at m/z 281 (C13H10F2N2O3 requires [M+H]+281).",
        "1H NMR (CDCl3) δ1.14 (3H, t), 4.45 (2H, q), 7.25 (2H, m), 7.51 (1H, t), 8.28 (1H, s) and 11.87 (1H, s).",
        "Description 11",
        "6-(2,3-Difluorophenyl)-3-hydroxypyridazine-4-carboxylic acid",
        "Ethyl 6-(2,3-difluorophenyl)-3-hydroxypyridazine-4-carboxylate (8.00 g, 28.6 mmol) was stirred in ethanol (275 mL) and treated with a solution of sodium hydroxide (4.6 g, 115 mmol) in water (175 mL). The mixture was stirred at reflux for 2 hours, cooled, concentrated in vacuo, diluted with water to ca. 350 mL total volume and filtered. Acidification with 2M hydrochloric acid gave a precipitate which was filtered off, washed with water, and thoroughly dried in vacuo at 60° C. to afford the title compound as a solid.",
        "MS (APCI −ve): [M−H]− at m/z 251 (C11H6F2N2O3 requires [M−H]− 251).",
        "1H NMR (DMSO-d6) δ7.37 (1H, m), 7.57 (2H, m), 8.28 (1H, d) and 14.3 (2H, broad).",
        "Description 12",
        "3-Chloro-6-(2,3-difluorophenyl)pyridazine-4-carboxamide",
        "6-(2,3-Difluorophenyl)-3-hydroxypyridazine-4-carboxylic acid (3.00 g, 11.9 mmol) was treated with phosphoryl chloride (15 mL) and 3 drops of dry DMF. The mixture was stirred at 80° C. for 4 hours, cooled, and evaporated to dryness. The residue was dissolved in dry THF (50 mL) and added, with vigorous stirring, to 880 ammonia (200 mL). After 1 hour, the mixture was diluted with water (200 mL) and extracted with ethyl acetate. The extract was washed with brine, dried (MgSO4) and evaporated to give the title compound as a solid.",
        "MS (APCI +ve): [M+H]+ at m/z 270/272 (C11H6ClF2N3O requires [M+H]+ 270/272).",
        "1H NMR (DMSO-d6) δ7.44 (1H, q), 7.68 (1H, q), 7.75 (1H, t), 8.15 (1H, s), 8.21 (1H, s) and 8.30 (1H, s).",
        "Description 13",
        "3-Chloro-6-(2,3-difluorophenyl)pyridazine-4-carbonitrile",
        "3-Chloro-6-(2,3-difluorophenyl)pyridazine-4-carboxamide (3.03 g, 11.2 mmol) was stirred in phosphoryl chloride (30 mL) at reflux for 3 hours, cooled, and evaporated to dryness. The residue was dissolved in dichloromethane, washed with saturated sodium hydrogen carbonate solution, dried (MgSO4) and evaporated to give the title compound as a solid.",
        "MS (APCI +ve): [M+H]+ at m/z 252/254 (C11H4ClF2N3 requires [M+H]+ 252/254).",
        "1H NMR (CDCl3) δ7.33 (1H, m), 7.41 (1H, m), 7.97 (1H, t) and 8.23 (1H, s).",
        "Description 14",
        "5-(2,3-Difluorophenyl)-1H-pyrazolo[3,4-c]pyridazin-3-ylamine",
        "3-Chloro-6-(2,3-difluorophenyl)pyridazine-4-carbonitrile (2.82 g, 11.2 mmol) and hydrazine hydrate (1.25 mL, 25.8 mmol) were stirred at reflux in ethanol (50 mL) for 1 hour. The mixture was cooled and evaporated to dryness. The residue was triturated with water, and the solid was filtered off and dried, giving the title compound as a solid.",
        "MS (APCI +ve): [M+H]+ at m/z 248 (C11H7F2N5 requires [M+H]+ 248).",
        "1H NMR (DMSO-d6) δ6.10 (2H, s), 7.39 (1H, q), 7.54 (1H, q), 7.82 (1H, t), 8.46 (1H, s) and 12.88 (1H, s).",
        "Synthetic Method I",
        "4-Diethylaminomethyl-N-[5-(2,3-difluorophenyl)-1H-pyrazolo[3,4-c]pyridazin-3-yl]benzamide",
        "4-Diethylaminomethylbenzoyl chloride (0.503 g, 2.43 mmol) was added to a solution of 3-amino-5-(2,3-difluorophenyl)-1H-pyrazolo[3,4-c]pyridine (Description 14; 0.200 g, 0.81 mmol) in pyridine (5 mL). The mixture was heated at reflux for 16 hours then the solvent was removed under reduced pressure. The residue was azeotroped, firstly with water and then with ethanol. The resulting solid was dissolved in dimethylformamide and purified initially by preparative HPLC on a C18 column, using a gradient elution with 10-90% v/v of acetonitrile (containing 0.01% trifluoroacetic acid) and water (containing 0.1% trifluoroacetic acid). Subsequent purification by silica gel chromatography using initially 5% v/v methanol in dichloromethane as eluent, followed by 5% v/v 1N methanolic ammonia in dichloromethane as eluent afforded the title compound, a solid.",
        "MS (APCI +ve): [M+H]+ at m/z 437 (C23H22ON6F2 requires [M+H]+ 437).",
        "1H NMR (DMSO-d6)δ1.01 (6H, br s), 2.50 (4H, m), 3.65 (2H, br s), 7.41 (1H, dd), 7.51 (2H, d), 7.59 (1H, m), 7.82 (1H, t), 8.06 (2H, d), 8.67 (1H, s), 11.47 (1H, s) and 14.37 (1H, s).",
        "Synthetic Method J",
        "N-[5-(2,3-Difluorophenyl)-1H-pyrazolo[3,4-c]pyridazin-3-yl]-4-(1,1-dioxo-1-thiomorpholin-4-yl)butyramide",
        "The hydrochloride salt of 4-(1,1-dioxo-1-thiomorpholin-4-yl)butyryl chloride (1.338 g, 4.848 mmol) was added to a solution of 3-amino-5-(2,3-difluorophenyl)-1H-pyrazolo[3,4-c]pyridine (0.2 g, 0.808 mmol) in dry pyridine (10 mL) with 4-dimethylaminopyridine (0.05 g) and the mixture heated at reflux under argon for 48 hours. After allowing to cool most of the solvent was evaporated in vacuo and the residue azeotroped with ethanol (4×10 mL). The mixture was dissolved in methanol and passed through an SCX column, washing with further methanol to remove some colouration. Basic material containing the product was then eluted from the column with 0.5N ammonia in methanol solution and evaporated to dryness in vacuo. Further purification by column chromatography on silica gel using a gradient elution of 2-8% v/v methanol in dichloromethane, followed by preparative HPLC on a C18 column, using a gradient elution with 10-90% v/v of acetonitrile (containing 0.01% trifluoroacetic) and water (containing 0.1% trifluoracetic acid) gave the product as the trifluoracetate salt. A solution of this salt in methanol was passed through an SCX column and further washed with methanol (20 mL) and then eluted with 0.5N ammonia in methanol. After evaporation of volatile material in vacuo the product was obtained as a solid.",
        "MS (APCI +ve): [M+H]+ at m/z 451 (C19H20N6O3S requires [M+H]+ at m/z 451)",
        "1H NMR (DMSO-d6): δ1.80 (2H, m), 2.40-2.60(4H, m partly obscured by DMSO solvent signal), 2.88 (4H, m), 3.03 (4H, m), 7.35-7.50 (1H, m), 7.50-7.65 (1H, m), 7.81 (1H, t), 8.71 (1H, d), 11.10 (1H, s) and 14.21 (1H, s).",
        "Synthetic Method K",
        "Piperidine-4-carboxylic acid [5-(2,3-difluorophenyl)-1H-pyrazolo[3,4-c]pyridazin-3-yl]-amide",
        "A mixture of 1-benzyl-piperidine-4-carboxylic acid [5-(2,3-difluorophenyl)-1H-pyrazolo[3,4-c]pyridazin-3-yl]-amide (Example 209; 340 mg, 0.76 mmol), ammonium formate (191 mg, 3.03 mmol) and 10% Pd/C (50 mg) in ethanol (10 mL) was stirred at reflux for 72 h. The reaction mixture was cooled, filtered through celite and concentrated. The residue was purified by chromatography on silica gel using initially 10% v/v methanol in dichloromethane and rising to 10% v/v 2N methanolic ammonia in dichloromethane to afford the title compound, a powder.",
        "MS (APCI +ve): [M+H]+ at M/z 359 (C17H16F2N6O requires [M+H]+ 359.",
        "1H NMR (DMSO-d6) δ11.11 (1H, s), 8.69 (1H, s), 7.79-7.82 (1H, dd), 7.54-7.60 (1H, dd), 7.38-7.44 (1H, dd); 3.15-3.18 (2H, t), 2.70-2.75 (2H, t), 2.46-2.50 (1H, m), 1.82-1.87 (2H, m); 1.67-1.72 (2H, m). Remaining NH signals presumed exchanged with solvent",
        "Synthetic Method L",
        "N-(5-Phenyl-1H-pyrazolo[3,4-c]pyridazin-3-yl)-3-(6-methylpyridin-3-yl)propionamide hydrochloride salt",
        "3-Amino-5-phenyl-1H-pyrazolo[3,4-c]pyridazine (Description 8; 0.15 g, 0.709 mmol was added to the hydrochloride salt of 3-(6-methylpyridin-3-yl)propionyl chloride (0.624 g, 2.84 mmol) in dry pyridine (10 mL) and the mixture heated at reflux overnight. After evaporation to dryness under reduced pressure and further drying under high vacuum the residue was chromatographed on silica gel initially with a gradient elution of 0-10% v/v methanol in dichloromethane, then with a gradient of 5-10% v/v 1N ammonia-methanol in dichloromethane. Fractions containing product were further purified by preparative HPLC on a C18 column, using a gradient elution with 10-90% v/v acetonitrile (containing 0.01% v/v trifluoroacetic acid) and water (containing 0.1% v/v trifluoracetic acid) to give product as the trifluoroacetate salt. A solution of this salt in methanol was passed through an SCX column and washed with methanol (20 mL). The free base of the title compound was obtained after elution with 66% v/v 2N methanolic ammonia in methanol and evaporation to dryness. A solution of the free base in dichloromethane (10 mL) was then treated with a slight excess of 1N hydrochloric acid in diethyl ether to give the product as a solid after evaporation of solvents.",
        "MS (APCI +ve): [M+H]+ at m/z 359 (C20H18N6O requires [M+H]+ at m/z 359)",
        "1H NMR (DMSO-d6): δ2.69 (3H, s), 2.91 (2H, t), 3.16 (2H, t), 7.45-7.65 (3H, m). 7.86 (1H, d), 8.07 (2H, d), 8.43 (1H, dd), 8.63 (1H, s), 8.75 (1H, d), 11.16 (1H, s) and 14.10 (1H, br s).",
        "Chemical shifts consistent with pyridinium salt, but HCl salt proton not seen—presumed exchanged with solvent.",
        "Further Examples of pyrazolo[3,4-c]pyridazines according to the invention are illustrated in Table 2. The further examples described herein were prepared by analogy with Synthetic Methods F-L disclosed above.",
        "TABLE 2\n\n\n\n\n\n\n\n\n(I)\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLC/MS\n\n\n\n\n\n\n\n[M + H]+ Observed\n\n\n\n\n\n\nCalculated\n(Unless [M]− or\n\n\nExample\nSynthetic\n\n\nMolecular\n[M − H]− are\n\n\nNo.\nMethod\nR1\nR2\nWeight (M)\nindicated)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n152\nF\nMe\nPh\n253.264\n254\n\n\n153\nF\nn-Pr\nPh\n281.318\n282\n\n\n154\nG\n(CH2)3NMe2\nPh\n324.386\n325\n\n\n155\nG\n(CH2)3(Morpholin-4-yl)\nPh\n366.423\n367\n\n\n156\nF\ni-Pr\nPh\n281.318\n282\n\n\n157\nF\ni-Pr\n2,3-di-F-Ph\n317.298\n318\n\n\n158\nF\nMe\n2,3-di-F-Ph\n289.244\n290\n\n\n159\nF\nMe\n2-Cl-Ph\n287.709\n288/290\n\n\n160\nF\ni-Pr\n2-Cl-Ph\n315.763\n316/318\n\n\n161\nG\n(CH2)3(Morpholin-4-yl)\n2,3-di-F-Ph\n402.403\n403\n\n\n162\nG\nMe\nPyridin-3-yl\n254.252\n255\n\n\n163\nF\ncyclo-Pentyl\n2-Cl-Ph\n341.8\n342/344\n\n\n164\nG\n(CH2)3NMe2\n2-Cl-Ph\n358.831\n359/361\n\n\n165\nG\n(CH2)3NMe2\nPyridin-3-yl\n325.374\n326\n\n\n166\nG\n(CH2)3NMe2\n2,3-di-F-Ph\n360.366\n361\n\n\n167\nF\ncyclo-Pentyl\nPh\n307.355\n308\n\n\n168\nG\n(CH2)3(Piperidin-1-yl)\n2-Cl-Ph\n398.896\n399/401\n\n\n169\nF\ncyclo-Pr\nPh\n279.302\n280\n\n\n170\nG\n(CH2)3NEt2\n2-Cl-Ph\n386.885\n387/389\n\n\n171\nF\ncyclo-Pr\n2-Cl-Ph\n313.747\n314/316\n\n\n172\nF\ncyclo-Pr\n2,3-di-F-Ph\n315.282\n316\n\n\n173\nF\ncyclo-Pr\nPyridin-3-yl\n280.29\n281\n\n\n174\nH\n2,4,6-tri-Me-Ph\n2,3-di-F-Ph\n393.395\n394\n\n\n175\nG\ni-Pr\nPyridin-2-yl\n282.306\n283\n\n\n176\nG\n(CH2)3(Pyrrolidin-1-yl)\n2,3-di-F-Ph\n386.404\n387\n\n\n177\nG\ncyclo-Pr\nPyridin-2-yl\n280.29\n281\n\n\n178\nG\ni-Pr\nPyridin-3-yl\n282.306\n283\n\n\n179\nG\nN-Me-Piperidin-4-yl\nPh\n336.397\n337\n\n\n180\nG\nN-Me-Piperidin-4-yl\n2,3-di-F-Ph\n372.377\n373\n\n\n181\nG\nPh\n2,3-di-F-Ph\n351.315\n352\n\n\n182\nG\n(CH2)3(Piperidin-1-yl)\n2,3-di-F-Ph\n400.431\n401\n\n\n183\nG\n(CH2)3(4-Et-Piperazin-1-\n2,3-di-F-Ph\n429.473\n430\n\n\n\n\nyl)\n\n\n184\nG\n(CH2)3(Pyrrolidin-1-yl)\nPh\n350.424\n351\n\n\n185\nG\n(CH2)3(Piperidin-1-yl)\nPh\n364.451\n365\n\n\n186\nI\n4-(CH2NEt2)-Ph\n2,3-di-F-Ph\n436.464\n437\n\n\n187\nI\n4-NMe2-Ph\n2-Cl-Ph\n392.848\n393/395\n\n\n188\nG\n(CH2)3(4-Et-Piperazin-1-\nPh\n393.492\n394\n\n\n\n\nyl)\n\n\n189\nG\ncyclo-Pentyl\n2,3-di-F-Ph\n343.336\n344\n\n\n190\nG\n(CH2)3NEt2\n2,3-di-F-Ph\n388.42\n389\n\n\n191\nJ\n(CH2)3(1,1-dioxo-1-\n2,3-di-F-Ph\n450.468\n449 [M − H]−\n\n\n\n\nthiomorpholin-4-yl)\n\n\n192\nI\n4-NMe2-Ph\n2,3-di-F-Ph\n394.383\n395\n\n\n193\nI\n4-NMe2-Ph\nPh\n358.403\n359\n\n\n194\nG\n(CH2)4NEt2\n2,3-di-F-Ph\n402.447\n403\n\n\n195\nG\n(CH2)4NEt2\nPh\n366.466\n367\n\n\n196\nG\n[1-(CH2CH2OMe)-\nPh\n380.45\n381\n\n\n\n\nPiperidin-4-yl]\n\n\n197\nG\n[1-(CH2CH2OMe)-\n2,3-di-F-Ph\n416.43\n417\n\n\n\n\nPiperidin-4-yl]\n\n\n198\nI\n2,3-Dihydrobenzofuran-5-yl\n2,3-di-F-Ph\n393.352\n394\n\n\n199\nF\nCH2OMe\n2,3-di-F-Ph\n319.27\n320\n\n\n200\nF\nCH2OMe\nPh\n283.29\n284\n\n\n201\nG\n(CH2)3NEt2\nPh\n352.44\n353\n\n\n202\nI\n[4-[CH2(Pyrrolidin-1-yl)]-\n2,3-di-F-Ph\n434.448\n435\n\n\n\n\nPh]\n\n\n203\nG\n(N-Et-Piperidin-4-yl)\nPh\n350.424\n351\n\n\n204\nG\n(N-Et-Piperidin-4-yl)\n2,3-di-F-Ph\n386.404\n387\n\n\n205\nF\nCH2CH2OMe\n2,3-di-F-Ph\n333.297\n334\n\n\n206\nG\niPr\n3-Me-Ph\n295.344\n296\n\n\n207\nF\ncyclo-Pr\n3-Me-Ph\n293.328\n294\n\n\n208\nF\nCH2O(CH2)2OMe\n2,3-di-F-Ph\n363.323\n364\n\n\n209\nG\n(1-CH2Ph-Piperidin-4-yl)\n2,3-di-F-Ph\n448.475\n449\n\n\n210\nF\nCH2OPh\nPh\n345.361\n346\n\n\n211\nF\nCH2O(CH2)2OMe\nPh\n327.342\n328\n\n\n212\nG\n(CH2)4(Piperidin-1-yl)\nPh\n378.477\n379\n\n\n213\nF\nCH2CH2OMe\nPh\n297.316\n298\n\n\n214\nG\n(CH2)3N[(CH2)2OMe]2\nPh\n412.491\n413\n\n\n215\nG\n[1-[(CH2)2OPh]-Piperidin-\nPh\n442.52\n443\n\n\n\n\n4-yl]\n\n\n216\nG\n[1-[(CH2)2OPh]-Piperidin-\n2,3-di-F-Ph\n478.501\n479\n\n\n\n\n4-yl]\n\n\n217\nF\nCH2OPh\n2,3-di-F-Ph\n381.341\n380 [M − H]−\n\n\n218\nI\n4-F-Ph\n2,3-di-F-Ph\n369.305\n370\n\n\n219\nK\nPiperidin-4-yl\n2,3-di-F-Ph\n358.35\n359\n\n\n220\nG\nCH2O-(3-NMe2-Ph)\n2,3-di-F-Ph\n424.409\n425\n\n\n221\nG\n(CH2)3[4-SO2Me-\nPh\n443.53\n444\n\n\n\n\nPiperazin-1-yl]\n\n\n222\nG\n(CH2)3N[(CH2)2OMe]2\n2,3-di-F-Ph\n448.471\n449\n\n\n223\nG\n(CH2)3[4-SO2Me-\n2,3-di-F-Ph\n479.51\n480\n\n\n\n\nPiperazin-1-yl]\n\n\n224\nG\n(CH2)3(Pyrrolidin-1-yl)\n2,3-di-F-Ph\n386.404\n387\n\n\n225\nG\n[1-[(CH2)2O(4-Cl-Ph)]-\nPh\n476.965\n477\n\n\n\n\nPiperidin-4-yl]\n\n\n226\nG\n[1-[(CH2)2O(4-Cl-Ph)]-\n2,3-di-F-Ph\n512.946\n513\n\n\n\n\nPiperidin-4-yl]\n\n\n227\nF\ni-Pr\nQuinalin-3-yl\n332.365\n333\n\n\n228\nG\nCH2O-(3-NMe2-Ph)\nPh\n388.429\n389\n\n\n229\nF\ncyclo-Pentyl\nQuinolin-3-yl\n358.403\n359\n\n\n230\nG\n(CH2)3[4-(CH2Ph)-\nPh\n455.563\n456\n\n\n\n\nPiperazin-1-yl]\n\n\n231\nF\ncyclo-Pr\n2-Cl-3-F-Ph\n331.737\n332/334\n\n\n232\nF\nCH2OMe\n2,3-di-F-Ph\n333.297\n334\n\n\n233\nF\ni-Pr\n2-Cl-3-F-Ph\n333.753\n334/336\n\n\n234\nG\n(CH2)3N(Me)(CH2)2OMe\n2,3-di-F-Ph\n404.419\n405\n\n\n235\nG\n[1-[CH2-(4-Cl-Ph)]-\nPh\n446.94\n447\n\n\n\n\nPiperidin-4-yl]\n\n\n236\nG\n[1-[CH2-(4-Cl-Ph)]-\n2,3-di-F-Ph\n482.92\n483\n\n\n\n\nPiperidin-4-yl]\n\n\n237\nG\n(CH2)4(Piperidin-1-yl)\n2,3-di-F-Ph\n414.458\n415\n\n\n238\nG\n(CH2)3[4-(CH2Ph)-\n2,3-di-F-Ph\n491.543\n492\n\n\n\n\nPiperazin-1-yl]\n\n\n239\nG\nN-Me-Piperidin-4-yl\n2-Cl-3-F-Ph\n388.832\n389/391\n\n\n240\nI\n4-F-Ph\nPh\n333.325\n334\n\n\n241\nG\nCH2Ph\nPh\n329.362\n330\n\n\n242\nF\nCH2OCH2CF3\n2,3-di-F-Ph\n387.267\n388\n\n\n243\nI\n2,3-Dihydrobenzofuran-5-yl\nPh\n357.371\n358\n\n\n244\nG\n[1-[CH2-(4-F-Ph)]-\nPh\n430.485\n431\n\n\n\n\nPiperidin-4-yl]\n\n\n245\nG\n[1-[CH2-(4-F-Ph)]-\n2,3-di-F-Ph\n466.465\n467\n\n\n\n\nPiperidin-4-yl]\n\n\n246\nG\n(CH2)3N(Me)(CH2)2OMe\nPh\n368.439\n369\n\n\n247\nG\nCH2Ph\n2,3-di-F-Ph\n365.342\n366\n\n\n248\nG\nCH2-[1-[CH2-(4-F-Ph)]-\n2,3-di-F-Ph\n462.502\n463\n\n\n\n\nPiperidin-4-yl]\n\n\n249\nG\nCH2-[1-[(CH2)2OPh]-\n2,3-di-F-Ph\n492.527\n493\n\n\n\n\nPiperidin-4-yl]\n\n\n250\nG\nrac-[1-(CH2Ph)-Pyrrolidin-\n2,3-di-F-Ph\n434.448\n435\n\n\n\n\n3-yl]\n\n\n251\nL\n(CH2)2-(6-Me-pyridin-3-\nPh\n358.403\n359\n\n\n\n\nyl)\n\n\n252\nL\n4-[CH2(Pyrrolidin-1-yl)]-\nPh\n398.468\n399\n\n\n\n\nPh\n\n\n253\nG\nCH2-[1-[(CH2)2OPh]-\nPh\n456.547\n457\n\n\n\n\nPiperidin-4-yl]\n\n\n254\nG\nCH2-[1-(CH2Ph)-Piperidin-\nPh\n426.521\n427\n\n\n\n\n4-yl]\n\n\n255\nG\n(CH2)3NMe2\n2-Cl-3-F-Ph\n376.821\n377/379\n\n\n256\nG\nCH2-[1-Et-Piperidin-4-yl]\nPh\n364.451\n365\n\n\n257\nG\nCH2-[1-Et-Piperidin-4-yl]\n2,3-di-F-Ph\n400.431\n401\n\n\n258\nI\n4-NMe2-Ph\nPyridin-3-yl\n359.391\n360\n\n\n259\nF\n(CH2)2Ph\n2,3-di-F-Ph\n379.368\n380\n\n\n260\nG\n1-Ph-Piperidin-4-yl\nPh\n398.468\n399\n\n\n261\nG\n1-Ph-Piperidin-4-yl\n2,3-di-F-Ph\n434.448\n435\n\n\n262\nF\ntrans-CH═CH-(4-F-Ph)\n2,3-di-F-Ph\n395.343\n396\n\n\n263\nF\n(CH2)2(4-F-Ph)\n2,3-di-F-Ph\n397.359\n398\n\n\n264\nF\ntrans-CH═CHPh\n2,3-di-F-Ph\n377.353\n378\n\n\n265\nL\n4-[CH2(Piperidin-1-yl)]-Ph\n2,3-di-F-Ph\n448.475\n449\n\n\n266\nG\n(CH2)3(Pyrrolidin-1-yl)\n2-Cl-3-F-Ph\n402.859\n403\n\n\n267\nI\nCH2-(4-NMe2-Ph)\n2,3-di-F-Ph\n408.41\n409\n\n\n268\nI\n(CH2)3[4-[O-(4-Cl-Ph)]-\nPh\n490.992\n491/493\n\n\n\n\npiperidin-1-yl]\n\n\n269\nG\nCH2(1-Ph-Piperidin-4-yl)\nPh\n412.495\n413\n\n\n270\nG\nCH2(1-Me-Piperidin-4-yl)\nPh\n350.424\n351\n\n\n271\nG\nCH2(1-Me-Piperidin-4-yl)\n2,3-di-F-Ph\n386.404\n387\n\n\n272\nF\ni-Pr\n2,3,6-tri-F-Ph\n335.288\n336\n\n\n273\nF\ncyclo-Pentyl\n2,3,6-tri-F-Ph\n361.326\n362\n\n\n274\nL\n(CH2)3(4-Et-Piperazin-1-\n2-Cl-3-F-Ph\n445.927\n446/448\n\n\n\n\nyl)\n\n\n275\nL\nCH2-[4-(CH2NMe2)-Ph]\n2,3-di-F-Ph\n408.41\n409\n\n\n276\nF\ncyclo-Pr\n2,3,6-tri-F-Ph\n333.272\n334\n\n\n277\nL\n(CH2)3(Piperidin-1-yl)\n2-Cl-3-F-Ph\n416.886\n417/419\n\n\n278\nL\n(CH2)2(6-Me-pyridin-3-yl)\n2,3-di-F-Ph\n394.383\n395\n\n\n279\nL\nrac-[(1-CH2Ph)-Pyrrolidin-\nPh\n398.468\n399\n\n\n\n\n3-yl]\n\n\n280\nL\n[4-(CH2-thiomorpholin-4-\n2,3-di-F-Ph\n466.514\n467\n\n\n\n\nyl)-Ph]\n\n\n281\nL\n[4-(CH2-thiomorpholin-4-\nPh\n430.534\n431\n\n\n\n\nyl)-Ph]\n\n\n282\nG\n[1-[CH2-(4-F-Ph)]-\n2,3,6-tri-F-Ph\n484.455\n485\n\n\n\n\nPiperidin-4-yl]\n\n\n283\nL\n[4-[CH2(Piperidin-1-yl)]-\nPh\n412.495\n413\n\n\n\n\nPh]\n\n\n284\nL\n[4-[CH2NEt2]-Ph]\nPh\n400.484\n401\n\n\n285\nL\n(CH2)4(4-Et-Piperazin-1-\n2,3-di-F-Ph\n443.499\n444\n\n\n\n\nyl)\n\n\n286\nH\ncyclo-Pentyl\nPyridin-3-yl\n308.343\n309\n\n\n287\nL\n[3-[CH2(Piperidin-1-yl)]-\n2,3-di-F-Ph\n448.475\n449\n\n\n\n\nPh]\n\n\n288\nL\n(CH2)3(4-Ph-Piperazin-1-\nPh\n441.536\n442\n\n\n\n\nyl)\n\n\n289\nL\n(CH2)3(4-[(CH2)2Ph]-\nPh\n469.59\n470\n\n\n\n\nPiperazin-1-yl)\n\n\n290\nL\n(CH2)3(4-(CH2cyclo-\nPh\n461.61\n462\n\n\n\n\nhexyl)-Piperazin-1-yl)\n\n\n291\nL\n(CH2)4(4-Et-Piperazin-1-\nPh\n407.519\n408\n\n\n\n\nyl)\n\n\n292\nG\n(CH2)3(4-Et-Piperazin-1-\n2,3,6-tri-F-Ph\n447.463\n448\n\n\n\n\nyl)\n\n\n293\nL\n[3-[CH2(Piperidin-1-yl)]-\n2,3-di-F-Ph\n434.448\n435\n\n\n\n\nPh]\n\n\n294\nL\n(CH2)3(4-(cyclo-pentyl)-\nPh\n433.557\n434\n\n\n\n\nPiperazin-1-yl)\n\n\n295\nL\n(CH2)3(4-iso-Pr-Piperazin-\nPh\n407.519\n408\n\n\n\n\n1-yl)\n\n\n296\nI\n(CH2)3NMe2\n3-Me-Ph\n338.413\n339\n\n\n297\nI\n(CH2)3(4-Et-Piperazin-1-\n3-Me-Ph\n407.519\n408\n\n\n\n\nyl)\n\n\n298\nF\nCH2OCH2Ph\n2,3-di-F-Ph\n395.367\n396\n\n\n299\nL\nBenzothien-2-yl\n2,3-di-F-Ph\n407.403\n408\n\n\n300\nF\nCH2OMe\n3-Me-Ph\n297.316\n298\n\n\n301\nF\nCH2Ph\n3-Me-Ph\n343.388\n344\n\n\n302\nF\nCH2OCH2Ph\n3-Me-Ph\n373.414\n374\n\n\n303\nF\nCH2OPh\n3-Me-Ph\n359.387\n360\n\n\n304\nL\n4-[CH2(4-Et-Piperazin-1-\n2,3-di-F-Ph\n477.517\n478\n\n\n\n\nyl)]-Ph\n\n\n305\nL\n(CH2)3(4-(cyclo-pentyl)-\n2,3-di-F-Ph\n469.537\n470\n\n\n\n\nPiperazin-1-yl)\n\n\n306\nL\n(CH2)3(4-(CH2cyclo-\n2,3-di-F-Ph\n497.591\n498\n\n\n\n\nhexyl)-Piperazin-1-yl)\n\n\n307\nF\nCH2-(4-MeO-Ph)\n3-Me-Ph\n373.414\n374"
    ],
    "citations": [
        "22 38 400",
        "0 063 754",
        "WO 02/24694",
        "01/57022",
        "01/81345"
    ],
    "us_classification": "544126",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "07",
            "subclass": "D",
            "main_group": "413",
            "subgroup": "00"
        }
    ]
}