{
    "title": "Method for multi-step temperature control of a substrate",
    "abstract": "A method of changing the temperature of a substrate during processing of the substrate includes providing the substrate on a substrate holder, the substrate holder including a temperature controlled substrate support for supporting the substrate, a temperature controlled base support for supporting the substrate support and a thermal insulator interposed between the temperature controlled substrate support and the temperature controlled base support. The method further includes setting the temperature of the base support to a first base temperature corresponding to a first processing temperature of the substrate, setting the substrate support to a first support temperature corresponding to the first processing temperature of the substrate, setting the temperature of the base support to a second base temperature corresponding to a second processing temperature of the substrate, and setting the substrate support to a second support temperature corresponding to the second processing temperature of the substrate.",
    "inventors": [
        "Tsukamoto"
    ],
    "document_number": "07297894",
    "publication_date": "20071120",
    "assignees": [
        "Tokyo Electron Limited"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for controlling the temperature of a substrate in a substrate processing system, the substrate processing system including a substrate holder having a substrate support with a plurality of temperature sensors reporting at least a temperature at an inner region and an outer region of said substrate and first and second heating elements heating respectively said inner and outer regions, said substrate holder including a base support having a cooling element for cooling said inner and outer regions, said substrate holder further including a thermal insulator disposed between said substrate support and said base support, said first and second heating elements and said cooling element being controlled by a temperature control system to maintain said substrate holder at a selectable set-point temperature, the method comprising:",
            "components": [
                {
                    "component": "selecting a first base temperature for said base support;",
                    "subcomponents": []
                },
                {
                    "component": "selecting a second base temperature for said base support;",
                    "subcomponents": []
                },
                {
                    "component": "selecting a first inner set-point temperature and a first outer set-point temperature;",
                    "subcomponents": []
                },
                {
                    "component": "selecting a second inner set-point temperature and a second outer set-point temperature;",
                    "subcomponents": []
                },
                {
                    "component": "setting said base support to said first base temperature using said cooling element;",
                    "subcomponents": []
                },
                {
                    "component": "placing said substrate on said substrate holder;",
                    "subcomponents": []
                },
                {
                    "component": "heating said inner region of said substrate to said first inner set-point temperature and said outer region of said substrate to said first outer set-point temperature;",
                    "subcomponents": []
                },
                {
                    "component": "processing said substrate for a first period of time at said first inner and outer set-point temperatures;",
                    "subcomponents": []
                },
                {
                    "component": "changing the base temperature for said base support from said first base temperature to said second base temperature different from the first inner set-point temperature and the first outer set-point temperature;",
                    "subcomponents": []
                },
                {
                    "component": "changing the temperature of said inner and outer regions of said substrate to said second inner and outer set-point temperatures; and",
                    "subcomponents": []
                },
                {
                    "component": "processing said substrate for a second period of time at said second inner and outer set-point temperatures.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein said first inner set-point temperature is less than said second inner set-point temperature, and said first outer set-point temperature is less than said second outer set-point temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 2 , wherein said first base temperature is less than said second base temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein said first inner set-point temperature is greater than said second inner set-point temperature, and said first outer set-point temperature is greater than said second outer set-point temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 4 , wherein said first base temperature is greater than said second base temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein said setting said base support to said first base temperature using said cooling element comprises flowing a heat transfer fluid through said base support, said heat transfer fluid having a fluid temperature corresponding to said first base temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein said changing the base temperature for said base support from said first base temperature to said second base temperature comprises:",
            "components": [
                {
                    "component": "flowing a heat transfer fluid through said base support, said heat transfer fluid having a fluid temperature corresponding to said first base temperature; and",
                    "subcomponents": []
                },
                {
                    "component": "changing the fluid temperature of said heat transfer fluid from said first base temperature to said second base temperature.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , wherein said heating said inner region of said substrate to said first inner set-point temperature comprises heating said inner region of said substrate by coupling electrical power to an inner resistive heating element, and wherein said heating said outer region of said substrate to said first outer set-point temperature comprises heating said outer region of said substrate by coupling electrical power to an outer resistive heating element.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 8 , wherein said changing the temperature of said inner and outer regions of said substrate to said second inner and outer set-point temperatures comprises increasing the electrical power to said inner resistive heating element and increasing the power to said outer resistive heating element.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 9 , wherein said changing the base temperature for said base support from said first base temperature to said second base temperature comprises increasing the base temperature for said base support from said first base temperature to said second base temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 8 , wherein said changing the temperature of said inner and outer regions of said substrate to said second inner and outer set-point temperatures comprises decreasing the electrical power to said inner resistive heating element and decreasing the power to said outer resistive heating element.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 11 , wherein said changing the base temperature for said base support from said first base temperature to said second base temperature comprises decreasing the base temperature for said base support from said first base temperature to said second base temperature.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 1 , further comprising:",
            "components": [
                {
                    "component": "clamping said substrate to said substrate holder.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 13 , further comprising:",
            "components": [
                {
                    "component": "providing a heat transfer gas to the backside surface of said substrate on said substrate holder.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 14 , further comprising:",
            "components": [
                {
                    "component": "configuring the upper surface of said substrate holder to have an inner thermal region for supplying a first heat transfer gas to the backside surface of said substrate and an outer thermal region for supplying a second heat transfer gas to the backside surface of said substrate;",
                    "subcomponents": []
                },
                {
                    "component": "selecting a first inner pressure for said inner thermal region and a first outer pressure for said outer thermal region;",
                    "subcomponents": []
                },
                {
                    "component": "selecting a second inner pressure for said inner thermal region and a second outer pressure for said outer thermal region;",
                    "subcomponents": []
                },
                {
                    "component": "during said heating, providing a first heat transfer gas to said inner thermal region at said first inner pressure and a second heat transfer gas to said outer thermal region at said first outer pressure; and",
                    "subcomponents": []
                },
                {
                    "component": "during said changing the temperature of said inner and outer regions of said substrate, providing said first heat transfer gas to said inner thermal region at said second inner pressure and said second heat transfer gas to said outer thermal region at said second outer pressure.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 1 , wherein said processing said substrate for a first period of time comprises etching a layer of material on said substrate.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 16 , wherein said processing said substrate for a second period of time comprises etching another layer of material underlying said layer of material etched during said first period of time.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. A method for controlling the temperature of a substrate in a substrate processing system, the substrate processing system including a substrate holder having a substrate support with a plurality of temperature sensors reporting at least a temperature at an inner region and an outer region of said substrate and first and second heating elements heating respectively said inner and outer regions, said substrate holder including a base support having a cooling element for cooling said inner and outer regions, said substrate holder further including a thermal insulator disposed between said substrate support and said base support, said first and second heating elements and said cooling element being controlled by a temperature control system to maintain said substrate holder at a selectable set-point temperature, the method comprising:",
            "components": [
                {
                    "component": "selecting a first base temperature for said base support;",
                    "subcomponents": []
                },
                {
                    "component": "selecting a second base temperature for said base support;",
                    "subcomponents": []
                },
                {
                    "component": "selecting a first inner set-point temperature and a first outer set-point temperature;",
                    "subcomponents": []
                },
                {
                    "component": "selecting a second inner set-point temperature and a second outer set-point temperature;",
                    "subcomponents": []
                },
                {
                    "component": "setting said base support to said first base temperature using said cooling element;",
                    "subcomponents": []
                },
                {
                    "component": "placing said substrate on said substrate holder;",
                    "subcomponents": []
                },
                {
                    "component": "heating said inner region of said substrate to said first inner set-point temperature and said outer region of said substrate to said first outer set-point temperature;",
                    "subcomponents": []
                },
                {
                    "component": "changing the base temperature for said base support from said first base temperature to said second base temperature different from the first inner set-point temperature and the first outer set-point temperature; and",
                    "subcomponents": []
                },
                {
                    "component": "ramping the temperature of said inner and outer regions of said substrate to said second inner and outer set-point temperatures while processing said substrate for a period of time.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. A method of changing the temperature of a substrate during processing of the substrate, comprising:",
            "components": [
                {
                    "component": "providing the substrate on a substrate holder, the substrate holder comprising a temperature controlled substrate support for supporting the substrate, a temperature controlled base support for supporting the substrate support and a thermal insulator interposed between the temperature controlled substrate support and the temperature controlled base support;",
                    "subcomponents": []
                },
                {
                    "component": "setting the temperature of the base support to a first base temperature corresponding to a first processing temperature of said substrate;",
                    "subcomponents": []
                },
                {
                    "component": "setting the substrate support to a first support temperature corresponding to said first processing temperature of said substrate;",
                    "subcomponents": []
                },
                {
                    "component": "setting the temperature of the base support to a second base temperature corresponding to a second processing temperature of said substrate; and",
                    "subcomponents": []
                },
                {
                    "component": "setting the substrate support to a second support temperature corresponding to said second processing temperature of said substrate wherein the first processing temperature and the second processing temperature are different.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method of claim 19 , wherein at least one of said first and second support temperatures is a temperature profile that varies across an area of said substrate support.",
            "components": []
        }
    ],
    "description": [
        "This application is related to co-pending U.S. patent application Ser. No. 10/551,236, entitled “Method and System for Temperature Control of a Substrate”, filed on Sep. 27, 2005; co-pending U.S. patent application Ser. No. 11/525,818, entitled “High Temperature Substrate Holder for a Substrate Processing System” (ES-108), filed on even date herewith; co-pending U.S. patent application Ser. No. 11/525,815, entitled “High Temperature Substrate Holder with Non-homogeneous Insulation Layer for a Substrate Processing System” (ES-098), filed on even date herewith; and co-pending U.S. patent application Ser. No. 11/526,120, entitled “High Rate Method for Stable Temperature Control of a Substrate” (ES-113), filed on even date herewith. The entire contents of these applications are herein incorporated by reference in their entirety.",
        "1. Field of the Invention",
        "The present invention relates to a method for temperature control of a substrate, and more particularly to a method of using a substrate holder for temperature control of a substrate.",
        "2. Description of Related Art",
        "It is known in semiconductor manufacturing and processing that various processes, including for example etch and deposition processes, depend significantly on the temperature of the substrate. For this reason, the ability to control the temperature of a substrate and controllably adjust the temperature of the substrate is becoming an essential requirement of a semiconductor processing system. The temperature of a substrate is determined by many processes including, but not limited to, substrate interaction with plasma, chemical processes, etc., as well as radiative and/or conductive thermal exchange with the surrounding environment. Providing a proper temperature to the upper surface of the substrate holder can be utilized to control the temperature of the substrate.",
        "The present invention relates to a method for controlling the temperature of a substrate.",
        "According to one embodiment, a method for controlling the temperature of a substrate in a substrate processing system is described, the substrate processing system including a substrate holder having a substrate support with a plurality of temperature sensors reporting at least a temperature at an inner region and an outer region of the substrate, and first and second heating elements heating respectively the inner and the outer regions. The substrate holder also including a base support having a cooling element for cooling the inner and the outer regions, and a thermal insulator disposed between the substrate support and said base support. The first and second heating elements and the cooling element are controlled by a temperature control system to maintain the substrate holder at a selectable set-point temperature. The method includes selecting a first base temperature for the base support; selecting a second base temperature for the base support; selecting a first inner set-point temperature and a first outer set-point temperature; selecting a second inner set-point temperature and a second outer set-point temperature. The base support is set to the first base temperature using the cooling element and the substrate is placed on the substrate holder. Also performed is heating the inner region of the substrate to the first inner set-point temperature and the outer region of the substrate to the first outer set-point temperature and processing the substrate for a first period of time at the first inner and outer set-point temperatures. The base temperature for the base support is changed from the first base temperature to the second base temperature, the temperature of the inner and outer regions of the substrate are changed to the second inner and outer set-point temperatures; and the substrate is processed for a second period of time at the second inner and outer set-point temperatures.",
        "According to another embodiment, a method for controlling the temperature of a substrate in a substrate processing system is described, the substrate processing system including a substrate holder having a substrate support with plurality of temperature sensors reporting at least a temperature at an inner region and an outer region of the substrate, and first and second heating elements heating respectively the inner and the outer regions. The substrate holder also including a base support having a cooling element for cooling the inner and outer regions, and a thermal insulator disposed between the substrate support and said base support, the first and second heating elements and the cooling element being controlled by a temperature control system to maintain the substrate holder at a selectable set-point temperature. The method includes selecting a first base temperature for the base support, selecting a second base temperature for the base support, selecting a first inner set-point temperature and a first outer set-point temperature and selecting a second inner set-point temperature and a second outer set-point temperature. Also included is setting the base support to the first base temperature using the cooling element, placing the substrate on the substrate holder, heating the inner region of the substrate to the first inner set-point temperature and the outer region of the substrate to the first outer set-point temperature. The base temperature for the base support is changed from the first base temperature to the second base temperature, and the temperature of the inner and outer regions of the substrate is ramped to the second inner and outer set-point temperatures while processing the substrate for a period of time.",
        "According to yet another aspect, a method of changing the temperature of a substrate during processing of the substrate includes providing the substrate on a substrate holder, the substrate holder including a temperature controlled substrate support for supporting the substrate, a temperature controlled base support for supporting the substrate support and a thermal insulator interposed between the temperature controlled substrate support and the temperature controlled base support. The method further includes setting the temperature of the base support to a first base temperature corresponding to a first processing temperature of said substrate, setting the substrate support to a first support temperature corresponding to said first processing temperature of said substrate, setting the temperature of the base support to a second base temperature corresponding to a second processing temperature of said substrate, and setting the substrate support to a second support temperature corresponding to said second processing temperature of said substrate.",
        "In the accompanying drawings:",
        "FIG. 1 presents a block diagram of a substrate processing system according to an embodiment of the present invention;",
        "FIG. 2A presents a schematic cross-section view of a substrate holder according to an embodiment of the present invention;",
        "FIG. 2B illustrate exemplary profiles in thermal conductivity and substrate temperature for a substrate holder;",
        "FIG. 3. presents a schematic cross-section view of a substrate holder according to another embodiment of the present invention;",
        "FIG. 4. presents a schematic cross-section view of a substrate holder according to another embodiment of the present invention;",
        "FIG. 5. presents a schematic cross-section view of a substrate holder according to another embodiment of the present invention;",
        "FIG. 6. presents a schematic cross-section view of a substrate holder according to another embodiment of the present invention;",
        "FIGS. 7A and 7B illustrate exemplary time traces of temperature; and",
        "FIG. 8 illustrates a flow chart of a method of adjusting a substrate temperature according to an embodiment of the present invention.",
        "In the following description, for purposes of explanation and not limitation, specific details are set forth, such as a particular geometry of the substrate holder for a substrate processing system and descriptions of various components and processes. However, it should be understood that the invention may be practiced in other embodiments that depart from these specific details.",
        "According to an embodiment of the present invention, a material processing system 1 is depicted in FIG. 1 that includes a process tool 10 having a substrate holder 20 and a substrate 25 supported thereon. The substrate holder 20 is configured to provide temperature control elements for adjustment of substrate temperature. Additionally, the temperature control elements may be spatially arranged in order to ensure a uniform or non-uniform substrate temperature. A controller 55 is coupled to the process tool 10 and the substrate holder 20, and is configured to monitor, adjust and control the substrate temperature as will be further discussed below.",
        "In the illustrated embodiment depicted in FIG. 1, the material processing system 1 can include an etch chamber. For example, the etch chamber can facilitate dry plasma etching, or, alternatively, dry non-plasma etching. Alternately, the material processing system 1 includes a photo-resist coating chamber such as a heating/cooling module in a photo-resist spin coating system that may be utilized for post-adhesion bake (PAB) or post-exposure bake (PEB), etc.; a photo-resist patterning chamber such as a photo-lithography system; a dielectric coating chamber such as a spin-on-glass (SOG) or spin-on-dielectric (SOD) system; a deposition chamber such as a vapor deposition system, chemical vapor deposition (CVD) system, plasma enhanced CVD (PECVD) system, atomic layer deposition (ALD) system, plasma enhanced ALD (PEALD) system, or a physical vapor deposition (PVD) system; or a rapid thermal processing (RTP) chamber such as a RTP system for thermal annealing.",
        "Referring now to FIG. 2A, a substrate holder is described according to one embodiment. The substrate holder 100 comprises a substrate support 130 having a first temperature and configured to support a substrate 110, a temperature-controlled support base 120 positioned below substrate support 130 and configured to be at a second temperature less than the first temperature (e.g. less than a desired temperature of substrate 110), and a thermal insulator 140 disposed between the substrate support 130 and the temperature-controlled support base 120. Additionally, the substrate support 130 comprises one or more heating elements coupled thereto (not shown), and configured to elevate the temperature of the substrate support 130 (e.g. to heat the substrate). It is to be understood that the first temperature may be part of a temperature gradient across the substrate support and the second temperature may be part of a temperature gradient across the temperature controlled base according to embodiments of the invention.",
        "According to one embodiment, the thermal insulator 140 comprises a thermal conductivity lower than the respective thermal conductivities of both the substrate support 130 and the temperature-controlled support base 120. For example, the thermal conductivity of the thermal insulator 140 is less than 1 W/m−K. Desirably, the thermal conductivity of the thermal insulator ranges from approximately 0.05 W/m−K to approximately 0.8 W/m−K and, more desirably, the thermal conductivity of the thermal insulator ranges from approximately 0.2 W/m−K to approximately 0.8 W/m−K.",
        "The thermal insulator 140 can comprise an adhesive made of polymer, plastic or ceramic. The thermal insulator 140 may include an organic or an inorganic material. For example, the thermal insulator 140 can comprise a room-temperature-vulcanizing (RTV) adhesive, a plastic such as a thermoplastic, a resin such as a thermosetting resin or a casting resin (or pourable plastic or elastomer compound), an elastomer, etc. In addition to providing a thermal resistance between the substrate support 130 and the temperature-controlled support base 120, the thermal insulator 140 may provide a bond layer or adhesion layer between the substrate support 130 and the temperature-controlled support base 120.",
        "The thickness and material composition of the thermal insulator 120 should be selected such that, when necessary, adequate radio frequency (RF) coupling between the support base 120 and plasma can be maintained. Furthermore, the thermal insulator 120 should be selected in order to tolerate thermal-mechanical shear driven by thermal gradients and differences in material properties, i.e., coefficient of thermal expansion. For example, the thickness of the thermal insulator 140 can be less than or equal to approximately 10 mm (millimeters), and desirably, the thickness can be less than or equal to approximately 5 mm, i.e., approximately 2 mm or less.",
        "Additionally, the material composition of the thermal insulator 140 is preferably such that it demonstrates erosion resistance to the environment within which it is utilized. For example, when presented with a dry plasma etching environment, the thermal insulator 140 should be resistant to the corrosive etch chemistries used during the etching process, as well as the corrosive cleaning chemistries used during an etch system cleaning process. In many etching chemistries and cleaning chemistries, halogen-containing process gases are utilized including, but not limited to, Cl2, F2, Br2, HBr, HCI, HF, SF6, NF3, CIF3, etc. In these chemistries, particularly cleaning chemistries, it is desirable to produce high concentrations of reactive atomic halogen species, such as atomic fluorine, etc.",
        "According to one embodiment, the thermal insulator 140 comprises an erosion resistant thermal insulator. In one embodiment, the entire thermal insulator is made from the erosion resistant material. Alternatively, only a portion of the thermal insulator 140, such as portions exposed to halogen-containing gas, can include the erosion resistant material. For example, the erosion resistant material may be included only at a peripheral exposed edge of the thermal insulator, while the remaining region of the thermal insulator includes a different material composition selected for providing a desired heat transfer co-efficient.",
        "The erosion resistant thermal insulator can include an acryl-type material, such as an acrylic-based material or an acrylate-based material. Acrylic-based materials and acrylate-based materials can be formed by polymerizing acrylic or methylacrylic acids through a reaction with a suitable catalyst. Table 1 provides data illustrating the dependence of erosion resistance on material composition. For example, data is provided for silicon-containing adhesives, and a series of acrylic/acrylate-containing adhesives (prepared by various vendors X, Y, Z, Q, R & T). The data includes the erosion amount (mm3) as a function of plasma (or RF power on) hours (hr); i.e, mm3/hr. As shown in Table 1, the acrylic/acrylate-containing adhesives exhibit more than an order of magnitude less erosion when subjected to a cleaning plasma (such as a SF6-based plasma).",
        "TABLE 1\n\n\n\n\n\n\n\n\n\nSilicon\nAcryl type\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntype\nX\nY\nZ\nQ\nR\nT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThickness (mm)\n0.13\n0.13\n0.25\n0.13\n0.15\n0.05\n0.12\n\n\nThermal con-\n0.25\n0.35\n0.6\n0.37\n0.3\n0.6\n0.2\n\n\nductivity (W/m-K)\n\n\nThermal\n5.2\n3.7\n4.2\n3.5\n7.5\n8.3\n6\n\n\nresistance (E−4)\n\n\nErosion ratio\n5.5\n0.32\n0.3\n0.22\n0.25\n0.15\n0\n\n\n(mm3/hr)",
        "According to yet another embodiment, the thermal insulator 140 comprises a non-uniform spatial variation of the heat transfer coefficient (W/m2−K) through the thermal insulator 140 between the temperature controlled support base 120 and the substrate support 130. For example, the heat transfer coefficient can vary in a radial direction between a substantially central region of the thermal insulator 140 (below substrate 110) and a substantially edge region of the thermal insulator 140 (below substrate 110). The spatial variation of the heat transfer coefficient may comprise a non-uniform spatial variation of the thermal conductivity (W/m−K) of the thermal insulator 140, or the spatial variation of the heat transfer coefficient may comprise a non-uniform spatial variation of the thickness of the thermal insulator 140, or both. As used herein, the term “non-uniform spatial variation” of a parameter means a spatial variation of the parameter across an area of the substrate holder that is caused by design rather than inherent minor variations of the parameter across a substrate holder. Further, the term “substantially central region of the thermal insulator” means a region of the thermal insulator that would overlap a center of the substrate if placed on the substrate holder, and the term “substantially edge region of the thermal insulator” means a region of the thermal insulator that would overlap an edge of the substrate if placed on the substrate holder.",
        "As illustrated in FIG. 2B, the thermal conductivity can vary in a radial direction between a substantially central region of the thermal insulator 140 below substrate 110 and a substantially edge region of the thermal insulator 140 below substrate 110. For example, the thermal conductivity can vary between a first value between approximately 0.2 W/m−K and approximately 0.8 W/m−K and a second value between approximately 0.2 W/m−K and approximately 0.8 W/m−K. Additionally, for example, the thermal conductivity can be approximately 0.2 W/m−K near a substantially central region of the thermal insulator 140 and the thermal conductivity can be approximately 0.8 W/m−K near a substantially edge region of the thermal insulator 140. Additionally yet, for example, the variation in the thermal conductivity substantially occurs between approximately the mid-radius region of the thermal insulator 140 and a substantially peripheral region of the thermal insulator 140. As shown in FIG. 2B, the temperature may vary from center to edge between a first temperature (T1) and a second temperature (T2). Such variations in thermal conductivity (and temperature) may be imposed to counter excessive heating of the peripheral edge of the substrate by, for instance, the focus ring surrounding the substrate.",
        "As illustrated in FIG. 3, a substrate holder is described according to another embodiment. The substrate holder 200 comprises a substrate support 230 having a first temperature and configured to support a substrate 210, a temperature-controlled support base 220 positioned below substrate support 230 and configured to be at a second temperature less than the first temperature (e.g. less than a desired temperature of substrate 210), and a thermal insulator 240 disposed between the substrate support 230 and the temperature-controlled support base 220. Additionally, the substrate support 230 comprises one or more heating elements coupled thereto (not shown), and configured to elevate the temperature of the substrate support 230 (e.g. to heat the substrate). The thermal insulator 240 comprises a non-uniform thickness.",
        "As shown, the thickness is less at a substantially center region of the thermal insulator 240 (below substrate 210) and it is relatively thicker at a substantially edge region below the substrate 210. Alternatively, the thickness can be greater at a substantially center region below substrate 210 and it can be relatively thinner at a substantially edge region of substrate 210. The non-uniform thickness of thermal insulator 240 may be imposed by a non-flat upper surface on support base 220, or it may be imposed by a non-flat lower surface of substrate support 240, or it may be imposed by a combination thereof. Alternatively yet, a layer of material having a different thermal conductivity than that of the thermal insulator 240 may be disposed on a portion of either the upper surface of support base 220 or the lower surface of substrate support 230. For instance, a layer of Kapton®, Vespel®, Teflon®, etc., may be disposed on a substantially central region below substrate 210, or such a layer may be disposed on a substantially peripheral region below substrate 210.",
        "Referring now to FIG. 4, a substrate holder is described according to another embodiment. The substrate holder 300 comprises a substrate support 330 having a first temperature and configured to support a substrate 310, a temperature-controlled support base 320 positioned below substrate support 330 and configured to be at a second temperature less than the first temperature (e.g. less than a desired temperature of substrate 310), and a thermal insulator 340 disposed between the substrate support 330 and the temperature-controlled support base 320. Additionally, the substrate support 330 comprises one or more heating elements coupled thereto (not shown), and configured to elevate the temperature of the substrate support 330.",
        "As shown in FIG. 4, the support base 320 comprises a plurality of protrusions, or ridges 342, that partially extend into (or fully extend through) the thermal insulator 340. Furthermore, the number density of protrusions can vary between a substantially central region 344 and a substantially peripheral region 346 of the substrate holder. For example, a higher density of protrusions may be placed at the peripheral region 346, while a relatively lower density of protrusions may be placed at the central region 344. Alternatively, for example, a lower density of protrusions may be placed at the peripheral region 346, while a relatively higher density of protrusions may be placed at the central region 344. In addition to the variation in density of protrusions, or in lieu of a variation in density, the size or shape or both of the protrusions may be varied.",
        "The temperature controlled support base 120 (220, 320) may be fabricated from a metallic material or a non-metallic material. For example, the support base 120 (220, 320) can be fabricated from aluminum. Additionally, for example, the support base 120 (220, 320) can be formed of a material having a relatively high thermal conductivity, such that the temperature of the support base can be maintained at a relatively constant temperature. The temperature of the temperature controlled support base is preferably actively controlled by one or more temperature control elements such as cooling elements. However, the temperature controlled support may provide passive cooling by use of cooling fins to promote enhanced free convection due to the increased surface area with the surrounding environment for example. The support base 120 (220, 320) can further include passages therethrough (not shown) to permit the coupling of electrical power to the one or more heating elements of the substrate support, the coupling of electrical power to an electrostatic clamping electrode, the pneumatic coupling of heat transfer gas to the backside of the substrate, etc.",
        "The substrate support 130 (230, 330) may be fabricated from a metallic material or a non-metallic material. The substrate support 130 (230, 330) can be fabricated from a non-electrically conductive material, such as a ceramic. For example, substrate support 130 (230, 330) can be fabricated from alumina.",
        "According to one embodiment, the one or more heating elements are embedded within the substrate support 130 (230, 330). The one or more heating elements can be positioned between two ceramic pieces which are sintered together to form a monolithic piece. Alternatively, a first layer of ceramic is thermally sprayed onto the thermal insulator, followed by thermally spraying the one or more heating elements onto the first ceramic layer, and followed by thermally spraying a second ceramic layer over the one or more heating elements. Using similar techniques, other electrodes, or metal layers, may be inserted within the substrate support 130 (230, 330). For example, an electrostatic clamping electrode may be inserted between ceramic layers and formed via sintering or spraying techniques as described above. The one or more heating elements and the electrostatic clamping electrode may be in the same plane or in separate planes, and may be implemented as separate electrodes or implemented as the same physical electrode.",
        "Referring now to FIG. 5, a substrate holder is described according to another embodiment. The substrate holder 400 comprises a substrate support 430 having a first temperature and configured to support a substrate 410, a temperature-controlled support base 420 positioned below substrate support 430 and configured to be at a second temperature less than the first temperature (e.g. less than a desired temperature of substrate 410), and a thermal insulator 440 disposed between the substrate support 430 and the temperature-controlled support base 420. Additionally, the substrate support 430 comprises one or more heating elements 431 coupled thereto, and configured to elevate the temperature of the substrate support 430. Furthermore, the support base 420 comprises one or more cooling elements 421 coupled thereto, and configured to reduce the temperature of the substrate support 430 via the removal of heat from the substrate support 430 through thermal insulator 440.",
        "The one or more heating elements 431 can comprise at least one of a heating fluid channel, a resistive heating element, or a thermoelectric element biased to transfer heat towards the wafer. Furthermore, as shown in FIG. 5, the one or more heating elements 431 are coupled to a heating element control unit 432. Heating element control unit 432 is configured to provide either dependent or independent control of each heating element, and exchange information with a controller 450.",
        "For example, the one or more heating elements 431 can comprise one or more heating channels that can permit a flow rate of a fluid, such as water, Fluorinert, Galden HT-135, etc., therethrough in order to provide conductive-convective heating, wherein the fluid temperature has been elevated via a heat exchanger. The fluid flow rate and fluid temperature can, for example, be set, monitored, adjusted, and controlled by the heating element control unit 432.",
        "Alternatively, for example, the one or more heating elements 431 can comprise one or more resistive heating elements such as a tungsten, nickel-chromium alloy, aluminum-iron alloy, aluminum nitride, etc., filament. Examples of commercially available materials to fabricate resistive heating elements include Kanthal, Nikrothal, Akrothal, which are registered trademark names for metal alloys produced by Kanthal Corporation of Bethel, Conn. The Kanthal family includes ferritic alloys (FeCrAI) and the Nikrothal family includes austenitic alloys (NiCr, NiCrFe). For example, the heating elements can comprise a cast-in heater commercially available from Watlow (1310 Kingsland Dr., Batavia, Ill., 60510) capable of a maximum operating temperature of 400 to 450 C, or a film heater comprising aluminum nitride materials that is also commercially available from Watlow and capable of operating temperatures as high as 300 C and power densities of up to 23.25 W/cm2. Additionally, for example, the heating element can comprise a silicone rubber heater (1.0 mm thick) capable of 1400 W (or power density of 5 W/in2). When an electrical current flows through the filament, power is dissipated as heat, and, therefore, the heating element control unit 432 can, for example, comprise a controllable DC power supply. A further heater option, suitable for lower temperatures and power densities, are Kapton heaters, consisted of a filament embedded in a Kapton (e.g. polyimide) sheet, marketed by Minco, Inc., of Minneapolis, Minn.",
        "Alternately, for example, the one or more heating elements 431 can comprise an array of thermoelectric elements capable of heating or cooling a substrate depending upon the direction of electrical current flow through the respective elements. Thus, while the elements 431 are referred to as “heating elements,” these elements may include the capability of cooling in order to provide rapid transition between temperatures. Further, heating and cooling functions may be provided by separate elements within the substrate support 430. An exemplary thermoelectric element is one commercially available from Advanced Thermoelectric, Model ST-127-1.4-8.5M (a 40 mm by 40 mm by 3.4 mm thermoelectric device capable of a maximum heat transfer power of 72 W). Therefore, the heating element control unit 432 can, for example, comprise a controllable current source.",
        "The one or more cooling elements 421 can comprise at least one of a cooling channel, or a thermoelectric element. Furthermore, as shown in FIG. 5, the one or more cooling elements 421 are coupled to a cooling element control unit 422. Cooling element control unit 422 is configured to provide either dependent or independent control of each cooling element 421, and exchange information with controller 450.",
        "For example, the one or more cooling elements 421 can comprise one or more cooling channels that can permit a flow rate of a fluid, such as water, Fluorinert, Galden HT-135, etc., therethrough in order to provide conductive-convective cooling, wherein the fluid temperature has been lowered via a heat exchanger. The fluid flow rate and fluid temperature can, for example, be set, monitored, adjusted, and controlled by the cooling element control unit 422. Alternately, during heating for example, the fluid temperature of the fluid flow through the one or more cooling elements 421 may be increased to complement the heating by the one or more heating elements 431. Alternately yet, during cooling for example, the fluid temperature of the fluid flow through the one or more cooling elements 421 may be decreased.",
        "Alternately, for example, the one or more cooling elements 421 can comprise an array of thermoelectric elements capable of heating or cooling a substrate depending upon the direction of electrical current flow through the respective elements. Thus, while the elements 421 are referred to as “cooling elements,” these elements may include the capability of heating in order to provide rapid transition between temperatures. Further, heating and cooling function may be provided by separate elements within the temperature controlled support base 420. An exemplary thermo-electric element is one commercially available from Advanced Thermoelectric, Model ST-127-1.4-8.5M (a 40 mm by 40 mm by 3.4 mm thermo-electric device capable of a maximum heat transfer power of 72 W). Therefore, the cooling element control unit 422 can, for example, comprise a controllable current source.",
        "Additionally, as shown in FIG. 5, the substrate holder 400 can further comprise an electrostatic clamp (ESC) comprising one or more clamping electrodes 435 embedded within substrate support 430. The ESC further comprises a high-voltage (HV) DC voltage supply 434 coupled to the clamping electrodes 435 via an electrical connection. The design and implementation of such a clamp is well known to those skilled in the art of electrostatic clamping systems. Furthermore, the HV DC voltage supply 434 is coupled to controller 450 and is configured to exchange information with controller 450.",
        "Furthermore, as shown in FIG. 5, the substrate holder 400 can further comprise a back-side gas supply system 436 for supplying a heat transfer gas, such as an inert gas including helium, argon, xenon, krypton, a process gas, or other gas including oxygen, nitrogen, or hydrogen, to the backside of substrate 410 through at least one gas supply line, and at least one of a plurality of orifices and channels (not shown). The backside gas supply system 436 can, for example, be a multi-zone supply system such as a two-zone (center/edge) system, or a three-zone (center/mid-radius/edge), wherein the backside pressure can be varied in a radial direction from the center to edge. Furthermore, the backside gas supply system 436 is coupled to controller 450 and is configured to exchange information with controller 450.",
        "Further yet, as shown in FIG. 5, the substrate holder 400 can further comprise one or more temperature sensors 462 coupled to a temperature monitoring system 460. The one or more temperature sensors 462 can be configured to measure the temperature of substrate 410, or the one or more temperature sensors 462 can be configured to measure the temperature of substrate support 430, or both. For example, the one or more temperature sensors 410 may be positioned such that the temperature is measured at the lower surface of the substrate support 430 as shown in FIG. 5, or positioned such that the temperature of a bottom of the substrate 410 is measured.",
        "The temperature sensor can include an optical fiber thermometer, an optical pyrometer, a band-edge temperature measurement system as described in pending U.S. patent application Ser. No. 10/168,544, filed on Jul. 2, 2002, the contents of which are incorporated herein by reference in their entirety, or a thermocouple (as indicated by the dashed line) such as a K-type thermocouple. Examples of optical thermometers include: an optical fiber thermometer commercially available from Advanced Energies, Inc., Model No. OR2000F; an optical fiber thermometer commercially available from Luxtron Corporation, Model No. M600; or an optical fiber thermometer commercially available from Takaoka Electric Mfg., Model No. FT-1420.",
        "The temperature monitoring system 460 can provide sensor information to controller 450 in order to adjust at least one of a heating element, a cooling element, a backside gas supply system, or an HV DC voltage supply for an ESC either before, during, or after processing.",
        "Controller 450 includes a microprocessor, memory, and a digital I/O port (potentially including D/A and/or A/D converters) capable of generating control voltages sufficient to communicate and activate inputs to substrate holder 400 as well as monitor outputs from substrate holder 400. As shown in FIG. 5, controller 450 can be coupled to and exchange information with heating element control unit 432, cooling element control unit 422, HV DC voltage supply 434, backside gas supply system 436, and temperature monitoring system 460. A program stored in the memory is utilized to interact with the aforementioned components of substrate holder 400 according to a stored process recipe. One example of controller 450 is a DELL PRECISION WORKSTATION 640™, available from Dell Corporation, Austin, Tex.",
        "The controller 450 may also be implemented as a general purpose computer, processor, digital signal processor, etc., which causes a substrate holder to perform a portion or all of the processing steps of the invention in response to the controller 450 executing one or more sequences of one or more instructions contained in a computer readable medium. The computer readable medium or memory is configured to hold instructions programmed according to the teachings of the invention and can contain data structures, tables, records, or other data described herein. Examples of computer readable media are compact discs, hard disks, floppy disks, tape, magneto-optical disks, PROMs (EPROM, EEPROM, flash EPROM), DRAM, SRAM, SDRAM, or any other magnetic medium, compact discs (e.g., CD-ROM), or any other optical medium, punch cards, paper tape, or other physical medium with patterns of holes, a carrier wave, or any other medium from which a computer can read.",
        "Controller 450 may be locally located relative to the substrate holder 400, or it may be remotely located relative to the substrate holder 400 via an internet or intranet. Thus, controller 450 can exchange data with the substrate holder 400 using at least one of a direct connection, an intranet, or the internet. Controller 450 may be coupled to an intranet at a customer site (i.e., a device maker, etc.), or coupled to an intranet at a vendor site (i.e., an equipment manufacturer). Furthermore, another computer (i.e., controller, server, etc.) can access controller 450 to exchange data via at least one of a direct connection, an intranet, or the internet.",
        "Optionally, substrate holder 400 can include an electrode through which RF power is coupled to plasma in a processing region above substrate 410. For example, support base 420 can be electrically biased at an RF voltage via the transmission of RF power from an RF generator through an impedance match network to substrate holder 400. The RF bias can serve to heat electrons to form and maintain plasma, or bias substrate 410 in order to control ion energy incident on substrate 410, or both. In this configuration, the system can operate as a reactive ion etch (RIE) reactor, where the chamber and upper gas injection electrode serve as ground surfaces. A typical frequency for the RF bias can range from 1 MHz to 100 MHz and is preferably 13.56 MHz.",
        "Alternately, RF power can be applied to the substrate holder electrode at multiple frequencies. Furthermore, an impedance match network can serve to maximize the transfer of RF power to plasma in the processing chamber by minimizing the reflected power. Various match network topologies (e.g., L-type, π-type, T-type, etc.) and automatic control methods can be utilized.",
        "Referring now to FIG. 6, a substrate holder is described according to another embodiment. The substrate holder 500 comprises a substrate support 530 having a first temperature and configured to support a substrate 510, a temperature-controlled support base 520 positioned below substrate support 530 and configured to be at a second temperature less than the first temperature (e.g. less than a desired temperature of substrate 510), and a thermal insulator 540 disposed between the substrate support 530 and the temperature-controlled support base 520. Additionally, the substrate support 530 comprises a center heating element 533 (located at a substantially center region below substrate 510) and an edge heating element 531 (located at a substantially edge, or peripheral, region below substrate 510) coupled thereto, and configured to elevate the temperature of the substrate support 530. Furthermore, the support base 520 comprises one or more cooling elements 521 coupled thereto, and configured to reduce the temperature of the substrate support 530 via the removal of heat from the substrate support 530 through thermal insulator 540.",
        "As shown in FIG. 6, the center heating element 533 and the edge heating element 531 are coupled to a heating element control unit 532. Heating element control unit 532 is configured to provide either dependent or independent control of each heating element, and exchange information with a controller 550.",
        "Additionally, as shown in FIG. 6, the substrate holder 500 can further comprise an electrostatic clamp (ESC) comprising one or more clamping electrodes 535 embedded within substrate support 530. The ESC further comprises a high-voltage (HV) DC voltage supply 534 coupled to the clamping electrodes 535 via an electrical connection. The design and implementation of such a clamp is well known to those skilled in the art of electrostatic clamping systems. Furthermore, the HV DC voltage supply 534 is coupled to controller 550 and is configured to exchange information with controller 550.",
        "Furthermore, as shown in FIG. 6, the substrate holder 500 can further comprise a back-side gas supply system 536 for supplying a heat transfer gas, such as an inert gas including helium, argon, xenon, krypton, a process gas, or other gas including oxygen, nitrogen, or hydrogen, to the center region and the edge region of the backside of substrate 510 through two gas supply lines, and at least two of a plurality of orifices and channels (not shown). The backside gas supply system 536, as shown, comprises a two-zone (center/edge) system, wherein the backside pressure can be varied in a radial direction from the center to edge. Furthermore, the backside gas supply system 536 is coupled to controller 550 and is configured to exchange information with controller 550.",
        "Further yet, as shown in FIG. 6, the substrate holder 500 further comprises a center temperature sensor 562 for measuring a temperature at a substantially center region below substrate 510 and an edge temperature sensor 564 for measuring a temperature at a substantially edge region below substrate 510. The center and edge temperature sensors 562, 564 are coupled to a temperature monitoring system 560.",
        "Referring now to FIG. 8, a flowchart describing a method 700 of controlling the temperature of a substrate on a substrate holder in a processing system is presented according to another embodiment. For example, the temperature control scheme can pertain to multiple process steps for a process in a processing system having a substrate holder such as one of those described in FIGS. 1 through 6. The method 700 begins in 710 with disposing a substrate on a substrate holder.",
        "The substrate holder comprises a plurality of temperature sensors reporting at least a temperature at an inner region and an outer region of the substrate and/or substrate holder. Additionally, the substrate holder comprises a substrate support having a first heating element and a second heating element heating the inner region and the outer region respectively, and a support base having a cooling element for cooling the inner region and the outer region. The first and second heating elements and the cooling element are controlled by a temperature control system to maintain the substrate holder at a selectable set-point temperature. Furthermore, the substrate holder comprises a thermal insulator disposed between the substrate support and the support base.",
        "In 720, the substrate is set to a first temperature profile. Using the temperature control system, a first base temperature for the base support (that is less than the first temperature profile (e.g. the substrate temperature), and a first inner set-point temperature and a first outer set-point temperature are selected. Thereafter, the temperature control system adjusts the cooling element and the first and second heating elements to achieve the selected temperatures described above.",
        "In 730, the substrate is set to a second temperature profile. Using the temperature control system, a second base temperature for the base support, and a second inner set-point temperature and a second outer set-point temperature are selected. Thereafter, the temperature control system changes the substrate temperature from the first temperature profile (i.e., first inner and outer set-point temperatures) to the second temperature profile (i.e., second inner and outer set-point temperatures) by optionally adjusting the cooling element to change the first base temperature to the second base temperature and adjusting the inner and outer heating elements until the second inner and outer set-point temperatures are achieved.",
        "In one example, the substrate temperature is increased (or decreased) from the first temperature profile to the second temperature profile, while the second base temperature remains the same as the first base temperature. The power delivered to the inner and outer heating elements is increased (or decreased) in order to heat (or cool) the substrate from the first temperature profile to the second temperature profile.",
        "In another example, the substrate temperature is increased (or decreased) from the first temperature profile to the second temperature profile, while the second base temperature is changed to a value different from the first base temperature. The power delivered to the inner and outer heating elements is increased (or decreased) in order to heat (or cool) the substrate from the first temperature profile to the second temperature profile, while the power delivered to the cooling element is increased (or decreased) in order to change the first base temperature to the second base temperature. Thus, according to one embodiment of the invention, the temperature of the support base is varied to assist the substrate support in controlling the temperature of the substrate. The present inventors have recognized that this varying of the support base temperature can provide more accurate and/or rapid temperature transitions of the substrate.",
        "The temperature control system utilizes a control algorithm in order to stably adjust temperature(s) in response to measured values provided by the temperature monitoring system. The control algorithm can, for example, include a PID (proportional, integral and derivative) controller. In a PID controller, the transfer function in the s-domain (i.e., Laplacian space) can be expressed as:\n\nGC(s)=Kp+KDs+KIs−1,  (1)",
        "where KP, KD, and KI are constants, referred to herein as a set of PID parameters. The design challenge for the control algorithm is to select the set of PID parameters to achieve the desired performance of the temperature control system.",
        "Referring to FIG. 7A, several exemplary time traces of temperature are shown to illustrate how different sets of PID parameters lead to a different temperature response. In each case, the temperature is increased from a first value to a second value. A first time trace of temperature 601 illustrates a relatively aggressive control scheme having a relatively low value for KI, for example, wherein the time trace exhibits “overshoot” and a series of oscillations following the overshoot. A second time trace of temperature 602 illustrates a relatively less aggressive control scheme having a relatively higher value for KI, for example, wherein the time trace exhibits a relatively slow, gradual increase to the second temperature. A third time trace of temperature 603 illustrates a desired moderately aggressive control scheme having a value for KI between that of time trace 601 and time trace 602, for example, wherein the time trace exhibits a relatively faster increase to the second temperature without overshoot. However, the present inventors have recognized that the use of only one PID parameter set is not sufficient to provide a desired condition for stability and rise rate.",
        "According to one embodiment, two or more PID parameter sets are utilized to achieve a rapid and stable adjustment of the temperature between an initial value and a final value. FIG. 7B illustrates an exemplary time trace of temperature 600 utilizing two sets of PID parameters. A first set of PID parameters is used for a first time duration 622, and a second set of PID parameters is used for a second time duration 624. The first time duration 622 can be determined by setting a temperature offset 620 from the final value of the temperature. For example, the temperature offset can range from approximately 50% to 99% of the temperature difference between the initial value and the final value. Additionally, for example, the temperature offset can range from approximately 70% to 95% of the temperature difference between the initial value and the final value, and desirably, the temperature offset can range from approximately 80% to 95%.",
        "For example, a relatively aggressive PID parameter set may be used for the first time duration 622, while a relatively less aggressive PID parameter set may be used for the second time duration 624. Alternatively, for example, the PID parameter KD can be increased from the first PID set to the second PID set, the PID parameter KI can be decreased from the first PID set to the second PID set, or a combination thereof.",
        "Although only certain embodiments of this invention have been described in detail above, those skilled in the art will readily appreciate that many modifications are possible in the embodiments without materially departing from the novel teachings and advantages of this invention. Accordingly, all such modifications are intended to be included within the scope of this invention."
    ],
    "citations": [
        "5445675",
        "5667622",
        "6566632",
        "6847014",
        "6921724",
        "2003/0015517",
        "10-083960",
        "2000-269189"
    ],
    "us_classification": "21912158",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "23",
            "subclass": "K",
            "main_group": "10",
            "subgroup": "00"
        }
    ]
}