{
    "title": "Method for fabricating circuitry component",
    "abstract": "An integrated chip package structure and method of manufacturing the same is by adhering dies on an organic substrate and forming a thin-film circuit layer on top of the dies and the organic substrate. Wherein the thin-film circuit layer has an external circuitry, which is electrically connected to the metal pads of the dies, that extends to a region outside the active surface of the dies for fanning out the metal pads of the dies. Furthermore, a plurality of active devices and an internal circuitry is located on the active surface of the dies. Signal for the active devices are transmitted through the internal circuitry to the external circuitry and from the external circuitry through the internal circuitry back to other active devices. Moreover, the chip package structure allows multiple dies with different functions to be packaged into an integrated package and electrically connecting the dies by the external circuitry.",
    "inventors": [
        "Lee",
        "Lin",
        "Huang"
    ],
    "document_number": "07297614",
    "publication_date": "20071120",
    "assignees": [
        "MEGICA Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for fabricating a circuit component, comprising:",
            "components": [
                {
                    "component": "joining a die and a first preformed substrate;",
                    "subcomponents": []
                },
                {
                    "component": "after said joining said die and said first preformed substrate, thinning said die;",
                    "subcomponents": []
                },
                {
                    "component": "joining said die and a second preformed substrate;",
                    "subcomponents": []
                },
                {
                    "component": "depositing a first patterned metal layer over said first preformed substrate, wherein said first patterned metal layer is connected to a metal pad of said die through an opening in said first preformed substrate; and",
                    "subcomponents": []
                },
                {
                    "component": "cutting said second preformed substrate.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , after said joining said die and said first preformed substrate, further comprising thinning said first preformed substrate, followed by said depositing said first patterned metal layer over said first preformed substrate.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 2 , wherein said thinning said first preformed substrate comprises grinding.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 2 , wherein said thinning said first preformed substrate comprises said thinning said first preformed substrate to a thickness of between 2 and 200 micrometers.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 wherein said first preformed substrate comprises an organic material.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein said first preformed substrate comprises glass.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein said second preformed substrate comprises an organic material.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , after said joining said die and said first preformed substrate, further comprising forming a polymer layer over said first preformed substrate and covering said die, followed by said thinning said die.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 1 , wherein said thinning said die comprises grinding.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 1 , wherein forming said opening in said first preformed substrate comprises etching.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 1 , wherein forming said opening in said first preformed substrate comprises drilling.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 1 , wherein said depositing said first patterned metal layer comprises electroplating.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 1 , wherein said depositing said first patterned metal layer comprises sputtering.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 1 , wherein said depositing said first patterned metal layer comprises electroless plating.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 1 , wherein said depositing said first patterned metal layer comprises depositing copper.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 1 , after said depositing said first patterned metal layer, further comprising forming an insulating layer on said first patterned metal layer, followed by said cutting said second preformed substrate.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 16 , after said forming said insulating layer, further comprising depositing a second patterned metal layer on said insulating layer, followed by said cutting said second preformed substrate.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 1 , after said depositing said first patterned metal layer, further comprising forming a gold bump over said first patterned metal layer, followed by said cutting said second preformed substrate.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 1 , after said depositing said first patterned metal layer, further comprising forming a solder bump over said first patterned metal layer, followed by said cutting said second preformed substrate.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method of claim 1 , wherein forming said opening in said first preformed substrate comprises laser forming.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The method of claim 1 , after said depositing said first patterned metal layer, further comprising cutting said first preformed substrate.",
            "components": []
        }
    ],
    "description": [
        "This application is a divisional application of, U.S. application Ser. No. 10/055,499, filed on Jan. 22, 2002, which claims the priority benefit of Taiwan application serial No. 90133093, filed Dec. 31 2001.",
        "This application is related to U.S. application Ser. No. 10/054,001, filed on Jan. 19, 2002, now U.S. Pat. No. 6,673,698; and related to application Ser. No. 10/690,350, filed on Oct. 21, 2003, now pending; and related to application Ser. No. 10/996,535, filed on Nov. 24, 2004, now pending; and related to application Ser. No. 10/996,537, filed on Nov. 24, 2004, now pending; and related to U.S. application Ser. No. 10/055,560, filed on Jan. 22, 2002; and related to application Ser. No. 10/638,018, filed on Aug. 8, 2003, now pending; and related to application Ser. No. 10/977,289, filed on Oct. 28, 2004, now pending; and related to U.S. application Ser. No. 10/055,568, filed on Jan. 22, 2002; and related to application Ser. No. 10/174,462, filed on Jun. 17, 2002, now U.S. Pat. No. 6,746,898; and related to application Ser. No. 10/755,042, filed on Jan. 9, 2004, now pending; and related to U.S. application Ser. No. 10/055,498 filed on Jan. 22, 2002; and related to application Ser. No. 10/454,972, filed on Jun. 4, 2003, now pending; and related to application Ser. No. 10/728,150 filed on Dec. 3, 2003, now pending, all assigned to common assignee and incorporated by reference in their entirety.",
        "1. Field of the Invention",
        "The present invention relates to an integrated chip package structure and method of manufacture the same. More particularly, the present invention relates to an integrated chip package structure and method of manufacture the same using organic substrate.",
        "2. Description of Related Art",
        "In the recent years, the development of advanced technology is on the cutting edge. As a result, high-technology electronics manufacturing industries launch more feature-packed and humanized electronic products These new products that hit the showroom are lighter, thinner, and smaller in design. In the manufacturing of these electronic products, the key component has to be the integrated circuit (IC) chip inside any electronic product.",
        "The operability, performance, and life of an IC chip are greatly affected by its circuit design, wafer manufacturing, and chip packaging. For this present invention, the focus will be on chip packaging technique. Since the features and speed of IC chips are increasing rapidly, the need for increasing the conductivity of the circuitry is necessary so that the signal delay and attenuation of the dies to the external circuitry are reduced. A chip package that allows good thermal dissipation and protection of the IC chips with a small overall dimension of the package is also necessary for higher performance chips. These are the goals to be achieved in chip packaging.",
        "There are a vast variety of existing chip package techniques such as ball grid array (BGA), wire bonding, flip chip, etc . . . for mounting a die on a substrate via the bonding points on both the die and the substrate. The inner traces helps to fan out the bonding points on the bottom of the substrate. The solder balls are separately planted on the bonding points for acting as an interface for the die to electrically connect to the external circuitry. Similarly, pin grid array (PGA) is very much like BGA, which replaces the balls with pins on the substrate and PGA also acts an interface for the die to electrically connect to the external circuitry.",
        "Both BGA and PGA packages require wiring or flip chip for mounting the die on the substrate. The inner traces in the substrate fan out the bonding points on the substrate, and electrical connection to the external circuitry is carried out by the solder balls or pins on the bonding points. As a result, this method fails to reduce the distance of the signal transmission path but in fact increase the signal path distance. This will increase signal delay and attenuation and decrease the performance of the chip.",
        "Wafer level chip scale package (WLCSP) has an advantage of being able to print the redistribution circuit directly on the die by using the peripheral area of the die as the bonding points It is achieved by redistributing an area array on the surface of the die, which can fully utilize the entire area of the die. The bonding points are located on the redistribution circuit by forming flip chip bumps so the bottom side of the die connects directly to the printed circuit board (PCB) with micro-spaced bonding points.",
        "Although WLCSP can greatly reduce the signal path distance, it is still very difficult to accommodate all the bonding points on the die surface as the integration of die and internal components gets higher. The pin count on the die increases as integration gets higher so the redistribution of pins in an area array is difficult to achieve. Even if the redistribution of pins is successful, the distance between pins will be too small to meet the pitch of a printed circuit board (PCB).",
        "Therefore the present invention provides an integrated chip package structure and method of manufacturing the same that uses the original bonding points of the die and connect them to an external circuitry of a thin-film circuit layer to achieve redistribution. The spacing between the redistributed bonding points matches the pitch of a PCB.",
        "In order to achieve the above object, the present invention presents an integrated chip package structure and method of manufacturing the same by adhering the backside of a die to an organic substrate, wherein the active surface of the die has a plurality of metal pads. A thin-film circuit layer is formed on top of the die and the organic substrate, where the thin-film circuit layer has an external circuitry that is electrically connected to the metal pads of the die. The external circuitry extends to a region that is outside the active area of the dies and has a plurality of bonding pads located on the surface of the thin-film layer circuit. The active surface of the die has an internal circuitry and a plurality of active devices, where signals can be transmitted from one active device to the external circuitry via the internal circuitry, then from the external circuitry back to another active device via the internal circuitry. Furthermore, the organic substrate has at least one inwardly protruded area so the backside of the die can be adhered inside the inwardly protruded area and exposing the active surface of the die. Wherein the organic substrate is composed of an organic layer and a heat conducting material formed overlapping and the inwardly protruded areas are formed by overlapping the organic substrate with openings on the heat conducting layer. Furthermore, the present chip package structure allows multiple dies with same or different functions to be packaged into one integrated chip package and permits electrically connection between the dies by the external circuitry.",
        "It is to be understood that both the foregoing general description and the following detailed description are exemplary, and are intended to provide further explanation of the invention as claimed.",
        "The accompanying drawings are included to provide a further understanding of the invention, and are incorporated in and constitute a part of this specification. The drawings illustrate embodiments of the invention and, together with the description, serve to explain the principles of the invention. In the drawings,",
        "FIG. 1A to 1I are schematic diagrams showing the sectional view of the structure of the first embodiment of the present invention.",
        "FIG. 2A to 2C are schematic diagrams showing the sectional view of the structure of the second embodiment of the present invention.",
        "FIG. 2D to 2E are schematic diagrams showing the sectional view of the formation of inwardly protruded areas in the organic substrate of the structure of the second embodiment of the present invention.",
        "FIG. 3A to 3C are schematic diagrams showing the sectional view of the structure of the third embodiment of the present invention.",
        "FIG. 4A to 4I are schematic diagrams showing the sectional view of the structure of the forth embodiment of the present invention.",
        "FIG. 5A to 5E are schematic diagrams showing the sectional view of the structure of the fifth embodiment of the present invention.",
        "FIG. 6 is a schematic diagram showing the section view of the chip package structure of a preferred embodiment of the present invention with one die.",
        "FIG. 7 is a schematic diagram showing the section view of the chip package structure of a preferred embodiment of the present invention with a plurality of dies.",
        "FIG. 8 is a magnified diagram showing the sectional view of the chip package structure of a preferred embodiment of the present invention.",
        "FIG. 9A, 9B are schematic diagrams of the top and side view respectively of the patterned wiring layer of the thin-film circuit layer with a passive device.",
        "FIG. 10A is a schematic diagram of the formation of a passive device by a single layer of patterned wiring layer of the thin-film circuit layer.",
        "FIG. 10B is a schematic diagram of the formation of a passive device by a double layer of patterned wiring layer of the thin-film circuit layer.",
        "FIG. 11A is a schematic diagram of the formation of a passive device by a single layer of patterned wiring layer of the thin-film circuit layer.",
        "FIG. 11B is a schematic diagram of the formation of a passive device by a double layer of patterned wiring layer of the thin-film circuit layer.",
        "FIG. 11C is a schematic diagram of the formation of a passive device by a double layer of patterned wiring layer of the thin-film circuit layer.",
        "Please refer to FIG. 1A, an organic substrate 110 with a surface 112 is provided. The material of the organic substrate comprises polymer resin, epoxy resin, imide resin, or the like, plastic, or thermosetting plastic. The fabrication of the organic substrates can be accomplished by existing printed circuit board (PCB) fabrication technique. The method includes heat pressing a plurality of insulating core boards or injection molding to form organic substrate 110.",
        "A plurality of dies 120 having an active surface 122 and a corresponding backside 124 is provided, where the active devices are formed on active surface 122 of dies 120. Furthermore, dies 120 have a plurality of metal pads 126 located on active surface 122 of dies 120 acting as the output terminal of dies 120 to transmit signals to the external circuitry. Backside 124 of dies 120 is adhered to surface 112 of organic substrate 110 by a conductive paste or adhesive tape. Therefore, active surface 122 of dies 120 is facing upwards along surface 112 of organic substrate 110.",
        "Please refer to FIG. 1B, when adhering die 120 to organic substrate 110, a filling layer 130 is formed on top of surface 112 of organic substrate 110 surrounding the peripheral of dies 120 to fill the gap between dies 120. Wherein the top face of filling layer 130 is approximately planar to active surface 122 of dies 120. The material of filling layer 130 can be epoxy, polymer, or the like. After curing of filling layer 130, a grinding or etching process is applied to planarize filling layer 130 so the top face of filling layer 130 is planar to active surface 122 of dies 120.",
        "Please refer to FIG. 1C, after the formation of filling layer 130 on organic substrate 110, a dielectric layer 142 is formed on top of filling layer 130 and active surface 122 of dies 120. Dielectric layer 142 is patterned according to metal pads 126 on dies 120 to form thru-holes 142a. The material of dielectric layer 142 can be poly-Imide (PI), benzocyclobutene (BCB), porous dielectric material, stress buffer material, or the like. Patternization of dielectric layer 142 can be performed by photo via, laser ablation, plasma etching, or the like.",
        "Please continue to refer to FIG. 1C, filling layer 130 is used to support dielectric layer 142 so dielectric layer 142 can be formed planarized on top of organic substrate 110 and dies 120 without an uneven surface. As a result, after dielectric layer 142 is formed on surface 112 of organic substrate 110 and active surface 122 of dies 120, dielectric layer 142 also fills the peripheral of dies 120, meaning the gap between dies 120. Therefore the bottom structure of dielectric layer 142 can replace the structure of filling layer 130 covering entirely surface 112 of organic substrate 110 and surrounding dies 120. The method of forming dielectric layer 142 includes first depositing a layer of dielectric layer 142 entirely over dies 120 and organic substrate 110, then after curing, grinding or etching process is performed to planarize dielectric layer 142.",
        "Please refer to FIG. 1D, after forming dielectric layer 142 and patterning dielectric layer 142 to form thru-holes 142a, a patterned wiring layer 144 is formed on top of dielectric layer 142 by photolithography and sputtering, electroplating, or electro-less plating. Wherein part of the conductive material from patterned wiring layer 144 will be injected into thru-holes 142a to form vias 142b, copper (Cu) is used as the material for patterned wiring layer 144. Moreover, thru-holes 142a can be pre-filled with a conductive material such as a conductive glue to form vias 142b. Therefore no matter if the thru-holes are filled with the conductive material from patterned wiring layer 144 or pre-filled with a conductive material, patterned wiring layer 144 is electrically connected to metal pads 126 of dies 120. It is to be noted that part of patterned wiring layer 144 extends to a region outside active surface 122 of dies 120. Dielectric layer 142 and patterned wiring layer 144 form a thin-film circuit layer 140.",
        "Please refer to FIG. 1E, after the formation of patterned wiring layer 144, another dielectric layer 146 can be formed similarly to dielectric layer 142 on top of dielectric layer 142 and patterned wiring layer 144. Dielectric layer 146 is also patterned to form thru-holes 146a, whereas thru-holes 146a correspond to bonding pads 144a of patterned wiring layer 144.",
        "Please refer to FIG. 1F, after the formation and patternization of dielectric layer 146 to form thru-holes 146a, a patterned wiring layer 148 can be formed on dielectric layer 146 in a similar way as patterned wiring layer 144. Wherein part of the conductive material from patterned wiring layer 148 will be injected into each thru-hole 146a for forming a via 146b. By the same token, patterned wiring layer 148 is electrically connected to patterned wiring layer 144 by vias 146b, and further electrically connected to metal pads 126 of die 120 by vias 142b of thru-hole 142a. Therefore, thin-film circuit layer 140 further comprises dielectric layer 146, a plurality of vias 146b, and patterned wiring layer 148.",
        "Please continue to refer to FIG. 1F, in order to redistribute all metal pads 126 of dies 120 on organic substrate 110, the number of patterned wiring layers (144, 148 . . . ) and dielectric layers (142, 146 . . . ) for electrical insulation may be increased. All patterned wiring layers (144, 148 . . . ) are electrically connected by vias (146b . . . ) of thru-holes (146a . . . ). However if only the first patterned wiring layer 144 is required to entirely redistribute metal pads 126 of dies 120 on organic substrate 110, extra dielectric layers (146 . . . ) and patterned wiring layers (148 . . . ) will no longer be required in the structure. In other words, thin-film circuit layer 140 comprises at least one dielectric layer 142, one patterned wiring layer 144, and a plurality of vias 142b. Wherein patterned wiring layer (144, 148 . . . ) and vias (142b, 146b . . . ) of thin-film circuit layer 140 form an external circuitry of thin-film circuit layer 140.",
        "Please refer to FIG. 1G, after the formation of patterned wiring layer 148, a patterned passivation layer 150 is formed on top of dielectric layer 146 and patterned wiring layer 148. Patterned passivation layer 150 is used to protect patterned wiring layer 148 and expose the plurality of bonding pads 148a of patterned wiring layer 148, whereas some of bonding pads 148a are in a region outside active surface 122 of dies 120. As previously mentioned, the redistribution of metal pads 126 on organic substrate 110 requires multiple layers of patterned wiring layers (144, 148 . . . ) and a patterned passivation layer 150 formed on the very top, which is furthest away from organic substrate 110. However, if only patterned wiring layer 144 is required to redistribute all metal pads 126 of dies 120 on organic substrate 110, patterned passivation layer 150 will be formed directly on patterned wiring layer 144. The material of patterned passivation layer 150 can be anti-solder insulating coating or other insulating material.",
        "Please refer to FIG. 1H, after the formation of patterned passivation layer 150, a bonding point 160 can be placed on bonding pads 148a serving as an interface for electrically connecting dies 120 to the external circuitry. Wherein bonding point 160 illustrated in FIG. 1H is a ball but it is not limited to any formation, which might include a bump, pin, or the like. Wherein ball connector maybe solder ball, and bump connector maybe solder bump, gold bump, or the like.",
        "Please refer to FIG. 1I, after the formation of bonding points 160 on bonding pads 148a, a singularization process of packaged die 120 by mechanical or laser cutting is performed along the dotted line as indicated in the diagram. Afterwards, the chip package structure of the die is completed.",
        "According to the above, the first embodiment of the present invention is a chip package structure with an organic substrate and a plurality of dies on the organic substrate. The external circuitry of the thin-film circuit layer allows the metal pads of the die to fan out. By forming bonding pads corresponding to the metal pads of the dies such as solders balls, bumps, or pins as the signal input terminals, the distance of the signal path is effectively decreased. As a result, signal delay and attenuation are reduced to increase performance of the die.",
        "The present invention uses existing technology on and equipment for fabricating PCB for the fabrication of the organic substrate by heat pressing a plurality of insulating core boards. Alternatively, the organic substrate can also be fabricated in large volume by injection molding. As a result of the low fabrication and material cost of the organic substrate, the cost of chip packaging is also lowered.",
        "The second embodiment of the present invention differs from the first embodiment by having inwardly protruded areas in the organic substrate. This area is for placement of the die with the backside of the die adhered to the bottom of the area so the overall thickness of the chip package structure is reduced. FIG. 2A to 2C are schematic diagrams of the sectional view of the second embodiment illustrating the fabrication of the structure.",
        "Please refer to FIG. 2A, an organic substrate 210 with a surface 212 is provided. In FIG. 2B, a plurality of inwardly protruded areas 214 is formed on surface 212 of organic substrate 210 by machining such as milling. The depth of each inwardly protruded area 214 is approximately equal to the thickness of die 220, therefore the outline and depth of inwardly protruded areas 214 will be the same as dies 220 in FIG. 2C. In FIG. 2C, backside 224 of dies 220 is adhered to the bottom of inwardly protruded areas 214 so dies 220 are inlayed in inwardly protruded areas 214. Active surface 222 of dies 220 is exposed along surface 212 of organic substrate 210.",
        "An alternative method of forming inwardly protruded areas 214 in organic substrate 210 in FIG. 2B is applying the existing technique is fabricating PCB on two core boards: a first organic layer 210a and a second organic layer 210b, as illustrated in FIG. 2D. Organic layer 210a has openings 214a and by overlapping the first organic layer 210a and the second organic layer 210b and heat pressing them together, openings 214a in organic layer 210a will form inwardly protruded areas 214 in organic layer 210b as seen before in FIG. 2B, as illustrated in FIG. 2E. The thickness of organic layer 210a is approximately equal to that of die 220 so the depth of inwardly protruded areas 214 is approximately equal to the thickness of die 220.",
        "The structure of the second embodiment of the present invention after FIG. 2C will follow FIG. 1C to 1I from the first embodiment of the present invention, therefore it will not be repeated.",
        "The second embodiment of the present invention is an organic substrate with a plurality of inwardly protruded areas for inlaying dies by adhering the backside of the dies to the bottom of the inwardly protruded areas and exposing the active surface of the dies. A thin-film circuit layer is formed on top of the dies and the organic substrate to fan out the metal pads of the dies by using the external circuitry of the thin-film circuit layer. Due to the inlay of the dies in the organic substrate, thinning of the thickness of the chip package structure is effectively achieved and the surface of the organic substrate provides enough planarity and support for the formation of the thin-film circuit layer.",
        "The third embodiment of the present invention differs from the second embodiment of the present invention by using an integrated organic substrate with at least one organic layer and one heat conducting layer. FIG. 3A to 3C are schematic diagrams of the sectional view of the third embodiment illustrating the fabrication of the structure.",
        "Please refer to FIG. 3A, an integrated organic substrate 310 consists of an organic layer 310a with multiple openings 314a and a heat conducting layer 310b, wherein the material of heat conducting layer 310b maybe metal. In FIG. 3B, organic layer 310a is placed overlapping heat conducting layer 310b so openings 314a of organic layer 310a form inwardly protruded areas 314 on heat conducting layer 310b. Following in FIG. 3C, backside 324 of die 320 is adhered to the bottom of inwardly protruded areas 314 so dies 320 are inlayed in organic substrate 310 with active surface 322 of die 320 exposed along surface 312 of organic board 310.",
        "The following presents two ways of forming integrated organic substrate 310 with inwardly protruded areas 314 as shown in FIG. 3B. In FIG. 3A, organic layer 310a with openings 314a is provided, openings 314a are formed at the same time when organic layer 310a is formed for example by injection molding. In FIG. 3B, organic layer 310a is overlapped on heat conducting layer 310b so openings 314a of organic layer 310a can form inwardly protruded areas 314 on the surface of heat conducting layer 310b.",
        "The structure of the third embodiment of the present invention after FIG. 3C will follow FIG. 1C to 1I from the first embodiment of the present invention, therefore it will not be repeated.",
        "The third embodiment of the present invention is an integrated organic substrate with an organic layer with a plurality of openings and a heat conducting layer. The openings in the organic layer will form the inwardly protruded areas in the integrated organic substrate. The backside of the die adheres to the bottom of the inwardly protruded areas so the dies are inlayed in the inwardly protruded areas and exposing the active surface of the dies. This integrated organic substrate can efficiently dissipate heat from the dies to the outside because the bottom of the inwardly protruded area is the surface of the heat conducting material. The surface of the organic substrate provides enough planarity and support for the formation of the thin-film circuit layer.",
        "The fourth embodiment of the present invention is slightly different from the first three embodiments. FIG. 4A to 4E are schematic diagrams of the sectional view of the fourth embodiment illustrating the fabrication of the structure.",
        "Please refer to FIG. 4A, an organic substrate 410 with a first surface 412 and a plurality of dies 420 are provided. The dies 420 have an active surface 422, a backside 424, and a plurality of metal pads 426 located on active surface 422. The fourth embodiment of the present invention differs from the third embodiment of the present invention by placing active surface 422 of die 420 downwards facing first surface 412 of organic substrate 410.",
        "Please refer to FIG. 4B, a filling layer 430 is formed on top of first surface 412 of organic substrate 410 after active surface 422 of die 420 is adhered to first surface 412 of organic substrate 410. Filling layer 430 covers entirely first surface 412 of organic substrate 410 and surrounds dies 420. The material of filling layer 430 maybe an oxide, epoxy, or the like.",
        "Please refer to FIG. 4C, after the formation of filling layer 430, a planarization process such as grinding is performed to planarize filling layer 430 and backside 424 of dies 420. Although the thickness of the active devices and traces (not shown) on active surface 422 of die 420 is much less than that of die 420, the thickness of die 420 should not be too small because cracks or damage to the die will occur during machine handling. However the present invention directly adheres active surface 422 of dies 420 to first surface 412 of organic substrate 410 without further machine handling. Afterwards a grinding process is performed on backside 424 of dies 420 to reduce the thickness of dies 420. As a result, dies 420 are ground to a very small thickness allowing the final chip package structure to be much thinner.",
        "Please refer to FIG. 4D, after the planarization of filling layer 430 and dies 420, a second organic substrate 440 with a second surface 442 is adhered to filling layer 430 and dies 420 creating a sandwich effect with filling layer 430 and dies 420 in between two organic substrates 410 and 440.",
        "Please refer to FIG. 4E, after the adhesion of second organic substrate 440, a grinding or the like process is performed to thin the backside of organic substrate 410 to achieve a thickness of about 2 microns to 200 microns, usually about 20 microns. First organic substrate 410 is used to provide a planar surface for dies 420 to adhere to and to serve as an insulating layer. Therefore organic substrate 410 can be replaced by substrate made of glass or other organic material.",
        "Please refer to FIG. 4F, after the thinning of first organic substrate 410, a plurality of first thru-holes 410a are formed on first organic substrate 410 for exposing metal pads 426 on active surface 422 of die 420. First thru-holes 410a can be formed by machine drilling, laser, plasma etching, or similar methods.",
        "Please refer to FIG. 4G, a first patterned wiring layer 450 is formed on first organic substrate 410. Using the same method disclosed in the first embodiment of the present invention, first vias 410b in first thru-holes 410a are formed by either filling first thru-holes 410a with part of the conductive material from patterned wiring layer 450 or pre-filling first thru-holes 410a with a conductive material before the formation of patterned wiring layer 450. A part of patterned wiring layer 450 will extend to a region outside active surface 422 of die 420.",
        "Please refer to FIG. 4H, a dielectric layer 462 is formed on first organic substrate 410 and first patterned wiring layer 450. Wherein dielectric layer 462 is patterned to form a plurality of second thru-holes 462a, which correspond to bonding pad 450a of patterned wiring layer 450.",
        "Please refer to FIG. 41, a second patterned wiring layer 464 is formed on top of dielectric layer 462. Using the same method as above, second vias 462b in thru-holes 462a can be formed by either filling second thru-holes 462a with part of the conductive material from patterned wiring layer or pre-filling second thru-holes 462a with a conductive material before the formation of patterned wiring layer 464. Similarly, in order to redistribute metal pads 426 of dies 420 on second organic substrate 440, dielectric layer (462 . . . ), second vias (462a . . . ), and second patterned wiring layer (464 . . . ) can be repeatedly formed on dies 420 and organic substrate 440. Wherein first organic substrate 410, first patterned wiring layer 450, dielectric layer 462 . . . , and second patterned wiring layer 464 . . . form thin-film circuit layer 460. First vias 410b, first patterned wiring layer 450, second vias 462b . . . , and second patterned wiring layer 464 from the external circuitry of thin-film circuit layer 460.",
        "The structure of the fourth embodiment of the present invention after FIG. 41 will follow FIG. 1G to 1I from the first embodiment of the present invention, therefore it will not be repeated.",
        "The fourth embodiment of the present invention is an organic substrate with the active surface of the dies adhered directly to the surface of the first organic substrate. A filling layer is formed over the dies and the organic substrate followed by a planarization and thinning process. Afterwards, a second organic substrate is adhered to the die and the filling layer. A thinning process of the first organic substrate is performed and a plurality of thru-holes filled with conductive material are formed on the first organic substrate. Finally a patterned wiring layer is formed on the first organic substrate allowing the external circuitry of the thin-film circuit layer to extend to a region outside the active surface of the die to help fan out the metal pads of the die.",
        "The advantage of this structure is increased surface stability and accuracy because the active surface of the dies are first adhered to the surface of the first organic substrate. The thickness of the die can be very small for reducing the overall thickness of the chip package because no machine handling of dies is required.",
        "The fifth embodiment of the present invention takes the first half of the fabrication process from the fourth embodiment of the present invention and combines with the second half of the fabrication process from the first embodiment of the present invention. FIG. 5A to 5E are schematic diagrams of the sectional view illustrating the fabrication of the structure.",
        "Please refer to FIG. 5A, an active surface 522 of dies 520 is adhered to a first surface 512 of a first organic substrate 510. In FIG. 5B, a filling layer 530 is formed on top of dies 520 and first organic substrate 510 covering dies 520. In FIG. 5C, a planarization and thinning process of dies 520 and filling layer 530 is performed to planarize backside 524 of dies 520 and filling layer 530. In FIG. 5D, a second organic substrate 540 is formed on top of dies 520 and filling layer 530 so backside 524 of dies 520 adheres to second organic substrate 540. By removing filling layer 530 and first organic substrate 510, the metal pads on active surface 522 of dies 520 are exposed. First organic substrate 510 is used to supply a planarized surface (first surface 512), and will be removed in later stages of the fabrication process. Therefore first organic substrate 510 can be replaced by substrates of other materials such as glass, metal, silicon, or other organic material.",
        "The structure of the fifth embodiment of the present invention after FIG. 5E will follow FIG. 1B to 1I of the first embodiment of the present invention, therefore it will not be repeated.",
        "The fifth embodiment of the present invention is an organic substrate with the active surface of the dies adhered to the surface of the first organic substrate for allowing high surface stability and accuracy. As a result, it eliminates the need of machine handling of the dies to achieve a very small thickness of the die for reducing the overall thickness of the chip package.",
        "Furthermore, please refer to FIG. 6, it illustrates the schematic diagram of the sectional view of the chip package structure 600 of the present invention for a single die 620. Die 620 is placed on organic substrate 610, and a thin-film circuit layer 640 is formed on top of die 620 and organic substrate 610. External circuitry 642 of thin-film circuit layer 640 has at least has one patterned wiring layer 642a and a plurality of vias 642b. The thickness of the inner traces inside die 620 is usually under 1 micron, but because the high amount of traces collocated together so RC delay is relatively high and the power/ground bus requires a large area. As a result, the area of die 620 is not enough to accommodate the power/ground bus. Therefore the chip package structure 600 uses thin-film circuit layer 640 and external circuitry 642 with wider, thicker, and longer traces to alleviate the problem. These traces act an interface for transmitting signals for the internal circuitry of die 620 or the power/ground bus of die 620. This will improve the performance of die 620.",
        "Please refer to FIG. 8, it illustrates a magnified view of the sectional view of the chip package structure of the present invention. Active surface 622 of die 620 has a plurality of active devices 628a, 628b, and an internal circuitry 624. The internal circuitry 624 forms a plurality of metal pads 626 on the surface of die 620. Therefore signals are transmitted from active devices 628a to external circuitry 642 via internal circuitry 624 of die 620, and from external circuitry 642 back to another active device 628b via internal circuitry 624. The traces of external circuitry 642 are wider, longer, and thicker than that of internal circuitry 624 for providing an improved transmission path.",
        "Please continue to refer to FIG. 6, external circuitry 642 further comprises at least one passive device 644 including a capacitor, an inductor, a resistor, a wave-guide, a filter, a micro electronic mechanical sensor (MEMS), or the like. Passive device 644 can be located on a single layer of patterned wiring layer 642a or between two layers of patterned wiring layers 642a. In FIG. 9A, 9B, passive device 644 can be formed by printing or other method on two bonding points on patterned wiring layer 642a when forming thin-film layer 640. In FIG. 10A, a comb-shape passive device 644 (such as a comb capacitor) is formed directly on a single patterned wiring layer. In FIG. 10B, passive device 644 (such as a capacitor) is formed between two layers of patterned wiring layers 642a with an insulating material 646 in between. Wherein the original dielectric layer (not shown) can replace insulating material 646. In FIG. 11A, passive device 644 (such as an inductor) is formed by making a single layer of patterned wiring layer 642a into a circular or square (not shown) spiral. In FIG. 11B, column-shape passive device 644 (such as an inductor) is formed by using two layers of patterned wiring layers 642a and a plurality of vias 642b to surround an insulating material 646 forming a column. In FIG. 11C, circular-shaped passive device 644 (such as an inductor) is formed by using slanted traces from two layers of patterned wiring layers and a plurality of vias 642b to surround an insulating material 646 in a circular manner forming a pie. The above structures allow the original externally welded passive devices to be integrated into the inside of the chip package structure.",
        "FIG. 6 illustrates a chip package structure 600 for a single die 620 but FIG. 7 illustrates a chip package structure 700 for a plurality of dies. Chip package structure 700 in FIG. 7 differs from chip package structure 600 in FIG. 6 by having a die module 720, which comprises at least one or more dies such as die 720a, 720b. Die 720a, 720b are electrically connected by the external circuitry of the thin-film circuit layer. The function of die 720a, 720b can be the same or different and can be integrated together by external circuitry 742 to form a multi-die module (MCM) by packaging same or different dies into one chip package structure. When multiple dies are packaged into the same chip package structure, singulation process is performed on the determined number of dies.",
        "Following the above, the present invention provides a chip packaging method by adhering a die to an organic substrate or to an inwardly protruded area of an organic substrate, and forming a thin-film circuit layer with bonding pads and points above the die and organic substrate. This structure can fan out the metal pads on the die to achieve a thin chip package structure with high pin count.",
        "Comparing to the BGA or PGA package technique used in the prior art, the chip package of the present invention is performed directly on the die and the organic substrate for fanning out the metal pads on the die. It does not require flip chip or wire bonding to connect the die to the micro-spaced contact points of a package substrate or carrier. The present invention can reduce cost because the package substrate with micro-spaced contacts is very expensive. Moreover the signal transmission path of the present invention is reduced to lessen the effect of signal delay and attenuation, which improves the performance of the die.",
        "FIG. 6 illustrates a chip package structure 600 for a single die 620 but FIG. 7 illustrates a chip package structure 700 for a plurality of dies. Chip package structure 700 in FIG. 7 differs from chip package structure 600 in FIG. 6 by having a die module 720, which comprises at least one or more dies such as die 720a, 720b mounted on an organic substrate 710. External circuity 742 of thin-film circuit layer 740 has at least has one patterned wiring layer 742a and a plurality of vias 742b. Die 720a, 720b are electrically connected by the external circuitry 742 of the thin-film circuit layer 740. The function of die 720a, 720b can be the same or different and can be integrated together by external circuitry 742 to fonn a multi-die module (MCM) by packaging same or different dies into one chip package structure. When multiple dies are packaged into the same chip package structure, singulation process is performed on the determined number of dies.",
        "Furthermore, the third embodiment of the present invention provides an integrated substrate comprises an organic layer and a heat conducting layer. A plurality of openings can be pre-formed on the organic layer so inwardly protruded areas are formed for inlaying the die when the organic layer overlaps the heat conducting layer. The heat conducting layer helps to dissipate heat to the outside from the die during operation, which will effectively increase performance.",
        "The thin-film layer circuit of the present invention is used to transmit signals between two main active devices inside the die, used as a power/ground bus, or used to add in passive devices. Furthermore, the chip package structure of the present invention can accommodate one or more dies with similar or different functions. The external circuitry of the thin-film circuit layer electrically connects the multiple dies together and can be used in a MCM package. The chip package structure of the present invention adapts the MCM, the external circuitry of the thin-film circuit layer, the passive devices of the external circuitry to form a package that is called “system in package”.",
        "It will be apparent to those skilled in the art that various modifications and variations can be made to the structure of the present invention without departing from the scope or spirit of the invention. In view of the foregoing, it is intended that the present invention cover modifications and variations of this invention provided they fall within the scope of the following claims and their equivalents."
    ],
    "citations": [
        "5250843",
        "5324687",
        "5353498",
        "5565706",
        "5841193",
        "5874770",
        "6110806",
        "6121688",
        "6271469",
        "6396148",
        "6555908",
        "6673698",
        "6746898",
        "6800941",
        "2001/0021541",
        "2002/0070443",
        "2002/0074641",
        "2002/0137263",
        "2002/0158334",
        "1094511"
    ],
    "us_classification": "438459",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "L",
            "main_group": "21",
            "subgroup": "46"
        }
    ]
}