{
    "title": "Semiconductor light-emitting device and method for manufacturing the device",
    "abstract": "A semiconductor light-emitting device has a pair of leads placed in parallel, a light-emitting element on the upper end of one lead, a bonding wire for electrically connecting the semiconductor light-emitting element of the upper end of another lead, and an envelope formed from a light-transmitting resin for sealing the semiconductor light-emitting element, the bonding wire, and the upper end of the leads, provided with a non-circular lateral cross-sectional surface structure with a long axis and a short axis. In the device, when observed along a direction in which the plurality of light-emitting devices are mounted on a same lead frame, a curvature of the lateral direction of said envelope is smaller than a curvature of the vertical direction of said envelope.",
    "inventors": [
        "Komoto",
        "Tanaka",
        "Fujimura"
    ],
    "document_number": "07297984",
    "publication_date": "20071120",
    "assignees": [
        "Kabushiki Kaisha Toshiba"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A semiconductor light-emitting device, comprising:",
            "components": [
                {
                    "component": "leads arranged side by side;",
                    "subcomponents": []
                },
                {
                    "component": "a light-emitting element mounted on one of the leads arranged side by side; and",
                    "subcomponents": []
                },
                {
                    "component": "an envelope made of light-transmitting resin and sealing part of the leads and the light-emitting element,",
                    "subcomponents": []
                },
                {
                    "component": "a shape of a horizontal section of the envelope perpendicular to a longitudinal direction of the leads being a shape formed by partly cutting an ellipse along a long axis thereof, a short axis of the ellipse being parallel to a side-by-side arranging direction of the leads, and",
                    "subcomponents": []
                },
                {
                    "component": "a shape of a light emitting face on a vertical section of the envelope parallel to the longitudinal direction of the leads and parallel to the side-by-side arranging direction of the leads being substantially a U-shape.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The semiconductor light-emitting device of claim 1 , wherein:",
            "components": [
                {
                    "component": "the leads arranged side by side are of a lead group that is among lead groups formed on a lead frame in a longitudinal direction of the lead frame and is separated from the lead frame.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This is Divisional Application of prior U.S. application Ser. No. 11/481,919, filed Jul. 7, 2006, which is a divisional application of U.S. patent application Ser. No. 10/947,142, filed Sep. 23, 2004, (now U.S. Pat. No. 7,094,619, issued Aug. 22, 2006) which is a continuation application of U.S. patent application Ser. No. 10/686,582, filed Oct. 17, 2003 (now U.S. Pat. No. 6,808,950, issued Oct. 26, 2004), which is a continuation of U.S. application Ser. No. 09/019,158, filed Feb. 5, 1998 (now U.S. Pat. No. 6,677,614 B1, issued Jan. 13, 2004), which is a divisional application of U.S. patent application Ser. No. 08/720,819, filed Oct. 2, 1996 (now U.S. Pat. No. 5,763,901, issued Jun. 9, 1998), which is a continuation of U.S. application Ser. No. 08/495,832, filed Jun. 28, 1995 (abandoned), which is a continuation of U.S. application Ser. No. 08/166,035, filed Dec. 14, 1993 (abandoned), all of which are incorporated herein by reference.",
        "1. Field of the Invention",
        "The present invention relates to a semiconductor light-emitting device and to a method for manufacturing such a device, and, in particular, to the shape of an envelope for enclosing the semiconductor light-emitting device.",
        "2. Description of the Prior Art",
        "A manufacturing process for a conventional semiconductor light-emitting device will now be explained.",
        "FIG. 1, FIGS. 2A and 2B, FIGS. 3A and 3B, and FIGS. 4A, 4B are diagrams illustrating this manufacturing process. FIG. 1 is a diagram showing a plurality of semiconductor light-emitting elements mounted on and bonded to a lead frame.",
        "FIG. 2A is a view of the upper surface of an envelope adjusting jig.",
        "FIG. 2B is a longitudinal cross-section viewed along the line IIB-IIB′ in FIG. 2A.",
        "FIG. 3A is an upper surface view showing conditions after shape of the envelopes. FIG. 3B is a longitudinal cross-section viewed along the line IIIB-IIIB′ in FIG. 3A.",
        "FIG. 4A is a view of the upper surface of a completed conventional semiconductor light-emitting device. FIG. 4B is a longitudinal cross-section viewed along the line IVB-IVB′ in FIG. 4A.",
        "In FIG. 1, the reference numeral 8 designates a lead frame. A lead group made up of a pair of leads 9, 9′ is formed at a uniform spacing in the longitudinal direction of the lead frame 8. For example, the uniform spacing between adjacent lead groups is approximately 6 to 7 mm and the leads 9, 9′ are made up of Fe wires.",
        "In FIG. 2A, the reference numeral 12 designates an envelope adjusting jig. A plurality of cavities 13 with circular lateral cross-sections and almost U-shaped longitudinal cross-sections is positionally arranged in a straight line at the same spacing as the lead groups on the lead frame.",
        "First of all, as shown in FIG. 1, a semiconductor light-emitting element 10 is mounted on the upper end of one of the leads 9 in each of the lead groups on the lead frame 8. The upper surface of the semiconductor light-emitting element 10 and the other lead 9′ are electrically connected by a bonding wire 11.",
        "Next, a light-transmitting resin such as a liquid mixture of epoxy resin, the leis filled into the cavities 13 of the envelope adjusting jig 12 shown in FIGS. 2A and 2B, then the lead groups of the lead frame 8 are inserted into the respective cavities 13 and the light-transmitting resin is thermally cured.",
        "As shown in FIGS. 3A and 3B, the mounted section of the semiconductor light-emitting element 10 of the lead groups and the upper end section of the bonding wire 11 and the leads 9, 9′ are sealed in an envelope 14 formed by the light-transmitting resin. Subsequently, as shown in FIGS. 4A and 4B, each of the lead groups is separated from the lead frame 8 at the part shown by the broken lines in FIG. 3B with a cutter to complete the semiconductor light-emitting device.",
        "Recently, there have been demands for semiconductor light-emitting devices with a high output. Also, it is commonly known that the diameter 14D of the light-emitting device 14 should be made as large as possible to successfully obtain high output.",
        "However, for good production efficiency in this manufacturing method for the conventional semiconductor light-emitting device, the spacing between the lead groups is set so that it is possible to form about 10 to 30 semiconductor light-emitting devices using one lead frame, and, in addition, the diameter 13D of the envelope depends on the spacing of the lead groups on the lead frame. For this reason, there is the problem that even when it is desired to increase the diameter of the envelope to obtain high output, this diameter is limited by the spacing of the lead groups. In addition, when the spacing of the lead groups is increased to provide an envelope with a large diameter, the number of semiconductor light-emitting devices obtained from one lead frame is reduced. This results in the problem of poor production efficiency.",
        "Accordingly, an object of the present invention is, with due consideration to the drawbacks of such conventional devices, to provide a semiconductor light-emitting device from which high output can be obtained by increasing the spacing between the lead groups on a lead frame, and to provide a method for manufacturing such a semiconductor light-emitting device.",
        "The present invention provides a semiconductor light-emitting device, as one of preferred embodiments, formed on a same lead frame on which a plurality of semiconductor light-emitting devices are formed in a straight line at a uniform spacing, said each semiconductor light-emitting device comprising:",
        "a plurality of lead means placed in parallel;",
        "semiconductor light-emitting means mounted on the upper end of one of said leads;",
        "bonding wire means for electrically connecting the semiconductor light-emitting means and the upper end of another lead means with a long axis and a short axis; and",
        "envelope means formed from a light-transmitting resin for sealing said semiconductor light-emitting means, said bonding wire, and the upper end of said lead, provided with a non-circular lateral cross-sectional surface structure,",
        "wherein when observed along a direction in which the plurality of light-emitting devices are mounted on the same lead frame, a curvature of the lateral direction of said envelope is smaller than a curvature of the vertical direction of said envelope.",
        "In the semiconductor light-emitting device above, for the lateral cross-section of said envelope is shaped by being cut one part of said envelop in a straight line along the direction in which the plurality of light-emitting devices are mounted on the same lead frame.",
        "In addition, the lateral cross-sectional shape of said envelop means is an ellipse shape in the semiconductor light-emitting device described above as a preferred embodiment.",
        "Moreover, the number of said lead means is two, and the number of said semiconductor light-emitting means is one in the semiconductor light-emitting device described above as a preferred embodiment.",
        "Furthermore, the number of said lead means is three, and the number of said semiconductor light-emitting means is two in the semiconductor light-emitting device described above as a preferred embodiment.",
        "The present invention also provides a manufacturing process for a semiconductor light-emitting device, as another preferred embodiment, formed on a plurality of lead frames, on each of the lead frames a plurality of semiconductor light-emitting devices are formed, comprising steps of:",
        "a process for forming the lead frame with a plurality of groups of side-by-side leads positioned in a straight line at a uniform spacing;",
        "a process for forming an envelope adjusting jig whereon cavities at a plurality of points are positioned on the non-circular lateral cross-sectional surface structure, with a long axis and a short axis, so that when observed along a direction in which the plurality of light-emitting devices are formed on the same lead frame, a curvature of the lateral direction of said each envelope in the same lead frame is smaller than a curvature of the vertical direction of said each envelope, and the short axis is positioned on a straight line at a spacing which is the same spacing as the group of leads;",
        "a process for mounting the semiconductor light-emitting element on the upper end of one lead of the group of leads and for connecting the semiconductor light-emitting element and the upper ends of the other leads of the group of leads with bonding wires;",
        "a process for filling the light-transmitting resin into the cavities of the envelope adjusting jig;",
        "a process for immersing the semiconductor light-emitting element, the bonding wire, and the upper end of the leads in the light-transmitting resin in the cavities and sealing this part with the light-transmitting resin; and",
        "a process for removing the lead frame from the envelope adjusting jig and separating each group of leads from the lead frame.",
        "In the manufacturing process for a semiconductor light-emitting device described above, further comprising a process for offsetting the lead frames alternately at a suitable length only, so that the lead frames are respectively parallel.",
        "These and other objects, features, and advantages of the present invention will become more apparent from the following description of the preferred embodiments taken in conjunction with the accompanying drawings, in which:",
        "FIG. 1 is a cross sectional diagram showing a semiconductor light-emitting element mounted on and bonded to a lead frame in a conventional example.",
        "FIGS. 2A and 2B are views of a conventional envelope adjusting jig. FIG. 2A is a view of the upper surface of the adjusting jig. FIG. 2B is a longitudinal cross section viewed along the line IIB-IIB′ in FIG. 2A.",
        "FIGS. 3A and 3B are diagrams showing the conditions after shape of the envelopes in a conventional device. FIG. 3A is a view of the upper surface of the adjusting jig. FIG. 3B is a longitudinal cross section viewed along the line IIIB-IIIB′ in FIG. 2A.",
        "FIGS. 4A and 4B are diagrams illustrating a completed conventional semiconductor light-emitting device. FIG. 4A is a view of the upper surface of the conventional semiconductor light-emitting device. FIG. 4B is a cross sectional view of the conventional semiconductor light-emitting device shown in FIG. 4A along the line IVB-IVB′ in FIG. 4A.",
        "FIG. 5 is a diagram showing a semiconductor light-emitting element mounted on and bonded to a lead frame.",
        "FIGS. 6A and 6B are diagrams illustrating a first embodiment of an envelope adjusting jig of the present invention. which is used to form the semiconductor light-emitting element of the present invention along the line VIB-VIB′ in FIG. 6A.",
        "FIG. 7 is a general diagram of a process for sealing the semiconductor light-emitting element, metal wiring, and the upper section of a lead with resin.",
        "FIGS. 8A and 8B are diagrams showing the conditions after shape of the envelopes in the first embodiment of the present invention. FIG. 8A is a view of the upper surface of the semiconductor light-emitting device. FIG. 8B is a longitudinal cross section viewed along the line VIIIB-IIIVB′ in FIG. 8A.",
        "FIGS. 9A and 9B are diagrams illustrating a completed first embodiment of the semiconductor light-emitting device of the present invention. FIG. 9A is a view of the upper surface of the semiconductor light-emitting device of the present invention. FIG. 9B is a cross sectional view of the semiconductor light-emitting device shown in FIG. 9A.",
        "FIGS. 10A and 10B are diagrams showing the conditions after shape of the envelopes in a second embodiment of the present invention. FIG. 10A is a view of the upper surface of the semiconductor light-emitting device of the second embodiment of the present invention. FIG. 10B is a cross sectional view of the semiconductor light-emitting device shown in FIG. 10A along the line XB-XB′ in FIG. 10A.",
        "FIGS. 11A and 11B are diagrams showing the conditions after shape of the envelopes in a third embodiment of the present invention. FIG. 11A is a view of the upper surface of the semiconductor light-emitting device of the third embodiment of the present invention. FIG. 10B is a cross sectional view of the semiconductor light-emitting device shown in FIG. 11A along the line XIB-XIB′ in FIG. 11A.",
        "FIG. 12 is a view of the upper surface of a fourth embodiment (envelope adjusting jig) of the present invention.",
        "FIGS. 13A and 13B are diagrams showing the conditions after shape of the envelopes in a fourth embodiment of the present invention. FIG. 13A is a view of the upper surface of the semiconductor light-emitting device of the fourth embodiment of the present invention. FIG. 13B is a cross sectional view of the semiconductor light-emitting device shown in FIG. 13A along the line XIIIB-XIIIB′ in FIG. 13A.",
        "Other features of this invention will become apparent in the course of the following description of exemplary embodiments which are given for illustration of the invention and are not intended to be limiting thereof.",
        "First of all, we will describe the features of the resent invention for clearly understanding.",
        "The lateral cross-section of the envelope for a semiconductor light-emitting device of the present invention has a long axis 601 and a short axis 602 and has a non-circular shape symmetrical around these axes 601 and 602, as shown in FIGS. 6A and 6B.",
        "By positioning the short axis 602 so that it is parallel to the longitudinal direction of the lead frame 1 shown in FIGS. 8A and 8B, and by positioning the long axis 601 so that it is perpendicular to the short axis 602. it is possible to lengthen the long axis 601 without changing the spacing of the lead groups on the lead frame 1.",
        "It is therefore possible to provide a large area as compared to a circle in which the length of the short axis 802 is the diameter, therefore the external efficiency of the light-emitting element is improved and the output of light emitted from the semiconductor light-emitting device can be increased.",
        "In addition, as shown in FIG. 12, by arranging lead frames 120 and 121 in parallel stages and offsetting these envelopes 126 and 127 alternately in the longitudinal direction, it is possible to make the long axis longer than the spacing “L” of the lead frames 120 and 121, thus increasing the light output.",
        "A first embodiment of the present invention will now be explained with reference to FIG. 5 to FIGS. 9A and 9B.",
        "FIG. 5 is a diagram showing a semiconductor light-emitting element mounted on and bonded to a lead frame.",
        "FIG. 6A is a diagram showing the upper surface of a first embodiment of an envelope adjusting jig of the present invention.",
        "FIG. 6B is a longitudinal cross-section viewed along the line VIB-VIB′ in FIG. 6A.",
        "FIG. 7 is a general diagram of a process for sealing the semiconductor light-emitting element, metal wiring, and the upper section of a lead with resin.",
        "FIG. 8A is a view showing the upper surface after shape of the envelopes in the first embodiment of the present invention.",
        "FIG. 8B is a longitudinal cross-section viewed along the line VIIIB-VIIIB′ in FIG. 8A.",
        "FIG. 9A is a diagram showing the upper surface of a completed first embodiment of the semiconductor light-emitting device of the present invention. FIG. 9B is a longitudinal cross-section viewed along the line IXB-IXB′ in FIG. 9A.",
        "In FIG. 5, the reference numeral 1 designates a lead frame. A plurality of lead groups, each made up of a pair of leads 2, 2′, is formed at a uniform spacing in the longitudinal direction of the lead frame 1.",
        "In FIG. 6A, the reference numeral 5 designates an envelope adjusting jig. A plurality of cavities 6 with circular lateral cross-sections and almost U-shaped longitudinal cross-sections is positionally arranged in a straight line at the same spacing as the lead groups on the lead frame.",
        "In each lead group 2, 2′, as shown in FIG. 7, a concave section is provided in a thick section of the upper end of the one lead 2, and a semiconductor light-emitting element 3 is mounted, using a conductive adhesive, on the bottom of this concave section.",
        "An adhesive temperature of 200° C. to 300° C. is used at this time. Then, the semiconductor light-emitting element 3 and the upper end of the other lead 2′ are electrically connected by a metal wire 4.",
        "Next, as illustrated in FIG. 7, the cavities 6 of the envelope adjusting jig 5 in FIGS. 6A and 6B are filled with a light-transmitting resin (a liquid mixture of epoxy resin and a curing agent), the lead groups are immersed in the light-transmitting resin in the cavities 6 in the envelope adjusting jig 5, and placed for two to some tens of hours in an oven maintained at 100° C. to 130° C., for curing.",
        "As illustrated in FIG. 7, the semiconductor light-emitting element 3, the metal wire (for example, Fe wire), and the upper section of the lead group are immersed into the above-mentioned liquid mixture.",
        "After thermal curing, the lead groups are separated from the envelope adjusting jig 5, and the lead groups are completely cut away from the lead frame 1 at the dotted line in FIG. 8B.",
        "In the above-described first embodiment of the semiconductor light-emitting device and method for manufacturing the device, as shown in FIGS. 5 to 9A and 9B, the envelope is shaped as an ellipse.",
        "By making the length of the short axis 602 of the lateral cross-section of the ellipse equal to the diameter 13D of the circle of the envelop shown in FIG. 2A, it is possible to produce the same number of semiconductor light-emitting devices from one lead frame as in the conventional example.",
        "When comparing the output of light for the conventional example and for this embodiment, for the area of the lateral cross-section IXB-IXB′ shown in FIGS. 9A and 9B, the length of the short axis 902 of the ellipse, which is the cross-sectional shape of the envelope of this embodiment, and the length of the diameter 902 of the circle shown by the dotted line 903 in FIG. 9A, which is the cross-sectional shape of the envelope 13 of the conventional example shown in FIGS. 2A and 2B, are the same, therefore the length of the long axis 901 of the ellipse of this embodiment is larger.",
        "When the cross-sectional area of the envelope is large, it is possible to consider the semiconductor light-emitting element as a point light-emitting source of no magnitude.",
        "For this reason, the light-emitting element 3 can be positioned at an optically ideal geometrical position, so that remarkably improved light condensing characteristics can be provided, and the ratio of the light passing through the interior of the resin which is reflected from the surface 97 of the light-transmitting resin shown in FIG. 9B is low.",
        "Accordingly, the external light-emitting efficiency is improved, and a semiconductor light-emitting device is obtained with a higher than conventional output.",
        "Other preferred embodiments of the present invention will now be explained with reference to the drawings.",
        "FIGS. 10A and 10B are diagrams showing a second embodiment of the present invention.",
        "FIGS. 11A and 11B are diagrams showing a third embodiment of the present invention.",
        "Parts which are identical or which correspond to the parts in the first embodiment have been designated by the same reference numerals as in the first embodiment so a further detailed explanation has been omitted.",
        "Specifically, in the second embodiment shown in FIGS. 10A and 10B, the lateral cross-sectional shape of the envelope is that of a circle of which part is cut off along the long axis.",
        "Also, in the third embodiment shown in FIGS. 11A and 11B, the lateral cross-sectional shape of the envelope is that of an ellipse of which part is cut off along the long axis.",
        "The shapes of these envelopes are obtained by using envelope adjusting jigs with cavities provided with the desired cross-sectional shapes.",
        "The same effect is obtained in each of these two embodiments as in the first embodiment.",
        "A fourth embodiment of the present invention will now be explained with reference to FIG. 12.",
        "FIG. 12 is a view of the envelope adjusting jigs of FIGS. 6A and 6B with these jigs arranged in two rows so that the jigs in the lower row are alternately offset and positioned at the midpoint of the spacing of the jigs in the upper row in the longitudinal direction.",
        "By this arrangement, the lateral cross-section is even longer in the long axis direction as a result of the displacement of the cavities in the longitudinal direction, and, specifically, a semiconductor light-emitting device with a higher output is obtained.",
        "In addition, even if the cross-sectional shape is unchanged, it is possible to pack the cavity spacing in the longitudinal direction so that more lead frames can be arranged in the same amount of space. Accordingly, the production efficiency can be improved.",
        "FIG. 13A is a view of the upper surface of the semiconductor light-emitting device as the fifth embodiment according to the present invention.",
        "FIG. 13B is a longitudinal cross section viewed along the line XIII-XIIIB′ in FIG. 13A.",
        "This invention is not limited to the above embodiments. The present invention can be applicable to another semiconductor light-emitting elements, for example, to a semiconductor light-emitting device having three leads 21, 22, and 23, as shown in FIGS. 13A and 13B.",
        "Although, each light-emitting device as the fifth embodiment has a pair of semiconductor light-emitting elements, it is also possible to obtain a semiconductor light-emitting device with a higher output than that of a conventional device without changing the number of semiconductor light-emitting devices obtained from one lead frame.",
        "By means of the present invention, it is possible to obtain a semiconductor light-emitting device with a higher output than that of a conventional device without changing the number of semiconductor light-emitting devices obtained from one lead frame.",
        "Also, by mean of the present invention, if the output from a semiconductor light-emitting device is kept the same, it is possible to increase the number of semiconductor light-emitting devices obtained from one lead frame, therefore the production efficiency is improved. In addition the size of the jigs can be reduced."
    ],
    "citations": [
        "3609475",
        "3694902",
        "3764862",
        "5321305",
        "5763901",
        "6677614",
        "6808950",
        "50-146362",
        "55-70079",
        "55-105390",
        "57-68088",
        "58-56483",
        "58-66373",
        "58-68992",
        "59-72185",
        "60-98688",
        "62-76577",
        "63-129680",
        "1-32688",
        "1-266771",
        "2-29686",
        "2-52463",
        "3-171681",
        "5-90644",
        "5-327029",
        "61-112534"
    ],
    "us_classification": "257 81",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "L",
            "main_group": "27",
            "subgroup": "15"
        }
    ]
}