{
    "title": "Group III-V crystal and manufacturing method thereof",
    "abstract": "A method of manufacturing a group III-V crystal is made available by which good-quality group III-V crystals are easily obtained at low cost without causing cracks, even when using a variety of substrates. A method of manufacturing a group III-V crystal, characterized in including: a step of depositing a metal film (",
    "inventors": [
        "Nakahata",
        "Uematsu",
        "Hirota"
    ],
    "document_number": "07297625",
    "publication_date": "20071120",
    "assignees": [
        "Sumitomo Electric Industries, Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of manufacturing a crystal of a group III-V compound, the method comprising:",
            "components": [
                {
                    "component": "a deposition step of depositing a metal film on a substrate;",
                    "subcomponents": []
                },
                {
                    "component": "a heat-treatment step of heat-treating the metal film under an atmosphere in which a metal-film patterning compound is present so that the metal film becomes patterned with a plurality of grooves having an indefinite shape, the grooves having an average width of 2 nm to 5000 nm, the metal film having an aperture fraction of 5% to 80%, the aperture fraction being the percentage of the surface area that the grooves occupy with respect to the substrate total surface area; and",
                    "subcomponents": []
                },
                {
                    "component": "a growth step of growing a group III-V crystal on the post-heat-treated metal film.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A method of manufacturing a crystal of a group III-V compound, the method comprising:",
            "components": [
                {
                    "component": "a deposition step of depositing a metal film on a substrate;",
                    "subcomponents": []
                },
                {
                    "component": "a heat-treatment step of heat-treating the metal film under an atmosphere in which a metal-film patterning compound is present so that the metal film becomes patterned with a plurality of grooves having an indefinite shape, the grooves having an average width of 2 nm to 5000 nm, the metal film having an aperture fraction of 5% to 80%, the aperture fraction being the percentage of the surface area that the grooves occupy with respect to the substrate total surface area;",
                    "subcomponents": []
                },
                {
                    "component": "a first growth step of growing a group III-V compound buffer film on the post-heat-treated metal film; and",
                    "subcomponents": []
                },
                {
                    "component": "a second growth step of growing a group III-V crystal on the group III-V compound buffer film.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A group III-V crystal manufacturing method as set forth in claim 1 , characterized in that the substrate is silicon, sapphire, SiC, ZrB",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A group III-V crystal manufacturing method as set forth in claim 1 , characterized in that the metal film contains titanium or vanadium.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A group III-V crystal manufacturing method as set forth in claim 1 , wherein the method renders the thickness of the metal film to be 10 nm to 100 nm.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A group III-V crystal manufacturing method as set forth in claim 1 , characterized in that the heat treatment is carried out at 800° C. to 1200° C. for 0.5 minutes to 20 minutes.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A group III-V compound crystal manufactured by a group III-V crystal manufacturing method as set forth in claim 1 .",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A group III-V compound crystal as set forth in claim 7 , wherein the group III-V crystal is Ga",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A group III-V crystal manufacturing method as set forth in claim 2 , characterized in that the substrate is silicon, sapphire, SiC, ZrB",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A group III-V crystal manufacturing method as set forth in claim 2 , characterized in that the metal film contains titanium or vanadium.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A group III-V crystal manufacturing method as set forth in claim 2 , wherein the method renders the thickness of the metal film to be 10 nm to 100 nm.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A group III-V crystal manufacturing method as set forth in claim 2 , characterized in that the heat treatment is carried out at 800° C. to 1200° C. for 0.5 minutes to 20 minutes.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A group III-V compound crystal manufactured by a group III-V crystal manufacturing method as set forth in claim 2 .",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A group III-V compound crystal as set forth in claim 13 , wherein the group III-V crystal is Ga",
            "components": []
        }
    ],
    "description": [
        "This application is a 371 of PCT/JP04/04811 filed on Apr. 1, 2004, which claims the benefit of Japan Patent Application No. 2003-129829, filed May 8, 2003, the contents of which are hereby incorporated herein by reference in their entirety.",
        "The present invention relates to crystals of group III-V compounds and to methods of their manufacture, and more particularly relates to methods of manufacturing good-quality group III-V crystals without producing cracks, even with the use of a variety of substrates.",
        "Growing a crystal of a group III-V compound, such as GaN crystal, on a substrate of a different material from the crystal material, such as a sapphire substrate or a silicon (Si) substrate, causes stress between the crystal and the substrate due to differences in properties such as their crystal lattice constants and thermal expansion coefficients, leading to warps and cracks; thus, the process does not yield group III-V crystals of good quality.",
        "In view of this problem, a method has been carried out for alleviating the stress between the crystals and the substrate by depositing a film of a silicon oxide (such as SiO2) on a sapphire substrate; patterning the silicon oxide film is by a technique such as photolithography, and thereafter growing a group III-V crystal onto the patterned substrate. Such a method, however, is problematic in that it requires the patterning of the silicon oxide film, which means the manufacturing cost is high.",
        "Another technique that has been proposed is one in which a GaN layer is grown on a substrate such as sapphire by a metal organic chemical vapor deposition (MOCVD) technique, followed by the depositing of a metal film thereon and performance of a heat treatment to form voids in the GaN layer; thereafter, a GaN crystal is grown. (See Japanese Unexamined Pat. App. Pub. No. 2002-343728, for example.) Nevertheless, a problem arises with such a method because growing a GaN layer by MOCVD leads to extremely high manufacturing costs.",
        "Still another technique that has been proposed is one in which a metal film is deposited on a sapphire or like substrate and thereafter a GaN crystal is grown. (See Japanese Unexamined Pat. App. Pub. No. 2002-284600, for example.) Such a method, however, is problematic in that the qualities of the resulting GaN crystal are compromised because the GaN crystal is grown on a metal film that has a different lattice constant from that of the GaN crystal.",
        "An object of the present invention, brought about to resolve the foregoing problems, is to make available good-quality group III-V crystal that is obtained by a simple, low-cost manufacturing method, and to make available the manufacturing method.",
        "In order to accomplish the foregoing object, a method of manufacturing a group III-V compound according to the present invention is characterized by comprising a step of depositing a metal film on a substrate; a step of heat-treating the metal film under an atmosphere in which a patterning compound is present; and a step of growing a group III-V crystal on the metal film subsequent to the heat treatment. Additionally, the invention may be characterized in that the method may further comprise, subsequent to the step of heat-treating, a step of growing a group III-V compound buffer film on the metal film after the heat treatment; and a step of growing a group III-V crystal on the group III-V compound buffer film.",
        "FIG. 1 illustrates one method of manufacturing a group III-V crystal according to the present invention;",
        "FIG. 2 illustrates another method of manufacturing a group III-V crystal according to the present invention; and",
        "FIG. 3A is a schematic diagram illustrating one representative configuration of holes or grooves formed in a metal film, and FIG. 3B is a schematic diagram illustrating another representative configuration of holes or grooves formed in a metal film.",
        "Referring to FIG. 1, one method of manufacturing a group III-V crystal according to the present invention is characterized in comprising a step of depositing a metal film 2 on a substrate 1 as illustrated in FIG. 1A; a step, as represented in FIG. 1B, of heat-treating the metal film 2 under an atmosphere in which a patterning compound is present; and a step, as represented in FIG. 1C, of growing a group III-V crystal 4 on the metal film after the heat treatment.",
        "Specifically, referring to FIGS. 1 and 3, a method of manufacturing a group III-V crystal according to the present invention is carried out through the following steps. First, as illustrated in FIG. 1A, a metal film 2 is deposited on a substrate 1 using a technique such as vapor deposition or sputtering. Next, the metal film 2 is heat-treated under an atmosphere in which a patterning compound is present, whereby the metal film 2 becomes patterned in indefinite shapes as illustrated in FIG. 1B, forming holes or grooves 12 in a worm-eaten pattern, as illustrated in FIGS. 3A as well as 3B, exposing the substrate 1 at the bottoms of the holes or grooves 12. Subsequently, as illustrated in FIG. 1C, a group III-V crystal 4 is grown, using a technique such as a hydride vapor phase epitaxy (HVPE), onto the metal film 2 in which the holes or grooves 12 in a worm-eaten pattern have been formed following the heat treatment.",
        "Herein, each of FIGS. 3A and 3B schematically illustrates a representative configuration of holes or grooves in a worm-eaten pattern that are formed in the metal film 2 by heat-treating the metal film 2 under an atmosphere in which a patterning compound is present. When the number of holes or grooves is small, a configuration such as that of FIG. 3A tends to form, and as the number of holes or grooves increases, a configuration such as that of FIG. 3B tends to form.",
        "By means of such a manufacturing method, a good-quality group III-V crystal 4 is grown because, as will be seen from FIG. 1, the group III-V crystal 4 can pick up information from the substrate 1 such as its crystal lattice constant. Moreover, the formation in the metal film of the pattern of holes or grooves 12 in worm-eaten contours alleviates the stress between the group III-V crystal 4 and the metal film 2, preventing the group III-V crystal 4 from forming cracks. Furthermore, the manufacturing cost is reduced because the group III-V crystal can be produced by a vapor phase epitaxy (VPE) technique such as the HVPE technique mentioned above, rather than by the high-cost MOCVD technique.",
        "Referring to FIGS. 1 and 3, in the group III-V crystal manufacturing method according to the present invention, it is preferable that the holes or grooves formed in the metal film by heat-treating the metal film under an atmosphere in which a patterning compound is present have an average width W of 2 nm to 5000 nm and that the aperture fraction, which is the surface area that holes or grooves occupy, be 5% to 80% of the total area of the substrate. If the average width W of the holes or grooves is less than 2 nm, the holes or grooves as formed do not reach the substrate, making it difficult to read information from (that is, take on the characteristics of) the substrate. If on the other hand the average width W of the holes or grooves exceeds 5000 nm, it becomes difficult to alleviate stress between the group III-V crystal and the substrate. Given these perspectives, it is further preferable that the average width W of the holes or grooves be from 5 nm to 1000 nm. Further, if the aperture fraction is less than 5% of the total area of the substrate, the smallness of the surface area in which the group III-V crystal is in contact with the substrate would be prohibitive of the growing III-V crystal reading information from the substrate. If on the other hand the aperture fraction exceeds 80%, the excessively large extent to which the metal film is absent would be prohibitive of alleviating stress between the group III-V crystal and the substrate. Given these perspectives, it is further preferable that the aperture fraction be 10% to 50% of the total area of the substrate. Herein, aperture fraction is defined as the percentage of surface area that the holes or grooves occupy with respect to the total area of the substrate, according to the following equation (1):",
        "Aperture\n          ⁢\n          \n            \n          \n          ⁢\n          fraction\n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            %\n            )\n          \n        \n        =\n        \n          \n            \n              (\n              \n                holes\n                ⁢\n                \n                  \n                \n                ⁢\n                or\n                ⁢\n                \n                  \n                \n                ⁢\n                grooves\n                ⁢\n                \n                  \n                \n                ⁢\n                occupying\n                ⁢\n                \n                  \n                \n                ⁢\n                area\n              \n              )\n            \n            \n              (\n              \n                substrate\n                ⁢\n                \n                  \n                \n                ⁢\n                total\n                ⁢\n                \n                  \n                \n                ⁢\n                surface\n                ⁢\n                \n                  \n                \n                ⁢\n                area\n              \n              )\n            \n          \n          ×\n          100\n        \n      \n    \n    \n      \n        (\n        1\n        )",
        "As for the substrate herein, a wide variety of substrates may be used, whether the same kind as or a different kind from the group III-V crystal to be grown, as long as its use does not conflict with the object of the present invention. For example, silicon, sapphire, SiC, ZrB2, or group III-V compounds are preferable because the lattice constants of crystals of these compounds are similar to the lattice constant of the group III-V crystals, and thus, good-quality crystals are readily produced. It should be noted that the group III-V compound used for the substrate need not be the same compound as the group III-V crystal that is to be grown thereon.",
        "Although there are no restrictions on the metal film, a metal film containing titanium (Ti) or vanadium (V), including such metals and alloys as Ti, Ti—Al, V, and V—Al, is preferable from the viewpoint of readiness for patterning.",
        "Although not particularly limited, the thickness of the metal film is preferably 10 nm to 1000 nm. A film thickness of less than 10 nm is prohibitive of causing the metal film to stay in the patterning operation, while the thickness exceeding 1000 nm is prohibitive of exposing the substrate in the patterning operation. In light of these factors, it is preferable that the thickness of the metal film be 30 nm to 500 nm.",
        "A compound that patterns the metal film means a compound, preferable examples of which include ammonia (NH3) and nitrogen (N2), that when a metal film is heat-treated under an atmosphere in which the compound is present patterns into indefinite shapes holes or grooves in worm-eaten contours in the metal film.",
        "Preferable heat-treating conditions for heat-treating of metal film in an atmosphere in which a patterning compound is present are temperatures of 800° C. to 1200° C. for a duration of 0.5 minutes to 20 minutes. If the heat-treatment temperature is less than 800° C. or the heat-treatment time is less than 0.5 minutes, insufficient patterning of the metal film results; if the heat-treatment temperature exceeds 1200° C. or the heat-treatment time exceeds 20 minutes, the metal film is patterned excessively. In light of these factors, it is preferable that the heat-treatment temperature be 900° C. to 1100° C. and the heat-treatment time 0.5 minutes to 10 minutes.",
        "The simple and low-cost manufacturing method described above yields good-quality group III-V crystals. Furthermore, in cases in which the III-V crystals in the foregoing are GaxAlyIn1-x-y (0≦x≦1 and 0≦y≦1), because at present there is no other particularly serviceable manufacturing method for such crystals, the method proves to be an invaluable manufacturing technique.",
        "Referring to FIG. 2, another method of manufacturing a group III-V crystal according to the present invention is characterized in comprising: a step of depositing a metal film 2 on a substrate 1 as illustrated in FIG. 2A; a step, as represented in FIG. 2B, of heat-treating the metal film in an atmosphere in which a patterning compound is present; a step, as represented in FIG. 2C, of growing a group III-V compound buffer film 3 on the metal film 2 after the heat treatment; and a step, as represented in FIG. 2D, of growing a group III-V crystal 4 on the group III-V compound buffer film 3.",
        "Specifically, referring to FIGS. 2 and 3, another method of manufacturing a group III-V crystal according to the present invention is carried out through the following steps. First, as illustrated in FIG. 2A, a metal film 2 is deposited on a substrate 1 using such a technique as vapor deposition or sputtering. Next, the metal film 2 is heat-treated in an atmosphere in which a patterning compound is present, whereby the metal film 2 is patterned in indefinite shapes as illustrated in FIG. 2B, forming holes or grooves 12 in worm-eaten contours, as illustrated in FIG. 3A as well as 3B, so that the substrate 1 is exposed in the bottoms of the holes or grooves 12.",
        "Next, using, for example, an HVPE technique a group III-V compound buffer film 3 as illustrated in FIG. 2C is grown onto the post-heat-treated metal film 2 in which the holes or grooves 12 in worm-eaten contours are formed. Herein, the term “a group III-V compound buffer film” 3 refers to an amorphous film of the group III-V compound that is grown at a lower temperature than that for growing the crystal. Subsequently, as illustrated in FIG. 2D, a group III-V crystal 4 is grown on the group III-V compound buffer film 3, using, for example, an HVPE technique.",
        "In Embodiment 2, described above, the formation onto the metal film 2 in which holes or grooves in a worm-eaten pattern have been formed makes it possible to alleviate the stress between the substrate 1 and the group III-V crystal 4 that is later formed on the group III-V compound buffer film 3. Moreover, because the group III-V crystal 4 in growing picks up information not from the substrate 1 but from the amorphous III-V film, even better-quality III-V crystal—crystal that has not taken in unnecessary crystalline information—is produced.",
        "Embodiments 1 and 2 described above are further detailed based on specific examples.",
        "Reference is made to FIG. 1. Based on Embodiment 1, by a vapor deposition technique a 30 nm-thick metallic Ti film was deposited as a metal film 2 on a substrate 1, as illustrated in FIG. 1A, using a sapphire base as the substrate 1. Next, as represented in FIG. 1B the metal film 2 was heat-treated within a NH3 atmosphere at 1000° C. for 0.5 minutes. The surface of the metal film 2 after its temperature was lowered was observed with a scanning electron microscope (SEM). Holes or grooves in a worm-eaten pattern as shown in FIG. 3A were found; the average width W of the holes or grooves was 8 nm and the aperture fraction was 12%. In addition, a group III-V crystal 4 as illustrated in FIG. 1C was grown at 1000° C. for a 5-hour duration by an HVPE technique using Ga and NH3 as source materials, resulting in a crystal free of cracks. The resulting crystal was found to be a good-quality GaN crystal by an XRD measurement, with its full width at half-maximum (FWHM) in the XRD being 120 arsec. The results are set forth in Table I.",
        "With the test conditions set out in Table I, group III-V crystals were grown by the same procedure as in Example 1. The results are summarized in Table I.",
        "TABLE I\n\n\n\n\n\n\n\n\n\nEx. 1\nEx. 2\nEx. 3\nEx. 4\nEx. 5\nEx. 6\nEx. 7\nEx. 8\nEx. 9\nEx. 10\nEx. 11\nEx. 12\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubstrate type\nSapphire\nSapphire\nGaAs\nSapphire\nSi\nAlN\nZrB2\nGaN\nSiC\nSapphire\nSapphire\nSi\n\n\n\n\n\n\n\n\n\n\nMetal film\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClass\nTi\nTi\nTi\nTi\nTi\nTi\nTi\nTi (90)\nV\nV\nTi\nTi\n\n\n(Composition:\n\n\n\n\n\n\n\nAl (10)\n\n\nmole %)\n\n\nFilm thick-\n30\n200\n200\n200\n200\n500\n200\n300\n200\n200\n200\n200\n\n\nness(nm)\n\n\nHeat treat-\n\n\nment\n\n\nAtmosphere\nNH3\nNH3\nNH3\nNH3\nNH3\nN2\nNH3 (40)\nNH3\nNH3\nNH3\nNH3\nNH3\n\n\n(Composition:\n\n\n\n\n\n\nH2 (60)\n\n\nmole %)\n\n\nTemp. (° C.)\n1000\n800\n1000\n1000\n1100\n1200\n1000\n1000\n1000\n1000\n1000\n1100\n\n\nDuration (min.)\n0.5\n10\n6\n3\n3\n10\n3\n3\n3\n2\n3\n3\n\n\nHole/groove width\n8\n10\n110\n31\n280\n900\n32\n26\n29\n18\n31\n280\n\n\nwidth (nm)\n\n\nAperture\n12\n25\n34\n22\n45\n75\n22\n18\n11\n8\n22\n38\n\n\nfraction (%)\n\n\nCrystal growth\n\n\nSource material 1\nGa\nGa\nGa\nGa\nGa\nGa\nGa\nGa\nGa\nGa (80)\nAl\nGa (70)\n\n\n(Composition:\n\n\n\n\n\n\n\n\n\nAl (10)\n\nAl (30)\n\n\nmole %)\n\n\n\n\n\n\n\n\n\nIn (10)\n\n\nSource material 2\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\n\n\n(Composition:\n\n\nmole %)\n\n\nTemp. (° C.)\n1000\n1100\n1000\n1000\n1100\n1000\n1000\n1000\n1100\n1000\n1000\n1100\n\n\nDuration (hrs.)\n5\n5\n5\n5\n5\n5\n5\n5\n5\n5\n5\n5\n\n\nCracking\nNone\nNone\nNone\nNone\nNone\nNone\nNone\nNone\nNone\nNone\nNone\nNone\n\n\nincidents\n\n\nCrystal\nGaN\nGaN\nGaN\nGaN\nGaN\nGaN\nGaN\nGaN\nGaN\nGa0.8\nAlN\nGa0.7\n\n\ncomposition\n\n\n\n\n\n\n\n\n\nAl0.1\n\nAl0.3N\n\n\n(XRD-iden-\n\n\n\n\n\n\n\n\n\nIn0.1N\n\n\ntified)\n\n\nXRD FWHM\n120\n120\n103\n110\n105\n108\n118\n135\n138\n150\n115\n97\n\n\n(arsec)",
        "Reference is made to FIG. 2. Based on Embodiment 2, by a vapor deposition technique a 200 nm-thick metallic Ti film was deposited as a metal film 2 on a substrate 1, as illustrated in FIG. 2A, using a sapphire base as the substrate 1. Next, as represented in FIG. 2B the metal film 2 was heat-treated in a NH3 atmosphere at 1000° C. for 3 minutes. the surface of the metal film 2 after its temperature was lowered was observed with an SEM. Holes or grooves in a worm-eaten pattern as shown in FIG. 3A were found; the average width W of the holes or grooves was 31 nm and the aperture fraction was 22%. Next, a group III-V compound buffer film 3 as illustrated in FIG. 2C was grown at 500° C. for a 0.5-hour duration. Then, a group III-V crystal 4 as illustrated in FIG. 2D was grown at 1000° C. for a 5-hour duration by an HVPE technique using Ga and NH3 as source materials, resulting in a crystal free of cracks. The resulting crystal was found to be a good-quality GaN crystal by an XRD measurement, with its FWHM in the XRD being 80 arsec. The results are set forth in Table I.",
        "With the test conditions set out in Table II, group III-V crystals were grown in the same procedure as in Example 13. The results are summarized in Table II.",
        "TABLE II\n\n\n\n\n\n\n\n\n\nEx. 13\nEx. 14\nEx. 15\nEx. 16\nEx. 17\nEx. 18\nEx. 19\nEx. 20\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSubstrate type\nSapphire\nSi\nGaAs\nAlN\nGaN\nSiC\nSapphire\nSi\n\n\n\n\n\n\n\n\n\n\nMetal Film\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClass\nTi\nTi\nTi\nTi\nTi (90)\nV\nTi\nTi\n\n\n(Comp.: mole %)\n\n\n\n\nAl (10)\n\n\nFilm thick-\n200\n200\n200\n500\n300\n200\n200\n200\n\n\nness (nm)\n\n\nHeat treat-\n\n\nment\n\n\nAtmosphere\nNH3\nNH3\nNH3\nN2\nNH3\nNH3\nNH3\nNH3\n\n\n(Comp.: mole %)\n\n\nTemp. (° C.)\n1000\n1100\n1000\n1200\n1000\n1000\n1000\n1100\n\n\nDuration (min.)\n3\n3\n6\n10\n3\n3\n3\n3\n\n\nHole/groove\n31\n280\n110\n900\n26\n29\n31\n280\n\n\nwidth (nm)\n\n\nAperture frac-\n22\n45\n34\n75\n18\n11\n22\n38\n\n\ntion (%)\n\n\nBuffer film\n\n\ngrowth\n\n\nSource material 1\nGa\nGa\nAl\nGa\nGa\nGa\nAl\nGa (70)\n\n\n(Comp.: mole %)\n\n\n\n\n\n\n\nAl (30)\n\n\nSource material 2\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\n\n\n(Comp.: mole %)\n\n\nTemp. (° C.)\n500\n500\n500\n500\n500\n500\n500\n500\n\n\nDuration (hrs.)\n0.5\n0.5\n0.5\n0.5\n0.5\n0.5\n0.5\n0.5\n\n\nCrystal growth\n\n\nSource material 1\nGa\nGa\nGa\nGa\nGa\nGa\nAl\nGa (70)\n\n\n(Comp.: mole %)\n\n\n\n\n\n\n\nAl (30)\n\n\nSource material 2\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\nNH3\n\n\n(Comp.: mole %)\n\n\nTemp. (° C.)\n1000\n1100\n1000\n1000\n1000\n1000\n1000\n1100\n\n\nDuration (hrs.)\n5\n5\n5\n5\n5\n5\n5\n5\n\n\nCracking incidents\nNone\nNone\nNone\nNone\nNone\nNone\nNone\nNone\n\n\nCrystal composition\nGaN\nGaN\nGaN\nGaN\nGaN\nGaN\nAlN\nGa0.7\n\n\n(XRD-identified)\n\n\n\n\n\n\n\nAl0.3N\n\n\nXRD FWHM\n80\n65\n72\n85\n88\n92\n90\n78\n\n\n(arsec)",
        "As is evident from Tables I and II, good-quality group III-V crystals that are free from cracks were obtained in all of the examples. Furthermore, it will be understood from comparisons, for example, between Examples 4 and 13, and between Examples 11 and 19, that the FWHMs of the crystals in the XRD analysis were reduced from 110 arsec to 80 arsec and from 115 arsec to 90 arsec, respectively, and that growing the buffer film prior to growing a group III-V crystal improved the quality of the crystals further.",
        "It should be understood that the presently disclosed embodiments and examples are in all respects illustrative and not limiting. The scope of the present invention is set forth not by the foregoing description but by the scope of the patent claims, and is intended to include meanings equivalent to the scope of the patent claims and all modifications within the scope.",
        "As described in the foregoing, in accordance with the present invention, the provision of a step of depositing a metal film on a substrate, a step of heat-treating the metal film in an atmosphere in which a patterning compound is present, and a step of growing a group III-V crystal on the metal film after the heat treatment, yields good-quality group III-V crystals without causing cracks, using a simple and low-cost manufacturing method."
    ],
    "citations": [
        "6809351",
        "6844246",
        "2005/0178471",
        "2000-164988",
        "2001-148348",
        "2001-223165",
        "2002-284600",
        "2002-343728",
        "2003-007616",
        "EP 1378934"
    ],
    "us_classification": "438602",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "L",
            "main_group": "21",
            "subgroup": "28"
        }
    ]
}