{
    "title": "Stack type ball grid array package and method for manufacturing the same",
    "abstract": "A stacked BGA package and a method for manufacturing the stacked BGA package, with reduced size and/or height of a unit package, which may also reduce an electrical connection length. The stacked BGA package may include a base BGA package having at least one semiconductor chip, and a plurality of BGA packages which are stacked on the base BGA package. A plurality of solder balls may electrically connect the base BGA package and the plurality of BGA packages and may then be sealed to reduce the likelihood of damage.",
    "inventors": [
        "Yoo"
    ],
    "document_number": "07298033",
    "publication_date": "20071120",
    "assignees": [
        "Samsung Electronics Co., Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A stacked BGA package comprising:",
            "components": [
                {
                    "component": "a base BGA package including at least one semiconductor chip;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of BGA packages, including at least one semiconductor chip mounted on the base BGA package;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of solder balls mounted on the at least one semiconductor chip of the plurality of BGA packages and electrically connected to the base BGA package and the plurality of BGA packages; and",
                    "subcomponents": []
                },
                {
                    "component": "a conductive circuit layer formed between an exposed uppermost semiconductor chip and the plurality of solder balls that are attached to a corresponding printed circuit board.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The stacked BGA package of claim 1 , wherein the base BGA package and the plurality of BGA packages mounted on the base BGA package, each BGA package comprising:",
            "components": [
                {
                    "component": "the printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads corresponding electrically connected to the plurality of wire bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "at least one semiconductor chip including a plurality of bonding pads is mounted on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of bonding wires corresponding electrically connected to the plurality of bonding pads and the plurality of solder ball landing pads;",
                    "subcomponents": []
                },
                {
                    "component": "an encapsulant sealing a portion of the printed circuit board to protect the plurality of wire bonding pads, the plurality of bonding pads and the plurality of bonding wires; and",
                    "subcomponents": []
                },
                {
                    "component": "the plurality of solder balls connected to the solder ball landing pad of the printed circuit board.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The stacked BGA package of claim 2 , wherein the at least one semiconductor chip is face up with respect to the printed circuit board.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The stacked BGA package of claim 2 , wherein the base BGA package and the plurality of BGA packages are exposed on an active surface of the upper semiconductor chip, excluding the upper BGA package of the plurality of BGA packages.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The stacked BGA package of claim 2 , wherein the encapsulant of the upper BGA package is sealed on the active surface of the upper semiconductor chip.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The stacked BGA package of claim 1 , wherein the conductive circuit layer is a tape, the conductive circuit layer including solder ball landing pads and conductive patterns which are connected to the plurality of bonding pads.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The stacked BGA package of claim 1 , wherein the conductive circuit layer includes solder ball landing pads and conductive patterns which are formed with the same metal layer to be used to the bonding pad.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The stacked BGA package of claim 7 , wherein the solder ball landing pads of the conductive circuit layer are arranged to correspond to the solder ball landing pads of the printed circuit board.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The stacked BGA package of claim 1 , wherein the solder ball is attached to a contact between the solder ball landing pads of the conductive circuit layer and the solder ball landing pads of the printed circuit board.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The stacked BGA package of claim 1 , wherein the base BGA package and the plurality of BGA packages each include one or more semiconductor chips.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The stacked BGA package of claim 1 , wherein the solder ball being connected to the plurality of BGA packages, is sealed by an encapsulant.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A stacked BGA package comprising n (n>1) BGA packages sequentially stacked and connected, each BGA package comprising:",
            "components": [
                {
                    "component": "a printed circuit board including a plurality of wire bonding pads and a plurality of solder ball landing pads, electrically connected to the plurality of wire bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "at least one semiconductor chip including a plurality of bonding pads, mounted on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of bonding wires electrically connected to the plurality of bonding pads and the plurality of wire bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "an encapsulant sealing the plurality of wire bonding pads, the plurality of bonding pads, and the plurality of bonding wires; and",
                    "subcomponents": []
                },
                {
                    "component": "at least one solder ball, connected to a solder ball landing pad of the printed circuit board,",
                    "subcomponents": []
                },
                {
                    "component": "a conductive circuit layer formed on a top area of the n BGA packages, and electrically connected to the upper semiconductor chip,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the conductive circuit layer is electrically connected to the solder ball of the adjacent BGA package.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The stacked BGA package of claim 12 , wherein the n BGA packages comprise one or more semiconductor chips.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The stacked BGA package of claim 12 , wherein the solder ball of the nth BGA package is sealed by the encapsulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A method of manufacturing a stacked BGA package, said method comprising:",
            "components": [
                {
                    "component": "preparing a BGA package including at least one semiconductor chip;",
                    "subcomponents": []
                },
                {
                    "component": "forming a conductive circuit layer on the BGA package to connect electrically to the exposed uppermost semiconductor chip of an upper stacked portion on the BGA package, wherein the conductive circuit layer is formed between the exposed uppermost semiconductor chip and a plurality of solder balls that are attached to a corresponding printed circuit board; and stacking at least one BGA package on the conductive circuit layer, wherein preparing the BGA package includes:",
                    "subcomponents": [
                        "preparing the printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads corresponding electrically connected to the plurality of wire bonding pads;",
                        "mounting a first semiconductor chip including a plurality of bonding pads on the printed circuit board;",
                        "connecting a plurality of bonding wires corresponding electrically to the plurality of bonding pads on the first semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                        "mounting a second semiconductor chip including a plurality of bonding pads on the first semiconductor chip;",
                        "connecting the plurality of bonding wires corresponding electrically to the plurality of bonding pads of the second semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                        "sealing a portion of the printed circuit board to protect the plurality of wire bonding pads, the plurality of bonding pads and bonding wires; and",
                        "connecting a solder ball to the solder ball landing pad of the printed circuit board."
                    ]
                },
                {
                    "component": "preparing the printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads corresponding electrically connected to the plurality of wire bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "mounting a first semiconductor chip including a plurality of bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "connecting a plurality of bonding wires corresponding electrically to the plurality of bonding pads on the first semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "mounting a second semiconductor chip including a plurality of bonding pads on the first semiconductor chip;",
                    "subcomponents": []
                },
                {
                    "component": "connecting the plurality of bonding wires corresponding electrically to the plurality of bonding pads of the second semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "sealing a portion of the printed circuit board to protect the plurality of wire bonding pads, the plurality of bonding pads and bonding wires; and",
                    "subcomponents": []
                },
                {
                    "component": "connecting a solder ball to the solder ball landing pad of the printed circuit board.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 15 , wherein the conductive circuit layer is a tape with conductive patterns on the BGA package, the conductive circuit layer being connected to a plurality of solder ball landing pads and bonding pads of the second semiconductor chip.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 16 , wherein sealing the upper BGA package comprises covering the active layer of the second semiconductor chip.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 16 , further comprising sealing the solder ball being connected to the BGA packages after connecting the solder ball.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 15 , wherein forming the plurality of solder ball landing pads and the conductive patterns being connected to the plurality of solder ball landing pads and the bonding pads comprises forming simultaneously the bonding pads on the second semiconductor chip.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. A stacked BGA package manufactured in accordance with the method of claim 15 .",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. A method of manufacturing a stacked BGA package, said method comprising:",
            "components": [
                {
                    "component": "preparing a BGA package including at least one semiconductor chip;",
                    "subcomponents": []
                },
                {
                    "component": "forming a plurality of solder balls on the at least one semiconductor chip and electrically connected to the BGA package;",
                    "subcomponents": []
                },
                {
                    "component": "forming a conductive circuit layer between an exposed uppermost semiconductor chip and the plurality of solder balls that are attached to a corresponding printed circuit board; and",
                    "subcomponents": []
                },
                {
                    "component": "stacking at least one BGA package on the plurality of solder balls.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. A stacked BGA package manufactured in accordance with the method of claim 21 .",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. A stacked BGA package comprising:",
            "components": [
                {
                    "component": "a base BGA package including at least one semiconductor chip;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of BGA packages, including at least one semiconductor chip mounted on the base BGA package; and",
                    "subcomponents": []
                },
                {
                    "component": "a conductive layer electrically connected to the base BGA package and the plurality of BGA packages, wherein the conductive layer is formed between an exposed uppermost semiconductor chip and a plurality of solder balls that are attached to a corresponding printed circuit board, wherein one of the BGA packages includes:",
                    "subcomponents": [
                        "the printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads corresponding electrically connected to the plurality of wire bonding pads;",
                        "a first semiconductor chip including a plurality of bonding pads on the printed circuit board;",
                        "a plurality of bonding wires corresponding electrically to the plurality of bonding pads on the first semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                        "a second semiconductor chip including a plurality of bonding pads on the first semiconductor chip, the plurality of bonding wires corresponding electrically to the plurality of bonding pads of the second semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                        "a portion of the printed circuit board sealed to protect the plurality of wire bonding pads, the plurality of bonding pads and bonding wires; and",
                        "a solder ball connected to the solder ball landing pad of the printed circuit board."
                    ]
                },
                {
                    "component": "the printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads corresponding electrically connected to the plurality of wire bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "a first semiconductor chip including a plurality of bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of bonding wires corresponding electrically to the plurality of bonding pads on the first semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a second semiconductor chip including a plurality of bonding pads on the first semiconductor chip, the plurality of bonding wires corresponding electrically to the plurality of bonding pads of the second semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a portion of the printed circuit board sealed to protect the plurality of wire bonding pads, the plurality of bonding pads and bonding wires; and",
                    "subcomponents": []
                },
                {
                    "component": "a solder ball connected to the solder ball landing pad of the printed circuit board.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. A method of manufacturing a stacked BGA package including n (n>1) BGA packages sequentially stacked, said method comprising:",
            "components": [
                {
                    "component": "providing a BGA package including at least one semiconductor chip, each semiconductor chip including a plurality of bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "providing a printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads, and a plurality of solder balls, wherein the plurality of solder ball landing pads are electrically connected to the plurality of wire bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "electrically connecting the plurality of bonding pads and the plurality of wire bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "forming a conductive circuit layer on the BGA package to electrically connect the at least one semiconductor chip to a plurality of solder balls of an adjacent BGA package; and",
                    "subcomponents": []
                },
                {
                    "component": "stacking n-1 BGA packages on the BGA package.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. A stacked BGA package manufactured in accordance with the method of claim 24 .",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. A unit BGA package comprising:",
            "components": [
                {
                    "component": "at least one semiconductor chip;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of solder balls mounted on the at least one semiconductor chip and electrically connected to the unit BGA package for connecting the unit BGA package to other BGA packages; and",
                    "subcomponents": []
                },
                {
                    "component": "a conductive circuit layer formed between an exposed uppermost semiconductor chip and the plurality of solder balls that are attached to a corresponding printed circuit board.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. A unit BGA package comprising:",
            "components": [
                {
                    "component": "at least one semiconductor chip; and",
                    "subcomponents": []
                },
                {
                    "component": "a conductive layer electrically connected to the unit BGA package for connecting the unit BGA package to other BGA packages, wherein the conductive layer is formed between an exposed uppermost semiconductor chip and a plurality of solder balls that are attached to a corresponding printed circuit board, wherein one of the BGA packages includes:",
                    "subcomponents": [
                        "the printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads corresponding electrically connected to the plurality of wire bonding pads;",
                        "a first semiconductor chip including a plurality of bonding pads on the printed circuit board;",
                        "a plurality of bonding wires corresponding electrically to the plurality of bonding pads on the first semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                        "a second semiconductor chip including a plurality of bonding pads on the first semiconductor chip, the plurality of bonding wires corresponding electrically to the plurality of bonding pads of the second semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                        "a portion of the printed circuit board sealed to protect the plurality of wire bonding pads, the plurality of bonding pads and bonding wires; and",
                        "a solder ball connected to the solder ball landing pad of the printed circuit board."
                    ]
                },
                {
                    "component": "the printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads corresponding electrically connected to the plurality of wire bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "a first semiconductor chip including a plurality of bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of bonding wires corresponding electrically to the plurality of bonding pads on the first semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a second semiconductor chip including a plurality of bonding pads on the first semiconductor chip, the plurality of bonding wires corresponding electrically to the plurality of bonding pads of the second semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a portion of the printed circuit board sealed to protect the plurality of wire bonding pads, the plurality of bonding pads and bonding wires; and",
                    "subcomponents": []
                },
                {
                    "component": "a solder ball connected to the solder ball landing pad of the printed circuit board.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. A unit BGA package comprising:",
            "components": [
                {
                    "component": "at least one semiconductor chip;",
                    "subcomponents": []
                },
                {
                    "component": "a conductive layer formed between an exposed uppermost semiconductor chip and a plurality of solder balls that are attached to a corresponding printed circuit board; and",
                    "subcomponents": []
                },
                {
                    "component": "the plurality of solder balls, wherein the conductive layer and the plurality of solder balls electrically are connected to the unit BGA package and connect the unit BGA package to other BGA packages, wherein one of the BGA packages includes:",
                    "subcomponents": [
                        "the printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads corresponding electrically connected to the plurality of wire bonding pads;",
                        "a first semiconductor chip including a plurality of bonding pads on the printed circuit board;",
                        "a plurality of bonding wires corresponding electrically to the plurality of bonding pads on the first semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                        "a second semiconductor chip including a plurality of bonding pads on the first semiconductor chip, the plurality of bonding wires corresponding electrically to the plurality of bonding pads of the second semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                        "a portion of the printed circuit board sealed to protect the plurality of wire bonding pads, the plurality of bonding pads and bonding wires; and",
                        "a solder ball connected to the solder ball landing pad of the printed circuit board."
                    ]
                },
                {
                    "component": "the printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads corresponding electrically connected to the plurality of wire bonding pads;",
                    "subcomponents": []
                },
                {
                    "component": "a first semiconductor chip including a plurality of bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of bonding wires corresponding electrically to the plurality of bonding pads on the first semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a second semiconductor chip including a plurality of bonding pads on the first semiconductor chip, the plurality of bonding wires corresponding electrically to the plurality of bonding pads of the second semiconductor chip and the plurality of wire bonding pads on the printed circuit board;",
                    "subcomponents": []
                },
                {
                    "component": "a portion of the printed circuit board sealed to protect the plurality of wire bonding pads, the plurality of bonding pads and bonding wires; and",
                    "subcomponents": []
                },
                {
                    "component": "a solder ball connected to the solder ball landing pad of the printed circuit board.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. A stacked BGA package comprising:",
            "components": [
                {
                    "component": "a base BGA package including a plurality of semiconductor chips;",
                    "subcomponents": []
                },
                {
                    "component": "a conductive circuit layer attached on an exposed uppermost semiconductor chip in the base BGA package;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of solder balls mounted on the conductive circuit layer of the base BGA package; and",
                    "subcomponents": []
                },
                {
                    "component": "a BGA package including a plurality of semiconductor chips, mounted on the plurality of solder balls,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the BGA package is electrically connected to the base package by the plurality of solder balls, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the conductive circuit layer is formed between the exposed uppermost semiconductor chip and the plurality of solder balls that are attached to a corresponding printed circuit board.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application claims priority from Korean Patent Application No. 2003-43574, filed Jun. 30, 2003, the contents of which are hereby incorporated herein by reference in their entirety.",
        "1. Field of the Invention",
        "The present invention relates generally to a semiconductor package and a method for manufacturing the same. More particularly, the present invention relates to a stack type ball grid array (BGA) package including one or more semiconductor chips and a method for manufacturing the same.",
        "2. Description of Related Art",
        "Electronic industries continue to seek products, such as mobile phones and PDAs that are lighter, faster, smaller, multi-functional, more reliable and more cost-effective. In order to meet the requirement of the electronic industries, semiconductor devices have become increasingly integrated. A representative semiconductor package using solder balls (instead of connecting pins) is a BGA package and a representative packaging process adopted in integrated semiconductor packages is a chip scale package (CSP).",
        "Demand for more compact semiconductor devices with larger capacity has resulted in the development of stacked BGA packages. In general, a stacked BGA package have been adopted because of the possibility of increasing the memory capacity of a semiconductor package by two or more times, as a result of stacking two or more packages.",
        "FIG. 1 is a cross-sectional view of a conventional stacked BGA package using a flexible printed circuit board 20. Referring to FIG. 1, the conventional stacked BGA package may typically include the flexible printed circuit board 20 between a first package 10 and a second package 30. The first and second packages 10 and 30 may include package bodies 12 and 32 with a semiconductor chip (not shown) and solder balls 14 and 34 exposed outside of the package bodies 12 and 32, respectively. Also, the solder balls 14 and 34 may be arranged to correspond each other. The flexible printed circuit board 20 may include at least one first portion 21 which is placed between the solder balls 14 and 34, and a second portion 22 which are extended from the first portion 21. The second portion 22 may be attached to a surface of the second package 30 surrounding a side portion of the second package 30. In addition, the second portion 22 may include one or more external connection terminals 40. As shown in FIG. 1, solder balls 14 and 34 may be provided on both the top and bottom of each package 10 and 30. Further, a passivation layer may be placed between the solder balls 14 and/or a film, such as a Cu film, may be placed between the solder balls 14 and 34.",
        "As described above, the conventional stacked BGA package has advantages, for example, decreasing the package size and/or increasing the capacity of a unit package, by forming the solder balls 14 and 34 on the bottom of the chips. However, the conventional stacked BGA package using the flexible printed circuit board 20 may extend the electrical connecting length between the first and second package 10 and 30. In this case, the flexible printed circuit board 20 should be used to manufacturing the stacked BGA package.",
        "Exemplary embodiments of the present invention provide a stacked BGA package including a plurality of BGA packages mounted on the base BGA package which are electrically connected via a conductive circuit layer and/or a plurality of solder balls. Other exemplary embodiments of the present invention provide a unit BGA package which may be electrically connected via a conductive circuit layer and/or a plurality of solder balls to other BGA packages. Other exemplary embodiments of the present invention provide a method of manufacturing a stacked BGA package and/or a unit BGA package.",
        "Exemplary embodiments of the present invention provide a method of manufacturing a stacked BGA package. According to exemplary embodiments of the present invention, a stacked BGA package includes a base BGA package with at least one semiconductor chip; a plurality of BGA packages with at least one semiconductor chip mounted on the base BGA package; and a plurality of solder balls electrically connected to the base BGA package and the plurality of BGA packages.",
        "In an exemplary embodiment, the stacked BGA package may include the base BGA package and the plurality of BGA packages mounted on the base BGA package, each BGA package including a printed circuit board with a plurality of wire bonding pads, a plurality of solder ball landing pads electrically connected to the plurality of wire bonding pads; at least one semiconductor chip with a plurality of bonding pads may be mounted on the printed circuit board; a plurality of bonding wires electrically connected to the plurality of bonding pads and the plurality of solder ball landing pads; an encapsulant sealing a portion of the printed circuit board to protect the plurality of wire bonding pads, the plurality of bonding pads and/or the plurality of bonding wires; and the plurality of solder balls connected to the solder ball landing pads of the printed circuit board.",
        "In an exemplary embodiment, at least one semiconductor chip may be face up with respect to the printed circuit board, and the base BGA package and the plurality of BGA packages may be exposed on the active surface of the upper semiconductor chip, excluding the upper BGA package of the plurality of BGA packages. In an exemplary embodiment, the encapsulation of the upper BGA package may be sealed on the active surface of the upper semiconductor chip.",
        "In an exemplary embodiment, the stacked BGA package including a conductive circuit layer may be formed between an exposed upper semiconductor chip and the solder balls which are attached to the corresponding printed circuit board, and the conductive circuit layer (which may be a tape), the conductive circuit layer with solder ball landing pads and conductive patterns which are connected to the plurality of bonding pads. In an exemplary embodiment, the conductive circuit layer with solder ball landing pads and conductive patterns may be formed the same as a metal layer to be used for the bonding pad.",
        "In an exemplary embodiment, the solder ball landing pads of the conductive circuit layer may be arranged to correspond to the solder ball landing pads of the printed circuit board, and the solder balls may be attached to contact between the solder ball landing pads of the conductive circuit layer and the solder ball landing pads of the printed circuit board. In an exemplary embodiment, the solder ball connected to the plurality of BGA packages may be sealed by the encapsulant. In an exemplary embodiment, the base BGA package and/or the plurality of BGA packages include one or more semiconductor chips.",
        "Another exemplary embodiment of the present invention provides a stacked BGA package with n (n>1) BGA packages sequentially stacked and connected, each BGA package including a printed circuit board with a plurality of wire bonding pads, a plurality of solder ball landing pads electrically connected to the plurality of wire bonding pads; at least one chip with a plurality of bonding pads mounted on the printed circuit board; a plurality of bonding wires electrically connected to the plurality of bonding pads and the plurality of solder ball landing pads; an encapsulant sealing the plurality of wire bonding pads, the plurality of bonding pads and the plurality of bonding wires; and at least one solder ball connected to the solder ball landing pads of the printed circuit board; and a conductive circuit layer formed on a top of the n−1 BGA packages, and electrically connected to the upper semiconductor chip, wherein the conductive circuit layer may be electrically connected to the solder balls of the adjacent BGA package.",
        "In an exemplary embodiment, the n BGA packages include one or more semiconductor chips. Also, the solder ball of the n BGA package may be sealed by the encapsulant.",
        "An exemplary embodiment of the present invention provides a method of manufacturing a stacked BGA package, said method including: preparing a BGA package including at least one semiconductor chip; forming a conductive circuit layer on the BGA package to electrically connect the semiconductor chip; and stacking at least one BGA package on the conductive circuit layer.",
        "In an exemplary embodiment, the method may further include preparing the BGA package including preparing a printed circuit board including a plurality of wire bonding pads, a plurality of solder ball landing pads electrically connected to the plurality of wire bonding pads; mounting a first semiconductor chip including a plurality of bonding pads on the printed circuit board; electrically connecting a plurality of bonding wires to the plurality of bonding pads on the first semiconductor chip and the plurality of wire bonding pads on the printed circuit board; mounting a second semiconductor chip including a plurality of bonding pads on the first semiconductor chip; electrically connecting the plurality of bonding wires to the plurality of bonding pads of the second semiconductor chip and the plurality of wire bonding pads on the printed circuit board; sealing a portion of the printed circuit board to protect the plurality of wire bonding pads, the plurality of bonding pads and bonding wires; and connecting at least one solder ball to the solder ball landing pads of the printed circuit board.",
        "The exemplary method may further include forming the conductive circuit layer as a tape with conductive patterns on the BGA package, the conductive circuit layer being connected to a plurality of solder ball landing pads and bonding pads of the second semiconductor chip. Also, the method may further include sealing the upper BGA package by covering the active layer of the second semiconductor chip.",
        "The method may further include sealing the solder ball(s) being connected to the BGA packages after connecting the solder ball(s). Also, the method may further include forming the plurality of solder ball landing pads, the conductive patterns connected to the plurality of solder ball landing pads, and/or the bonding pads simultaneously.",
        "The present invention will become more readily apparent through the following detailed description of exemplary embodiments of the present invention, made with reference to the attached drawings, in which:",
        "FIG. 1 is a cross-sectional view of a conventional stacked BGA package using a flexible printed circuit board;",
        "FIG. 2 is a cross-sectional view of a stacked BGA package including a multi chip package according to an exemplary embodiment of the present invention;",
        "FIG. 3 is a cross-sectional view of an exemplary embodiment of a unit BGA package according to FIG. 2;",
        "FIG. 4 is a plan view of a conductive circuit layer according to an exemplary embodiment of the present invention;",
        "FIGS. 5a and 5b are exemplary, enlarged cross-sectional views of conductive circuit layer portions shown in FIG. 2;",
        "FIG. 6 is a plan view of the bottom of the conductive circuit layer according to an exemplary embodiment of the present invention;",
        "FIGS. 7a through 7c are cross-sectional views of the unit BGA package according to an exemplary embodiment of the present invention;",
        "FIGS. 8a and 8b are cross-sectional views of the stacked BGA package according to an exemplary embodiment of the present invention;",
        "FIG. 9 is a cross-sectional view of a conventional multi chip BGA package; and",
        "FIG. 10 is a cross-sectional view of a stacked BGA package according to another exemplary embodiment of the present invention.",
        "The present invention will now be described more fully with reference to the accompanying drawings, in which exemplary embodiments of the invention are shown. It should be understood, however, that exemplary embodiments of the present invention described herein can be modified in form and detail without departing from the spirit and scope of the invention. Accordingly, the exemplary embodiments described herein are provided by way of example and not of limitation, and the scope of the present invention is not restricted to the particular embodiments described herein.",
        "Referring to FIG. 2, according to an exemplary embodiment of the present invention, a stacked BGA package 200 may include a plurality of BGA packages 100a through 100d. Each unit BGA package 100a through 100d may include at least one semiconductor chip, e.g., two semiconductor chips 103 and 105. The plurality of BGA packages 100a through 100d may be electrically connected by a series of solder balls 115 and 116, respectively. The series of solder balls 115 and 116 may supply an external signal to the semiconductor chips 103 and 105 in the plurality of BGA packages 100a through 100d, respectively. In addition, a conductive circuit layer 120 may be formed on the top of the plurality of BGA packages 100a through 100c.",
        "With reference to FIG. 3, a unit BGA package 100 may include a printed circuit board 101, at least one semiconductor chip, e.g., two or more semiconductor chips 103 and 105, on the printed circuit board 101. According to an exemplary embodiment of the present invention, the first and second semiconductor chips 103 and 105 are sequentially stacked, and an active surface of the first and second semiconductor chips 103 and 105 are face up with respect to the printed circuit board 101. Also, a series of bonding pads 103a and 105a may be arranged on a peripheral area of the first and second semiconductor chips 103 and 105 and the first and second semiconductor chips 103 and 105 may be attached by an adhesive layer 107. The adhesive layer 107 may be formed to expose the bonding pads 103a on the first semiconductor chip 103. In addition, the series of bonding pads 103a and 105b may be connected to a series of wire bonding pads 109 placed on a peripheral area of the printed circuit board 101 by a series of bonding wires 111a and 111b.",
        "The bonding pads 103a and 105b, the wire bonding pads 109, and the bonding wires 111a and 111b may be sealed by an encapsulant 113, for example, an epoxy molding compound (EMC) or other polymer composition. An active surface of the second semiconductor chip 105 may be sealed with an upper BGA package. However, the active surface of the second semiconductor chip 105, i.e., the upper chip, in the other BGA packages 100b, 100c and 100d may be exposed to be connected to another adjacent BGA package. Also, the conductive circuit layer 120 may be formed on the exposed active surface of the second semiconductor chip 105.",
        "As illustrated in FIG. 4, the conductive circuit layer 120 may include a series of solder ball landing pads 121 and a series of conductive patterns 123, connected to corresponding the series of bonding pads 105a on the second semiconductor chip 105. The solder ball landing pads 121 and the conductive pattern 123 may be separated from adjacent solder ball landing pad 121 and/or conductive pattern 123 by an electrical insulator.",
        "Referring to FIG. 5a, the conductive circuit layer 120 may be a tape, in which the solder ball landing pad 121 and the conductive pattern 123 are formed. In detail, the conductive pattern 123 may be extended to contact to the bonding pad 105a. The solder ball 116 may be attached on the solder ball landing pad 121, and may be electrically connected to the bonding pad 105a by the conductive pattern 123.",
        "With reference to FIG. 5b, the conductive circuit layer 120 may be directly formed on the semiconductor chip. In a manufacturing process for semiconductor devices, i.e., forming the bonding pad 105a by a metal, the conductive circuit layer 120 may be formed with a formation of the bonding pad 105a, thereby patterning the solder ball landing pad 121 and the conductive pattern 123, simultaneously. In such an exemplary method, the conductive circuit layer 120 may be formed without an additional taping process and photolithography process.",
        "Referring to FIG. 6, the underside of the printed circuit board 101 may provide the solder ball landing pads 130 to place the solder balls 115, a plurality of holes 133 for providing an electrical connection to the solder ball landing pads 130 and the wire bonding pads 109, and the conductive patterns 135. The holes 133 in the printed circuit board 101 may enable connection to the wire bonding pads 109, therefore a conductive material (not shown) may be plated and/or inserted inside the holes 133. The conductive patterns 135 may connect to the holes 133 and the solder ball landing pads 130. Each conductive pattern 125 may be separated from adjacent conductive patterns 135. The solder ball landing pads 130 which are placed on the underside of the printed circuit board 101 may be connected to the corresponding solder ball landing pads 121 on the conductive circuit layer 120 of the adjacent BGA package (not shown).",
        "Furthermore, the solder balls 115 and 116 may be attached to solder ball landing pads 130 which are placed on the underside of the printed circuit board 101, and may then be soldered with the solder ball landing pads 121 of the conductive circuit layer 120 at the same time. The solder balls 115 of the base BGA package 100a need not be encapsulated, thereby enabling mounting to a main board (not shown). However, the solder balls 116 of the upper BGA packages 100b, 100c and 100d may be encapsulated to disperse any stress concentrated at the solder joint, to further protect the conductive circuit layer 120 and improve the package reliability. Thus, the BGA packages 100a through 100d may be electrically connected by the solder balls 115 and 116.",
        "A method for manufacturing of the unit BGA package 100a through 100d according to an exemplary embodiment of the present invention will be now described.",
        "As illustrated in FIG. 7a, the first semiconductor chip 103 may be mounted on the printed circuit board 101, for example, by an adhesive material (not shown), such as an Ag epoxy or a polyimide tape. The solder ball landing pads 130 and the conductive patterns 135 may be formed on the underside of the printed circuit board 101. Also, the wire bonding pads 103a may be formed on a top peripheral area of the printed circuit board 101. The active surface of the first semiconductor chip 103 may be face up with respect to printed circuit board 101, thereby exposing the wire bonding pads 109. The bonding wires 111a may then be connected to the bonding pads 103a and the wire bonding pads 109.",
        "As illustrated in FIG. 7b, the second semiconductor chip 105 may be attached on the first semiconductor chip 103 by an adhesive layer 107, such as an adhesive material, such as an Ag epoxy or a polyimide tape. Also, the second semiconductor chip 105 may include the bonding pads 105, thereby connecting to the wire bonding pad 109 on the printed circuit board 101. Furthermore, the second semiconductor chip 105 may be essentially the same as the first semiconductor chip 103. The bonding wires 111b may then be electrically connected to the corresponding bonding pads 105a of the second semiconductor chip 105 and the wire bonding pads 109 on the printed circuit board 101.",
        "As illustrated in FIG. 7c, the first and second semiconductor chips 103 and 105, the bonding wires 111a and 111b may be sealed by the encapsulant 113 to be formed on a peripheral area of the printed circuit board 101, in order to provide protection from the external environment. The encapsulation 113 may expose a portion of the active surface of the second semiconductor chip 105, to stack other BGA packages 100b through 100d. In addition, the solder balls 115 may have an input/output function of the first and second semiconductor chips 103 and 105 may be soldered on the solder ball landing pads 130 of the printed circuit board 101, and thus the unit BGA package 100 may be completed.",
        "The base BGA package 100a may be the lower BGA package of the stacked BGA package 200, and the solder balls 115 of the other BGA packages 100b, 100c, 100d may be sealed by encapsulant 140. The active surface of the second semiconductor chip 105 of the upper BGA package 100d may be completely sealed, because an additional unit BGA package does not need to be stacked.",
        "Hereafter, a method for manufacturing the stacked BGA package 200 according to an exemplary embodiment of the present invention will be now described. Referring to FIG. 7d, the conductive circuit layer 120 may be formed on an exposed active surface of the second semiconductor chip 105 of the BGA package 100a. The conductive circuit layer 120 may further include the solder ball landing pads 121 and the conductive patterns 123, as shown in FIG. 4. If the conductive circuit layer 120 is of a tape type, the conductive circuit layer 120 may be formed the same as a metal layer used to form the bonding pad 105a on the second semiconductor chip 105.",
        "Referring to FIG. 8, the solder balls 116 of another BGA package 100b may be placed on the conductive circuit layer 120 of the base BGA package 100a. The BGA package 100b may have been electrically tested and may have the same or different functionality as the base BGA package 100a. The solder balls 116 of the BGA package 100b may be contact the solder ball landing pads 121 of the conductive circuit layer 120 on the base BGA package 100a. Therefore, the BGA packages 100a and 100b may be electrically connected. The solder balls 116 of the BGA package 100b may be sealed by the encapsulant 140, thereby dispersing stress applied to the solder balls 116 and/or protecting the conductive circuit layer 120. Another BGA package 100c may be stacked on the BGA package 100b by the above-described method. As described above, the conductive circuit layer 120 need not be formed on the second semiconductor chip 105 of the upper BGA package 100d, and the encapsulation 113 may be formed to cover the active surface of the second semiconductor chip 105.",
        "In this manner, the stacked BGA package 200 (which may be considered a CSP) may provide the solder balls 115 on the underside of the semiconductor chip 103 for attachment thereto. Also, the stacked BGA package 200 may be manufactured without an additional flexible board, thereby increasing reliability and/or decreasing signal delay of the semiconductor chips 103 and 105.",
        "According to exemplary embodiments of the present invention, the stacked BGA package 200 includes a plurality of BGA packages 100a through 100d having at least one semiconductor chip 103 and/or 105, may decrease the height of the stacked package compared with the stacked package having one semiconductor chip in a unit package. For instance, a plurality of semiconductor chips 52a through 52e are stacked in a conventional package body 60 as shown in FIG. 9. One of the semiconductor chips 52a through 52e may experience an electrical failure, and as a result, the entire conventional multi-chip package may fail. However, the stacked BGA package 200 according to exemplary embodiments of the present invention may have a lower electrical/mechanical failure rate than the conventional multi chip package, by enabling the completion of testing of the unit BGA packages 100a through 100d before the stacking process.",
        "The stacked BGA package 200 according to another exemplary of the present invention will be now described. Referring to FIG. 10, a stacked BGA package 200 may include a plurality of BGA packages 200a through 200d, and each BGA package 200a through 200d may have any number of semiconductor chips 203 and 205. For instance, the first and fourth BGA packages 200a and 200d may include one semiconductor chip 203 and the second and third BGA packages 200b and 200c may include two semiconductor chips 203 and 205. Thus, the first and fourth BGA packages 200a and 200d may include a printed circuit board 201 to which the one semiconductor chip 203 is attached. A plurality of bonding pads 203a may be formed on a peripheral area of the semiconductor chips 203 and 205 and a plurality of wire bonding pads 209 may be formed on a peripheral area of the printed circuit boards 201. Also, a series of bonding wires 211 may be connected to the corresponding plurality of bonding pads 203a and wire bonding pads 209. The encapsulant 213 may be sealed to protect the bonding pads 203a, the wire bonding pads 209, and the bonding wires 211 on a top portion of the printed circuit board 201.",
        "In the first BGA package 200a, the encapsulant 213 may be sealed to expose an active surface of the semiconductor chip 203, thereby enabling the stacking of the second BGA package 200b. However, the active surface of the semiconductor chip 203 in the fourth BGA package 200d may be completely sealed because an additional BGA package need not be stacked. A plurality of solder balls 215 acting as electrical connection terminals may be attached to an underside of the printed circuit board 201. The plurality of solder balls 215 of the fourth BGA package 200d may be sealed by the encapsulant 240. In addition, a conductive circuit layer 120 may be formed on a top surface of the first BGA package 200a thereby enabling the stacking of the second BGA package 200b.",
        "In an exemplary embodiment, the second and third BGA package 200b and 200c may also include the printed circuit board 201, the first and second semiconductor chips 203 and 205, to which a series of bonding wires 211a and 211b may be connected to the plurality of wire bonding pads 209 and the plurality of bonding pads 203a and 205a, the encapsulant 213, and the plurality of solder balls 216 that are used to connect to the printed circuit board 201. Even though various semiconductor chips may be mounted in the stacked BGA package 200, similar efficiency may be achieved.",
        "As mentioned above, exemplary embodiments of the present invention may reduce the likelihood of damage to semiconductor chips and solder balls during the manufacture of stacked BGA packages. Exemplary embodiments of the present invention may also reduce the height of the stacked BGA package relative to the stacked package having one semiconductor chip in a unit package, thereby allowing a thinner stacked package to be produced. The solder balls which are connected to the unit BGA packages may be encapsulated to disperse the stress, caused by protecting the conductive circuit layer. As a result, the reliability of a semiconductor package may be improved.",
        "Although the invention has been described with reference to various aspects and exemplary embodiments thereof, it will be apparent to those of ordinary skill in the art that various modifications and adaptations to the described embodiments may be made without departing from the spirit and scope of the invention as defined in the appended claims."
    ],
    "citations": [
        "6650007",
        "6700783",
        "6778404",
        "2003/0137041",
        "10-2000-0056804",
        "10-0375168"
    ],
    "us_classification": "257686",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "L",
            "main_group": "23",
            "subgroup": "12"
        }
    ]
}