{
    "title": "Insert earphone assembly for audiometric testing and method for making same",
    "abstract": "An improved insert earphone for audiometric testing is provided, having a housing, a receiver located within the housing, a flexible eartip located externally to the housing, and a tube nipple acoustically coupled between the receiver and the flexible eartip. The flexible eartip has a flexible tube portion that is coupled to an output end of the tube nipple, which may be rigid. The housing and tube nipple are configured and arranged such that the angle between a longitudinal axis of the tube nipple and the vertical axis is obtuse, minimizing the stress on the ear canal when the flexible eartip is inserted therein. An acoustic damper may be located at or near the input end of the tube nipple to prevent ear wax from clogging the damper and minimize the need for damper replacement.",
    "inventors": [
        "Wilson",
        "Iseberg"
    ],
    "document_number": "07298858",
    "publication_date": "20071120",
    "assignees": [
        "Etymotic Research, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An insert earphone comprising:",
            "components": [
                {
                    "component": "a housing;",
                    "subcomponents": []
                },
                {
                    "component": "a receiver located in the housing and having an output port, the receiver for electrically coupling with an audio signal source;",
                    "subcomponents": []
                },
                {
                    "component": "a flexible eartip for acoustic sealing with an ear canal of a user, the flexible eartip having a foam eartip portion and a flexible tube portion; and",
                    "subcomponents": []
                },
                {
                    "component": "a tube nipple providing an acoustic pathway through at least one wall of the housing and having a first end and a second end, the first end of the tube nipple being located within the housing and being acoustically coupled to the output port of the receiver and the second end of the tube nipple being located externally to the housing and being acoustically coupled to the flexible tube portion of the flexible eartip,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the earphone providing a response that is approximately 0 dB relative to a response of the TDH-39 standard at one or both of 6 kHz and 8 kHz.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The insert earphone of claim 1 wherein the second end of the tube nipple is positioned within the flexible tube portion of the flexible eartip.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The insert earphone of claim 1 , the tube nipple and the housing being configured and arranged to form an obtuse angle between a longitudinal axis of the tube nipple and a vertical axis of the housing, wherein the housing hangs approximately vertically along the side of a user's head when worn.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The insert earphone of claim 3 wherein the angle is approximately 118 degrees.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The insert earphone of claim 1 , comprising a flexible channel located between the output port of the receiver and the first end of the tube nipple.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The insert earphone of claim 5 wherein the flexible channel has a first end and a second end, and wherein the first end of the flexible channel is coupled to the output port of the receiver and the second end of the flexible channel is coupled to the first end of the tube nipple.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The insert earphone of claim 1 , comprising an acoustic damper located in the tube nipple proximate the first end of the tube nipple.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. An insert earphone comprising:",
            "components": [
                {
                    "component": "a housing;",
                    "subcomponents": []
                },
                {
                    "component": "a receiver located in the housing and having an output port, the receiver for electrically coupling with an audio signal source;",
                    "subcomponents": []
                },
                {
                    "component": "a flexible eartip for acoustic sealing with ear canal of a user;",
                    "subcomponents": []
                },
                {
                    "component": "a tube nipple having a first end and a second end, the first end located within the housing and acoustically coupled to the output port of the receiver and the second end located externally to the housing and acoustically coupled to the flexible eartip; and",
                    "subcomponents": []
                },
                {
                    "component": "an acoustic damper located in the tube nipple proximate the first end of the tube nipple,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the insert earphone is inserted at least partially into the ear canal and is supported entirely by the ear canal when worn by the user.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The insert earphone of claim 8 , the tube nipple and the housing being configured and arranged to form an obtuse angle between a longitudinal axis of the tube nipple and a vertical axis of the housing, wherein the housing hangs approximately vertically along the side of a user's head when worn.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The insert earphone of claim 9 wherein the angle is approximately 118 degrees.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The insert earphone of claim 8 wherein the flexible eartip comprises a flexible tube portion and a foam eartip portion, and wherein at least a portion of the flexible tube portion extends through the foam eartip portion.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The insert earphone of claim 11 wherein the tube nipple is rigid and wherein the second end of the tube nipple is positioned within the flexible tube portion of the flexible eartip.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The insert earphone of claim 8 , comprising a flexible channel located between the output port of the receiver and the first end of the tube nipple.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The insert earphone of claim 13 wherein the flexible channel has a first end and a second end, and wherein the first end of the flexible channel is coupled to the output port of the receiver and the second end of the flexible channel is coupled to the first end of the tube nipple.",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation of U.S. patent application having Ser. No. 09/676,722 filed Sep. 28, 2000 now U.S. Pat. No. 6,993,144, which is based upon and claims the benefit of U.S. Provisional Patent Application having Ser. No. 60/156,777 filed Sep. 30, 1999. The above-identified applications are all hereby incorporated herein by reference in their respective entireties.",
        "The above-referenced U.S. provisional application Ser. No. 60/156,777 is hereby incorporated by reference herein in its entirety.",
        "N/A",
        "Headphone or earphone devices have been used in audiometry applications for some time. One example of such a device that has been used for many years is the TDH-39 headphone of Telephonics. The TDH-39 headphone basically comprises a metal casing that is worn on the head of a user. The casing is fitted with ear cushions that support the headphone against the outer ear in an attempt to attenuate ambient noise levels during audiometric testing. While the TDH-39 headphone has been widely used and accepted in the audiometry industry, it is quite cumbersome and uncomfortable to wear for extended periods of time and the typical leak around the cushions prevents adequate attentuation of ambient noise. In addition, because the TDH-39 has ear cushions that cover the ear canal, the TDH-39 often causes a canal “collapse” problem which may distort a user's hearing and adversely affect audiometric testing results. While superficial changes have been made to the TDH-39 over the years, such as, for example, the change from a metal to a plastic cased version (i.e., the TDH-39P), none of these changes have solved the comfort and canal collapse problems.",
        "Another example of such a device is the ER-3 earphone of Etymotic Research Inc. The ER-3 device is generally the subject of U.S. Pat. No. 4,763,753, and was introduced as an alternative to the TDH-39 for audiometric testing. The ER-3 comprises a pair of base units that each house a transducer and are each connected to an earpiece via a sound tube. The base units are worn around the neck or shoulder area while the earpieces are inserted into the ear canal of a user. The sound tubes are generally long (e.g., 10.95 inches) to enable the positioning of the transducers a sufficient distance from the ear to minimize any interference when the earphones are used, for example, with electrical response audiometry as discussed in U.S. Pat. No. 4,763,753.",
        "While the ER-3 provides sufficient ambient noise attenuation, is more comfortable to wear over extended periods of time, and addresses the collapsed canal problem, it produces a response that is nearly identical to that produced by the THD-39 except at 6 and 8 kHz. In addition, some audiologists have claimed to have difficulty calibrating the ER-3 at 6 kHz. At 8 kHz, the response of the ER-3 is attenuated to the point that it is out of the calibration range of standard audiometers. As can be seen from the frequency response curves set forth in FIG. 1A, the ER-3 response also becomes somewhat distorted at higher frequencies (e.g., at greater than approximately 6-8 kHz).",
        "A further example of a prior art device is the ER-4 earphone of Etymotic Research Inc. The ER-4 is generally the subject of U.S. Pat. No. 5,887,070, and was developed for hi-fidelity music listening applications. Because the ER-4 does not have enough output to meet the specifications of standard audiometers, however, it is generally not suitable for audiometric testing below approximately 2 kHz.",
        "Further disadvantages and limitations of prior art systems with respect to audiometric testing will become apparent to one of skill in the art through comparison of such systems with the present invention as set forth in the remainder of the present application with reference to the drawings.",
        "An improved insert earphone for audiometric testing is provided. The insert earphone generally includes a housing, a receiver located within the housing, a flexible eartip located externally to the housing, and a tube nipple. One end of the tube nipple is acoustically coupled to an output port of the receiver and the other end of the tube nipple is acoustically coupled to the flexible eartip. In use, a user places the flexible eartip in the user's ear canal such that the housing is located proximate the user's ear. Electrical signals received by the receiver from an external audio signal source are converted by the receiver into sound. The sound is then transmitted into the ear canal of the user via a sealed acoustic path including the tube nipple and the flexible eartip.",
        "In one embodiment, the housing and tube nipple may be configured and arranged such that an angle between a longitudinal axis of the tube nipple and a vertical axis is obtuse, such as 118 degrees, for example. This configuration and arrangement allows the housing to hang proximate to, and comfortably from, the ear while minimizing the stress applied to the ear canal and/or the eartip.",
        "In another embodiment, the flexible eartip may have a flexible tube portion and a foam eartip portion. The tube nipple, which may be rigid, is coupled to the flexible tube portion of flexible eartip. The flexible tube portion is of a minimum length such that a user may grasp the housing and insert the foam eartip portion of the flexible eartip into the user's ear canal.",
        "In a further embodiment, the tube nipple may have an input end that is located within the housing and coupled to the receiver, and an output end located externally to the housing and coupled to the flexible eartip. The insert earphone may also have an acoustic damper located within the tube nipple at or near the input end of the tube nipple. Such a location of the damper away from the output end of the tube nipple effectively prevents the damper from being clogged with earwax, minimizing the need for damper replacement. Instead, the flexible eartip may be decoupled from the output end of the tube nipple and replaced with a new flexible eartip.",
        "Other aspects, advantages and novel features of the present invention will become apparent from the following detailed description of the invention when considered in conjunction with the accompanying drawings.",
        "FIG. 1A illustrates frequency response curves of a prior art earphone device.",
        "FIG. 1B illustrates an embodiment of an insert earphone assembly built in accordance with the present invention.",
        "FIG. 1C illustrates full insertion of an embodiment of an insert earphone assembly built in accordance with the present invention.",
        "FIG. 1D illustrates shallow insertion of an embodiment of an insert earphone assembly built in accordance with the present invention.",
        "FIG. 2 illustrates a desirable configuration of one embodiment of the unitary housing built in accordance with the present invention.",
        "FIG. 3 illustrates detail of one embodiment of the flexible eartip of FIG. 1.",
        "FIG. 4 illustrates detail of one embodiment of the socket of FIG. 1.",
        "FIG. 5 illustrates one embodiment of the cable of FIG. 1.",
        "FIG. 6 illustrates electrical connections and equalization circuitry for the embodiment of the cable illustrated in FIG. 5.",
        "FIG. 7 illustrates an alternative embodiment of the tube nipple of FIG. 1.",
        "FIG. 8 illustrates the frequency response of the eartip assembly of the present invention, as compared to a prior art earphone device.",
        "FIG. 9 illustrates frequency response curves of the insert earphone assembly of the present invention.",
        "FIG. 10 illustrates the maximum undistorted output of the invention compared to that of a prior art device.",
        "FIG. 1B illustrates an embodiment of an insert earphone assembly 1 built in accordance with the present invention. The insert earphone 1 has a unitary housing 3. The unitary housing 3 is formed of two housing components 5 and 7 that snap fit against a rigid tube nipple 9 at a top end 11 of the unitary housing 3 and against a socket 13 at a bottom end 15 of the unitary housing 3. Alternatively, the housing components 5 and 7 may be assembled using screws.",
        "More specifically, housing components 5 and 7 have grooves 17 and 19, respectively, located at the top end 11 of the unitary housing 3 that, upon assembly of the unitary housing 3, engage a flange portion 21 of tube nipple 9. Similarly, housing components 5 and 7 have grooves 23 and 25, respectively, located at the bottom end 15 of the unitary housing 3 that, upon assembly of the unitary housing 3, engage a flange portion 27 of the socket 13. Such a snap fit configuration provides for ease of assembly and disassembly of the unitary housing 3. Tube nipple 9 may be, for example, an ER 3-04 nipple, and socket 13 may be, for example, an MS868 socket, available from Etymotic Research Inc. Tube nipple 9 may also be an integral part of the unitary housing 3. In other words, the tube nipple 9 may be formed as part of the unitary housing 3.",
        "Tube nipple 9 has an outer portion 29 that is located on the outside of unitary housing 3 and all inner portion 31 that is located within the unitary housing 3. Inner portion 31 of tube nipple 9 mates with a flexible tubing 33 located within the unitary housing 3. More particularly, the inner portion 31 of tube nipple 9 is inserted into an output end 34 of a channel 35 in flexible tubing 33. The flexible tubing 33 provides an acoustic seal for an input end 37 of the tube nipple 9.",
        "The outer portion 29 of tube nipple 9 likewise mates with a flexible eartip 39. More particularly, the outer portion 29 of tube nipple 9 is inserted into a tube portion 41 of flexible eartip 39. Tube portion 41 forms an acoustic seal between an output end 43 of tube nipple 9 and the ear canal of a user. Flexible eartip 39 may be, for example, an ER-14 eartip available from Etymotic Research Inc. Other types of eartips may also be used, such as, for example, that shown in our U.S. Pat. No. 5,887,070.",
        "An acoustic damper 44 is preferably located in inner portion 31 of tube nipple 9, near input end 37 of tube nipple 9. It is desirable to locate the acoustic damper 44 as such, i.e., far enough away from the output end 43 of tube nipple 9, so that it does not become clogged from, for example, ear wax. This wax free and simple construction enables the flexible eartip 39 to be replaced after use, and eliminates the need for a separate damper replacement kit such as that sold with prior art devices.",
        "Acoustic damper 44 serves to cancel a resonance at lower frequencies. The remaining horn/resonance effect (e.g., between 3 and 5 KHz) is used to help equalization. Acoustic damper 44 may be, for example, 680 Ω.",
        "A receiver 45 is mounted within unitary housing 3. For example, receiver 45 is mounted on an inner surface 47 of housing portion 5. A shock absorbing material 49 is placed between the surface 47 and the receiver 45 to dampen any vibrations that may be transmitted by the unitary housing 3. The receiver 45 and shock absorbing material 49 may be mounted using glue or other adhesive type material.",
        "Receiver 45 has an output port 51 that mates with the flexible tubing 33. More specifically, output port 51 is inserted into an input end 53 of channel 35 in flexible tubing 33. Flexible tubing 33 provides an acoustic seal for the output port 51 of receiver 45.",
        "Receiver 45 is electrically coupled to an audio signal source such as, for example, an audiometer, via wire 55, socket 13 and cable 57. Cable 57, may be, for example, an ER5-10 cable available from Etymotic Research Inc.",
        "During operation of the earphone assembly, electrical signals representative of sound energy are received from an audio signal source (not shown) and transmitted via cable 57, socket 13 and wire 55 to receiver 45. Receiver 45 transduces the electrical signals received into sound energy and transmits the sound energy through output port 51. The sound energy is then coupled to the ear canal of a user through channel 35 of flexible tubing 33 and through tube nipple 9. As set forth below, the electrical signals received by the receiver 45 may be equalized signals.",
        "FIG. 1C illustrates full insertion of an embodiment of an insert earphone assembly built in accordance with the present invention. Referring to FIG. 1C, there is illustrated the insert earphone assembly 1 connected to cable 57 and fully inserted into the ear canal 80 of a user. In accordance with an aspect of the invention, the flexible eartip 39 may be fully inserted into the ear canal 80 and the insert earphone may be supported entirely by the ear canal 80 of the user.",
        "FIG. 1D illustrates shallow insertion of an embodiment of an insert earphone assembly built in accordance with the present invention. Referring to FIG. 1D, there is illustrated the insert earphone assembly 1 connected to cable 57 and partially inserted into the ear canal 80 of a user. In accordance with an aspect of the invention, for shallow insertion of the earphone 1, the flexible eartip 39 may be partially inserted into the ear canal 80. The insert earphone 1, however, may still be supported entirely by the ear canal 80 of the user.",
        "FIG. 2 illustrates a desirable configuration of one embodiment of the unitary housing 3 built in accordance with the present invention. Angle theta from the vertical axis 58 to a longitudinal axis 60 of the tube nipple 9 is optimized for the typical ear canal, and allows the unitary housing 3 to hang vertically along the side of a user's head when worn. Angle theta is an obtuse angle and may be, for example, 118°.",
        "FIG. 3 illustrates detail of one embodiment of the eartip 39 of FIG. 1. As is apparent from FIG. 3, and as mentioned above, flexible eartip 39 comprises a tube portion 41 and a foam portion 42. The tube portion 41 is flexible and may be PVC-105 tubing. The tube portion 41 extends through foam portion 42 such that sound passes through foam portion 42 via tube portion 41, and enters the inner ear when the foam portion 42 is fitted within the ear canal of a user. The foam portion 42 generally provides an acoustic seal with the ear canal and provides sufficient attenuation of background noise levels for audiometric testing.",
        "As can be seen from FIG. 3, eartip 39 (and thus tube portion 41) may have a total length dimension of 26 mm, and the foam portion 42 may have a total length dimension of 13 mm. Because of the short length of the tube portion 41, even though it is flexible, a user may grasp the unitary housing 3 and use the unitary housing 3 as a convenient handle for inserting the foam portion 42 into the ear canal for sealing therewith.",
        "FIG. 4 illustrates detail of one embodiment of the socket 13 of FIG. 1. The socket 13 may have the dimensions shown in FIG. 4.",
        "FIG. 5 illustrates one embodiment of the cable 57 of FIG. 1. Cable 57 includes a pod 59, button 61, mono plugs 63 and 65, and plugs 67 and 69. Plugs 63 and 65 plug into an audio signal source, such as for example, an audiometer. Plugs 67 and 69 plug into respective earphone assemblies 1, one for each ear. Specifically, plug 67 mates with socket 13 of unitary housing 3 of one earphone assembly 1, and plug 69 mates with socket 13 of unitary housing 3 of another earphone assembly 1.",
        "FIG. 6 illustrates electrical connections and equalization circuitry for the embodiment of the cable 57 illustrated in 5. While the equalization circuitry is shown as being located in pod 59 of cable 57, it may also be located in unitary housing 3 of FIG. 1 or plugs 63 and 65 of cable 57.",
        "FIG. 7 illustrates an alternate embodiment of the tube nipple of the eartip assembly of the present invention. Tube nipple 70 may have the dimensions as shown in FIG. 7.",
        "FIG. 8 illustrates the frequency response of the eartip assembly 1 of FIG. 1. Curve 71 shows the response of the eartip assembly 1 using the equalization circuitry of FIG. 6. For comparison, curve 73 shows the response of the prior art eartip mentioned above, i.e., the ER-3A of Etymotic Research Inc. As can be seen from FIG. 8, the present invention provides a better high frequency response than the ER-3A prior art eartip.",
        "FIG. 9 illustrates frequency response curves of the insert earphone assembly of the present invention. The curves of FIG. 9 are similar to those mentioned above with respect to FIG. 1A for the prior art ER-3 earphone device. As can be seen from a comparison of FIG. 1A and FIG. 9, the present invention provides a better undistorted output at higher frequencies (i.e., at greater than approximately 6-8 kHz) and a better high frequency response than the prior art ER-3 device. In addition, the present invention maintains desired noise isolation and has a low occlusion effect relative to the prior art.",
        "The present invention therefore solves the collapsed canal problem as achieved by the prior art ER-3, but provides a TDH-39 prior art like response shape at higher frequencies than the ER-3 within the calibration range of standard audiometers. Just as important, the maximum undistorted output (i.e., having ≦3% THD) at 6 and 8 kHz is approximately 20-25 dB greater with the present invention than is possible with the prior art ER-3, as shown in FIG. 10. In other words, the present invention has a response approximately 0 dB relative to TDH-39 and a sensitivity within range of the TDH-39 standard, unlike the ER-3. This is achieved by an assembly that is much more compact and is much cheaper and easier to manufacture than the prior art ER-3. In addition, because of its unique angle (as discussed above with respect to FIG. 2) and its compact design, the assembly of the present invention is more comfortable to wear than both the prior art TDH-39 and ER-3.",
        "In view of the above-detailed description of the present invention and associated drawings, other modifications and variations will now become apparent to those skilled in the art. It should also be apparent that such modifications and variations may be effected without departing from the spirit and scope of the present invention."
    ],
    "citations": [
        "2430229",
        "2971065",
        "3408461",
        "3529102",
        "3671685",
        "3789164",
        "3819860",
        "3983336",
        "4170720",
        "4447677",
        "4520236",
        "4592087",
        "4646872",
        "4677675",
        "4677679",
        "4689819",
        "4739512",
        "4763753",
        "4781196",
        "4852177",
        "4852683",
        "4870688",
        "4880076",
        "5046580",
        "5099856",
        "5113967",
        "5128566",
        "5131046",
        "5144675",
        "5208867",
        "5488205",
        "5748743",
        "5887070",
        "5975235",
        "6286622",
        "6411722",
        "6993144",
        "648172",
        "2155276",
        "0043700",
        "0238196",
        "0290295"
    ],
    "us_classification": "381328",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "04",
            "subclass": "R",
            "main_group": "25",
            "subgroup": "00"
        }
    ]
}