{
    "title": "Aiming indicia for a bar code and method of use",
    "abstract": "An aiming indicia is provided for a bar code comprising a sequence of parallel code bars and intervening code spaces disposed along a longitudinal code axis in accordance with a predefined standard. The aiming indicia comprises a non-encoded graphic element disposed on the longitudinal code axis adjacent the bar code and spaced apart from the nearest code bars by a distance of at least 10 times a minimum unit width for the code bars.",
    "inventors": [
        "Philyaw",
        "Roberts"
    ],
    "document_number": "07296746",
    "publication_date": "20071120",
    "assignees": [
        "LV Partners, L.P."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An aiming indicia for a bar code comprising a sequence of code bars and intervening code spaces disposed along a longitudinal code axis in accordance with a predefined standard and which bar code is operable to be interfaced with a hand scanner that is operable to require that, prior to scanning the first code bar therein, the scanner must have a predetermined acceleration along the longitudinal axis of the bar code, the aiming indicia comprising:",
            "components": [
                {
                    "component": "a non-encoded graphic element disposed on the longitudinal code axis adjacent the bar code at the beginning thereof relative to the encoded sequence and spaced apart from the nearest code bars by a distance measured in a predetermined number of widths for the code bars and indicating that it is the beginning for a scan operation by the scanner.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. An aiming indicia in accordance with claim 1 , wherein the graphic element has a height, measured in a direction perpendicular to the longitudinal code axis, within a range from about 50% to about 105% of the height of the code bars.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. An aiming indicia in accordance with claim 2 , wherein the graphic element has a height within a range from about 85% to about 100% of the height of the code bars.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. An aiming indicia in accordance with claim 3 , wherein the graphic element has a height of about 95% of the height of the code bars.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. An aiming indicia in accordance with claim 3 , wherein the graphic element is separated from the nearest portion of the bar code by a distance, measured in a direction parallel to the longitudinal code axis, within a range from about 15% to about 30% of the height of the element.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. An aiming indicia in accordance with claim 5 , wherein the graphic element is separated from the nearest portion of the bar code by a distance within a range from about 18% to about 24% of the height of the element.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. An aiming indicia in accordance with claim 6 , wherein the graphic element is separated from the nearest portion of the bar code by a distance of about 20% of the height of the element.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. An aiming indicia in accordance with claim 1 , wherein the graphic element is at least partially rendered in a red color.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. An aiming indicia in accordance with claim 1 , wherein the graphic element is at least partially rendered in a color contrasting with the color of the code bars.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. An aiming indicia in accordance with claim 9 , wherein the graphic element is at least partially red in color and the code bars are black in color.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. An aiming indicia in accordance with claim 1 , wherein the graphic element further comprises a plurality of discrete non-encoded sub-elements.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. An aiming indicia in accordance with claim 11 , wherein a first sub-element is a colon and a second stab-element is a letter C.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. An aiming indicia in accordance with claim 12 , wherein the first and second sub-elements have a portion of their interior rendered in a red color.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. An aiming indicia in accordance with claim 13 , wherein the first and second sub-elements have an outline portion rendered in a black color.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A method for facilitating a reading of a bar code using a manual optical reader, the bar code comprising a sequence of code bars and intervening code spaces disposed along a scanning longitudinal code axis, the optical reader having an optical axis defining a target region sensible by the optical reader and which bar code is operable to be interfaced with a manual optical reader that is operable to require that, prior to scanning the first code bar therein, the manual optical reader have a predetermined acceleration along the longitudinal axis of the bar code, the method comprising the following steps:",
            "components": [
                {
                    "component": "providing a non-encoded aiming indicia disposed along the longitudinal code axis adjacent the bar code at the beginning thereof relative to the encoded sequence and spaced apart from the nearest code bars by a distance measured in a predetermined number of widths for the code bars; and",
                    "subcomponents": []
                },
                {
                    "component": "inducing users of optical readers to first direct the optical axis of the optical reader such that the target region is centered on the aiming indicia at the beginning of the encoded sequence and then to direct the optical axis of the optical reader such that the target region sweeps along the longitudinal code axis from the aiming indicia across the bar code.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A method in accordance with claim 15 , wherein the step of inducing comprises providing instructions for the use of the aiming indicia along with operating instructions for the manual optical reader.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. A method in accordance with claim 15 , wherein the step of inducing comprises printing instructions for the use of the aiming indicia on an article of commerce bearing the aiming indicia.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. A method in accordance with claim 15 , wherein the step of inducing comprises providing, instructions for the use of the aiming indicia on a television program.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. An enhanced bar code for encoding information in machine-readable form, comprising:",
            "components": [
                {
                    "component": "an encoded character string including a plurality of encoded characters disposed along a longitudinal code axis, each character being formed by a sequence of code bars and intervening code spaces, the code bars being parallel to one another and to a line defining a bar axis which intersects the longitudinal code axis, each character having a definition in accordance with a predefined standard and which bar code is operable to be interfaced with a hand scanner that is operable to require that, prior to scanning the first code bar therein, the scanner must have a predetermined acceleration along the longitudinal axis of the bar code; and",
                    "subcomponents": []
                },
                {
                    "component": "a non-encoded aiming indicia disposed on the longitudinal code axis adjacent the encoded character string at the beginning thereof relative to the encoded sequence and spaced apart from the nearest code bars by a distance measured in a predetermined number of widths for the code bars.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. A bar code in accordance with claim 19 , wherein the definition for each character includes:",
            "components": [
                {
                    "component": "a bar/space pattern associated with the character setting forth the respective widths of the code bars and code spaces making up the character in terms of integer multiples of the minimum unit width,",
                    "subcomponents": []
                },
                {
                    "component": "at least one encoded alphanumeric value associated with the character, and",
                    "subcomponents": []
                },
                {
                    "component": "an integer checksum value associated with the character.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application is a Continuation Application of U.S. Ser. No. 09/580,793 filed May 30, 2000, which will issue as U.S. Pat. No. 6,843,417, on Jan. 18, 2005, which is a Continuation-In-Part of the following two U.S. patent applications: Ser. No. 09/382,421 filed Aug. 24, 1999 and entitled “A COMBINED PRODUCT CODE AND INSIGNIA FOR SIGNIFYING AN INTERNAL INTERACTIVE CODE” and Ser. No. 09/491,136 filed Jan. 26, 2000 now U.S. Pat. No. 6,708,208 and entitled, “UNIQUE BAR CODE FOR INDICATING A LINK BETWEEN A PRODUCT AND A REMOTE LOCATION ON A WEB NETWORK”, each of which is a Continuation-In-Part of U.S. patent application Ser. No. 09/378,221 filed Aug. 19, 1999 now U.S. Pat. No. 6,745,234 and entitled “METHOD AND APPARATUS FOR ACCESSING A REMOTE LOCATION BY SCANNING AN OPTICAL CODE”, which is a Continuation-In-Part of the following two U.S. patent applications: Ser. No. 09/151,471 filed Sep. 11, 1998 now abandoned and entitled, “METHOD FOR INTERFACING SCANNED PRODUCT INFORMATION WITH A SOURCE FOR THE PRODUCT OVER A GLOBAL NETWORK”, and Ser. No. 09/151,530 filed Sep. 11, 1998 now U.S. Pat. No. 6,098,106 and entitled, “METHOD FOR CONTROLLING COMPUTERS THROUGH A RADIO/TELEVISION COMMUNICATION HUB”.",
        "This invention relates generally to bar codes for encoding information in machine-readable form. In one aspect, it relates to an aiming indicia for use with a bar code to facilitate its reading.",
        "With the growing numbers of computer users connecting to the “Internet,” many companies are seeking the substantial commercial opportunities presented by such a large user base. For example, one technology which exists allows a television (“TV”) signal to trigger a computer response in which the consumer will be guided to a personalized web page. The source of the triggering signal may be a TV, video tape recorder, or radio. For example, if a viewer is watching a TV program in which an advertiser offers viewer voting, the advertiser may transmit a unique signal within the television signal which controls a program known as a “browser” on the viewer's computer to automatically display the advertiser's web page. The viewer then simply makes a selection which is then transmitted back to the advertiser.",
        "In order to provide the viewer with the capability of responding to a wide variety of companies using this technology, a database of company information and Uniform Resource Locator (“URL”) codes is necessarily maintained in the viewer's computer, requiring continuous updates. URLs are short strings of data that identify resources on the Internet: documents, images, downloadable files, services, electronic mailboxes, and other resources. URLs make resources available under a variety of naming schemes and access methods such as HTTP, FTP, and Internet mail, addressable in the same simple way. URLs reduce the tedium of “login to this server, then issue this magic command . . . ” down to a single click. The Internet uses URLs to specify the location of files on other servers. A URL includes the type of resource being accessed (e.g., Web, gopher, FTP), the address of the server, and the location of the file. The URL can point to any file on any networked computer. Current technology requires the viewer to perform periodic updates to obtain the most current URL database. This aspect of the current technology is cumbersome since the update process requires downloading information to the viewer's computer. Moreover, the likelihood for error in performing the update, and the necessity of redoing the update in the event of a later computer crash, further complicates the process. Additionally, current technologies are limited in the number of companies which may be stored in the database. This is a significant limitation since world-wide access presented by the Internet and the increasing number of companies connecting to perform on-line E-commerce necessitates a large database.",
        "Many types of optical readers are known, however, their cost and complexity have heretofore limited their use primarily to industrial and commercial users. Now, many new network-based technologies are being developed for home users which involve optical scanning. Thus, a need exists for a simple, low cost optical reader which can be attached to a personal computer.",
        "Many types of bar codes are known for encoding machine-readable information in accordance with existing standards, for example Code 128, EAN 128, Codabar, the EAN 8 and 13 series, the ISBN series, the ISSN series, ITF, the JAN 8 and 13 series, Pharmacode, the UPC-A and -E series, Plessy and Code 39. Such bar codes are used for a variety of commercial purposes including inventory control, retail sales, shipping information, etc. For a number of reasons, including the expansion of computer-based commerce and network-based commercial activities, a need exists for new bar codes which can be distinguished from existing bar codes.",
        "Low cost optical readers which can be attached to personal computers will increase the number of persons having access to bar code technology. However, a relatively small percentage of the public is actually trained in the use of such equipment. A need therefor exists, for bar codes which facilitate accurate reading by inexperienced users.",
        "The present invention disclosed and claimed herein comprises, in one aspect thereof, an aiming indicia for a bar code comprising a sequence of parallel code bars and intervening code spaces disposed along a longitudinal code axis in accordance with a predefined standard. The aiming indicia comprises a non-encoded graphic element disposed on the longitudinal code axis adjacent the bar code and spaced apart from the nearest code bars by a distance of at least 10 times a minimum unit width for the code bars.",
        "For a more complete understanding of the present invention and the advantages thereof, reference is now made to the following description taken in conjunction with the accompanying Drawings in which:",
        "FIG. 1 illustrates a block diagram of the preferred embodiment;",
        "FIG. 2 illustrates the computer components employed in this embodiment;",
        "FIG. 3 illustrates system interactions over a global network;",
        "FIGS. 4a-4e illustrate the various message packets transmitted between the source PC and network servers used in the preferred embodiment;",
        "FIG. 5 is a flowchart depicting operation of the system according to the preferred embodiment;",
        "FIG. 6 illustrates a flowchart of actions taken by the Advertiser Reference Server (“ARS”) server;",
        "FIG. 7 illustrates a flowchart of the interactive process between the source computer and ARS;",
        "FIG. 8 illustrates a web browser page receiving the modified URL/advertiser product data according to the preferred embodiment;",
        "FIG. 9 illustrates a simplified block diagram of the disclosed embodiment;",
        "FIG. 10 illustrates a more detailed, simplified block diagram of the embodiment of FIG. 9;",
        "FIG. 11 illustrates a diagrammatic view of a method for performing the routing operation;",
        "FIG. 12 illustrates a block diagram of an alternate embodiment utilizing an optical region in the video image for generating the routing information;",
        "FIG. 13 illustrates a block diagram illustrating the generation of a profile with the disclosed embodiment;",
        "FIG. 14 illustrates a flowchart for generating the profile and storing at the ARS;",
        "FIG. 15 illustrates a flowchart for processing the profile information when information is routed to a user;",
        "FIG. 16 illustrates a general block diagram of a disclosed embodiment;",
        "FIG. 17 illustrates the conversion circuit of the wedge interface;",
        "FIG. 18 illustrates a sample message packet transmitted from the user PC to the ARS;",
        "FIG. 19 illustrates a more detailed block diagram of the routing of the message packets between the various nodes;",
        "FIG. 20 illustrates a block diagram of a browser window, according to a disclosed embodiment;",
        "FIG. 21 illustrates a diagrammatic view of information contained in the ARS database;",
        "FIG. 22 illustrates a flowchart of the process of receiving information from the user's perspective;",
        "FIG. 23 illustrates a flowchart according to the ARS;",
        "FIG. 24 illustrates a flowchart of the process performed at the E-commerce node;",
        "FIG. 25 illustrates reading a bar code with an optical reader according to an embodiment of the invention;",
        "FIG. 26 illustrates a top plan view of an optical reader according to an embodiment of the invention;",
        "FIG. 27 illustrates a front elevation view of the optical reader viewed from line 27-27 of FIG. 26;",
        "FIG. 28 illustrates a general functional block diagram of the components of an optical reader in accordance with an embodiment of the invention;",
        "FIG. 29 illustrates the optical reader of FIG. 26 with portions of the outer shell removed to show the interior components;",
        "FIG. 30 illustrates an enlarged view of the optical system of the optical reader while reading a bar code;",
        "FIG. 31 illustrates a perspective view of the detector unit used in an embodiment of the optical reader;",
        "FIG. 32 illustrates an exploded view of the detector unit of FIG. 31;",
        "FIG. 33 illustrates a top plan view of an optical reader according to another embodiment of the invention;",
        "FIG. 34 illustrates a side elevation view of the optical reader of FIG. 33;",
        "FIG. 35 illustrates a front elevation view of the optical reader viewed from line 35-35 of FIG. 33;",
        "FIG. 36 illustrates a flowchart of one embodiment of the process for reading a bar code;",
        "FIGS. 37a and 37b illustrate an operation wherein a bar code is associated with a unique indicia;",
        "FIG. 38a illustrates a diagrammatic view of a unique ornamental bar code for being associated with a product;",
        "FIG. 38b illustrates an alternate embodiment of an ornamental bar code;",
        "FIG. 39 illustrates a product on which the bar code of FIG. 38a is disposed;",
        "FIG. 40 illustrates a unique bar code for encoding machine-readable information;",
        "FIG. 41 illustrates a flowchart for one embodiment of a process for facilitating the manual reading of a bar code from the perspective of the bar code sponsor; and",
        "FIG. 42 illustrates a flowchart of the process from the user's perspective.",
        "Referring now to FIG. 1, there is illustrated a block diagram of a system for controlling a personal computer (“PC”) 112 via an audio tone transmitted over a wireless system utilizing a TV. In the embodiment illustrated in FIG. 1, there is provided a transmission station 101 and a receive station 117 that are connected via a communication link 108. The transmission station 101 is comprised of a television program source 104, which is operable to generate a program in the form of a broadcast signal comprised of video and audio. This is transmitted via conventional techniques along channels in the appropriate frequencies. The program source is input to a mixing device 106, which mixing device is operable to mix in an audio signal. This audio signal is derived from an audio source 100 which comprises a coded audio signal which is then modulated onto a carrier which is combined with the television program source 104. This signal combining can be done at the audio level, or it can even be done at the RF level in the form of a different carrier. However, the preferred method is to merely sum the audio signal from the modulator 102 into the audio channel of the program that is generated by the television program source 104. The output thereof is provided from the mixing device 106 in the form of broadcast signal to an antenna 107, which transmits the information over the communication link 108 to an antenna 109 on the receive side.",
        "On the receive side of the system, a conventional receiver 110, such as a television is provided. This television provides a speaker output which provides the user with an audible signal. This is typically associated with the program. However, the receiver 110 in the disclosed embodiment, also provides an audio output jack, this being the type RCA jack. This jack is utilized to provide an audio output signal on a line 113 which is represented by an audio signal 111. This line 113 provides all of the audio that is received over the communication link 108 to the PC 112 in the audio input port on the PC 112. However, it should be understood that, although a direct connection is illustrated from the receiver 110 to the PC 112, there actually could be a microphone pickup at the PC 112 which could pick the audio signal up. In the disclosed embodiment, the audio signal generated by the advertiser data input device 100 is audible to the human ear and, therefore, can be heard by the user. Therefore, no special filters are needed to provide this audio to the PC 112.",
        "The PC 112 is operable to run programs thereon which typically are stored in a program file area 116. These programs can be any type of programs such as word processing programs, application programs, etc. In the disclosed embodiment, the program that is utilized in the system is what is referred to as a “browser.” The PC 112 runs a browser program to facilitate the access of information on the network, for example, a global communication network known as the “Internet” or the World-Wide-Web (“Web”). The browser is a hypertext-linked application used for accessing information. Hypertext is a term used to describe a particular organization of information within a data processing system, and its presentation to a user. It exploits the computer's ability to link together information from a wide variety of sources to provide the user with the ability to explore a particular topic. The traditional style of presentation used in books employs an organization of the information which is imposed upon it by limitations of the medium, namely fixed sized, sequential paper pages. Hypertext systems, however, use a large number of units of text or other types of data such as image information, graphical information, video information, or sound information, which can vary in size. A collection of such units of information is termed a hypertext document, or where the hypertext documents employ information other than text, hypermedia documents. Multimedia communications may use the Hypertext Transfer Protocol (“HTTP”), and files or formatted data may use the Hypertext Markup Language (“HTML”). This formatting language provides for a mingling of text, graphics, sound, video, and hypertext links by “tagging” a text document using HTML. Data encoded using HTML is often referred to as an “HTML document,” an “HTML page,” or a “home page.” These documents and other Internet resources may be accessed across the network by means of a network addressing scheme which uses a locator referred to as a Uniform Resource Locator (“URL”), for example, “http://www.digital.com.”",
        "The Internet is one of the most utilized networks for interconnecting distributed computer systems and allows users of these computer systems to exchange data all over the world. Connected to the Internet are many private networks, for example, corporate or commercial networks. Standard protocols, such as the Transport Control Protocol (“TCP”) and the Internet Protocol (“IP”) provide a convenient method for communicating across these diverse networks. These protocols dictate how data are formatted and communicated. As a characteristic of the Internet, the protocols are layered in an IP stack. At higher levels of the IP stack, such as the application layer (where HTTP is employed), the user information is more readily visible, while at lower levels, such as the network level (where TCP/IP are used), the data can merely be observed as packets or a stream of rapidly moving digital signals. Superimposed on the Internet is a standard protocol interface for accessing Web resources, such as servers, files, Web pages, mail messages, and the like. One way that Web resources can be accessed is by browsers made by Netscape® and Microsoft Internet Explorer®.",
        "Referring again now to FIG. 1, the user can load this program with the appropriate keystrokes such that a browser window will be displayed on a display 118. In one embodiment, the user can run the browser program on the PC 112 such that the browser window is displayed on the display 118. While watching a preferred program, the user can also view display 118. When an audio signal is received by the receiver 110 and the encoded information is contained therein that was input thereto by the advertiser, the PC 112 will then perform a number of operations. The first operation, according to the disclosed embodiment, is to extract the audio information within the received audio signal in the form of digital data, and then transmit this digital data to a defined location on the global communication network via a modem connection 114. This connection will be described hereinbelow. This information will be relayed to a proprietary location and the instructions sent back to the PC 112 as to the location of the advertiser associated with the code, and the PC 112 will then effect a communication link to that location such that the user can view on the display 118 information that the advertiser, by the fact of putting the tone onto the broadcast channel, desires the viewer to view. This information can be in the form of interactive programs, data files, etc. In one example, when an advertisement appears on the television, the tone can be generated and then additional data displayed on the display 118. Additionally, a streaming video program could be played on the PC received over the network, which streaming video program is actually longer than the advertising segment on the broadcast. Another example would be a sports game that would broadcast the tone in order to allow a user access to information that is not available over the broadcast network, such as additional statistics associated with the sports program, etc.",
        "By utilizing the system described herein with respect to the disclosed embodiment of FIG. 1, an advertiser is allowed the ability to control a user's PC 112 through the use of tones embedded within a program audio signal. As will described hereinbelow, the disclosed embodiment utilizes particular routing information stored in the PC 112 which allows the encoded information in the received audio signal to route this information to a desired location on the network, and then allow other routing information to be returned to the PC 112 for control thereof to route the PC 112 to the appropriate location associated with that code.",
        "Referring now to FIG. 2, there is illustrated a computer 204, similar to computer 112, connected to display information on display 118. The computer 204 comprises an internal audio or “sound” card 206 for receiving the transmitted audio signal through receive antenna 109 and receiver 110. The sound card 206 typically contains analog-to-digital circuitry for converting the analog audio signal into a digital signal. The digital signal may then be more easily manipulated by software programs. The receiver 110 separates the audio signal from the video signal. A special trigger signal located within the transmitted advertiser audio signal triggers proprietary software running on the computer 204 which launches a communication application, in this particular embodiment, the web browser application located on the PC 204. Coded advertiser information contained within the audio signal is then extracted and appended with the address of a proprietary server located on the communication network.",
        "The remote server address is in the form of a URL. This appended data, in addition to other control codes, is inserted directly into the web browser application for automatic routing to the communication network. The web browser running on PC 204, and communicating to the network with an internal modem 208, in this embodiment, transmits the advertiser information to the remote server. The remote server cross-references the advertiser product information to the address of the advertiser server located on the network. The address of the advertiser server is routed back through the PC 204 web browser to the advertiser server. The advertiser product information is returned to PC 204 to be presented to the viewer on display 118. In this particular embodiment, the particular advertiser product information displayed is contained within the advertiser's web page 212. As mentioned above, the audio signal is audible to the human ear. Therefore the audio signal, as emitted from the TV speakers, may be input to the sound card 206 via a microphone. Furthermore, the audio signal need not be a real-time broadcast, but may be on video tapes, CDs, DVD, or other media which may be displayed at a later date. With the imminent implementation of high definition digital television, the audio signal output from the TV may also be digital. Therefore, direct input into a sound card for A/D purposes may not be necessary, but alternative interfacing techniques to accommodate digital-to-digital signal formats would apply.",
        "Referring now to FIG. 3, there is illustrated a source PC 302, similar to PCs 204 and 112, connected to a global communication network (“GCN”) 306 through an interface 304. In this embodiment, the audio signal 111 is received by PC 302 through its sound card 206. The audio signal 111 comprises a trigger signal which triggers proprietary software into launching a web browser application residing on the PC 302. The audio signal 111 also comprises advertiser product information which is extracted and appended with URL information of an Advertiser Reference Server (“ARS”) 308. The ARS 308 is a system disposed on the GCN 306 that is defined as the location to which data in the audio signal 111 is to be routed. As such, data in the audio signal 111 will always be routed to the ARS 308, since a URL is unique on the GCN 306. Connected to the ARS 308 is a database 310 of product codes and associated manufacturer URLs. The database 310 undergoes a continual update process which is transparent to the user. As companies sign-on, i.e., subscribe, to this technology, manufacturer and product information is added to the database 310 without interrupting operation of the source PC 302 with frequent updates. When the advertiser server address URL is obtained from the ARS database 310, it and the request for the particular advertiser product information are automatically routed back through the web browser on PC 302, over to the respective advertiser server for retrieval of the advertiser product information to the PC 302. Additionally, although the disclosed invention discusses a global communication network, the system is also applicable to LANs, WANs, and peer-to-peer network configurations. It should be noted that the disclosed architecture is not limited to a single source PC 302, but may comprise a plurality of source PCs, e.g., PC 300 and PC 303. Moreover, a plurality of ARS 308 systems and advertiser servers 312 may be implemented, e.g., ARS 314, and advertiser server A 316, respectively.",
        "The information transactions, in general, which occur between the networked systems of this embodiment, over the communication network, are the following. The web browser running on source PC 302 transmits a message packet to the ARS 308 over Path “A.” The ARS 308 decodes the message packet and performs a cross-reference function with product information extracted from the received message packet to obtain the address of an advertiser server 312. A new message packet is assembled comprising the advertiser server 312 address, and sent back to the source PC 302 over Path “B.” A “handoff” operation is performed whereby the source PC 302 browser simply reroutes the information on to the advertiser server 312 over Path “C,” with the appropriate source and destination address appended. The advertiser server 312 receives and decodes the message packet. The request-for-advertiser-product-information is extracted and the advertiser 312 retrieves the requested information from its database for transmission back to the source PC 302 over Path “D.” The source PC 302 then processes the information, i.e., for display to the viewer. The optional Path “E” is discussed hereinbelow. It should be noted that the disclosed methods are not limited to only browser communication applications, but may accommodate, with sufficient modifications by one skilled in the art, other communication applications used to transmit information over the Internet or communication network.",
        "Referring now to FIG. 4a, the message packet 400 sent from the source PC 302 to ARS 308 via Path “A” comprises several fields. One field comprises the URL of the ARS 308 which indicates where the message packet is to be sent. Another field comprises the advertiser product code or other information derived from the audio signal 111, and any additional overhead information required for a given transaction. The product code provides a link to the address of the advertiser server 312, located in the database 310. Yet another field comprises the network address of the source PC 302. In general, network transmissions are effected in packets of information, each packet providing a destination address, a source address, and data. These packets vary depending upon the network transmission protocol utilized for communication. Although the protocols utilized in the disclosed embodiment are of a conventional protocol suite commonly known as TCP/IP, it should be understood that any protocols providing the similar basic functions can be used, with the primary requirement that a browser can forward the routing information to the desired URL in response to keystrokes being input to a PC. Within the context of this disclosure, “message packet” shall refer to and comprise the destination URL, product information, and source address, even though more than a single packet must be transmitted to effect such a transmission.",
        "Upon receipt of the message packet 400 from source PC 302, ARS 308 processes the information in accordance with instructions embedded in the overhead information. The ARS 308 specifically will extract the product code information from the received packet 400 and, once extracted, will then decode this product code information. Once decoded, this information is then compared with data contained within the ARS advertiser database 310 to determine if there is a “hit.” If there is no “hit” indicating a match, then information is returned to the browser indicating such. If there is a “hit,” a packet 402 is assembled which comprises the address of the source PC 302, and information instructing the source PC 302 as to how to access, directly in a “handoff” operation, another location on the network, that of an advertiser server 312. This type of construction is relatively conventional with browsers such as Netscape® and Microsoft Internet Explorer® and, rather than displaying information from the ARS 308, the source PC 302 can then access the advertiser server 312. The ARS 308 transmits the packet 402 back to source PC 302 over Path “B.” Referring now to FIG. 4b, the message packet 402 comprises the address of the source PC 302, the URL of the advertiser server 312 embedded within instructional code, and the URL of the ARS 308.",
        "Upon receipt of the message packet 402 by the source PC 302, the message packet 402 is disassembled to obtain pertinent routing information for assembly of a new message packet 404. The web browser running on source PC 302 is now directed to obtain, over Path “C,” the product information relevant to the particular advertiser server 312 location information embedded in message packet 404. Referring now to FIG. 4c, the message packet 404 for this transaction comprises the URL of the advertiser server 312, the request-for-product-information data, and the address of the source PC 302.",
        "Upon receipt of the message packet 404 from source PC 302, advertiser server 312 disassembles the message packet 404 to obtain the request-for-product-information data. The advertiser server 312 then retrieves the particular product information from its database, and transmits it over Path “D” back to the source PC 302. Referring now to FIG. 4d, the message packet 406 for this particular transaction comprises the address of the source PC 302, the requested information, and the URL of the advertiser server 312.",
        "Optionally, the ARS 308 may make a direct request for product information over Path “E” to advertiser server 312. In this mode, the ARS 308 sends information to the advertiser server 312 instructing it to contact the source PC 302. This, however, is unconventional and requires more complex software control. The message packet 408 for this transaction is illustrated in FIG. 4e, which comprises the URL of the advertiser server 312, the request-for-product-information data, and the address of the source PC 302. Since product information is not being returned to the ARS 308, but directly to the source PC 302, the message packet 408 requires the return address to be that of the source PC 302. The product information is then passed directly to PC 302 over Path “D.”",
        "Referring now to FIG. 5, the method for detecting and obtaining product information is as follows. In decision block 500, a proprietary application running resident on a source computer PC 302 (similar to PC 204) monitors the audio input for a special trigger signal. Upon detection of the trigger signal, data following the trigger signal is decoded for further processing, in function block 502. In function block 504, the data is buffered for further manipulation. In decision block 506, a determination is made as to whether the data can be properly authenticated. If not, program flow continues through the “N” signal to function block 520 where the data is discarded. In function block 522, the program then signals for a retransmission of the data. The system then waits for the next trigger signal, in decision block 500. If properly authenticated in decision block 506, program flow continues through the “Y” signal path where the data is then used to launch the web browser application, as indicated in function block 508. In function block 510, the web browser receives the URL data, which is then automatically routed through the computer modem 208 to the network interface 304 and ultimately to the network 306. In function block 514, the ARS 308 responds by returning the URL of advertiser server 312 to the PC 302. In function block 516, the web browser running on the source PC 302, receives the advertiser URL information from the ARS 308, and transmits the URL for the product file to the advertiser server 312. In block 518, the advertiser server 312 responds by sending the product information to the source PC 302 for processing.",
        "The user may obtain the benefits of this architecture by simply downloading the proprietary software over the network. Other methods for obtaining the software are well-known; for example, by CD, diskette, or pre-loaded hard drives.",
        "Referring now to FIG. 6, there is illustrated a flowchart of the process the ARS 308 may undergo when receiving the message packet 400 from the source PC 302. In decision block 600, the ARS 308 checks for the receipt of the message packet 400. If a message packet 400 is not received, program flow moves along the “N” path to continue waiting for the message. If the message packet 400 is received, program flow continues along path “Y” for message processing. Upon receipt of the message packet 400, in function block 602, the ARS 308 decodes the message packet 400. The product code is then extracted independently in function block 604 in preparation for matching the product code with the appropriate advertiser server address located in the database 310. In function block 606, the product code is then used with a lookup table to retrieve the advertiser server 312 URL of the respective product information contained in the audio signal data. In function block 608, the ARS 308 then assembles message packet 402 for transmission back to the source PC 302. Function block 610 indicates the process of sending the message packet 402 back to the source PC 302 over Path “B.”",
        "Referring now to FIG. 7, there is illustrated a flowchart of the interactive processes between the source PC 302 and the advertiser server 312. In function block 700, the source PC 302 receives the message packet 402 back from the ARS 308 and begins to decode the packet 402. In function block 702, the URL of the advertiser product information is extracted from the message packet 402 and saved for insertion into the message packet 404 to the advertiser server 312. The message packet 404 is then assembled and sent by the source PC 302 over Path “C” to the advertiser server 312, in function block 704. While the source PC 302 waits, in function block 706, the advertiser server 312 receives the message packet 404 from the source PC 302, in function block 708, and disassembles it. The product information location is then extracted from the message packet 404 in function block 710. The particular product information is retrieved from the advertiser server 312 database for transmission back to the source PC 302. In function block 712, the product information is assembled into message packet 406 and then transmitted back to the source PC 302 over Path “D.” Returning to the source PC 302 in function block 714, the advertiser product information contained in the message packet 406 received from the advertiser server 312, is then extracted and processed in function block 716.",
        "Referring now to FIG. 8, after receipt of a trigger signal, a web browser application on a source PC 302 is automatically launched and computer display 800 presents a browser page 802. Proprietary software running on the source PC 302 processes the audio signal data after being digitized through the sound card 206. The software appropriately prepares the data for insertion directly into the web browser by extracting the product information code and appending keystroke data to this information. First, a URL page 804 is opened in response to a Ctrl-O command added by the proprietary software as the first character string. Opening URL page 804 automatically positions the cursor in a field 806 where additional keystroke data following the Ctrl-O command will be inserted. After URL page 804 is opened, the hypertext protocol preamble http:// is inserted into the field 806. Next, URL information associated with the location of the ARS 308 is inserted into field 806. Following the ARS 308 URL data are the characters /? to allow entry of variables immediately following the /? characters. In this embodiment, the variable following is the product information code received in the audio signal. The product code information also provides the cross-reference information for obtaining the advertiser URL from the ARS database 310. Next, a carriage return is added to send the URL/product data and close the window 804. After the message packet 400 is transmitted to the ARS 308 from the source PC 302, transactions from the ARS308, to the source PC 302, to the advertiser server 312, and back to the source PC 302, occur quickly and are transparent to the viewer. At this point, the next information the viewer sees is the product information which was received from the advertiser server 312.",
        "Referring now to FIG. 9, there is illustrated a block diagram of a more simplified embodiment. In this embodiment, a video source 902 is provided which is operable to provide an audio output on an audio cable 901 which provides routing information referred to by reference numeral 904. The routing information 904 is basically information contained within the audio signal. This is an encoded or embedded signal. The important aspect of the routing information 904 is that it is automatically output in realtime as a function of the broadcast of the video program received over the video source 902. Therefore, whenever the program is being broadcast in realtime to the user 908, the routing information 904 will be output whenever the producer of the video desires it to be produced. It should be understood that the box 902 representing the video source could be any type of media that will result in the routing information being output. This could be a cassette player, a DVD player, an audio cassette, a CD ROM or any such media. It is only important that this is a program that the producer develops which the user 908 watches in a continuous or a streaming manner. Embedded within that program, at a desired point selected by the producer, the routing information 904 is output.",
        "The audio information is then routed to a PC 906, which is similar to the PC 112 in FIG. 1. A user 908 is interfaced with the PC to receive information thereof, the PC 906 having associated therewith a display (not shown). The PC 906 is interfaced with a network 910, similar to the network 306 in FIG. 3. This network 910 has multiple nodes thereon, one of which is the PC 906, and another of which is represented by a network node 912 which represents remote information. The object of the present embodiment is to access remote information for display to the user 908 by the act of transmitting from the video program in block 902 the routing information 904. This routing information 904 is utilized to allow the PC 906 which has a network “browser” running thereon to “fetch” the remote information at the node 912 over the network 910 for display to the user 908. This routing information 904 is in the form of an embedded code within the audio signal, as was described hereinabove.",
        "Referring now to FIG. 10, there is illustrated a more detailed block diagram of the embodiment of FIG. 9. In this embodiment, the PC 906 is split up into a couple of nodes, a first PC 1002 and a second PC 1004. The PC 1002 resides at the node associated with the user 908, and the PC 1004 resides at another node. The PC 1004 represents the ARS 308 of FIG. 3. The PC 1004 has a database 1006 associated therewith, which is basically the advertiser database 310. Therefore, there are three nodes on the network 910 necessary to implement the disclosed embodiment, the PC 1002, the PC 1004 and the remote information node 912. The routing information 904 is utilized by the PC 1002 for routing to the PC 1004 to determine the location of the remote information node 912 on the network 910. This is returned to the PC 1002 and a connection made directly with the remote information node 912 and the information retrieved therefrom to the user 908. The routing information 904 basically constitutes primary routing information.",
        "Referring now to FIG. 11, there is illustrated a diagrammatic view of how the network packet is formed for sending the primary routing information to the PC 1004. In general, the primary routing information occupies a single field which primary routing information is then assembled into a data packet with the secondary routing information for transfer to the network 910. This is described hereinabove in detail.",
        "Referring now to FIG. 12, there is illustrated an alternate embodiment to that of FIG. 9. In this embodiment, the video source 902 has associated therewith an optical region 1202, which optical region 1202 has disposed therein an embedded video code. This embedded video code could be relatively complex or as simple as a grid of dark and white regions, each region in the grid able to have a dark color for a logic “1” or a white region for a logic “0.” This will allow a digital value to be disposed within the optical region 1202. A sensor 1204 can then be provided for sensing this video code. In the example above, this would merely require an array of optical detectors, one for each region in the grid to determine whether this is a logic “1” or a logic “0” state. One of the sensed video is then output to the PC 906 for processing thereof to determine the information contained therein, which information contained therein constitutes the primary routing information 904. Thereafter, it is processed as described hereinabove with reference to FIG. 9.",
        "Referring now to FIG. 13, there is illustrated a block diagram for an embodiment wherein a user's profile can be forwarded to the original subscriber or manufacturer. The PC 906 has associated therewith a profile database 1302, which profile database 1302 is operable to store a profile of the user 908. This profile is created when the program, after initial installation, requests profile information to be input in order to activate the program. In addition to the profile, there is also a unique ID that is provided to the user 908 in association with the browser program that runs on the PC 906. This is stored in a storage location represented by a block 1304. This ID 1304 is accessible by a remote location as a “cookie” which is information that is stored in the PC 906 in an accessible location, which accessible location is actually accessible by the remote program running on a remote node.",
        "The ARS 308, which basically constitutes the PC 1004 of FIG. 10, is operable to have associated therewith a profile database 1308, which profile database 1308 is operable to store profiles for all of the users. The profile database 1308 is a combination of the stored in profile database 1302 for all of the PCs 906 that are attachable to the system. This is to be distinguished from information stored in the database 310 of the ARS 308, the advertiser's database, which contains intermediate destination tables. When the routing information in the primary routing information 904 is forwarded to the ARS 308 and extracted from the original data packet, the lookup procedure described hereinabove can then be performed to determine where this information is to be routed. The profile database 1302 is then utilized for each transaction, wherein each transaction in the form of the routing information received from the primary routing information 904 is compared to the destination tables of database 310 to determine what manufacturer is associated therewith.",
        "The associated ID 1304 that is transmitted along with the routing information in primary routing information 904 is then compared with the profile database 1308 to determine if a profile associated therewith is available. This information is stored in a transaction database 1310 such that, at a later time, for each routing code received in the form of the information in primary routing information 904, there will associated therewith the IDs 1304 of each of the PCs 906. The associated profiles in database 1308, which are stored in association with IDs 1304, can then be assembled and transmitted to a subscriber as referenced by a subscriber node 1312 on the network 910. The ARS 308 can do this in two modes, a realtime mode or a non-realtime mode. In a realtime mode, each time a PC 906 accesses the advertiser database 310, that user's profile information is uploaded to the subscriber node 1312. At the same time, billing information is generated for that subscriber 1312 which is stored in a billing database 1316. Therefore, the ARS 308 has the ability to inform the subscriber 1312 of each transaction, bill for those transactions, and also provide to the subscriber 1312 profile information regarding who is accessing the particular product advertisement having associated therewith the routing information field 904 for a particular routing code as described hereinabove. This information, once assembled, can then be transmitted to the subscriber 1312 and also be reflected in billing information and stored in the billing information database 1316.",
        "Referring now to FIG. 14, there is illustrated a flowchart depicting the operation for storing the profile for the user. The program is initiated in a block 1402 and then proceeds to a function block 1404, wherein the system will prompt for the profile upon initiation of the system. This initiation is a function that is set to activate whenever the user initially loads the software that he or she is provided. The purpose for this is to create, in addition to the setup information, a user profile. Once the user is prompted for this, then the program will flow to a decision block 1406 to determine whether the user provides basic or detailed information. This is selectable by the user. If selecting basic, the program will flow to a function block 1408 wherein the user will enter basic information such as name and serial number and possibly an address. However, to provide some incentive to the user to enter more information, the original prompt in function block 1404 would have offers for such things as coupons, discounts, etc., if the user will enter additional information. If the user selects this option, the program flows from the decision block 1406 to a function block 1410. In the function block 1410, the user is prompted to enter specific information such as job, income level, general family history, demographic information and more. There can be any amount of information collected in this particular function block.",
        "Once all of the information is collected, in either the basic mode or the more specific mode, the program will then flow to a function block 1412 where this information is stored locally. The program then flows to a decision block 1414 to then go on-line to the host or the ARS 308. In general, the user is prompted to determine whether he or she wants to send this information to the host at the present time or to send it later. If he or she selects the “later” option, the program will flow to a function block 1415 to prompt the user at a later time to send the information. In the disclosed embodiment, the user will not be able to utilize the software until the profile information is sent to the host. Therefore, the user may have to activate this at a later time in order to connect with the host.",
        "If the user has selected the option to upload the profile information to the host, the program will flow to the function block 1416 to initiate the connect process and then to a decision block 1418 to determine if the connection has been made. If not, the program will flow along a “N” path to a time to decision block 1420 which will timeout to an error block 1422 or back to the input of the connect decision block 1418. The program, once connected, will then flow along a “Y” path from decision block 1418 to a function block 1428 to send the profile information with the ID of the computer or user to the host. The ID is basically, as described hereinabove, a “cookie” in the computer which is accessed by the program when transmitting to the host. The program will then flow to a function block 1430 to activate the program such that it, at later time, can operate without requiring all of the setup information. In general, all of the operation of this flowchart is performed with a “wizard” which steps the user through the setup process. Once complete, the program will flow to a Done block 1432.",
        "Referring now to FIG. 15, there is illustrated a flowchart depicting the operation of the host when receiving a transaction. The program is initiated at a Start block 1502 and then proceeds to decision block 1504, wherein it is determined whether the system has received a routing request, i.e., the routing information 904 in the form of a tone, etc., embedded in the audio signal, as described hereinabove with respect to FIG. 9. The program will loop back around to the input of decision block 1504 until the routing request has been received. At this time, the program will flow along the “Y” path to a function block 1506 to receive the primary routing information and the user ID. Essentially, this primary routing information is extracted from the audio tone, in addition to the user ID. The program then flows to a function block 1508 to look up the manufacturer URL that corresponds to the received primary routing information and then return the necessary command information to the originating PC 108 in order to allow that PC 108 to connect to the destination associated with the primary routing information. Thereafter, the program will flow to a function block 1510 to update the transaction database 1310 for the current transaction. In general, the routing information 904 will be stored as a single field with the associated IDs. The profile database 1308, as described hereinabove, has associated therewith detailed profiles of each user on the system that has activated their software in association with their ID. Since the ID was sent in association with the routing information, what is stored in the transaction database 1310 is the routing code, in association with all of the IDs transmitted to the system in association with that particular routing code. Once this transaction database 1310 has been updated, as described hereinabove, the transactions can be transferred back to the subscriber at node 312 with the detailed profile information from the profile database 1308.",
        "The profile information can be transmitted back to the subscriber or manufacturer at the node 312 in realtime or non-realtime. A decision block 1512 is provided for this, which determines if the delivery is realtime. If realtime, the program will flow along a “Y” path to a function block 1514 wherein the information will be immediately forwarded to the manufacturer or subscriber. The program will then flow to a function block 1516 wherein the billing for that particular manufacturer or subscriber will be updated in the billing database 1316. The program will then flow into an End block 1518. If it was non-realtime, the program moves along the “N” path to a function block 1520 wherein it is set for a later delivery and it is accrued in the transaction database 1310. In any event, the transaction database 1310 will accrue all information associated with a particular routing code.",
        "With a realtime transaction, it is possible for a manufacturer to place an advertisement in a magazine or to place a product on a shelf at a particular time. The manufacturer can thereafter monitor the times when either the advertisements are or the products are purchased. Of course, they must be scanned into a computer which will provide some delay. However, the manufacturer can gain a very current view of how a product is moving. For example, if a cola manufacturer were to provide a promotional advertisement on, for example, television, indicating that a new cola was going to be placed on the shelf and that the first 1000 purchasers, for example, scanning their code into the network would receive some benefit, such as a chance to win a trip to some famous resort in Florida or some other incentive, the manufacturer would have a very good idea as to how well the advertisement was received. Further, the advertiser would know where the receptive markets were. If this advertiser, for example, had placed the television advertisement in ten cities and received overwhelming response from one city, but very poor response from another city, he would then have some inclination to believe that either the one poor-response city was not a good market or that the advertising medium he had chosen was very poor. Since the advertiser can obtain a relatively instant response and also content with that response as to the demographics of the responder, very important information can be obtained in a relatively short time.",
        "It should be noted that the disclosed embodiment is not limited to a single source PC 302, but may encompass a large number of source computers connected over a global communication network. Additionally, the embodiment is not limited to a single ARS 308 or a single advertiser server 312, but may include a plurality of ARS and advertiser systems, indicated by the addition of ARS 314 and advertiser server A 316, respectively. It should also be noted that this embodiment is not limited only to global communication networks, but also may be used with LAN, WAN, and peer-to-peer configurations.",
        "It should also be noted that the disclosed embodiment is not limited to a personal computer, but is also applicable to, for example, a Network Computer (“NetPC”), a scaled-down version of the PC, or any system which accommodates user interaction and interfaces to information resources.",
        "One typical application of the above noted technique is for providing a triggering event during a program, such as a sport event. In a first example, this may be generated by an advertiser. One could imagine that, due to the cost of advertisements in a high profile sports program, there is a desire to utilize this time wisely. If, for example, an advertiser contracted for 15 seconds worth of advertising time, they could insert within their program a tone containing the routing information. This routing information can then be output to the user's PC 302 which will cause the user's PC 302 to, via the network, obtain information from a remote location typically controlled by the advertiser. This could be in the form of an advertisement of a length longer than that contracted for. Further, this could be an interactive type of advertisement. An important aspect to the type of interaction between the actual broadcast program with the embedded routing information and the manufacturer's site is the fact that there is provided information as to the user's PC 302 and a profile of the user themselves. Therefore, an advertiser can actually gain realtime information as to the number of individuals that are watching their particular advertisement and also information as to the background of those individuals, profile information, etc. This can be a very valuable asset to an advertiser.",
        "In another example, the producer of the program, whether it be an on-air program, a program embedded in a video tape, CD-ROM, DVD, or a cassette, can allow the user to automatically access additional information that is not displayed on the screen. For example, in a sporting event, various statistics can be provided to the user from a remote location, merely by the viewer watching the program. When these statistics are provided, the advertiser can be provided with profile information and background information regarding the user. This can be important when, for example, the user may record a sports program. If the manufacturer sees that this program routing code is being output from some device at a time later than the actual broadcast itself, this allows the advertisers to actually see that their program is still being used and also what type of individual is using it. Alternatively, the broadcaster could determine the same and actually bill the advertiser an additional sum for a later broadcast. This is all due to the fact that the routing information automatically, through a PC and a network, will provide an indication to the advertiser the time at which the actual information was broadcast.",
        "The different type of medium that can be utilized with the above embodiment are such things as advertisements, which are discussed hereinabove, contests, games, news programs, education, coupon promotional programs, demonstration media (demos), and photographs, all of which can be broadcast on a private site or a public site. This all will provide the ability to allow realtime interface with the network and the remote location for obtaining the routed information and also allow for realtime billing and accounting.",
        "Referring now to FIG. 16, there is illustrated a general block diagram of a disclosed embodiment. A bar code scanning input device 1600 is provided by a input device distributor to customers and is associated with that distributor via a input device ID stored therein. The input device 1600 is either sold or freely distributed to customers for use with their personal computing systems. Since more and more products are being sold using bar codes, it can be appreciated that a user having the input device 1600 can scan bar codes of a multitude of products in order to obtain more information. Information about these products can be made immediately available to the user from the manufacturer for presentation by the user's computer 302. Beyond simply displaying information about the product in which the user is interested, the input device distributor may include additional advertising information for display to the user such as information about other promotions or products provided or sold by the input device distributor. Similarly, advertisers may provide catalogs of advertisements or information in newspapers or periodicals where the user simply scans the bar code associated with the advertisement using the input device 1600 to obtain further information. There is provided a paper source 1602 having contained thereon an advertisement 1604 and an associated bar code 1606. (Note that the disclosed concept is not limited to scanning of bar codes 1606 from paper sources 1602, but is also operable to scan a bar code 1606 on the product itself. Also, the input device 1600 can be any type of device that will scan any type of image having information encoded therein.)",
        "After obtaining the input device 1600 from the input device distributor, the user connects the input device 1600 to their PC 302. During a scanning operation, input device 1600 reads bar code data 1606 and the input device ID into a “wedge” interface 1608 for conversion into keyboard data, which keyboard data is passed therefrom into the keyboard input port of PC 302. The importance of the input device ID will be discussed in more detail hereinbelow.",
        "The wedge interface 1608 is simply an interface box containing circuitry that accommodates inputs from both the scanning input device 1600 and a computer keyboard 1610. This merely allows the information scanned by the input device 1600 to be input into the PC 302. In the disclosed embodiment, the wedge interface 1608 will convert any information. The data output from the input device 1600 is passed into the wedge interface 1608 for conversion into keyboard data which is readily recognizable by the PC 302. Therefore, the input device 1600 is not required to be connected to a separate port on the PC 302. This data is recognized as a sequence of keystrokes. However, the output of the input device 1600 can be input in any manner compatible with the PC 302. When not receiving scanner data, the wedge interface 1608 simply acts as a pass-through device for keyboard data from the keyboard 1610. In any case, the information is ultimately processed by a processor in the PC 302 and can be presented to the user on a display 1612. The wedge interface 1608 is operable to provide a decoding function for the bar code 1606 and conversion thereof to keystroke input data.",
        "In operation, the product code of a product is provided in the form of a bar code 1606. This bar code 1606 is the “link” to a product. The disclosed embodiment is operable to connect that product information contained in the bar code 1606 with a web page of the manufacturer of that product by utilizing the bar code 1606 as the product “identifier.” The program operating on the PC 302 provides routing information to the ARS 308 after launching the browser on the PC 302 and connecting to the ARS 308 over the GCN 306, which ARS 308 then performs the necessary steps to cause the browser to connect to the manufacturer web site, while also providing for an accounting step, as will be described in more detail hereinbelow.",
        "The bar code 1606 by itself is incompatible with any kind of network for the purposes of communication therewith. It is primarily provided for a retail-type setting. Therefore, the information contained in the bar code 1606, by itself, does not allow for anything other than identification of a product, assuming that one has a database 1614 containing information as to a correlation between the product and the bar code 1606.",
        "The wedge interface 1608 is operable to decode the bar code 1606 to extract the encoded information therein, and append to that decoded bar code information relating to an ID for the input device 1600. This information is then forwarded to the ARS 308 by the resident program in the PC 302. This is facilitated by intermediate routing information stored in the program indicating to which node on the GCN 306 the scanned bar code information is to be sent, i.e., to the ARS 308. It is important to note that the information in the bar code 1606 must be converted from its optical image to numerical values which are then ultimately input to the keyboard input port of PC 302 and converted into data compatible with communication software residing on the PC 302 (in this case, HTML language for insertion into a browser program). When the scanned information is input to the PC 302, the resident program launches the browser program and then assembles a communication packet comprised of the URL of the ARS 308, the input device ID and the user ID. If another type of communications program were utilized, then it would have to be converted into language compatible with that program. Of course, a user could actually key in the information on the bar code 102 and then append the appropriate intermediate routing information thereafter. As will be described hereinbelow, the intermediate routing information appended thereto is the URL of the ARS 308 disposed on the GCN 306.",
        "As part of the configuration for using the input device 1600, the PC 302 hosts input device software which is operable to interpret data transmitted from the input device 1600, and to create a message packet having the scanned product information and input device ID, routing information, and a user ID which identifies the user location of the input device 1600. The input device software loads at boot-up of the PC 302 and runs in the background. In response to receiving a scanned bar code 1606, the wedge interface 1608 outputs a keystroke code (e.g., ALT-F10) to bring the input device program into the foreground for interaction by the operating system. The input device program then inserts the necessary information into the browser program. The message packet is then transmitted to interface 304 across the global communication network 306 to the ARS 308. The ARS 308 interrogates the message packet and performs a lookup function using the ARS database 310. If a match is found between particular parameters of the message packet, a return message packet is sent back to the PC 302 for processing.",
        "The input device program running on PC 302 functions to partition the browser window displayed to the user into several individual areas. This is for the purpose of preparing to present to the user selected information in each of the individual areas (also called “framing”). The selected information comprises the product information which the user requested by scanning the bar code 1606 using the input device 1600, information about the input device distributor which establishes the identity of the company associated with that particular input device 1600, and at least one or more other frames which may be advertisements related to other products that the input device distributor sells. Note that the advertisements displayed by the input device distributor may be related to the product of interest or totally unrelated. For example, if a user scans the bar code 1606 of a soda from Company A, the input device distributor may generate an advertisement of a new soft drink being marketed by Company A, that it sells. On the other hand, the input device distributor may also structure the display of information to the user such that a user requesting product information of a Product X may get the requested information of Product X along with advertisements for a competing item Product Y. Essentially, the input device distributor is free to generate any advertisement to the user in response to the user requesting product information.",
        "The return message packet transmitted from the ARS 308 to the PC 302 is then transmitted back across the GCN 306 to the advertiser server 312. The advertiser server 312 restructures the message packet and appends the particular product information for transmission back to the PC 302. Upon receiving the particular advertiser information from advertiser server 312, the PC 302 then retransmits a message to the input device distributor site 1616 and E-commerce site 1618 to obtain the information that needs to be framed in the browser window displayed to the user.",
        "Therefore, the input device 1600 is associated with the input device distributor by way of a input device ID such that scanning a product bar code 1606 in order to obtain information about that particular product generates one or more responses from one or more remote sites disposed on the GCN 306. Stored in the input device 1600 is the input device ID which establishes its relationship to the input device distributor. Proprietary input device software running on the PC 302 operates to decode scanned bar code information and the input device ID received from the input device 1600 and wedge interface 1608, and also provides a unique user ID for establishing the location of the user of the input device 1600. The input device software also assembles message packets and works in conjunction with the on-board communication software (e.g., a browser) to automatically route the message packets across the GCN 306 such that the one or more remote sites disposed on the GCN 306 return information to be framed for presentation to the user.",
        "Referring now to FIG. 17, there is illustrated a conversion circuit of the wedge interface. A microcontroller 1700 provides conversion of the data from the input device 1600 and controls interfacing of the keyboard 1610 and input device 1600 with the PC 302. The microcontroller 1700 has contained therein a memory 1702 or it can have external memory. There are provided a plurality of input device interfaces 1704 to the input device 1600, a plurality of PC interfaces 1706 to the PC 302, and plurality of keyboard interfaces 1708 to the keyboard 1610. In general, the input device interfaces 1704 comprise a serial data line, a ground line, and a power line. Similarly, the keyboard interfaces 1708 comprise a serial data line, a ground line, a clock line, and a power line. The PC 302 provides a clock line, a power line, a serial data, and a ground line for input to the microcontroller 1700. The microcontroller 1700 is operable to receive signals from the keyboard 1610 and transfer the signals to the PC 302 as keyboard signals. Operation with the keyboard 1610 is essentially a “pass-through” procedure. Data output from the keyboard 1610 is already in keyboard format, and therefore requires no conversion by the wedge interface 1608. With respect to the input device 1600, the serial data is not compatible with a keyboard 1610 and, therefore, it must be converted into a keyboard format in order to allow input thereof to the keyboard input of the PC 302.",
        "The microcontroller 1700 performs this function after decoding this bar code information, and conversion of this bar code information into an appropriate stream of data which is comprised of the bar code information and the appended URL. This appended URL will be pre-stored in the memory 1702 and is programmable at the time of manufacture. It is noted that the memory 1702 is illustrated as being contained within the microcontroller 1702 to provide a single chip solution. However, this could be external memory that is accessible by the microcontroller 1702. Therefore, the microcontroller 1700 provides an interface between the input device 1600 and the keyboard 1610 to the PC 302 which allows the input device 1600 to receive coded information and convert it to keyboard strokes or, alternatively, to merely pass-through the keystrokes from the keyboard 1610. Therefore, the user need not install any type of plug-in circuit board into the motherboard of the PC 302 in order to provide an interface to the input device 1600; rather, the user need only utilize the already available keyboard port in order to input the appropriate data into the system.",
        "In this particular disclosed embodiment, the microcontroller 1700 comprises a PIC16C73 microcontroller by Microchip Technologies™. The PIC16C73 device is a low cost CMOS 8-bit microcontroller with an integrated analog-to-digital converter. The PIC16C73 device, as illustrated in the disclosed embodiment, has 192 bytes of RAM and 4k×4 of EPROM memory. The microcontroller 1700 can accommodate asynchronous or synchronous inputs from input devices connected to it. In this disclosed embodiment, communication to the keyboard 1610 is synchronous while it is asynchronous when communicating with input device 1600.",
        "It should be noted that, although in this particular embodiment bar code information of the bar code 1606 is input into the keyboard input port of the PC 302, disclosed methods may also be advantageously utilized with high speed port architectures such as Universal Serial Bus (“USB”) and IEEE 1394.",
        "Bar codes are structured to be read in either direction. Timing considerations need to be addressed because of the variety of individuals scanning the bar code introduce a wide variety of scan rates. Bar codes use bars of varying widths. The presence of a black bar generates a positive pulse, and the absence of a black bar generates no pulse. Each character of a conventional bar code has associated therewith seven pulses or bars. Depending on the width of the bars, the time between pulses varies. In this disclosed embodiment, the interface circuitry 1608 performs a “running” calculation of the scan time based upon the rising edge of the pulses commencing with the leader or header information. The minimum and maximum scans times are calculated continuously in software with the interface 1608 during the scanning process to ensure a successful scan by the user.",
        "Referring now to FIG. 18, there is illustrated a sample message packet transmitted from the user's PC 302 to the ARS 308. The message packet 1800 comprises a number of bits of information including the bar code information 1802 obtained from the user scanning the bar code 1606 with the input device 1600; the input device ID 1804 which is embedded in a memory in the input device 1600 and identifies it with a particular input device distributor; and a user ID 1806 which is derived from the software running on the PC 302 and which identifies uniquely with the user location. Note that the message packet includes other necessary information for the proper transmission for point to point.",
        "Referring now to FIG. 19, there is illustrated a more detailed block diagram of the routing of the message packets in order to present the framed information to the user. As is mentioned hereinabove, when the user scans a bar code 1606 using the input device 1600, a input device program running on the user PC 302 is operable to interpret the information output by the input device 1600 and generate a message packet for transmission over the GCN 306. The input device program assembles the message packet such that it is directed to the ARS 308 disposed on the GCN 306. The message packet contains several pieces of information including the input device ID 1804 which links it to the input device distributor, the user ID 1806 which identifies the particular user using the input device 1600, and bar code information 1802 describing a particular product of interest to the user. This message from the PC 302 is transmitted over a path 1900 to the ARS 308 where the ARS database 310 is accessed to cross reference the ID information 1804 and bar code information 1802 to a particular advertiser and input device distributor. The ARS 308 returns a message packet over a path 1902 to the user PC 302 which contains routing information as to the location of various other sites disposed on the GCN 306, for example, the advertiser server 312 and input device distributor site 1616.",
        "It can be appreciated that other information can also be provided by the ARS 308 which more closely targets the particular user of the input device 1600. For example, if it is known that a particular input device 1600 is sold in a certain geographic area, this information can be useful in targeting the particular user with certain advertising information relevant to that geographic area. In any case, the information returned from the ARS 308 over path 1902 provides enough information for the input device program running on the user PC 302 to identify a number of other sites disposed on the GCN 306. The user PC 302 then processes the return message packet and routes another message packet over a path 1904 to the advertiser server 312. The advertiser server 312 then returns product information of the particular product in which the user was interested back to the user PC 302 over a path 1906. Similarly, the user PC 302 routes information (e.g., the URL of the input device distributor site and the user profile) to the input device distributor site 1616 over a path 1908 in order to obtain information back over a path 1910 for framing any banners which identify the input device distributor. Additionally, the user PC 302 forwards a message packet to the E-commerce site 1618 over a path 1912 in order to return information regarding any particular advertisements the input device distributor wants to display to the user. The advertisements are returned to the PC 302 over a path 1914.",
        "Referring now to FIG. 20, there is illustrated a block diagram of a browser window according to the disclosed embodiment. The browser window 2000 is partitioned into a plurality of areas for framing specific information. A bar code area 2002 displays that product information in which the user was interested; an input device-specific area 2004 displays information about the input device distributor; and an E-commerce area 2006 displays advertising information that the input device distributor selects for display according to this particular user and input device 1600. As mentioned hereinabove, a program operable to process scanned bar code information with the unique input device 1600 develops the browser window by partitioning it into specific areas for the framing of information. Therefore, information returned from the E-commerce site 1608 is passed through the GCN 306 to the particular E-commerce frame 2006. Similarly, information about the particular product of interest is returned from the advertiser site 312 across the GCN 306 to the particular bar code specific area 2002. Information placed in the input device specific area 2004 is information about the input device distributor which is returned from the input device distributor site 1616 across GCN 306.",
        "Referring now to FIG. 21, there is illustrated a structure of information contained in the ARS database. The ARS database 310 contains a variety of information required to properly interrogate and assemble packets for obtaining information from the various sites disposed on the GCN 306. The ARS database 310 has a database structure 2100 which contains addresses for the web sites containing the product information requested by the user when scanning the bar code 1606 with the input device 1600. Under a PRODUCT heading 2102 are listed the particular bar codes and associated routing information for addressing the respective server location. For example, the ARS server 308 may contain any number of advertisers having unique URL addresses associated therewith. Therefore, the bar code 1606 of a particular product is associated with a unique URL address which routes any request for information of that product to that particular advertiser's site. Also part of the ARS database structure 2000 is a heading of INPUT DEVICE under which is the input device ID 1804 and the distributor associated with that input device ID 1804.",
        "It can be appreciated that there may be a number of distributors using the disclosed architecture such that each distributor has an ID embedded in the input device 1600 which uniquely identifies that input device with the particular distributor. Therefore, the unique input device ID 1804 needs to be listed with the respective distributors of that input device 1600 in order to process the information that needs to be framed and displayed to that particular user. Another heading under the ARS database structure 2100 is a user heading 2106 which contains profile information associated with that particular user ID 1806. As mentioned hereinabove, the user ID 1806 is obtained via the input device software running on the PC 302 and upon installation or subsequent configuration may request that the user input certain profile information which may be used to target that particular user with products and services which identify with that user profile. The ARS database structure 2100 also contains an E-commerce heading 2108 which contains information related to the bar code 1606 and an advertisement that may be triggered by the request for that information. For example, any bar code 1606 associated with a paper source 1602 can be associated with the specific information in the ARS database 310. A user wishing to obtain information about a specific soft drink may, in fact, trigger an advertising response of a competitor product. Similarly, the user interested in information about that particular soft drink may also trigger information which is relevant to that particular product or a product which may normally be served in conjunction with that soft drink. Furthermore, if the user profile indicates that this individual has significant interest in finance or insurance, the request for information regarding this particular bar coded product may trigger advertisement from an E-commerce server 1618 related to information about finance and insurance. It should be noted that the information described as contained within the ARS database structure 2100 is not limited to what has been described, but may comprise any number of pieces of information used to present desired information to the computer display of the user.",
        "Referring now to FIG. 22, there is illustrated a flowchart of the process of receiving information from the user's perspective, and according to the disclosed embodiment. The input device software running on the user's PC 302 runs in the background until activated by output from the input device 1600. Therefore, flow moves to a decision block 2200 where if a scanned input does not occur, flow moves out the “N” path and loops back to the input of decision block 2200. On the other hand, if scanned input information is received, flow moves out the “Y” path to a function block 2202 where the input device software assembles a message packet containing the bar code information, the input device ID 1804 and the ARS 308 URL address. Additionally, the browser is launched in which this information is placed for transmission to the ARS 308. Flow then moves to a function block 2204 where the browser is partitioned into any number of areas in which information is displayed when obtained from the input device distributor site 1616, the E-commerce site 1618, and the advertiser server 312. It should be known that although three frames are shown in the particular window 2000 of this embodiment, the number of frames displayed in the window 2000 is limited only by the available real estate of the window 2000 area itself.",
        "After the input device software partitions the browser window into one or more frames in preparation of receipt of return information, flow moves to a decision block 2206 where the computer waits for information to be returned from the various sites disposed on the GCN 306. If information is not returned, flow moves out the “N” path and simply loops back to the input to continue monitoring for receipt of the information. If information has been received, flow moves out the “Y” path to a function block 2208 where routing information for each frame (or partitioned area of the window 2000) is inserted into one or more packets for transmission to the various sites. The various sites then return the requested information back to the PC 302, as indicated in function block 2210. Flow is then to a function block 2212 where the proprietary software working in conjunction with the hosted browser places the returned information into the respective frames of the window. The user, viewing the display at PC 302, then perceives a variety of information, one of which is the particular product information which he or she requested, in addition to input device distributor information, and possibly other advertisements based upon the user's profile.",
        "Referring now to FIG. 23, there is illustrated a flowchart of the process according to the ARS. The ARS 308 is operable to decode and process messages received from the GCN 306. Therefore, flow is to a decision block 2300 where, if bar code information is not received, flow is out the “N” path with loop-back to its input. If bar code information has been received, flow is to a function block 2302 where a matching process occurs to link the bar-coded product information to its respective manufacturer. The ARS database 310 also associates the URL address of the manufacturer's server. When a match is found, the ARS 308 begins to assemble a message packet of information for transmission back to the PC 302, as indicated in function block 2304. The message packet contains the product information and the URL address of the manufacturer's website. Flow then moves to a decision block 2306 where the input device ID 1804 is compared with the list of input device IDs issued by the particular input device distributor. If the input device ID 1804 is validated, flow moves out the “Y” path to a function block 2308 where the message packet is appended with the input device ID 1804 and distributor routing address. Flow then moves to a decision block 2310 where the ARS 308 determines if any E-commerce information is to be associated with a particular input device ID 1804. If so, flow is out the “Y” path to a function block 2312 where the message packet is appended with the E-commerce routing string. The E-commerce routing string provides addressing for the E-commerce server 1618. Flow then moves to a function block 2314 where all message packets are returned back to the PC 302 for processing.",
        "Referring back to decision block 2306, if the input device ID 1804 is determined to be invalid, flow moves out the “N” path and jumps forward to the input of decision block 2314, since the lack of a input device ID 1804 interrupts the link to any advertising provided by the E-commerce server 1618. At this point, the only information provided is the link to the advertiser server 312 for return of product information. Referring now to decision block 2310, if no E-commerce information is available, flow moves out the “N” path and jumps forward to the input of function block 2314 where the message packet back to the PC 302 contains only the URL of the advertiser server 312, the bar code information, the distributor server 1616 address and input device ID 1804 information.",
        "Referring now to FIG. 24, there is illustrated a flowchart of the process performed at the E-commerce site. The E-commerce server 1618 receives the message packet from the user PC 302, as indicated in function block 2400, and decodes the packet to perform a match with the bar coded information. Moving on to a decision block 2402, if the match is unsuccessful, flow is out the “N” path to a function block 2404 where the match is rejected. A message may be returned to indicate that a problem occurred and the user may need to re-scan the product bar code 1606. If a successful match occurs, flow moves out the “Y” path to a function block 2406 where the input device ID 1804 is matched with the bar code product information. The bar coded information may be distributed to customers over a large geographic area. However, the input device 1606 may be coded for certain geographic areas. For example, a input device 1600 having an XXX ID may be restricted for sale in the Southwestern United States while a input device 1600 having a YYY ID may be sold only in the Northeast. In this way, geographic areas may be targeted with advertising more appealing to that particular area. Advertising returned to the user PC 302 may be focused further by obtaining a user profile when the software or input device 1600 are installed. In this way, advertising may be focused based upon the user profile. Therefore, flow moves to a function block 2408 to lookup the E-commerce action based upon the input device ID 1804 and the bar code information. Flow moves to a function block 2410 to assemble all the information into a packet for return to the user PC 302. The product information and/or user profile information may be returned. Flow is then to a function block 2412 where the message packet is transmitted.",
        "Referring now to FIG. 25, there is illustrated an optical reader which can be used for scanning an optical code, for example a bar code, and delivering signals indicative of the optical code to a computer. Reader 2500 typically includes an outer shell 2502 enclosing the working components and shaped for convenient manual grasping by the user. During operation, the front end 2504 of the reader 2500 is brought into contact with (or very close proximity to) a surface 2506 bearing the optical code to be read, for example barcode 2508. The reading operation begins with the reader 2500 positioned at a starting position (shown in phantom and denoted by reference numeral 2510) to one side of the barcode 2508. The reader 2500 is then moved across the barcode 2508 as indicated by arrow 2512 to a final position (shown in phantom and denoted by reference numeral 2514) on the opposite side. Typically, the reader 2500 must be moved across the barcode 2508 at a substantially constant speed to ensure accurate reading of the symbol. Once the optical symbol has been scanned by the optical reader 2500, internal circuitry produces electronic output signals indicative of the symbol. These electronic output signals are provided to a computer (not shown), typically by means of a wired control cord 2516. Alternately, the output signals may be sent from the reader 2500 to the computer using other known transmission technologies, for example using a wireless radio frequency (RF) link or a wireless infrared (IR) link.",
        "Referring now to FIGS. 26 and 27, there are illustrated external views of optical reader 2500 according to an embodiment of the invention. Typically, the outer shell 2502 of the reader 2500 will be constructed from multiple pieces to allow simple assembly of the internal components. For example, the illustrated embodiment includes an upper shell 2702 and a lower shell 2704 which form a hollow interior cavity within which the internal components are mounted. To provide for easier gripping and to prevent the device from rolling across flat surfaces, the upper shell 2702 may have a generally semi-circular cross section and the lower shell 2704 may have a generally flat cross section. A scanning portal 2706 is provided at the front end 2504 of reader 2500 to allow the interior components to project and collect radiant energy during the scanning operation. The scanning portal 2706 is typically covered by a protective window 2708 which is transparent to the radiant energy wavelength used for scanning. Projection and/or collection lenses may be visible behind the window 2708. For example, in FIG. 27, a collection lens 2710 and a projection lens 2712 are visible through the window 2708.",
        "To assist the user in maintaining the proper orientation of the reader 2500 during the scanning operation (i.e., with the front end 2504 substantially flat against the surface 2506 bearing the optical symbol, the front end 2504 may be adapted to form a substantially flat bearing surface 2602 surrounding the scanning portal 2708. The bearing surface 2602 is preferably substantially perpendicular to the axis 2604 of the collection portion of the optical system. To reduce the likelihood that the scanning window 2708 will be scratched during the scanning process, it may be inset slightly behind the plane of the bearing surface 2602. The window 2708 may be further protected by the provision of pads 2606 on external shell 2502 which project slightly ahead of the bearing surface 2602.",
        "The external shell 2502 of the reader 2500 may be contoured to provide a comfortable grasp for the user and/or to have an attractive or distinctive shape. For example, the upper shell 2702 of the reader 2500 is smoothly contoured to provide a “streamlined” appearance in accordance with a common style used on other computer related devices such as a computer mouse, a track ball, etc. In other embodiments, however, the exterior shell may be contoured to provide a more distinctive appearance. The exterior surface of the outer shell 2502 further provides an area 2607 for the placement of identifying or advertising indicia 2608 (shown in phantom). Such indicia, if present, may be formed by printing or painting directly on the exterior surface of the reader 2500, by the application of discrete labels, and/or by molding letters, designs or other indicia directly into the surface of the reader by means of injection molding or a similar process.",
        "Referring now to FIGS. 33-35, there is illustrated an alternative embodiment of the invention. Optical reader 3300 has an exterior shell 3302 contoured to resemble an animal, in this case, a stylized cat. It will be readily appreciated that, except for the recontoured shell 3302, the features described for the previous embodiment are present in substantially identical form in this embodiment, including the scanning portal 2706, window 2708, bearing surface 2602 and pads 2606. In addition, identifying or advertising indicia 2608 may be placed on the stylized shell of reader 3300 in the same fashion as on the previous embodiment. It will further be apparent that the external shell of the reader can be contoured to resemble other animals, e.g., dogs, birds, reptiles, fish, etc. or other objects including automobiles, trucks, trains, aircraft, etc. without departing from the scope of the current invention.",
        "Referring now to FIG. 28, there is illustrated a general block diagram showing the function of an optical reader in accordance with embodiments of the current invention. A radiant energy source 2802 is provided for generating a radiant energy which will be used for illuminating a target region containing the barcode or other symbol to be scanned. The radiant energy, denoted by arrow 2804, is transmitted from the source 2802 into an optical system 2806. The radiant energy is typically light in the visible wavelength, however light of infrared (IR) wavelength or other forms of radiant energy may be used. The optical system 2606, which will be described in further detail below, directs the radiant energy (now denoted by arrow 2807) into a target region 2808 adjacent to the reader. The radiant energy directed into the target region 2808 illuminates a barcode 2810 present therein and causes an image, denoted by arrow 2812, of the barcode to be reflected back into another portion of the optical system 2806. The reflected image of the barcode passes through the optical system 2806 where it is processed to increase its contrast and decrease its luminance. After processing, the image, denoted now by arrow 2814, is directed by the optical system 2806 onto a photodetector 2816, which produces output electrical signals indicative of the radiant energy incident thereon. The output electrical signals, denoted by arrow 2818, are routed to a decoder circuit 2820, which utilizes electronic circuitry to decode the output electrical signals to provide an indication of the information contained in the barcode 2810. The information, denoted by reference numeral 2822, is then transmitted to an external computer 2824 for further use or processing.",
        "Typically, the decoded information 2822 is transmitted to the external computer 2824 in accordance with a known data interface format. Suitable data interface formats for transmission of the barcode information from the decoder circuit 2820 of the reader to an external computer 2824 include an output signal which emulates computer keyboard keystrokes such as those in accordance with the PS/2 keyboard interface standard or the AT keyboard interface standard. Alternately, the output signals may be formatted in accordance with other known data interface or communication standards, including the Universal Serial Bus (USB) standard, the RS-232 standard, the RS-423 standard, the IEEE 1394 (FIREWIRE) standard, the Integrated Drive Electronics (IDE) interface standard, the Enhanced Integrated Drive Electronics (EIDE) interface standard, the Asynchronous Transfer Mode (ATM) transmission standard, the Fiber Distributed Data Interface (FDDI) interface standard, the 8-Bit Industry Standard Architecture (ISA) bus standard, the 16-bit Industry Standard Architecture (ISA) bus standard, the VL-Bus bus standard, the Peripheral Component Interconnect (PCI) bus standard, the Personal Computer Memory Card International Association (PCMCIA) bus standard, the Centronics Parallel Port (CPP) standard, the Enhanced Parallel Port (EPP) standard, the Extended Capabilities Port (ECP) standard, the Small Computer System Interface (SCSI) interface standard, and network architecture standards including Ethernet and Token Ring network standards.",
        "It is desirable to provide an optical reader which is economical to produce, therefore reducing the number of components and simplifying the design and construction of the remaining components are important features of the current invention. Referring now to FIG. 29, there is illustrated the optical reader 2500 with the upper shell removed to show the interior components. A printed circuit board (PCB) 2902 is provided for physical mounting and electrical interconnection of the necessary electronic components comprising the decoder circuit and output signal interface circuit. These components include a microprocessor 2904, memory (not shown), interface circuit 2906, timing crystal 2908 and signal amplifiers 2910. Note that for clarity of illustration, the individual circuit lines and many smaller components such as resistors which appear on the actual PCB 2902 are not illustrated in FIG. 29. The PCB 2902 may be mounted to the lower shell 2704 of the reader by means of locating pins 2912 molded into the shell and protruding through corresponding holes in the PCB. These holes can further receive screws (not shown) for securing the upper shell 2702 to the lower shell 2704 during final assembly. The portion of the PCB 2902 mounting amplifiers 2910 is preferably enclosed is shielding material 2914 to prevent stray electrical signals from creating noise in the amplifier circuitry. The control cord 2516 connects the reader 2500 to the external computer 2824, entering the shell and passing through strain relief fitting 2916 for connecting to the PCB 2902 with electrical connector 2918.",
        "The optical system 2806 may be mounted to the front end of the PCB 2902 and further secured to the lower shell 2704 with locating pins 2920 and/or clips 2922 as needed. The radiant energy source 2802 is typically mounted to the PCB 2902 and electrically connected thereto to receive electrical power. The radiant energy source 2802 produces light or other radiant energy which is delivered into the optical system 2806. In one embodiment, the radiant energy source 2802 is a light emitting diode (LED), however it will be apparent that a laser or other radiant energy source could be used. The optical system 2806 comprises a projection portion 2924 for directing the radiant energy along a projection path extending from the radiant energy source 2802 to the target region 2926. The optical system 2806 further includes a collection portion 2928 for collecting the radiant energy reflected from a symbol (e.g., a barcode) when the symbol occupies the target region 2926 and directing the collected radiant energy along a collection path extending from the target region to the photodetector 2816. The collection path of the optical system 2608 is typically enclosed by a light shield 2930 to prevent unwanted radiant energy from entering the optical system and being reflected or scattered into the photodetector 2816.",
        "Referring now to FIG. 30, there is illustrated an enlarged view of the optical system 2608 showing its constituent components. In FIG. 30, the top of the light shield 2930 has been removed for clarity of illustration, but the walls 3002 of the light shield are present on either side of the collection axis 2604. In this embodiment, the radiant energy source 2802 is mounted on a forward extension 3004 of the PCB 2902. At least a portion of the radiant energy emitted by the source 2802, which is typically visible—or IR—wavelength light, enters the projection portion 2924 of the optical system. In the embodiment shown, the projection portion includes a guideway 3006 which directs the radiant energy (denoted by rays 3008) from the source 2802 to the target region 2926. In one embodiment, the guideway 3006 comprises a transparent prism which directs the radiant energy 3008 by reflection from the guideway sides 3010 and by refraction at the guideway ends 3012, 3013. It will be apparent, however that other embodiments may utilize a mirror or fiber optics as the guideway 3006. Alternatively, other embodiments may directly illuminate the target region 2926 from the source 2802 without the use of a guideway. A guideway lens 2712 may be used at the upstream end 3013 of the guideway 3006 to increase the amount of radiant energy collected from the source 2802 for delivery to the target region 2926.",
        "The radiant energy 3008 delivered to the target region 2926 illuminates any barcode 2508 present, causing the energy to be scattered from the surface of the barcode as illustrated. At least a portion of the energy scattered from the barcode 2508 is reflected into the collection lens 2710, forming a reflected image of the barcode. This image is directed along the collection axis 2604 of the optical system downstream toward the photodetector 2816. As the barcode 2508 moves through the target region 2926, the reflected image of the alternating light and dark (i.e., more reflective and less reflective) bars forming the symbol will be directed across the photodetector 2816, causing the output electrical signals to vary correspondingly. Given output electronic signals having sufficient signal-to-noise ratio, decoding circuits of known design can amplify and decode the output electrical signals from a photodetector and identify the corresponding barcode. However, prior to the current invention, photodetectors providing signals having sufficient signal-to-noise ratio were not available at a sufficiently low manufacturing cost. Of particular challenge is obtaining a high signal-to-noise ratio electrical signal from a photodetector without utilizing a multi-stage photo amplifier. Further, it is preferred that the system utilize as few optical elements as possible.",
        "Referring still to FIG. 30, the photodetector 2816 of the current embodiment is mounted on the top surface 3014 of a base 3016 and electrically connected to the PCB 2902 with leads 3018. The photodetector 2816 may be a device selected from the group of known light-sensitive devices including photo-diodes, photo-transistors, photo-resistors, photomultiplier tubes, and Charge Coupled Devices (CCD). Alternately, the photodetector 2816 may be another type of device for producing electrical signals corresponding to light incident thereupon. In a preferred embodiment, the photodetector 2816 is a photo-diode which provides a desirable combination of light-sensitivity and low cost.",
        "Disposed upstream on the collection path from the photodetector 2816 is a pinhole aperture 3020. Preferably, there are no intervening or refractive or diffractive elements between the pinhole aperture 3020 and the photodetector 2816, as their presence will increase the cost of the device. A pinhole aperture is a well known optical element which provides a well defined, virtually undistorted image of objects across a wide angular field (i.e., good depth of focus) and over a large range of distances (i.e., good depth of field). A pinhole aperture does not focus the energy passing therethrough, but rather increases the contrast of the image, although at the same time decreasing its luminance. Raising the contrast of the image passed to the photodetector 2816 increases the signal-to-noise ratio of the resulting electrical output. The lower luminance of the image merely reduces the overall output signal strength and can be easily overcome by electronic amplification if the signal-to-noise ratio of the signal is high. Thus, by positioning the pinhole aperture 3020 upstream of the photodetector 2816 in the current invention, the image contrast of the barcode image is increased such that an inexpensive single stage photodetector can provide an electrical signal having sufficient signal-to-noise ratio to allow decoding of the barcode without encountering excessive signal noise during electronic amplification.",
        "The collection lens 2710 is disposed upstream on the collection path (i.e., toward the barcode which is the source of the image) from the pinhole aperture 3020. Preferably, collection lens 2710 is a magnifying lens, i.e., refracting the light rays passing therethrough to create an image which has increased dimensions compared to the actual bar code. The magnifying lens illustrated in FIG. 30 is a single element double convex lens. In another embodiment, a single element plano-convex lens may be used. In still further embodiments, other single element or multi element magnifying lenses can be used for collection lens 2710. Preferably, there are no intervening refractive or diffractive elements between the pinhole aperture 3020 and the collection lens 2710, as their presence will increase the cost of the device.",
        "The refracted light rays 3009 leaving the collection lens 2710 form an image of the bar code which is dimensionally magnified as it moves toward the pinhole aperture 3020, thereby increasing the apparent width of the bars when their image is received at the pinhole aperture. The portion of the image passing through the pinhole aperture 3020 and reaching the photodetector 2816 will likewise be dimensionally magnified. Thus, the optical system 2806 of the current embodiment, combining dimensional image magnification (provided by the collection lens 2710) and contrast enhancement (provided by the pinhole aperture 3020) effectively acts to pre-amplify the optical signal reaching the photodetector 2816 such that the electrical output signals 2818 will have sufficient signal-to-noise ratio for amplification and decoding without requiring a multi stage electronic photo amplifier which would be more expensive to manufacture. Described another way, the optical system according to one embodiment of the current invention provides increased resolution (i.e., the ability to distinguish between two lines or points in a symbol) as follows: The bar code 2508 to be read has a minimum unit width denoted by W, for example, the minimum width of a bar in the bar code. The light rays 3009 of the image are refracted by the collection lens 2710 such that the minimum unit width of the bar code is dimensionally magnified, for example, from W to 2×W (i.e., a factor of 2X) as it moves from the target plane 2506 to the pinhole aperture plane 3024. The pinhole aperture 3020 is selected to have a diameter, for example 0.5×W, which is smaller than the magnified minimum unit width. Thus, only a sample (denoted by reference numeral 3028) of the image rays may pass through the aperture 3020 to the photodetector 2816 lying in the photodetector plane 3026. This results in the photodetector 2816 seeing (i.e., having in its field of view), at most, either a portion of a single feature (bar or space) or portions of one bar and one adjacent space. The photodetector never sees portions of three adjacent features at the same time. This arrangement results in a very high signal-to-noise ratio being produced by the photodetector 2816. In one embodiment of the current invention, the optical system 2806 provides at the photodetector plane 3026 an image of the symbol 2508 at the target plane 2506 which is dimensionally magnified within the range of about 0.5X to about 5X. In another embodiment, the optical system 2806 provides at the photodetector plane an image of the symbol at the target plane which is magnified within the range of about 1.5X to about 2.5X. In yet another embodiment, the optical system 2806 provides at the photodetector plane an image of the symbol at the target plane which is dimensionally magnified within the range of 1.9X to about 2.1X.",
        "Referring still to FIG. 30, a protective window 2708 may be provided along the collection path upstream from the magnifying lens 2710. The protective window 2708 has parallel surfaces which are disposed substantially perpendicular to the collection path 2604 and thus do not substantially refract or diffract light rays passing therethrough. In the embodiment illustrated, the protective window 2708 is molded as an integral portion of the component which also comprises the projection guideway 3006 and guideway lens 2712. In one embodiment of the current invention, the collection portion 2928 of the optical system 2806 consists of only the protective window 2708, the magnifying collection lens 2710 and the pinhole aperture 3020 arranged in that order between the target symbol 2508 and the photodetector 2816. Such an embodiment provides a functional optical system having very low production costs.",
        "Referring now to FIGS. 31 and 32, there is illustrated a discrete detector unit 3102 which may be used in an embodiment of the invention. The detector unit 3102 comprises the photodetector 2816 and the pinhole aperture 3020 packaged together in a discrete unit. Such packaging decreases production costs by reducing the assembly's part count and by reducing the number of components which must be assembled.",
        "As best seen in FIG. 32, the detector unit 3102 includes a base 3016 having a top surface 3014 upon which the actual photodetector 2816 is mounted. Note that the photodetector 2816 may be a separate electronic component which has been mounted to the base 3016 or alternately, it may be a device formed as an integral part of the base substrate. A cap 3104 is mounted to the base 3016. The cap 3104 has a top portion 3106 which is spaced apart from the top surface 3014 of the base 3016 to define an interior cavity 3202 containing the photodetector 2816. The cap 3104 has a single pinhole 3020 formed therethrough at a predetermined distance 3108 from the photodetector 2816. Except for the pinhole aperture 3020, the cap 3104 is preferably light-tight. In one embodiment of the invention, the cap 3014 of the detector unit 3102 is a cylindrical metallic canister having a flat upper portion 3106. Using a metallic canister for the cap 3014 has two advantages: first, it provides a rugged container which protects the photodetector from damage during transportation, handling and assembly; and second, the metallic material allows a pinhole aperture 3020 having high dimensional accuracy to be formed by drilling, punching or otherwise machining a hole through the metallic surface. In addition, cylindrical metallic canisters suitable for use as cap 3014 are readily available at very low costs in the electronic industry, having been used for many years as protective caps for transistors and other semiconductor devices. To provide for a convenient sized optical reader, one embodiment of the current invention utilizes a detector unit 3102 having a cap 3104 with a diameter 3204 within the range of about 3 millimeters to about 20 millimeters. Another embodiment of the current invention utilizes a detector unit 3102 having a cap 3104 with a diameter 3204 within the range of about 4 millimeters to about 8 millimeters. Yet another reader according to the current invention utilizes a cap for the detector unit 3102 having a diameter 3204 within the range of about 5.5 millimeters to about 6.5 millimeters.",
        "The predetermined distance 3108 between the pinhole aperture plane 3024 and the photodetector plane 3026 will affect the overall magnification of the image (or portion of the image) received at the photodetector 2816. In one embodiment of the current invention, the predetermined distance 3108 is within the range of about 1 millimeter to about 10 millimeters. In another embodiment of the current invention, the predetermined distance 3108 is within the range of about 3 millimeters to about 7 millimeters. In yet another embodiment, the predetermined distance 3108 between the photodetector 2816 and the pinhole aperture 3020 is within the range of about 4.5 millimeters to about 6 millimeters.",
        "Referring now to FIG. 36, there is illustrated a flowchart of a method of reading a bar code in accordance with another aspect of the current invention. The method starts in block 3602 and proceeds to the first function block 3604 wherein the target region is illuminated with a radiant energy generated by a radiant energy source which is directed from the source to the target region. Next, flow continues to function block 3606 wherein the bar code or other symbol is moved through the target area. Flow next proceeds to block 3608 which represents transmitting an image of the illuminated bar code through an optical system along a collection path extending from the target region to a photodetector. The step of transmitting includes a first sub-step 3610 wherein the reflected image of the bar code is dimensionally magnified with an optical element which is disposed along the collection path between the target region and the photodetector. Preferably, the optical element used for dimensional magnification is a magnifying lens, either a double convex lens or a plano-convex lens. Further, it should be noted that sub-step 3610 is preferred but not required.",
        "The step 3608 of transmitting an image of the illuminated bar code further comprises a second sub-step 3612 which is increasing the contrast of the reflected image and decreasing the luminance of the image by passing it through an optical element disposed along the collection path between the target region and the photodetector. Note that when sub-step 3610 is performed, the optical element for magnifying the image is disposed between the bar code and the optical element which increases the contrast of the reflected image. In an embodiment of the invention, the optical element which increases the contrast of the reflected image is a passive device, i.e., it requires no electrical energy or other external power. In another embodiment, the optical element which increases the contrast of the image is combined in a discrete package with the photodetector. In yet embodiment, the optical element which increases the contrast of the reflected image is a pinhole aperture. The pinhole aperture may be formed through the body of a discrete package enclosing the photodetector or the pinhole aperture may be a separate element included in the optical system.",
        "Flow now continues to function block 3614 wherein the reflected image of the bar code is received by the photodetector. Flow then continues to function block 3616 wherein the photodetector generates output electrical signals indicative of the radiant energy received. Flow then proceeds to function block 3618 wherein the output electrical signals produced by the detector are decoded to provide an indication of the information contained in the bar code. The method of reading the bar code is now complete as indicated by the flow proceeding to the “End” block 3620.",
        "Referring now to FIG. 37a, there is illustrated a bar code 3702 which can be scanned with the input device 1600, for example the optical reader 2500 or 3300 previously described, to extract the information contained therein. Typically, these bar codes are associated with a product or a service and they will have the decoded information disposed thereunder in the form of numbers, this represented by a series of “xxx's.” These bar codes are conventional and can be generated with many types of programs. However, they are usually uniquely associated with a given product or product number (i.e., a “UPN”) or they can be generated for any type of application a user desires them for. However, with a UPN, they have specific links and specific fields. For example, a certain portion of the bar code 3702, when associated with a product having a UPN, will define the company. Therefore, all UPNs for a given company will have this set portion and it will always be the same.",
        "The bar code 3702 is disposed on a surface, either the surface of a product or even an advertisement or a tag associated with the product. It is typically in close association with that product or service. On the surface in proximity thereto is provided a logo 3704. This logo is an indicia of the fact that the bar code 3702 is associated with the system described hereinabove, i.e., when this bar code 3702 is scanned with the PC 302 running the appropriate software, this indicates that information is in the database of the ARS 308. Of course, the user does not know that this information must first be obtained from ARS 308; rather, the user merely knows that the indicia 3704 indicates that scanning of the bar code 3702 will launch a computer to a destination site. This is unique in that the bar code performs two functions, a retail function and a routing function. However, the user, when selecting products, will have no idea that this bar code 3702 on the product can actually allow them to have access to a defined location on the network without the indicia 3704.",
        "Referring now to FIG. 37b, there is illustrated an alternate embodiment, wherein the bar code 3702 is surrounded by a border 3706, which border 3706 can be a particular color that can stand out. Typically, this bar code 3702 will be disposed on a product on a retail shelf. When the consumer picks up the product, the consumer can actually determine which products have a product code for use by the retailer that is also useful to access some location on the network. For example, a manufacturer may want to offer some type of prize or incentive for an individual to purchase their product. They could actually offer some type of coupon from the remote location, provided that a consumer purchases their product and then scans it with the input device 1600 attached to the PC. If this occurs, then the user will be connected to the location and receive some type of coupon. However, in order for this to occur, the user must recognize that the product they are purchasing was one that had a UPN associated therewith that was “network compatible.” This network compatibility indicates to the consumer that they can in fact access some location over the network. They are not informed as to what location can be located; rather, only that some type of particular location can be located. This provides a means by which the manufacturer can possibly sell more product and various types of coupons that can be uploaded.",
        "Referring now to FIG. 38a, there is illustrated a diagrammatic view of a unique ornamental bar code 3802. The bar code 3802 is an ornamental bar code that provides a unique appearance for a user which essentially identifies the bar code as being associated with a particular function, that function being to facilitate interconnection with a remote location on a network, i.e., the Internet and the hereinabove described application.",
        "The ornamental bar code illustrated in FIG. 38a has a plurality of slanted lines of differing thicknesses, with a left side border 3804, and a right side border 3806. The left side border 3804 has a straight slanted edge 3808 and the right side border 3806 has a slanted straight line edge 3810. The edges 3808 and 3810 are parallel to each other and they are at the same angle. Disposed therebetween are a plurality of varying width straight lines. These lines are the encoded information which is represented by a plurality of “X's” disposed at the lower edge of the bar code 3802. It is noted that the straight lines are similar, if not identical, to those provided on a conventional bar code. The organization and spacing of the lines is also conventional and the illustration of FIG. 38a is not meant to be to scale. However, although this is an ornamental bar code, it is a bar code that can be scanned with the conventional scanner along different scan axis. Typically, the conventional scanner scans along a straight line. Therefore, any straight line that intersect with the bar code at substantially any angle must be able to determine along that line the differing widths. Therefore, if the adjacent lines were not substantially parallel to each other along the scan line, such that the width thereof might change, this may cause an error in the reading. Typically a bar code is scanned along many different angles to determine which angle gives the best reading. Although it is not required to have the borders 3804 and 3806, these are provided for an ornamental purpose. Any arrangement of the lines other than the conventional, will provide an ornamental appearance. Further, it could be that the lines have different colors.",
        "Referring now to FIG. 38b, there is illustrated an alternate design for the ornamental bar code 3802, this being an ornamental bar code 3814. This ornamental bar code 3814, similar to the bar code 3802, has a left border 3816 and a right border 3818. However, the border 3816 has disposed thereon a serpentine edge 3820 and the border 3818 has a substantially similar shaped serpentine edge 3822 disposed thereon. Between the two serpentine edges 3820 and 3822 are disposed a plurality of varying width lines, each being serpentine such that the edges thereof are substantially identical to the edges 3822, wherein the space therebetween is of uniform thickness, although it is serpentine in shape. Further, the edge of the bar code 3814 or 3802 need not be straight but, rather, can be uniquely shaped. Again, the spaces between the lines need to be of such a nature that a straight line scan will be able to discriminate between varying widths and open spaces to extract the code therefrom.",
        "Referring now to FIG. 39, there is illustrated a product 3902 such as a can with the bar code 3802 disposed thereon. This bar code 3802, as described hereinabove, has a unique design which can be recognized as being associated with a particular function, the function in the disclosed embodiment being that of allowing interconnection to the web. However, bar code 3802 is coded with information that is unique to the product and is not necessarily unique to any web address; rather, the ARS 308 has associated therewith the information to effect a communication link between a user's computer at which the product code 3802 is scanned and a remote location on the web, as described hereinabove. It is the recognition that this code is of such a nature that the user can access a remote web site utilizing some type of scanning input device such as that described hereinabove. This code has information contained therein, which is typically not of interest to a consumer. However, this code could be of interest to a retailer in one operation, i.e., that of maintaining inventory and setting prices, and also useful in interconnecting with a remote location on the web for conducting some type of E-commerce associated with that particular product 3902.",
        "In operation, as described hereinabove, the user or consumer will recognize that a particular product has a unique bar code disposed thereon. This is due to the fact that the bar code has some aesthetically attractive feature that will visually attract the user to the bar code. Once the user recognizes this, then the user is provided with knowledge that a link exists through their computer. There is a “branding” associated with this unique design, such that it will have a significant level of trade dress attributes. Once this is recognized by a consumer as the unique design associated with unique software of a service provider providing the linking operation and that it will be a “linkable” product via the bar code. Once this is recognized, the user can then utilize the computer with that software disposed thereon to create a link to the remote location.",
        "Referring now to FIG. 40, there is illustrated a unique bar code which can be used for encoding machine-readable information. Such bar code can be read using an input device 1600, for example, the optical reader 2500 or 3300 previously described, to extract the information encoded therein. The bar code 4000 comprises a character string 4002 including a plurality of characters 4003-4008 disposed side-by-side along a longitudinal code axis 4010. Each character 4003-4008 is formed by a sequence of code bars 4012 and intervening code spaces 4014. The code bars 4012 are parallel to one another and to a line defining a bar axis 4016 which intersects the longitudinal code axis 4010.",
        "The bar axis 4016 forms a slant angle (denoted by reference numeral 4024) with a line 4026 which is perpendicular to the longitudinal code axis 4010. The slant angle 4024 has a value greater than one degree to provide a visual cue indicating the unique bar code of the current invention is being used. In another embodiment, the slant angle 4024 has a value within the range from about five degrees to about forty-five degrees. This range provides, at the lower end, an unambiguous visual cue even if angular printing variations on the order of several degrees are present, while at the same time avoiding extreme code bar length-to-height ratios (i.e., greater than 1.0) at the higher end of the range which may greatly increase the likelihood of scanning problems. In yet another embodiment, the slant angle 4024 has a value within the range from about twenty degrees to about twenty-five degrees. This range is believed to provide a strong visual cue while maintaining a code bar length-to-height ratio in the desirable range below about 0.5. In one preferred embodiment, the slant angle 4024 is about 22.5 degrees.",
        "Each character 4003-4008 of bar code 4000 is defined in accordance with the character specification of a predefined bar code standard. The definition for each character includes a bar/space pattern, at least one encoded alphanumeric value and an integer checksum value. One example of such a predefined bar code standard is the Code 128 bar code, the character specification of which is shown in TABLE 1 (appended to this disclosure following the Detailed Description). The bar/space pattern of the character specification (see TABLE 1) provides the width of each successive code bar 4012 and code space 4014 for a character in terms of multiples of a minimum unit width. By way of background, each character encoded in a Code 128 bar code is made up of three code bars 4012 and three code spaces 4014. The only exception is the stop character 4008, which includes one extra bar 4012. Each of the code bars 4012 and code spaces 4014 has a width 4018 which is one of four different unit widths, i.e., one, two, three or four times a minimum unit width. In the Code 128 standard, each character except the stop character has an overall width 4020 which is eleven times the minimum unit width. The stop character 4008 has an overall width which is thirteen times the minimum unit width.",
        "The character specification also provides at least one encoded alphanumeric value for each character. In the character specification for the Code 128 standard (see TABLE 1), three alternative encoded alphanumeric values are provided for each character, namely, the Code Set A values, the Code Set B values and the Code Set C values. For example, in FIG. 40 the leftmost character (i.e., designated 4003), which has a bar/space pattern of “112232”, has an encoded alphanumeric value of “,” in Code Set A, an encoded alphanumeric value of “,” in Code Set B, and an encoded alphanumeric value of “12” in Code Set C. Similarly, the next character (i.e., designated 4004), which has a bar/space pattern of “131123”, has an encoded alphanumeric value of “B” in Code Set A, an encoded alphanumeric value of “B” in Code Set B, and an encoded alphanumeric value of “34” in Code Set C.",
        "The character specification further provides an integer checksum value (shown as “Value” in TABLE 1) for each character. For the illustrated character designated 4003 having a bar/space pattern of “112232”, the integer checksum value is “12”, and for the illustrated character designated 4004 having a bar/space pattern of “131123”, the integer checksum value is “34”.",
        "It will be appreciated that while the unique bar code illustrated in FIG. 40 utilizes characters defined in accordance with the character specification of the Code 128 standard, other unique bar codes according to the current invention may utilize characters defined in accordance with the character specification of other predefined bar codes, including Codabar, the EAN 8 and 13 series, the ISBN series, the ISSN series, ITF, the JAN 8 and 13 series, Pharmacode, the UPC-A and -E series, Plessy and Code 39, or to standards yet to be developed. It will be further appreciated that while it may utilize characters defined according to the character specification of an existing bar code standard, the unique bar code of the current invention varies from the standards of known bar codes in other respects. For example, while the embodiment of bar code 4000 illustrated in FIG. 40 utilizes characters defined according to the character specification of the Code 128 standard, it does not utilize all characters of the Code 128 standard. For example, the Code 128 characters having checksum values 103, 104 or 105 (i.e., bar/space patterns of “211412”, “211214” and “211232”, respectively), one of which characters is always required in a bar code according to the Code 128 standard, are never used in the bar code 4000 of the current embodiment.",
        "Referring again to FIG. 40, the plurality of characters in the character string 4002 of unique bar code 4000 includes, sequentially, one start character (in this case, character 4003), a message string 4022 having at least one message character (in this case, characters 4004-4006), one check character (in this case character 4007) and a stop character (in this case, character 4008). The unique bar code 4000 can be read by scanning in either direction along the longitudinal code axis 4010. The stop character 4008 may therefore appear at either end of the character string 4002. The stop character 4008 is always recognizable, however, due to its unique bar/space pattern, e.g., “2331112” in the Code 128 system. The start character 4003 is thus always the one of the two end characters on the character string 4002 which is not the stop code 4008.",
        "In the unique bar code of the current invention, the start character 4003 is used to designate the type identification (“TID”) of the bar code. In the current invention, the start character 4003 may be any character having a checksum value within the range from 1 to 94, inclusive, thus the unique bar code 4000 may have any of 94 different TID's. In the bar code illustrated in FIG. 40, the start character 4003 has a checksum value of “12” under the character specification for Code 128. By contrast, the standard for Code 128 bar codes requires the start character to have a checksum value within the range from 103 to 105, inclusive. Thus, the illustrated bar code 4000 is not decodable using the Code 128 bar code standard and cannot be mistaken for a Code 128 bar code, even though many of the same characters are used.",
        "The message characters 4004, 4005 and 4006 of the message string 4022 encode the message, i.e., the informational content, of the bar code 4000. The message characters may be encoded in accordance with the encoded alphanumeric values of the character specification being used. However, the checksum values for each of the message characters in the unique bar code of the current invention must be within the range from 0 to 95, inclusive. Thus, using the Code Set C values for the character specification of Code 128 (see TABLE 1), the message characters 4004-4006 of message string 4022 encode the information “34”, “56” and “78”, respectively. It will be appreciated that using an alternate code set, e.g., Code Set B, the same message characters will encode the information “B”, “X” and “n”, respectively.",
        "The check character 4007 is disposed between the message string 4022 and the stop character 4008. The check character 4007 is typically used by an optical reader to ensure that the start character 4003 and the message string 4022 have been accurately read. In the unique bar code of the current invention, the check character 4007 encodes a modulus 103 checksum that is calculated by summing the checksum value of the start character 4003 plus the product of each message character position (the message character position adjacent the start character being=1) and the checksum value of the message character at that position. This sum is divided by 103. The remainder of the answer is the checksum value of the check character, which can then be determined by consulting the character specification, e.g., TABLE 1. Each encoded character in the character string 4002 is included in the checksum calculation except the stop character 4008 and the check character 4007. Examples of the checksum calculation for the bar code of FIG. 40, and for a second bar code (not illustrated) are provided below.",
        "Calculate checksum for bar code according to current invention using Code Set C values for character specification of Code 128, for Start Character=12 and Message String=34 56 78:",
        "Alpha. Encoded value:\n12\n34\n56\n78\n\n\n\nChecksum value:\n12\n34\n56\n78\n\n\n\nPosition:\nStart\n1\n2\n3\n\n\n\n\n\n\n\nCalculate Sum: 12 + (1 × 34) + (2 × 56) + (3 × 78) = 392\n\n\n\nCalculate Modulus 103 Remainder: 392/103 = 3 remainder 83\n\n\n\nCheck character = Character with checksum value 83\n\n\n\nFinal character string: 12 34 56 78 83 (Stop)",
        "Calculate checksum for bar code according to current invention using Code Set B values for character specification of Code 128, for Start Character=C and Message String=o d e:",
        "Alpha. Encoded value:\nC\no\nd\ne\n\n\n\nChecksum value:\n35\n79\n68\n69\n\n\n\nPosition:\nStart\n1\n2\n3\n\n\n\n\n\n\n\nCalculate Sum: 35 + (1 × 79) + (2 × 68) + (3 × 69) = 457\n\n\n\nCalculate Modulus 103 Remainder: 457/103 = 4 remainder 45\n\n\n\nCheck character = Character with checksum value 45, i.e., M\n\n\n\nFinal character string: C o d e M (Stop)",
        "To ensure accurate reading of the character string 4002 by optical readers, the bar code 4000 includes a white space, or quiet zone 4028 disposed along the longitudinal code axis 4010 on either end of the character string. The quiet zone 4028 has a width 4029, measured parallel to the longitudinal code axis 4010, of at least ten times the minimum unit width of the code bars 4012. No code bars or other symbols may be present in the quiet zone 4028.",
        "The unique bar code of the current invention may further include a wedge symbol 4030 disposed adjacent to the character string 4002 to provide the appearance of a rectangular end to the slanted character string. The wedge symbol 4030 has no encoded information which can be extracted by the optical reader, and is therefore referred to as being “non-encoded”. Each wedge symbol 4030 is a right triangle having a first side 4032 which is substantially parallel to the longitudinal code axis 4010, a second side 4034 which is substantially perpendicular to the longitudinal code axis and a hypotenuse side 4036 which is substantially parallel with the bar axis 4016 of the code bars. Each wedge symbol 4030 is disposed along the longitudinal code axis 4010 such that the hypotenuse side 4036 faces the character string 4002 and is separated from the character string by a space having a width of at least ten times the minimum unit width. In other words, the wedge symbol 4030 must be located outside the quiet zone 4028. In a preferred embodiment, the bar code 4000 includes a pair of wedge symbols 4030, with one wedge symbol disposed on either side of the character string 4002 to provide an overall rectangular appearance to the bar code. To further enhance the rectangular appearance, in one embodiment the wedge symbols 4030 have a height 4038, measured perpendicular to the longitudinal code axis 4010, which is the same as the height of the code bars 4012.",
        "Referring still to FIG. 40, the unique bar code 4000 may further include a human-readable element 4040 disposed proximate to the character string 4002. The human-readable element 4040 provides some of the information encoded in the character string 4002 in a human-readable form. Typically, the human readable element 4040 will comprise conventional alphanumeric characters arrayed in a string parallel to the longitudinal code axis 4010. The human-readable element 4040 may be positioned above or below the character string 4002, or it may be positioned in a recessed area formed along one edge of the character string, as illustrated in FIG. 40.",
        "In one embodiment, the human-readable element 4040 comprises two sub-elements. The first sub-element is an initial letter (denoted by reference numeral 4042) disposed at the leftmost position of the human-readable element 4040. The second sub-element is at least two two-digit strings arrayed sequentially immediately to the right of the initial letter 4042. The first of these two-digit strings (denoted by reference numeral 4043) provides the encoded alphanumeric value of the start character 4003. The subsequent two-digit strings (denoted by reference numerals 4044, 4045 and 4046) correspond to the encoded alphanumeric values of the message characters in the message string 4022, in sequence from the message character (i.e., 4004) adjacent the start character 4003 to the message character (i.e., 4006) adjacent to the checksum character 4007. For example, in the bar code 4000 illustrated in FIG. 40, the human-readable element 4040 includes an initial letter 4042, which is a “C”, followed by four two-digit strings 4043-4046. The first two-digit string 4043 provides the human-readable string “12” corresponding to the encoded alphanumeric value of the start character 4003. The subsequent three two-digit strings 4044, 4045 and 4046 provide the human-readable strings “34”, “56” and “78”, corresponding respectively to the encoded alphanumeric values for the message string characters 4004, 4005 and 4006. To further enhance the readability of the human-readable element 4040, blank spaces 4048 may be inserted between the initial letter 4042 and the first two-digit string 4043 and further between each pair of two-digit strings.",
        "While automatic optical readers (i.e., those which can scan a bar code while stationary) have become commonplace in retail and commercial settings, these automated devices are typically too expensive for wide ownership by individuals such as home computer users. In contrast, manual optical readers (i.e., those which must be moved across the bar code during scanning) such as optical reader 2500 or 3300, can be attractively priced to achieve widespread ownership among the public. Manual optical readers, however, require the user to follow certain scanning procedures in order to read reliably. For example, the scan must encompass the entire bar code in a single pass; scanning only a portion of the code will result in a read error. Further, the scan must be performed at a relatively constant speed, i.e., within a predefined range of speeds; scanning too slow or too fast will also result in a read error.",
        "It is anticipated that new or inexperienced users of manual optical readers may encounter difficulty in scanning bar codes for one of several reasons. First, the user may intentionally begin scanning in the middle of the code because the user has no visual cue which indicates where the scan should start. This will cause a read error as previously described. Second, the user may begin scanning too close to the edge of the bar code. Obviously, if the user's aim with the reader is somewhat inaccurate, intending to begin the scan close to the edge of the code may result in actually starting the scan within the code string itself rather than to the side, thereby omitting encoded characters from the scan and causing a read error. Even if the movement of the reader encompasses all of the encoded characters, however, beginning the scan too close to the edge of the code may still result in a read error. This is because the user must accelerate the scanner from its static starting position up to the desired scanning speed. As the reader is being accelerated, its speed will initially be below the acceptable range of scanning speeds, and during this time the characters moved across by the reader will not be properly sensed. Third, the user may begin the scan too far from the code. While this may reduce read problems associated with under-speed scanning, it increases the likelihood that the user's scan path (i.e., the path followed by the target region of the reader) will drift off of the longitudinal code axis such that encoded characters (especially at the end of the code string) are missed. Facilitating the proper scanning of bar codes by users of manual optical readers is thus an important aspect of expanding the use of these systems.",
        "Referring again to FIG. 40, there is illustrated an aiming indicia 4050 disposed adjacent the bar code 4000. The aiming indicia includes a graphic element 4052 disposed along the longitudinal code axis 4010 and spaced apart from the nearest of the code bars 4012 by a distance of at least ten times the minimum unit width for the code bars (i.e. the graphic element may not be placed within the quiet zones 4028 of the bar code). Preferably, the graphic element 4052 is centered along the longitudinal code axis 4010, however, this is not strictly required. The graphic element 4052 has no encoded information which can be extracted by the optical reader, and is therefore referred to as being “non-encoded”.",
        "Users of manual optical readers will be instructed or otherwise induced to scan the bar code 4000 by first aiming the reader at the aiming indicia 4050, preferably at the center 4056, and then sweeping the aim point (i.e., target region) of the reader along the code axis from the aiming indicia across the entire bar code. Stated in more technical terms, the user will first hold the optical reader (e.g., reference numeral 2500, FIGS. 25-30) to direct its optical axis (e.g., reference numeral 2604, FIGS. 26, 30) such that the target region (e.g., reference numeral 2926, FIGS. 29, 30) is on the aiming indicia 4050. Next, the user will move the optical reader to direct the optical axis 2604 such that the target region 2926 sweeps along the longitudinal code axis 4010 from the aiming indicia 4050 across the entire bar code 4000. The aiming indicia 4050 is disposed relative to the bar code 4000 such that users following the procedure described above will encounter significantly reduced reading errors. Further, the aiming indicia 4050 provides a strong visual cue which helps to remind the user of proper scanning techniques.",
        "According to another aspect of the current invention, an enhanced bar code 4070 (FIG. 40) is provided by combining a non-encoded aiming indicia 4050 and a bar code 4000 including the encoded character string 4002. The enhanced bar code 4070 may further comprise non-encoded wedge symbols 4030 as previously described.",
        "In one embodiment, the graphic element 4052 has a height 4054, measured in a direction perpendicular to the longitudinal code axis 4010, within the range from about 50% to about 105% of the height 4038 of the code bars 4012. This range provides, at the lower end, an aiming indicia 4050 large enough to be readily noticed (and thus provide a visual cue), while at the higher end it provides an indicia which is not so large as to prompt users to become careless and begin their scan too high or too low with respect to the center axis. In another embodiment, the graphic element 4052 has a height 4054 within the range from about 85% to about 100% of the height 4038 of the code bars. Aiming indicia within this range maintain a generally rectangular overall appearance for the enhanced bar code 4070. In a preferred embodiment, the aiming indicia 4050 has a graphic element 4052 with a height of about 95% of the height of the code bars.",
        "In one embodiment of the current invention, the graphic element 4052 is separated from the nearest portion of the bar code 4000 by a distance (denoted by reference numeral 4058), measured in a direction parallel to the longitudinal code axis 4010, within the range from about 15% to about 30% of the height 4054 of the element. This range is believed to provide optimum longitudinal placement of the aiming indicia 4050 to ensure that the manual optical reader is fully accelerated up to scanning speed before encountering the encoded character string 4002 of the bar code 4000. It will be appreciated that the distance 4058 is measured from the nearest portion of any part of the bar code 4000. Thus, for bar codes including wedge symbols 4030 or other non-encoded characters, the distance between the aiming indicia 4050 and the encoded character string 4002 will be slightly increased. However, this will not adversely affect scanning procedures in any way, since the reader can be fully accelerated and at a stable scanning speed prior to encountering the encoded character string 4002. In another embodiment, the graphic element 4052 is separated from the nearest portion of the bar code 4000 by a distance 4058 within the range of about 18% to about 24% of the height 4054 of the element. Spacings within this range are believed to provide a more consistent visual cue to the user. In a preferred embodiment, the graphic element 4052 is separated from the nearest portion of the bar code 4000 by a distance of about 20% of the height 4054 of the element.",
        "Users may be further induced to utilize the aiming indicia 4050 during scanning of the bar code 4000 by making the graphic element 4052 more visually prominent. Thus, in another embodiment of the current invention, the graphic element 4052 is at least partially rendered in a red color, red being a color frequently associated by the public with important information. In another embodiment, the graphic element 4052 is at least partially rendered in a color which contrasts with the color of the code bars 4012 in the bar code 4000, the public also associating contrasting colors with important information. For example, in still another embodiment, the graphic element 4052 is at least partially red in color and the code bars 4012 of the bar code are black in color. It will be appreciated, other colors or combinations of contrasting colors can be utilized for rendering the graphic element 4052 and bar code 4000 without departing from the scope of the current invention.",
        "As illustrated in FIG. 40, the graphic element 4052 of the aiming indicia 4050 need not be a single element but rather may include a plurality of discrete sub-elements. For example, as illustrated in FIG. 40, a first sub-element 4060 can be a colon symbol (“:”) and a second sub-element 4062 can be a letter C. The graphic element 4052 so created may be a logo for a company sponsoring the bar code, on the other hand it may simply be a combination of elements believed effective in drawing the user's attention to the aiming indicia 4050. It is, of course, possible to combine certain aspects of the invention previously described. For example, the graphic sub-elements 4060 and 4062 may be rendered in an attention-attracting color or with contrasting colors. In one example, the colon 4060 and letter C 4062 may be rendered with their interior areas (denoted by reference numeral 4064) colored red. In another embodiment, both the colon sub-element 4060 and the C sub-element 4062 may have the interior area 4064 colored red and an outline or border area (denoted by reference numeral 4066) colored black.",
        "Referring now to FIGS. 41 and 42, there are illustrated flowcharts of a method for facilitating the reading of a bar code with a manual optical reader. The flowchart of FIG. 41 illustrates the process from the perspective of the bar code sponsor (i.e., the entity responsible for producing the bar code and/or marking it on a product or other article of commerce) and FIG. 42 illustrates the process from the perspective of the user (i.e., the entity actually scanning the bar code with a manual optical reader).",
        "Referring first to FIG. 41, the process from the sponsor's perspective begins in the block designated with reference numeral 4102. Flow then proceeds to function block 4104, wherein an aiming indicia is provided along the longitudinal code axis adjacent a bar code, spaced apart from the nearest code bars by a distance of at least ten times a minimum width for the code bars. This step results in the formation of an enhanced bar code 4070 as illustrated in FIG. 40, including a bar code 4000 with encoded character string 4002 and (optionally) wedge symbols 4030, combined with an aiming indicia 4050. Flow proceeds from function block 4104 to function block 4106, wherein users of manual optical readers are induced to read the bar code 4000 using the aiming indicia 4050 in accordance with the following procedures: First, aiming the optical reader at the aiming indicia 4050, and second, sweeping the aim point of the reader along the longitudinal code axis 4010 from the aiming indicia completely across the bar code 4000.",
        "In one embodiment of the process, the sponsor may induce users to read the bar code using the aiming indicia 4050 by means of instructions included with the optical reader. In an alternative embodiment, the sponsor may induce users through instructions included with and/or printed on products bearing the enhanced bar code 4070. In yet another embodiment, the sponsor may induce users through instructions provided in advertisements or public service announcements, or through other known educational or instructional means.",
        "Referring now to FIG. 42, the process according to the user's perspective begins in block 4202 and proceeds to a first function block 4204, wherein the user aims the optical reader at the aiming indicia 4050. Preferably, the optical reader will be aimed at the center 4056 of the graphic element 4052, however precise aiming will typically not be required. Described in more technical terms, the function of block 4204 requires the user to direct the optical axis of the optical reader such that the target region of the reader is within, and preferably centered on, the aiming indicia. Flow then proceeds to function block 4206, wherein the user sweeps the aim point of the reader along the code axis 4010 from the aiming indicia 4050 across the bar code 4000. Stated in more technical terms, the function block 4206 requires the user to direct the optical axis of the optical reader such that the target region of the reader sweeps along the longitudinal code axis 4010 from the aiming indicia 4050 through the bar code 4000. The process disclosed proves the user with a prominent visual clue which indicates where the scan movement should begin. Further, while the user must still maintain a reasonably constant speed while scanning across the encoded portions of the bar code, starting the scan movement at the aiming indicia will allow the optical reader to be fully accelerated by the time it reaches the encoded character string 4002. This will greatly improve the reliability of the scanning process.",
        "Although the preferred embodiment has been described in detail, it should be understood that various changes, substitutions and alterations can be made therein without departing from the spirit and scope of the invention as defined by the appended claims.",
        "TABLE 1\n\n\n\n\n\n\nCode Set\nCode Set\nCode Set\nBar/Space Pattern\n\n\nValue\nA\nB\nC\nB S B S B S\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n0\nSP\nSP\n00\n2 1 2 2 2 2\n\n\n1\n!\n!\n01\n2 2 2 1 2 2\n\n\n2\n“\n“\n02\n2 2 2 2 2 1\n\n\n3\n#\n#\n03\n1 2 1 2 2 3\n\n\n4\n$\n$\n04\n1 2 1 3 2 2\n\n\n5\n%\n%\n05\n1 3 1 2 2 2\n\n\n6\n&\n&\n06\n1 2 2 2 1 3\n\n\n7\n'\n'\n07\n1 2 2 3 1 2\n\n\n8\n(\n(\n08\n1 3 2 2 1 2\n\n\n9\n)\n)\n09\n2 2 1 2 1 3\n\n\n10\n*\n*\n10\n2 2 1 3 1 2\n\n\n11\n+\n+\n11\n2 3 1 2 1 2\n\n\n12\n,\n,\n12\n1 1 2 2 3 2\n\n\n13\n-\n-\n13\n1 2 2 1 3 2\n\n\n14\n.\n.\n14\n1 2 2 2 3 1\n\n\n15\n/\n/\n15\n1 1 3 2 2 2\n\n\n16\n0\n0\n16\n1 2 3 1 2 2\n\n\n17\n1\n1\n17\n1 2 3 2 2 1\n\n\n18\n2\n2\n18\n2 2 3 2 1 1\n\n\n19\n3\n3\n19\n2 2 1 1 3 2\n\n\n20\n4\n4\n20\n2 2 1 2 3 1\n\n\n21\n5\n5\n21\n2 1 3 2 1 2\n\n\n22\n6\n6\n22\n2 2 3 1 1 2\n\n\n23\n7\n7\n23\n3 1 2 1 3 1\n\n\n24\n8\n8\n24\n3 1 1 2 2 2\n\n\n25\n9\n9\n25\n3 2 1 1 2 2\n\n\n26\n:\n:\n26\n3 2 1 2 2 1\n\n\n27\n;\n;\n27\n3 1 2 2 1 2\n\n\n28\n<\n<\n28\n3 2 2 1 1 2\n\n\n29\n=\n=\n29\n3 2 2 2 1 1\n\n\n30\n>\n>\n30\n2 1 2 1 2 3\n\n\n31\n?\n?\n31\n2 1 2 3 2 1\n\n\n32\n@\n@\n32\n2 3 2 1 2 1\n\n\n33\nA\nA\n33\n1 1 1 3 2 3\n\n\n34\nB\nB\n34\n1 3 1 1 2 3\n\n\n35\nC\nC\n35\n1 3 1 3 2 1\n\n\n36\nD\nD\n36\n1 1 2 3 1 3\n\n\n37\nE\nE\n37\n1 3 2 1 1 3\n\n\n38\nF\nF\n38\n1 3 2 3 1 1\n\n\n39\nG\nG\n39\n2 1 1 3 1 3\n\n\n40\nH\nH\n40\n2 3 1 1 1 3\n\n\n41\nI\nI\n41\n2 3 1 3 1 1\n\n\n42\nJ\nJ\n42\n1 1 2 1 3 3\n\n\n43\nK\nK\n43\n1 1 2 3 3 1\n\n\n44\nL\nL\n44\n1 3 2 1 3 1\n\n\n45\nM\nM\n45\n1 1 3 1 2 3\n\n\n46\nN\nN\n46\n1 1 3 3 2 1\n\n\n47\nO\nO\n47\n1 3 3 1 2 1\n\n\n48\nP\nP\n48\n3 1 3 1 2 1\n\n\n49\nQ\nQ\n49\n2 1 1 3 3 1\n\n\n50\nR\nR\n50\n2 3 1 1 3 1\n\n\n51\nS\nS\n51\n2 1 3 1 1 3\n\n\n52\nT\nT\n52\n2 1 3 3 1 1\n\n\n53\nU\nU\n53\n2 1 3 1 3 1\n\n\n54\nV\nV\n54\n3 1 1 1 2 3\n\n\n55\nW\nw\n55\n3 1 1 3 2 1\n\n\n56\nX\nX\n56\n3 3 1 1 2 1\n\n\n57\nY\nY\n57\n3 1 2 1 1 3\n\n\n58\nZ\nZ\n58\n3 1 2 3 1 1\n\n\n59\n[\n[\n59\n3 3 2 1 1 1\n\n\n60\n\\\n\\\n60\n3 1 4 1 1 1\n\n\n61\n]\n]\n61\n2 2 1 4 1 1\n\n\n62\n{circumflex over ( )}\n{circumflex over ( )}\n62\n4 3 1 1 1 1\n\n\n63\n—\n—\n63\n1 1 1 2 2 4\n\n\n64\nNUL\n{grave over ( )}\n64\n1 1 1 4 2 2\n\n\n65\nSOH\na\n65\n1 2 1 1 2 4\n\n\n66\nSTX\nb\n66\n1 2 1 4 2 1\n\n\n67\nETX\nc\n67\n1 4 1 1 2 2\n\n\n68\nEOT\nd\n68\n1 4 1 2 2 1\n\n\n69\nENQ\ne\n69\n1 1 2 2 1 4\n\n\n70\nACK\nf\n70\n1 1 2 4 1 2\n\n\n71\nBEL\ng\n71\n1 2 2 1 1 4\n\n\n72\nBS\nh\n72\n1 2 2 4 1 1\n\n\n73\nHT\ni\n73\n1 4 2 1 1 2\n\n\n74\nLF\nj\n74\n1 4 2 2 1 1\n\n\n75\nVT\nk\n75\n2 4 1 2 1 1\n\n\n76\nFF\nl\n76\n2 2 1 1 1 4\n\n\n77\nCR\nm\n77\n4 1 3 1 1 1\n\n\n78\nSO\nn\n78\n2 4 1 1 1 2\n\n\n79\nSI\no\n79\n1 3 4 1 1 1\n\n\n80\nDLE\np\n80\n1 1 1 2 4 2\n\n\n81\nDC1\nq\n81\n1 2 1 1 4 2\n\n\n82\nDC2\nr\n82\n1 2 1 2 4 1\n\n\n83\nDC3\ns\n83\n1 1 4 2 1 2\n\n\n84\nDC4\nt\n84\n1 2 4 1 1 2\n\n\n85\nNAK\nu\n85\n1 2 4 2 1 1\n\n\n86\nSYN\nv\n86\n4 1 1 2 1 2\n\n\n87\nETB\nw\n87\n4 2 1 1 1 2\n\n\n88\nCAN\nx\n88\n4 2 1 2 1 1\n\n\n89\nEM\ny\n89\n2 1 2 1 4 1\n\n\n90\nSUB\nz\n90\n2 1 4 1 2 1\n\n\n91\nESC\n{\n91\n4 1 2 1 2 1\n\n\n92\nFS\n|\n92\n1 1 1 1 4 3\n\n\n93\nGS\n}\n93\n1 1 1 3 4 1\n\n\n94\nRS\n~\n94\n1 3 1 1 4 1\n\n\n95\nUS\nDEL\n95\n1 1 4 1 1 3\n\n\n96\nFNC 3\nFNC 3\n96\n1 1 4 3 1 1\n\n\n97\nFNC 2\nFNC 2\n97\n4 1 1 1 1 3\n\n\n98\nSHIFT\nSHIFT\n98\n4 1 1 3 1 1\n\n\n99\nCODE C\nCODE C\n99\n1 1 3 1 4 1\n\n\n100\nCODE B\nFNC 4\nCODE B\n1 1 4 1 3 1\n\n\n101\nFNC 4\nCODE A\nCODE A\n3 1 1 1 4 1\n\n\n102\nFNC 1\nFNC 1\nFNC 1\n4 1 1 1 3 1\n\n\n103\nStart A\nStart A\nStart A\n2 1 1 4 1 2\n\n\n104\nStart B\nStart B\nStart B\n2 1 1 2 1 4\n\n\n105\nStart C\nStart C\nStart C\n2 1 1 2 3 2\n\n\n106\nStop\nStop\nStop\n2 3 3 1 1 1 2"
    ],
    "citations": [
        "5943432",
        "6398106",
        "6415983",
        "6616056",
        "6688522",
        "6843417"
    ],
    "us_classification": "23546201",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "06",
            "subclass": "K",
            "main_group": "7",
            "subgroup": "10"
        }
    ]
}