{
    "title": "Non-aqueous electrolyte battery",
    "abstract": "A non-aqueous electrolyte battery of the present invention includes a non-aqueous electrolyte containing a lithium salt, a cyclic sultone derivative, and an acid anhydride, wherein the non-aqueous electrolyte contains the cyclic sultone derivative in an amount of 0.3 to 3% by mass and the non-aqueous electrolyte contains the acid anhydride in an amount of 0.3 to 3% by mass. Furthermore, the non-aqueous electrolyte battery includes at least one selected from a cyclic sultone derivative and an acid anhydride, and an electrolyte salt. The electrolyte salt contains lithium salt A and lithium salt B. The lithium salt A is at least one selected from LiBF",
    "inventors": [
        "Kawai",
        "Yamano",
        "Yabushita",
        "Sakata",
        "Nishihama"
    ],
    "document_number": "07297447",
    "publication_date": "20071120",
    "assignees": [
        "Hitachi Maxell, Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A non-aqueous electrolyte battery comprising a positive electrode, a negative electrode, a separator, and a non-aqueous electrolyte,",
            "components": [
                {
                    "component": "wherein the non-aqueous electrolyte contains at least one selected from the group consisting of a cyclic sultone derivative and an acid anhydride. and an electrolyte salt,",
                    "subcomponents": []
                },
                {
                    "component": "the electrolyte salt comprises lithium salt A and lithium salt B, the lithium salt A comprises at least one selected from the group consisting of LiBF",
                    "subcomponents": []
                },
                {
                    "component": "the lithium salt B comprises a lithium salt other than the lithium salt A, wherein the lithium salt B is at least one selected from the group consisting of LiClO",
                    "subcomponents": []
                },
                {
                    "component": "the electrolyte salt contains the lithium salt A in an amount of 2 to 20 mol % with respect to the electrolyte salt comprising lithium salt A and lithium salt B, wherein the non-aqueous electrolyte contains the cyclic sultone derivative in an amount of 0.5 to 3 wt %.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The non-aqueous electrolyte battery according to claim 1 , wherein the non-aqueous electrolyte contains the cyclic sultone derivative in an amount of 0.5 to 3 wt % and the acid anhydride in an amount of 0.5 to 3 wt %.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The non-aqueous electrolyte battery according to claim 2 , wherein the non-aqueous electrolyte contains the cyclic sultone derivative and the acid anhydride in an amount of 1.7 to 3.5 wt %.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The non-aqueous electrolyte battery according to claim 1 , wherein the cyclic sultone derivative comprises at least one selected from the group consisting of 1,3-propanesultone and 1,4-butanesultone.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The non-aqueous electrolyte battery according to claim 1 , wherein the positive electrode contains a a manganese-containing oxide as a positive active material.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The non-aqueous electrolyte battery according to claim 1 , wherein the negative electrode contains one selected from the group consisting of lithium and a lithium alloy as a negative active material.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The non-aqueous electrolyte battery according to claim 1 , wherein the non-aqueous electrolyte contains a solvent, and the solvent contains an ether having a boiling point of 120° C. or higher.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A non-aqueous electrolyte battery comprising a positive electrode, a negative electrode, a separator, and a non-aqueous electrolyte,",
            "components": [
                {
                    "component": "wherein the non-aqueous electrolyte contains at least one selected from the group consisting of a cyclic sultone derivative and an acid anhydride, and an electrolyte salt,",
                    "subcomponents": []
                },
                {
                    "component": "the electrolyte salt comprises lithium salt A and lithium salt B, the lithium salt A comprises at least one selected from the group consisting of LiBF",
                    "subcomponents": []
                },
                {
                    "component": "the lithium salt B comprises a lithium salt other than the lithium salt A, wherein the lithium salt B is at least one selected from the group consisting of LiClO",
                    "subcomponents": []
                },
                {
                    "component": "the electrolyte salt contains the lithium salt A in an amount of 2 to 20 mol % with respect to the electrolyte salt comprising lithium salt A and lithium salt B, wherein the non-aqueous electrolyte contains the acid anhydride in an amount of 0.5 to 3 wt %.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The non-aqueous electrolyte battery according to claim 8 , wherein the non-aqueous electrolyte contains the cyclic sultone derivative in an amount of 0.5 to 3 wt %.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The non-aqueous electrolyte battery according to claim 9 , wherein the non-aqueous electrolyte contains the cyclic sultone derivative and the acid anhydride of 1.7 to 3.5 wt %.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The non-aqueous electrolyte battery according to claim 9 , wherein the cyclic sultone derivative comprises at least one selected from the group consisting of 1,3-propanesultone and 1,4-butanesultone.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The non-aqueous electrolyte battery according to claim 8 , wherein the positive electrode contains a manganese-containing oxide as a positive active material.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The non-aqueous electrolyte battery according to claim 8 , wherein the negative electrode contains one selected from the group consisting of lithium and a lithium alloy as a negative active material.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The non-aqueous electrolyte battery according to claim 8 , wherein the non-aqueous electrolyte contains a solvent, and the solvent contains an ether having a boiling point of 120° C. or higher.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A non-aqueous electrolyte battery comprising a positive electrode, a negative electrode, a separator, and a non-aqueous electrolyte,",
            "components": [
                {
                    "component": "wherein the non-aqueous electrolyte contains at least one selected from the group consisting of a cyclic sultone derivative and an acid anhydride, and an electrolyte salt,",
                    "subcomponents": []
                },
                {
                    "component": "the electrolyte salt comprises lithium salt A and lithium salt B, the lithium salt A comprises at least one selected from the group consisting of LiBF",
                    "subcomponents": []
                },
                {
                    "component": "the lithium salt B comprises a lithium salt other than the lithium salt A, wherein the lithium salt B is at least one selected from the group consisting of LiClO",
                    "subcomponents": []
                },
                {
                    "component": "the electrolyte salt contains the lithium salt A in an amount of 2 to 20 mol % with respect to the electrolyte salt comprising lithium salt A and lithium salt B and",
                    "subcomponents": []
                },
                {
                    "component": "a sealing member, wherein the sealing member comprises a packing made of a heat-resistant resin or glass hermetic seal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The non-aqueous electrolyte battery according to claim 15 , wherein the packing comprises any one selected from the group consisting of a tetrafluoroethylene-perfluoroalkoxyethylene copolymer, polyphenylene sulfide, and polyether ether ketone.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The non-aqueous electrolyte battery according to claim 15 , wherein the non-aqueous electrolyte contains a solvent, and the solvent contains an ether having a boiling point of 120° C. or higher.",
            "components": []
        }
    ],
    "description": [
        "1. Field of the Invention",
        "The present invention relates to a non-aqueous electrolyte battery, and more specifically, to a non-aqueous electrolyte battery suitable for use in a high-temperature atmosphere.",
        "2. Description of the Related Art",
        "Recently, there is an increasing demand for a battery that can be used as a power source for equipment used in a high-temperature atmosphere (higher than 100° C.), such as a pressure sensor in a tire. A potential candidate for such a battery includes a non-aqueous electrolyte battery such as a lithium primary battery and a lithium ion secondary battery.",
        "As the non-aqueous electrolyte battery to be used for the above-mentioned purpose, a lithium primary battery using manganese dioxide or graphite fluoride as a positive active material and lithium or a lithium alloy as a negative electrode, and a lithium ion secondary battery using lithium cobaltate or lithium manganate as a positive active material and a carbon material as a negative electrode are considered to be suitable due to their excellent load characteristics and low-temperature characteristics. However, when these batteries are left or used at a high temperature, a carbonic ester (propylene carbonate, ethylene carbonate, methyl ethyl carbonate, etc.) that is a solvent of an electrolyte reacts with the positive active material to generate gas such as carbon dioxide, which causes the batteries to expand.",
        "In particular, when a manganese-containing oxide such as manganese dioxide is used as a positive active material, the above-mentioned generation of gas becomes conspicuous due to the catalyst function of the positive active material. In a temperature region higher than 100° C., such a problem becomes more serious. Furthermore, the following also is found: when a battery discharged by about 50% or more is used in a high-temperature atmosphere or left for a long period of time, gas is generated suddenly due to hydrogen and hydrocarbon such as methane, which causes the battery to expand. In this case, the generation of gas is presumed to be caused by the reaction between a solvent of an electrolyte and lithium at a negative electrode, as well as the reaction between the solvent of the electrolyte and the positive active material.",
        "On the other hand, in the case of an ordinary coin-type primary battery, in order to seal the battery, packing made of polypropylene (PP) (which often is referred to as a “gasket”) mainly is used. Polypropylene is a packing material with sufficient reliability for general use and is inexpensive. However, in a temperature region higher than 100° C. that is close to the melting point of polypropylene, polypropylene is softened to make it impossible to obtain sufficient strength. Therefore, polypropylene is not suitable as a packing material for a battery intended for a high temperature.",
        "As a packing material intended for a high temperature, as described in JP 8(1996)-153500 A, a heat-resistant resin having a melting point of 240° C. or higher (e.g., a tetrafluoroethylene-perfluoroalkoxyethylene copolymer (PFA), polyphenylene sulfide, and polyether ether ketone) was studied.",
        "An olefin-type packing material such as polypropylene, which has been used generally, allows gas generated in a battery to pass therethrough gradually to dissipate out of the battery, whereby an increase in pressure in the battery is alleviated. The packing composed of the above-mentioned heat-resistant resin has sufficient durability even at a high temperature; however, transmittance of gas is very small. Therefore, gas accumulates in the battery, and the battery expands due to an increase in pressure. Needless to say, in the case where glass hermetic seal having hermeticity higher than that of sealing with the heat-resistant packing, the expansion of the battery becomes further conspicuous.",
        "There are various reasons for avoiding expanding a battery. When a battery expands, equipment to be used is damaged, and the contact between electrodes and a current collector becomes insufficient, which decreases battery performance and impairs reliability of the battery.",
        "In order to solve the above-mentioned problem, JP 11(1999)-162511 A (EP 1030399), JP 2000-3724 A (U.S. Pat. No. 6,033,809), JP 2000-123868 A, JP 2000-323171 A, and the like disclose the addition of a cyclic sultone derivative such as 1,3-propanesultone to an electrolyte for the purpose of enhancing cycle characteristics of a non-aqueous electrolyte battery and suppressing the generation of gas. Furthermore, JP 4(1992)-355065 A (U.S. Pat. No. 5,296,319), JP 7(1995)-122297 A, and the like disclose that an acid anhydride is added to an electrolyte to reduce the amount of moisture in the electrolyte so as to enhance storage characteristics of a battery at a high temperature. These additives respectively are relatively effective for suppressing the generation of gas in a battery at a temperature of about 60° C. to 80° C. and enhancing storage characteristics.",
        "In atmospheres having temperatures of 100° C. or higher, these additives are not effective enough for the above purpose.",
        "Furthermore, it also is found that although the above-mentioned additives are sufficiently effective to a battery before discharging or with a small discharge depth, they do not exhibit effects as expected with respect to the battery that has been discharged to some degree.",
        "In one aspect, the present invention relates to a non-aqueous electrolyte battery including a positive electrode, a negative electrode, a separator, and a non-aqueous electrolyte, wherein the non-aqueous electrolyte contains a lithium salt, a cyclic sultone derivative, and an acid anhydride, the non-aqueous electrolyte contains the cyclic sultone derivative in an amount of 0.3 to 3% by mass, and the non-aqueous electrolyte contains the acid anhydride in an amount of 0.3 to 3% by mass.",
        "In one aspect, the present invention relates to a non-aqueous electrolyte battery including a positive electrode, a negative electrode, a separator, and a non-aqueous electrolyte, wherein the non-aqueous electrolyte contains at least one selected from the group consisting of a cyclic sultone derivative and an acid anhydride, and an electrolyte salt, the electrolyte salt contains lithium salt A and lithium salt B, the lithium salt A is at least one selected from the group consisting of LiBF4, LiPF6, LiAsF6, and LiSbF6, the lithium salt B is a lithium salt other than the lithium salt A, and the electrolyte salt contains the lithium salt A in an amount of 2 mol % or more.",
        "In one aspect, the present invention relates to a non-aqueous electrolyte battery including a positive electrode, a negative electrode, a separator, a non-aqueous electrolyte, and a sealing member, wherein the non-aqueous electrolyte contains a solvent and a cyclic sultone derivative, the solvent contains an ether having a boiling point of 120° C. or higher, the non-aqueous electrolyte contains the cyclic sultone derivative in an amount of 0.5 to 5% by mass, and the sealing member includes a packing made of a heat-resistant resin or glass hermetic seal.",
        "FIG. 1 shows a cross-sectional view schematically showing an example of a non-aqueous electrolyte battery of the present invention.",
        "The present invention provides a non-aqueous electrolyte battery suitable for use in a high-temperature atmosphere by decreasing the generation of gas in the battery to suppress the expansion of the battery while keeping excellent load characteristics and low-temperature characteristics peculiar to the non-aqueous electrolyte battery. Furthermore, in certain embodiments, the above-mentioned effects can be maintained irrespective of a discharge depth of the non-aqueous electrolyte battery.",
        "Other advantages of the present embodiment will become apparent to those skilled in the art upon reading and understanding the following detailed description with reference to the accompanying figures.",
        "In one embodiment, a non-aqueous electrolyte is obtained by dissolving an electrolyte salt in a solvent or a mixed solvent of at least two kinds selected from the group consisting of a cyclic carbonic ester such as propylene carbonate, ethylene carbonate, butylene carbonate, and vinylene carbonate; a chain carbonic ester such as dimethyl carbonate, diethyl carbonate, and methyl ethyl carbonate; and an ether such as 1,2-dimethoxyethane, diglyme (diethylene glycol dimethyl ether), triglyme (triethylene glycol dimethyl ether), tetraglyme (tetraethylene glycol dimethyl ether), methoxyethoxyethane, 1,2-diethoxyethane, and tetrahydrofuran. In particular, as carbonic ester, propylene carbonate, ethylene carbonate, butylene carbonate, and the like, having a boiling point of 120° C. or higher, are preferable. Furthermore, as ether, diethoxyethane, diglyme, and the like, having a boiling point of 120° C. or higher, are preferable.",
        "When the molecular weight of ether is increased, the freezing point and viscosity also are increased. Therefore, a solvent having a low viscosity and freezing point such as dimethoxyethane is preferable in terms of the low-temperature characteristics of a battery. However, due to a low boiling point, such a solvent increases the pressure in the battery at a temperature higher than 100° C. As a result, in the case of using a general-purpose olefin type packing, a solvent is more likely to dissipate through the packing. In the case of a packing using a heat-resistant resin, gas accumulates in a battery, and the battery is likely to expand due to an increase in pressure.",
        "In contrast, when a solvent having a high boiling point such as diethoxyethane and diglyme is used, an increase in internal pressure of a battery is suppressed, and the expansion of the battery is prevented when stored at a high temperature, whereby storage characteristics can be enhanced.",
        "In the case where the above-mentioned carbonic ester and ether are mixed, the mixing ratio thereof preferably is in a range of 30:70 to 70:30 (carbonic ester:ether) in a volume ratio. A cyclic carbonic ester and a chain carbonic ester also may be mixed.",
        "In the present embodiment, it is preferred to use at least one cyclic sultone derivative. In particular, as the cyclic sultone derivative to be contained in the electrolyte, 1,3-propanesultone or 1,4-butanesultone is preferred.",
        "It is desirable that the adding amount of the cyclic sultone derivative is set to be 0.5 to 5% by mass based on the total amount of an electrolyte including the derivative. Due to the addition of the cyclic sultone derivative, a coating capable of suppressing the reaction with the solvent of the electrolyte is formed on the surface of a positive electrode, and the generation of gas in the battery is decreased to suppress the expansion of the battery. If the amount of the cyclic sultone derivative is 0.5% by mass or more, this effect is exhibited sufficiently. Furthermore, when the amount of the cyclic sultone derivative is increased, although the effect of suppressing the expansion of a battery is enhanced, the resistance in the battery is increased, resulting in a decrease in closed-circuit voltage (CCV). Simultaneously with this, the volume also becomes likely to decrease. Therefore, it is desirable that the adding amount is set to be 5% by mass or lower based on the total amount of the electrolyte. In particular, when the adding amount of the cyclic sultone derivative is 3% by mass or less, discharge characteristics become satisfactory.",
        "Examples of the acid anhydride include mellitic anhydride, malonic anhydride, maleic anhydride, butyric anhydride, propionic anhydride, pulvic anhydride, phthalonic anhydride, phthalic anhydride, pyromellitic anhydride, lactic anhydride, naphthalic anhydride, toluic anhydride, thiobenzoic anhydride, diphenic anhydride, citraconic anhydride, diglycolamidic anhydride, acetic anhydride, succinic anhydride, cinnamic anhydride, glutaric anhydride, glutaconic anhydride, valeric anhydride, itaconic anhydride, isobutyric anhydride, isovaleric anhydride, and benzoic anhydride. These acid anhydrides may be used alone or in combination of at least two kinds.",
        "It is desirable that the adding amount of acid anhydride also is set to be 0.5 to 5% by mass based on the total amount of the electrolyte including the acid anhydride, in the same way as in the cyclic sultone derivative. Furthermore, in order to obtain satisfactory discharge characteristics, it is desirable that the adding amount of the acid anhydride is set to be 3% by mass or less.",
        "Herein, in the case of adding both the cyclic sultone derivative and the acid anhydride, even the addition of a small amount can suppress the generation of gas effectively. Therefore, in this case, the problem of a decrease in load characteristics caused by an additive can be reduced. Furthermore, due to the presence of both the additives, it is expected that the effects of them can be enhanced, and both the side effects can be suppressed. For example, in the case where the acid anhydride is present in an electrolyte, the acid anhydride reacts with water in the electrolyte to generate an acid. The acid further reacts with a negative electrode to form a coating on the surface of the negative electrode in the form of a lithium salt or the like, thereby allowing the load characteristics to be decreased easily. However, it is considered that such a reaction is inhibited due to the presence of the cyclic sultone derivative in the electrolyte.",
        "In the case of adding both the cyclic sultone derivative and the acid anhydride, preferably, each adding amount should be set to be 0.3 to 3% by mass. It is desirable that at least one adding amount is set to be 0.5% by mass or more, and it is more desirable that each adding amount is set to be 0.5% by mass. Furthermore, by setting the total adding amount to be 1.7 to 3.5% by mass, the above-mentioned cooperated effects can be enhanced further.",
        "Examples of an electrolyte salt to be dissolved in the above-mentioned electrolyte include at least one lithium salt (hereinafter, referred to as a “lithium salt A”) selected from LiBF4, LiPF6, LiAsF6, and LiSbF6, and at least one lithium salt (hereinafter, referred to as a “lithium salt B”), e.g., LiClO4, LiCnF2n+1SO3 such as LiCF3SO3 and LiC4F9SO3, LiN(CF3SO2)2, LiN(C2F5SO2)2, LiC(CF3SO3)3, LiCF3CO2, LiB10Cl10, lower fatty acid lithium, LiAlCl4, LiCl, LiBr, LiI, chloroboranelithium, lithium tetraphenylborate, and the like. In the case where manganese dioxide is used as a positive active material, due to the coexistence thereof, a lithium imide salt (e.g., LiClO4, LiCnF2n+1SO3 such as LiCF3SO3, and LiC4F9SO3, LiN(CF3SO2)2, LiN(C2F5SO2)2, and the like) preferably is used.",
        "The concentration of the electrolyte salt in the electrolyte is not particularly limited. However, the concentration is preferably 0.2 to 2 mol/dm3, more preferably 0.3 to 1.5 mol/dm3.",
        "Furthermore, by using the mixture of the above-mentioned lithium salt A and lithium salt B, the effects of the above-mentioned additives are likely to be exhibited even in a battery that has been discharged to some degree. Furthermore, the generation of gas can be suppressed sufficiently when such a battery is stored. In this case, the proportion of the lithium salt A should be set to be 2 mol % or more based on the total amount of the electrolyte salt. On the other hand, the lithium salt A is likely to be decomposed by a trace amount of water present in a battery. Therefore, the proportion of the lithium salt A desirably is set to be 20 mol % or less based on the total amount of the electrolyte salt.",
        "Considering the characteristics of a battery as a whole, LiBF4 or LiPF6 preferably is used as the lithium salt A, and at least one selected from LiClO4, LiCF3SO3, LiC4F9SO3, LiN(CF3SO2)2, and LiN(C2F5SO2)2 preferably is used.",
        "In the present embodiment, as the positive active material, those which are used generally as a positive active material of a lithium primary battery, a lithium ion secondary battery, or the like can be used. For example, in addition to LiCoO2, LiNiO2, and LiNixCo1−xO2, a manganese-containing oxide such as LiMnO2, LiMnO2, LiNixMn1−xO2, LiMn3O6 and manganese dioxide, and fluorocarbon can be used. In particular, when manganese dioxide which is highly reactive with the electrolyte, is used, the effects of the present embodiment are exhibited conspicuously. For producing a positive electrode, generally, a conductive assistant and a binder are used in addition to the positive active material. As the conductive assistant, carbon black, scalelike graphite, ketchen black, acetylene black, fibrous carbon, and the like are used. As the binder, for example, polytetrafluoroethylene, polyvinylidene fluoride, carboxymethyl cellulose, styrene-butadiene rubber, and the like are used.",
        "For producing a positive electrode, a positive electrode mixture prepared by mixing a positive active material, a conductive assistant, and a binder is subjected to pressure forming. Alternatively, the positive electrode mixture is dispersed in water or an organic solvent to prepare a paste containing the positive electrode mixture, and this paste is applied to a current collector made of a metal foil, expanded metal, a plain-woven mesh, or the like, followed by drying and pressure forming. The method for producing a positive electrode is not limited to the above-mentioned method. Other methods may be used.",
        "There is no particular limit to a negative active material. Those which are used as a negative active material of a lithium primary battery, a lithium ion secondary battery, or the like can be used. Preferable specific examples thereof include metal lithium, a lithium alloy such as lithium-aluminum, lithium-lead, lithium-bismuth, lithium-indium, lithium-gallium and lithium-indium-gallium, a carbon material, and a metal oxide such as lithium titanium oxide. These negative active materials can be used alone as a negative electrode. Alternatively, in the same way as in the positive electrode, a negative electrode mixture is prepared, and the mixture is applied to a current collector, followed by drying and pressure forming. In the case of using metal lithium, a lithium alloy, or the like, the resultant mixture may be crimped onto a current collector made of a metal foil, a metal net, or the like.",
        "As a separator, any of a microporous resin film and resin non-woven fabric can be used. Examples thereof include polyolefin such as polyethylene, polypropylene, and polymethylpentene. In addition, for the purpose of heat resistance, fluorine resin such as a tetrafluoroethylene-perfluoroalkoxyethylene copolymer, polyphenylene sulfide, polyether ether ketone, polybutylene terephthalate, and the like are used. Furthermore, by using a separator with a layered structure obtained by stacking a plurality of microporous films and non-woven fabrics made of the above materials, stacking a plurality of miroporous films, or stacking a plurality of non-woven fabrics, reliability in the case of use in a high-temperature atmosphere can be enhanced.",
        "The above-mentioned positive electrode, negative electrode, electrolyte, and separator are sealed in a battery case made of a metal can, a laminate film, or the like, whereby a non-aqueous electrolyte battery is assembled. In the case of sealing the battery case by using a packing as a sealing member, as the material for the packing, for example, polypropylene and nylon can be used. In addition, for the purpose of heat resistance, a heat-resistant resin having a melting point higher than 240° C. such as fluorine resin (e.g., a tetrafluoroethylene-perfluoroalkoxyethylene copolymer), polyphenylene ether, polysulfone, polyarylate, polyether sulfone, polyphenylene sulfide, polyether ether ketone, and the like can be used. Furthermore, as the sealing member, glass hermetic seal also can be used. The glass hermetic seal is a sealing member using soda-lime glass. The glass hermetic seal is applied, in a molten state, to a metal material so as to be bonded thereto, thereby sealing the metal material. The glass hermetic seal is excellent in hermeticity.",
        "Hereinafter, various embodiments will be described specifically by way of examples.",
        "In one embodiment, a non-aqueous electrolyte primary battery was produced as follows. First, manganese dioxide as a positive active material, carbon black as a conductive assistant, polytetrafluoroethylene as a binder were prepared, and they were mixed in a mass ratio of 90:5:5 to obtain a positive electrode mixture. Then, the positive electrode mixture was subjected to pressure forming to produce a positive electrode. As a negative electrode, a lithium foil was used. As a separator, a layered structure of a microporous polypropylene film and polypropylene non-woven fabric was used. As a sealing member, a packing made of polyphenylene sulfide was used. As a result, a coin-type non-aqueous electrolyte battery with a thickness of 5 mm and a diameter of 24 mm having a configuration shown in FIG. 1 was assembled.",
        "FIG. 1 shows an exemplary battery, in accordance with one aspect of the present invention. A positive electrode 1 is accommodated in a positive electrode can 4 made of stainless steel, and a negative electrode 2 is placed on the positive electrode 1 via a separator 3. The negative electrode 2 is made of a lithium foil, and is crimped onto the inner surface of a negative electrode can 5 made of stainless steel. A non-aqueous electrolyte is injected into the battery in an amount of 0.5 cm3, and an opening end of the positive electrode can 4 is compressed inward, whereby an annular packing 6 made of polyphenylene sulfide provided on the periphery of the negative electrode can 5 is pressed. As a result, the periphery of the negative electrode can 5 is in contact with the inner peripheral surface of the opening end of the positive electrode can 4 under pressure, whereby the opening of the positive electrode can 4 is sealed.",
        "First, propylene carbonate and 1,2-dimethoxyethane were mixed in a volume ratio of 1:1 to obtain a mixed solvent. LiClO4 was dissolved in the mixed solvent in an amount of 0.5 mol/dm3. Then, 1,3-propanesultone and phthalic anhydride were added to the resultant mixed solvent so that the contents thereof respectively became 0.5% by mass to obtain an electrolyte. The electrolyte thus obtained was used for a battery with the above-mentioned configuration, whereby a non-aqueous electrolyte battery of Example 1 was produced.",
        "Non-aqueous electrolyte batteries as shown in Table 1 were produced in the same way as in Example 1, except that one or both contents of 1,3-propanesultone and phthalic anhydride were varied in a range of 0.5 to 4% by mass.",
        "A non-aqueous electrolyte battery was produced in the same way as in Example 1, except that 1,3-propanesultone and phthalic anhydride were not added to the electrolyte.",
        "Non-aqueous electrolyte batteries shown in Table 1 were produced in the same way as in Example 1, except that the adding amount of 1,3-propanesultone or phthalic anhydride was set to be a value outside of the range of the present invention.",
        "TABLE 1\n\n\n\n\n\n\n\n\n\nAdditive (% by mass)\nConcentration of electrolyte salt\nProportion\n\n\n\n\n\n\n\n\n\n\n\n\n\nCyclic\n\n\n(mol/dm3)\nof lithium\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nsultone\nAcid\n\nLithium salt A\nLithium salt B\nsalt A\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nderivative\nanhydride\nTotal\nLiPF6\nLiBF4\nLiClO4\n(mol %)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 1\n0.5\n0.5\n1\n0\n0\n0.5\n0\n\n\nExample 2\n0.5\n1\n1.5\n0\n0\n0.5\n0\n\n\nExample 3\n1\n0.5\n1.5\n0\n0\n0.5\n0\n\n\nExample 4\n1\n1\n2\n0\n0\n0.5\n0\n\n\nExample 5\n0.5\n2\n2.5\n0\n0\n0.5\n0\n\n\nExample 6\n0.5\n2.5\n3\n0\n0\n0.5\n0\n\n\nExample 7\n1\n2\n3\n0\n0\n0.5\n0\n\n\nExample 8\n2\n1\n3\n0\n0\n0.5\n0\n\n\nExample 9\n0.5\n3\n3.5\n0\n0\n0.5\n0\n\n\nExample 10\n1.5\n2\n3.5\n0\n0\n0.5\n0\n\n\nExample 11\n2\n1.5\n3.5\n0\n0\n0.5\n0\n\n\nExample 12\n1\n3\n4\n0\n0\n0.5\n0\n\n\nExample 13\n3\n1\n4\n0\n0\n0.5\n0\n\n\nComparative\n0\n0\n0\n0\n0\n0.5\n0\n\n\nExample 1\n\n\nComparative\n1\n0\n1\n0\n0\n0.5\n0\n\n\nExample 2\n\n\nComparative\n0\n1\n1\n0\n0\n0.5\n0\n\n\nExample 3\n\n\nComparative\n0\n4\n4\n0\n0\n0.5\n0\n\n\nExample 4\n\n\nComparative\n4\n0\n4\n0\n0\n0.5\n0\n\n\nExample 5\n\n\nComparative\n1\n0.2\n1.2\n0\n0\n0.5\n0\n\n\nExample 6\n\n\nComparative\n0.2\n1\n1.2\n0\n0\n0.5\n0\n\n\nExample 7\n\n\nComparative\n1\n4\n5\n0\n0\n0.5\n0\n\n\nExample 8\n\n\nComparative\n4\n1\n5\n0\n0\n0.5\n0\n\n\nExample 9",
        "The batteries of Examples 1-13 and Comparative Examples 1-9 after stored at 120° C. for 350 hours were examined for load characteristics at a low temperature, expansion of a battery, and a capacity retention ratio. Table 2 shows the results. Methods for measuring the load characteristics at a low temperature, the expansion of a battery, and the capacity retention ratio are as follows.",
        "Load Characteristics at a Low Temperature:",
        "After stored at 120° C. for 350 hours, a battery was discharged at −40° C. and a current value of 2 mA, and a CCV after 5 seconds from the commencement of the discharge was measured.",
        "Expansion of a Battery:",
        "A battery was stored at 120° C. for 350 hours and allowed to cool to 20° C., and then, the thickness of the battery was measured. A value obtained by subtracting the thickness of the battery previously measured before storage from the thickness measured after cooling was determined as the expansion of the battery.",
        "Capacity Retention Ratio:",
        "First, a battery before stored at a high temperature was connected to a discharge resistor of 1 kΩ, and discharged at 20° C. to a termination voltage of 2.0 V. A discharge capacity at this time was measured. Another battery was stored at 120° C. for 350 hours and allowed to cool to 20° C. The battery was discharged under the same condition as that before storage, and a discharge capacity at this time was measured. The ratio of the discharge capacity thus obtained to that before storage was determined as a capacity retention ratio.",
        "TABLE 2\n\n\n\n\n\n\n\nCCV at −40° C.\n\n\n\n\n\n(V)\n\nCapacity\n\n\n\nAfter 5 seconds\nExpansion of\nretention\n\n\n\nfrom the discharge\nbattery\nratio\n\n\n\nat 2 mA\n(mm)\n(%)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 1\n2.92\n0.30\n90\n\n\nExample 2\n2.95\n0.25\n92\n\n\nExample 3\n2.94\n0.24\n92\n\n\nExample 4\n2.92\n0.15\n94\n\n\nExample 5\n2.90\n0.09\n93\n\n\nExample 6\n2.88\n0.06\n92\n\n\nExample 7\n2.95\n0.10\n95\n\n\nExample 8\n2.89\n0.12\n94\n\n\nExample 9\n2.85\n0.06\n91\n\n\nExample 10\n2.85\n0.10\n93\n\n\nExample 11\n2.80\n0.08\n94\n\n\nExample 12\n2.65\n0.05\n87\n\n\nExample 13\n2.60\n0.05\n89\n\n\nComparative\n1.90\n0.80\n67\n\n\nExample 1\n\n\nComparative\n2.77\n0.45\n77\n\n\nExample 2\n\n\nComparative\n2.80\n0.40\n79\n\n\nExample 3\n\n\nComparative\n2.52\n0.09\n80\n\n\nExample 4\n\n\nComparative\n2.49\n0.10\n77\n\n\nExample 5\n\n\nComparative\n2.81\n0.41\n82\n\n\nExample 6\n\n\nComparative\n2.81\n0.42\n83\n\n\nExample 7\n\n\nComparative\n2.33\n0.04\n84\n\n\nExample 8\n\n\nComparative\n2.24\n0.03\n85\n\n\nExample 9",
        "As is apparent from Table 2, the batteries of Examples 1-13, with the cyclic sultone derivative and the acid anhydride added to an electrolyte in an amount of 0.5 to 3% by mass, had a high discharge voltage, less expanded when stored at a high temperature, and had a high capacity retention ratio. Thus, these batteries were suitable for use in a high-temperature atmosphere. Particularly, in the batteries of Examples 4-11 in which the total adding amount of the cyclic sultone derivative and the acid anhydride was 2 to 3.5% by mass, the generation of gas in a battery was reduced to suppress the expansion of the battery effectively while minimizing a decrease in discharge voltage, i.e., a decrease in load characteristics.",
        "In contrast, the battery of Comparative Example 1, with no cyclic sultone derivative and acid anhydride added to an electrolyte, expanded largely when stored at a high temperature, and a discharge voltage was decreased remarkably and a capacity retention ratio was low. Furthermore, in the batteries of Comparative Examples 2-5 with either one of the cyclic sultone derivative and the acid anhydride added to an electrolyte, the effect of suppressing the expansion of a battery was not sufficient, or a decrease in discharge voltage was large. Thus, satisfactory storage characteristics were not obtained.",
        "Furthermore, in the batteries of Comparative Examples 6-9 in which the cyclic sultone derivative and the acid anhydride were added to an electrolyte in an amount outside the range of the present invention, the effect of the coexistence of the additives was not sufficient, or a decrease in discharge voltage due to the addition of the additives exceeding a required amount was conspicuous. Thus, satisfactory storage characteristics were not obtained.",
        "A non-aqueous electrolyte battery was produced in the same way as in Example 1, except that 0.5 mol/dm3 of LiClO4 and 0.05 mol/dm3 of LiPF6 were dissolved in a mixed solvent of propylene carbonate and 1,2-dimethoxyethane (1:1 in a volume ratio), and 1,3-propanesultone and phthalic anhydride were added in an amount of 0.5% by mass, respectively, to the mixture, thereby obtaining an electrolyte.",
        "A non-aqueous electrolyte battery shown in Table 3 was produced in the same way as in Example 14, except that the adding amount of an additive and the kind and concentration of an electrolyte salt were varied.",
        "A non-aqueous electrolyte battery shown in Table 3 was produced in the same way as in Example 17, except that LiClO4 was used alone as an electrolyte salt, and lithium salt A was not contained.",
        "A non-aqueous electrolyte battery was produced in the same way as in Example 16, except that the cyclic sultone derivative and the acid anhydride were not added to the electrolyte.",
        "TABLE 3\n\n\n\n\n\n\n\n\n\nConcentration of\n\n\n\n\nelectrolyte salt\n\n\n\n\n\n\n\n\n\n\n\n\nAdditive (% by mass)\n(mol/dm3)\nProportion\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCyclic\n\n\n\nLithium\nof lithium\n\n\n\nsultone\nAcid\n\nLithium salt A\nsalt B\nsalt A\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nderivative\nanhydride\nTotal\nLiPF6\nLiBF4\nLiClO4\n(mol %)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 14\n0.5\n0.5\n1\n0.05\n0\n0.5\n9.1\n\n\nExample 15\n2\n1\n3\n0\n0.05\n0.5\n9.1\n\n\nExample 16\n2\n1\n3\n0.1\n0\n0.5\n16.7\n\n\nExample 17\n1.5\n1.5\n3\n0.03\n0\n0.4\n7.0\n\n\nExample 18\n1.5\n1.5\n3\n0\n0\n0.5\n0\n\n\nComparative\n0\n0\n0\n0.1\n0\n0.5\n16.7\n\n\nExample 10",
        "The batteries of Examples 14-18 and Comparative Example 10 were examined for the expansion of a battery after stored at a high temperature when a discharge depth was 50% and 80%. Table 4 shows the results. A method for measuring the expansion of a battery is as follows.",
        "Expansion of Batteries:",
        "A battery was discharged until a discharge depth became 50%, and another battery was discharged until a discharge depth became 80%. Thereafter, these batteries were stored at 120° C. for 350 hours and allowed to cool to 20° C. The thickness of each battery at this time was measured. A value obtained by subtracting the thickness of each battery previously measured before storage from the thickness measured after cooling was determined as the expansion of each battery.",
        "TABLE 4\n\n\n\n\n\n\n\n\n\nExpansion of battery (mm)\n\n\n\n\n\n\n\n\n\n\n\nDischarge by 50%\nDischarge by 80%\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 14\n0.20\n0.15\n\n\n\nExample 15\n0.20\n0.08\n\n\n\nExample 16\n0.15\n0.05\n\n\n\nExample 17\n0.20\n0.10\n\n\n\nExample 18\n0.20\n0.70\n\n\n\nComparative\n0.55\n0.10\n\n\n\nExample 10",
        "As shown in Table 4, the batteries of Examples 14-17 less expanded even when stored after the discharge has proceeded, and the generation of gas was suppressed sufficiently. More specifically, in the batteries of Examples 14-17, a mixture of lithium salt A such as LiPF6 and LiBF4 and at least one lithium salt B other than the lithium salt A was used as an electrolyte salt for a non-aqueous electrolyte. The lithium salt A was contained in an amount of 2 mol % or more based on the total amount of the electrolyte salt, and at least one of the cyclic sultone derivative and the acid anhydride was added to the electrolyte, whereby the effect of the additive was maintained irrespective of a discharge depth.",
        "In contrast, the battery of Comparative Example 10 expanded largely when stored at a relatively small discharge depth. Furthermore, the battery of Example 18 has substantially the same electrolyte composition as that of Example 10 or 11; however, the additive exhibited its effect effectively at a relatively small discharge depth, while the effect of the additive was eliminated when discharge has proceeded, allowing the battery to expand largely.",
        "As described in Examples 14-17, when LiPF6, LiBF4, and the like are contained, the generation of gas can be suppressed when a battery is stored at a high temperature after discharge has proceeded. The reason for this is not made clear. However, it is presumed that PF5 and BF3 derived from an electrolyte salt react with a new phase of a negative active material formed due to discharge, and a coating of a fluoride is formed on the surface of the active material, whereby decomposition of an ester and ether of the electrolyte solvent is suppressed.",
        "A non-aqueous electrolyte battery shown in Table 5 was produced in the same way as in Example 1, except that 0.5 mol/dm3 of LiClO4 was dissolved in a mixed solvent of propylene carbonate and diethoxyethane (1:1 in a volume ratio), and 1,3-propanesultone was added to the resultant mixture in an amount of 2% by mass to obtain an electrolyte, and a packing made of a tetrafluoroethylene-perfluoroalkoxyethylene copolymer was used.",
        "A non-aqueous electrolyte battery was produced in the same way as in Example 19, except that diglyme was used in place of diethoxyethane.",
        "A non-aqueous electrolyte battery was produced in the same way as in Example 19, except that 1,3-propanesultone was added to the electrolyte in an amount of 0.5% by mass.",
        "A non-aqueous electrolyte battery was produced in the same way as in Example 19, except that 1,3-propanesultone was added to the electrolyte in an amount of 5% by mass.",
        "A non-aqueous electrolyte battery was produced in the same way as in Example 19, except that dimethoxyethane was used in place of diethoxyethane.",
        "A non-aqueous electrolyte battery was produced in the same way as in Comparative Example 11, except that a packing made of polypropylene was used.",
        "A non-aqueous electrolyte battery was produced in the same way as in Comparative Example 11, except that 1,3-propanesultone was not added to the electrolyte.",
        "A non-aqueous electrolyte battery was produced in the same way as in Comparative Example 11, except that 1,3-propanesultone was added to the electrolyte in an amount of 10% by mass.",
        "TABLE 5\n\n\n\n\n\n\n\n\n\nAdding amount of cyclic\n\n\n\nMaterial\n\nsultone derivative\n\n\n\nfor packing\nElectrolyte solvent\n(% by mass)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 19\nPFA\nPropylene carbonate +\n2\n\n\n\n\ndiethoxyethane\n\n\nExample 20\nPFA\nPropylene carbonate + diglyme\n2\n\n\nExample 21\nPFA\nPropylene carbonate +\n0.5\n\n\n\n\ndiethoxyethane\n\n\nExample 22\nPFA\nPropylene carbonate +\n5\n\n\n\n\ndiethoxyethane\n\n\nComparative\nPFA\nPropylene carbonate +\n2\n\n\nExample 11\n\ndimethoxyethane\n\n\nComparative\nPP\nPropylene carbonate +\n2\n\n\nExample 12\n\ndimethoxyethane\n\n\nComparative\nPFA\nPropylene carbonate +\n0\n\n\nExample 13\n\ndimethoxyethane\n\n\nComparative\nPFA\nPropylene carbonate +\n10\n\n\nExample 14\n\ndimethoxyethane",
        "The batteries of Examples 19-22 and Comparative Examples 11-14 were examined for load characteristics at a room temperature, expansion of a battery, and a capacity retention ratio after stored at 120° C. for 200 hours. Table 6 shows the results. Methods for measuring the load characteristics at a room temperature, the expansion of a battery, and the capacity retention ratio are as follows.",
        "Load Characteristics at a Room Temperature:",
        "After stored at 120° C. for 200 hours, a battery was connected to a discharge resistor of 200Ω and discharged at 20° C. and a CCV after 5 seconds from the commencement of the discharge was measured.",
        "Expansion of a Battery:",
        "A battery was stored at 120° C. for 200 hours and allowed to cool to 20° C., and then, the thickness of the battery was measured. A value obtained by subtracting the thickness of the battery previously measured before storage from the thickness measured after cooling was determined as the expansion of the battery.",
        "Capacity Retention Ratio:",
        "First, a battery before stored at a high temperature was connected to a discharge resistor of 3.9Ω, and discharged at 20° C. to a termination voltage of 2.0 V. A discharge capacity at this time was measured. Another battery was stored at 120° C. for 200 hours and allowed to cool to 20° C. The battery was discharged under the same condition as that before storage, and a discharge capacity at this time was measured. The ratio of the discharge capacity thus obtained to that before storage was determined as a capacity retention ratio.",
        "TABLE 6\n\n\n\n\n\n\n\nCCV at 20° C.\n\nCapacity\n\n\n\n(V)\n\nretention\n\n\n\nAfter 5 seconds from\nExpansion of battery\nratio\n\n\n\ndischarge at 200 Ω\n(mm)\n(%)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 19\n2.93\n0.11\n97\n\n\nExample 20\n2.90\n0.08\n96\n\n\nExample 21\n2.95\n0.13\n95\n\n\nExample 22\n2.89\n0.06\n96\n\n\nComparative\n2.95\n0.15\n97\n\n\nExample 11\n\n\nComparative\n2.23\n0.20\n72\n\n\nExample 12\n\n\nComparative\n1.90\n0.80\n70\n\n\nExample 13\n\n\nComparative\n2.05\n0.03\n78\n\n\nExample 14",
        "As is apparent from Table 6, the batteries of Examples 19-22, in which an ether having a boiling point of 120° C. or higher was contained as an electrolyte solvent, a cyclic sultone derivative was added to the electrolyte in an amount of 0.5 to 5% by mass, and sealing was conducted with a packing made of a heat-resistant resin, had a high discharge voltage, less expanded when stored at a high temperature, and had a high capacity retention ratio. Thus, these batteries were suitable for use in a high-temperature atmosphere.",
        "In contrast, the battery of Comparative Example 11, in which dimethoxyethane having a boiling point of 84° C. was contained in place of an ether having a boiling point of 120° C. or higher, exhibited load characteristics enhanced to some degree; however, it expanded largely to increase the inner pressure therein.",
        "Furthermore, the battery of Comparative Example 12, in which a packing made of polypropylene was used in place of the packing in Comparative Example 11, expanded largely when stored at a high temperature compared with Comparative Example 11 and had a substantially low discharge voltage and capacity retention ratio. The reason for this is considered as follows: the sealing performance of the battery was decreased, causing the electrolyte solvent to dissipate out of the battery and water to enter the battery.",
        "Furthermore, in the battery of Comparative Example 13 with no cyclic sultone derivative added thereto or the battery of Comparative Example 14 with an excess amount of cyclic sultone derivative added thereto, a decrease in discharge voltage was conspicuous. Thus, satisfactory storage characteristics were not obtained.",
        "The invention may be embodied in other forms without departing from the spirit or essential characteristics thereof. The embodiments disclosed in this application are to be considered in all respects as illustrative and not limiting. The scope of the invention is indicated by the appended claims rather than by the foregoing description, and all changes which come within the meaning and range of equivalency of the claims are intended to be embraced therein."
    ],
    "citations": [
        "5079109",
        "5296319",
        "6033809",
        "6268080",
        "6451478",
        "6815119",
        "6866966",
        "6927001",
        "2003/0031923",
        "2004/0096736",
        "2004/0146786",
        "1 030 399",
        "1146586",
        "1 317 013",
        "63-102173",
        "4-355065",
        "5-13059",
        "7-122297",
        "8-153500",
        "2597091",
        "9-219217",
        "9-306445",
        "11-162511",
        "2000-3724",
        "2000-77098",
        "2000-123868",
        "2000268857",
        "2000-323171",
        "2001-52757",
        "2001-57235",
        "2001-143747",
        "P2001-126764",
        "P2001-307770",
        "2002-170576",
        "2002-308884",
        "2003-17119",
        "2004-87168",
        "WO-00/36683",
        "WO 0137364"
    ],
    "us_classification": "429329",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "M",
            "main_group": "6",
            "subgroup": "16"
        }
    ]
}