{
    "title": "Hand-held dispenser",
    "abstract": "A hand-held dispenser for precisely controlling the flow rate of water therethrough and for precisely controlling the metering of a liquid chemical into the water passing through the apparatus.",
    "inventors": [
        "Laible"
    ],
    "document_number": "07296761",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A hand-held dispenser apparatus for controlling the flow rate of water therethrough and for controlling the metering of a liquid chemical into the water passing through the apparatus, comprising:",
            "components": [
                {
                    "component": "a body member;",
                    "subcomponents": []
                },
                {
                    "component": "said body member including a generally horizontally disposed first body portion having first and second sides, an inlet end, a discharge end, and a first fluid passageway, having inlet and discharge ends, extending between said inlet and discharge ends of said first body portion;",
                    "subcomponents": []
                },
                {
                    "component": "said inlet end of said first fluid passageway adapted to be secured to a source of water under pressure;",
                    "subcomponents": []
                },
                {
                    "component": "said first body portion having a transversely extending spool opening formed therein which extends between said first and second sides thereof and which communicates with said first fluid passageway;",
                    "subcomponents": []
                },
                {
                    "component": "a spool member mounted in said spool opening and having an inlet end, an outlet end, an upper end, a lower end, and first and second sides;",
                    "subcomponents": []
                },
                {
                    "component": "said spool member having a second fluid passageway extending between its said inlet and outlet ends which communicates with said first fluid passageway;",
                    "subcomponents": []
                },
                {
                    "component": "said spool member having a third fluid passageway formed therein which extends from said second fluid passageway to said lower end of said spool member;",
                    "subcomponents": []
                },
                {
                    "component": "said body member also including a vertically extending second body portion, having upper and lower ends and first and second sides;",
                    "subcomponents": []
                },
                {
                    "component": "said second body portion having a transversely extending, horizontally disposed cylindrical bore, having first and second ends, formed therein below said spool opening which extends between said first and second sides thereof;",
                    "subcomponents": []
                },
                {
                    "component": "said body member having a fourth fluid passageway formed therein which extends downwardly from said spool opening to said cylindrical bore;",
                    "subcomponents": []
                },
                {
                    "component": "said second body portion having a fifth fluid passageway formed therein which extends from said cylindrical bore to said lower end thereof;",
                    "subcomponents": []
                },
                {
                    "component": "said fifth fluid passageway being in communication with a source of liquid chemical;",
                    "subcomponents": []
                },
                {
                    "component": "a cylindrical chemical metering valve, having first and second ends, selectively rotatably mounted in said cylindrical bore and being rotatable between first and second positions;",
                    "subcomponents": []
                },
                {
                    "component": "said metering valve having radially spaced-apart first and second transversely extending metering passageways formed therein, each of which has an inlet end and a discharge end;",
                    "subcomponents": []
                },
                {
                    "component": "said first and second metering passageways permitting different chemical flow rates therethrough;",
                    "subcomponents": []
                },
                {
                    "component": "when said metering valve is in its said first position, said inlet end of said first metering passageway is in fluid communication with said fifth fluid passageway and said discharge end of said first metering passageway is in fluid communication with said fourth fluid passageway;",
                    "subcomponents": []
                },
                {
                    "component": "when said metering valve is in its second position, said inlet end of said second metering passageway is in fluid communication with said fifth fluid passageway and said discharge end of said second metering passageway is in fluid communication with said fourth fluid passageway;",
                    "subcomponents": []
                },
                {
                    "component": "wherein an elongated first valve handle is secured to said first end of said metering valve and wherein an elongated second valve handle is secured to said second end of said metering valve;",
                    "subcomponents": []
                },
                {
                    "component": "said first and second valve handles are radially offset with respect to one another;",
                    "subcomponents": []
                },
                {
                    "component": "wherein a first stop is provided at said first end of said spool member which is in rotational path of said first valve handle and wherein a second stop is provided at said second end of said spool member which is in the rotational path of said of said second valve handle.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The dispenser apparatus of claim 1 wherein a metering tip is mounted in the discharge end of each of said first and second metering passageways.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The dispenser apparatus of claim 2 wherein each of said metering tips has a metering orifice provided therein.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The dispenser apparatus of claim 3 wherein said metering tips orifices have different diameters.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The dispenser of claim 1 wherein said metering valve is in its said first position when said first valve handle is in engagement with said first stop and wherein said metering valve is in its said second position when said second valve handle is in engagement with said second stop.",
            "components": []
        }
    ],
    "description": [
        "This is a continuation-in-part application of Petitioner's earlier application Ser. No. 11/132,553 filed May 19, 2005 now U.S. Pat. No. 7,237,728, entitled “HAND-HELD DISPENSER”.",
        "1. Field of the Invention",
        "This invention relates to a hand-held dispenser and more particularly to a hand-held dispenser which is capable of controlling the flow rate of water therethrough and for controlling the metering of a liquid chemical into the water passing through the dispenser.",
        "2. Description of the Related Art",
        "Many types of dispensers have been previously provided which may be connected to the end of a water hose or the like wherein the device introduces chemicals into the water flow so that a lawn or the like may be sprayed. The devices of the prior art are also able to inject liquid chemicals into a water stream so that a mop bucket, etc., may be filled with water, detergent or other chemicals.",
        "To applicant's knowledge, none of the prior art devices are able to conveniently and economically precisely control the rate of water flow through the device but to also precisely control the metering of liquid chemicals into the precisely controlled flow of water.",
        "In applicant's co-pending application, a solution to the problems of the prior art is disclosed. The instant invention is believed to be an improvement in the invention of the co-pending application. Although the invention of applicant's co-pending application has been well-accepted, it has been found that certain customers have a preference for a single flow rate of water through the spool member such as two gallons per minute but some of those same customers desire to have at least two chemical injection rates for dispensing into the water available to them.",
        "A hand-held dispenser is described for precisely controlling the flow rate of water therethrough and for precisely controlling the metering of a liquid chemical into the water passing through the apparatus. The apparatus of this invention comprises a body member which includes a generally horizontally disposed first body portion having opposite sides, an inlet end, a discharge end, and a first fluid passageway extending between the inlet and discharge ends. The first body portion has a transversely extending spool opening formed thereon which extends between the opposite sides thereof and which communicates with the first fluid passageway. The inlet end of the first body portion is adapted to be secured to a source of water under pressure.",
        "A spool member is mounted in the spool opening and has an inlet end, an outlet end, an upper end, a lower end, and first and second sides. The spool member has a second fluid passageway extending between its inlet end and its outlet end which communicates with the first fluid passageway. The spool member has a third fluid passageway formed therein which extends from the second fluid passageway to the lower end of the spool member.",
        "The body member also includes a generally vertically extending second body portion, having upper and lower ends, and first and second sides. The second body portion has a transversely extending, horizontally disposed cylindrical bore, having first and second ends, formed therein below the spool opening which extends between the first and second sides of the second body portion. The body member also has a fourth fluid passageway formed therein which extends downwardly from the spool opening to the cylindrical bore. The second body portion also has a fifth fluid passageway formed therein which extends from the cylindrical bore to the lower end of the second body portion. The fifth fluid passageway is in communication with a source of liquid chemical.",
        "A cylindrical chemical metering valve, having first and second ends, is selectively rotatably mounted in the cylindrical bore and is rotatable between first and second positions. The metering valve has radially spaced-apart first and second transversely extending metering passageways formed therein, each of which has an inlet end a discharge end. The first and second metering passageways permit different chemical flow rates therethrough due to the different sized metering tips associated therewith.",
        "When the metering valve is in its first position, the inlet end of the first metering passageway is in fluid communication with the fifth fluid passageway and the discharge end of the first metering passageway is in fluid communication with the fourth fluid passageway. When the metering valve is in its second position, the inlet end of the second metering passageway is in fluid communication with the fifth fluid passageway and the discharge end of the second metering passageway is in fluid communication with the fourth fluid passageway.",
        "Thus, the liquid chemical may be injected into the flow of water passing through the first body portion at two different rates depending upon whether the metering valve is in its first position or in its second position.",
        "It is therefore a principal object of the invention to provide an improved chemical dispenser.",
        "Still another object of the invention is to provide an improved hand-held dispenser which dispenses chemicals mixed with water.",
        "Yet another object of the invention is to provide a dispenser of the type described which enables the precise controlling of the flow rate of water therethrough and the precise metering of a liquid chemical into the water passing through the dispenser.",
        "Still another object of the invention is to provide a hand-held dispenser which is either disposable or reusable.",
        "Still another object of the invention is to a dispenser which permits chemicals to be injected into a flow of water passing therethrough in two different rates.",
        "Still another object of the invention is to provide a dispenser which is economical of manufacture, durable in use and refined in appearance.",
        "These and other objects will be obvious to those skilled in the art.",
        "FIG. 1 is perspective view of the dispenser of the co-pending application;",
        "FIG. 2 is an exploded perspective view of the dispenser of the co-pending application;",
        "FIG. 3 is a vertical sectional view of the dispenser of the co-pending application;",
        "FIG. 4 is a partial sectional view of the dispenser of the co-pending application;",
        "FIG. 5 is a top view of the dispenser of the co-pending application;",
        "FIG. 6 is a side view of the dispenser of the co-pending application;",
        "FIG. 7 is an end view of the dispenser of the co-pending application as seen from the right of FIG. 6;",
        "FIG. 8 is a bottom view of the dispenser of the co-pending application;",
        "FIG. 9 is a perspective view of the dispenser of this invention;",
        "FIG. 10 is a side view of the dispenser of this invention;",
        "FIG. 11 is an exploded perspective view of the dispenser of this invention;",
        "FIG. 12 is a side view of the dispenser of this invention with portions thereof cut away to more fully illustrate the invention; and",
        "FIG. 13 is an end view of the dispenser of this invention with portions thereof cut away to more fully illustrate the invention.",
        "The dispenser of the co-pending application is illustrated in FIGS. 1-8 while the dispenser of the instant application is illustrated in FIGS. 9-13. In FIGS. 1-8, the dispenser of the co-pending application is referred to generally by the reference numeral 10 and is preferably of the hand-held type. Dispenser 10 includes a dispenser body 12 which is generally T-shaped in configuration and which includes a generally horizontally disposed body portion 14 and a generally vertically disposed body portion 16. Obviously, body portion 14 will not always be horizontally disposed when being used nor will body portion 16 always be substantially vertically disposed when in use.",
        "Body portion 14 includes an inlet end 18 which preferably has a rotatable dispenser nut or connector 20 mounted thereon so that a water hose or the like may be secured thereto with the water hose being in communication with a source of water under pressure. It is preferred that a backflow preventer 21 of conventional design be imposed between the water hose and the inlet end 18. The outlet or discharge end 22 of the body portion 14 may have any type of spray deflector nozzle 23 or the like mounted thereon, if so desired. Body portion 14 includes a first fluid passageway 24 extending from the inlet end 18 to the discharge end or outlet end 22.",
        "Body portion 14 is provided with a transversely extending spool opening 28 which intersects and which is in communication with the fluid passageway 24. An elongated, preferably rectangular in cross section, spool 30 is slidably mounted in spool opening 28 and is movable between at least first and second positions. Spool 30 is provided with end caps 32 and 34 mounted on the opposite ends thereof which are removably mounted thereon and which limit the movement of the spool 30 with respect to the body portion 14. For purposes of description, spool 30 will be described as having opposite ends 36 and 38, opposite sides 40 and 42, a lower end 44 and an upper end 46.",
        "At least two water flow control passageways 50 and 52 extend between sides 40 and 42 and have different diameters. At least two chemical flow passageways 54 and 56 extend upwardly into spool 30 from the lower end thereof so as to be in fluid communication with the water flow control passageways 50 and 52, respectively. The chemical flow passageways 54 and 56 have different diameters.",
        "When spool 30 is in its first position, water flow control passageway 50 is in fluid communication with the first fluid passageway 24 and the chemical flow passageway 54 will be in fluid communication with water flow control passageway 50. When spool 30 is in its second position, water flow control passageway 52 is in communication with the first fluid passageway 24 and the chemical flow passageway 56 will be in communication with water flow control passageway 52.",
        "The vertically disposed body portion 16 is provided with a second fluid passageway 58 extending therethrough with the upper end thereof being in communication with the spool opening 28. The numeral 60 refers to a rotary on-off valve which extends transversely through the first fluid passageway 24 so that the flow of water therethrough may be controlled.",
        "The numeral 62 refers to a rotating collar mounted on the lower end of body portion 16 to enable the dispenser to be connected to a conventional chemical container.",
        "With a liquid chemical container having liquid chemical therein is secured to the collar 62 and with the dispenser on-off valve 60 in its open position, and with the dispenser spool in its first position, liquid chemical will be drawn upwardly through the second fluid passageway 58 as water passes through first fluid passageway 24. The liquid chemical in second fluid passageway 58 will pass through chemical flow passageway 54, water flow control passageway 50 and into fluid passageway 24. With the spool 30 in its second position, liquid chemical will be drawn upwardly through the fluid passageway 58, through chemical flow passageway 56, through water flow control passageway 52 and into fluid passageway 24. By providing the dispenser spool 30 with the water flow control passageways 50, 52 and the chemical flow passageways 54, 56, the chemical added to the water is precisely metered depending upon the diameters of the chemical flow passageways 54 and 56. The flow of water through the dispenser is precisely controlled through the use of the variable diameter water flow control passageways 50 and 52. Although the dispenser spool 30 is described as having a pair of chemical flow passageways and a pair of water flow control passageways formed therein, the dispenser spool 30 could be provided with additional sets of chemical flow passageways and water flow control passageways with the dispenser spool being selectively movable between a plurality of operating positions.",
        "Referring now to the invention of this application, and more particularly to FIGS. 9-13, the dispenser of the instant application is referred to generally by the reference numeral 110 and is preferably of the hand-held type. Dispenser 110 includes a dispenser body 112 which is generally T-shaped in configuration and which includes a generally horizontally disposed body portion 114 and a generally vertically disposed body portion 116. Obviously, body portion 114 will not always be horizontally disposed when being used nor will body portion 116 always be substantially vertically disposed when in use.",
        "Body portion 114 includes an inlet end 118 which preferably has a rotatable dispenser nut or connector 120 mounted thereon so that a water hose or the like may be secured thereto with the water hose being in communication with a source of water under pressure. It is preferred that a backflow preventer 121 of conventional design be imposed between the water hose and the inlet end 118. The outlet or discharge end 122 of the body portion 114 may have any type of spray deflector nozzle 123 or the like mounted thereon, if so desired, as seen in FIG. 12. Body portion 114 includes a first fluid passageway 124 extending from the inlet end 118 to the discharge end or outlet end 122.",
        "Body portion 114 is provided with a transversely extending spool opening 128 which intersects and which is in communication with the fluid passageway 124. An elongated, preferably rectangular in cross section, spool 130 is selectively removably mounted in spool opening 128. For purposes of description, spool 130 will be described as having opposite ends 136 and 138, opposite sides 140 and 142, a lower end 144 and an upper end 146.",
        "A second fluid passageway 150 extends between the inlet end and outlet end of the spool member 130 which communicates with the first fluid passageway 124. The spool member 130 has a third fluid passageway 152 formed therein which extends from the second fluid passageway 150 to the lower end of the spool member 130. The body 112 has a fourth fluid passageway 154 formed therein which extends downwardly from the spool opening 128 to a cylindrical bore 156 which is formed in body portion 116 below spool opening 128. The second body portion 116 has a fifth fluid passageway 158 formed therein which extends from the cylindrical bore 156 to the lower end of the back portion 116. The fifth fluid passageway 158 is in communication with a source of liquid chemical contained within container C which is connected to the lower end of body portion 116.",
        "A cylindrical chemical metering valve 160, having end portions 162 and 164, is selectively rotatably mounted in the cylindrical bore 156 and is rotatable between first and second positions. The metering valve 160 has radially spaced-apart first and second transversely extending metering passageways 166 and 168, respectively, formed therein each of which has an inlet end and a discharge end. Metering tips 170 and 172 are mounted in the discharge ends of the metering passageways 166 and 168, respectively, which permit different chemical flow rates therethrough. In other words, the orifices of the metering tips 170 and 172 have different diameters.",
        "Handle 174 is mounted on end portion 162 of valve 160 while handle 176 is mounted on end portion 164 of valve 160. End portions 162 and 164 are secured together by a screw 178 so that handles 174 and 176 are disposed at right angles to one another. Valve 160 is selectively rotatable between first and second positions relative to the spool 130. When valve 160 is in its first position of FIGS. 9 and 10, handle 176 will be horizontally disposed and spaced from the stop 163. which extends outwardly from end portion 136 of spool 130 and handle 176 will be in engagement with stop 163 which extends outwardly from end portion 138 of spool 130. In the first position, metering passageway 168 will be in communication with passageways 154 and 158. In the second position of valve 160, handle 174 will be in engagement with stop 163 and handle 176 will be horizontally disposed. In the second position, metering passageway 166 will be in communication with passageways 154 and 158.",
        "Thus, the dispenser 110 permits the user to pass water through the body at a particular flow rate which will depend upon the diameter of the passageway 124. The user can select the chemical injection rate between two options available to the user by simply rotating valve 160 between its two positions. If the user desires a different water flow rate, the spool 130 may be replaced by a spool having a different diameter passageway extending therethrough.",
        "Thus it can be seen that the invention accomplishes at least all of its stated objectives."
    ],
    "citations": [
        "2113203",
        "3034731",
        "3090564",
        "3684187",
        "3764074",
        "3770205",
        "3940069",
        "3998227",
        "4033509",
        "4057940",
        "4349157",
        "4369921",
        "4475689",
        "4553423",
        "4600130",
        "D284988",
        "4767058",
        "4901923",
        "4923098",
        "5007588",
        "5009393",
        "5039016",
        "5100059",
        "5183206",
        "5213265",
        "5303729",
        "5320288",
        "5372310",
        "5375769",
        "5383603",
        "5465908",
        "5595345",
        "H1691",
        "5804082",
        "5826795",
        "5850973",
        "5853114",
        "5944259",
        "5954272",
        "5957387",
        "6012650",
        "6068204",
        "6102308",
        "6116521",
        "6179226",
        "6182911",
        "6187186",
        "6233756",
        "6240983",
        "6254015",
        "6267303",
        "6283385",
        "6345773",
        "6371385",
        "6378785",
        "6397879",
        "6419166",
        "6425534",
        "6461361",
        "6471141",
        "6571824",
        "6578776",
        "6604546",
        "D484572",
        "6672520",
        "6708901",
        "6715643",
        "6726123",
        "6749133",
        "6749135",
        "6752297",
        "6772966",
        "D497975",
        "6827293",
        "6869028",
        "6913209",
        "6948451"
    ],
    "us_classification": "239310",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "05",
            "subclass": "B",
            "main_group": "7",
            "subgroup": "26"
        }
    ]
}