{
    "title": "Implant with anchor",
    "abstract": "Surgical methods and related devices for treating glaucoma are described. The methods include trabecular bypass surgery, which involve bypassing diseased trabecular meshwork with a seton implant. The implant is used to limit a healing process known as filling in, which has a tendency to close surgically created openings in the trabecular meshwork. In addition to bypassing the diseased trabecular meshwork, existing outflow pathways are also used or restored. The seton implant is positioned through the trabecular meshwork so that an inlet end of the seton implant is exposed to the anterior chamber of the eye and an outlet end is positioned into fluid collection channels at about an exterior surface of the trabecular meshwork or up to the level of aqueous veins.",
    "inventors": [
        "Bergheim",
        "Gharib"
    ],
    "document_number": "07297130",
    "publication_date": "20071120",
    "assignees": [
        "Glaukos Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An implant for treating glaucoma, comprising:",
            "components": [
                {
                    "component": "an inlet portion configured to extend through a portion of the trabecular meshwork of an eye;",
                    "subcomponents": []
                },
                {
                    "component": "an outlet portion configured to extend into and along Schlemm's canal of said eye;",
                    "subcomponents": []
                },
                {
                    "component": "wherein said implant provides a flow path between the anterior chamber and Schlemm's canal, and wherein said implant has a retention protrusion configured to anchor the implant and stabilize at least a portion of said flow path through said implant.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The implant of claim 1 , wherein the implant has no cutting surfaces such that the implant is insertable into Schlemm's canal without the implant cutting tissue.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The implant of claim 1 , wherein the retention protrusion comprises a barb.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The implant of claim 1 , wherein the retention protrusion is on the outlet portion.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A method of treating glaucoma comprising:",
            "components": [
                {
                    "component": "inserting an implant through an incision in an eye into the anterior chamber of the eye;",
                    "subcomponents": []
                },
                {
                    "component": "transporting the implant from the incision through the anterior chamber of the eye to Schlemm's canal of the eye such that an outflow portion of the implant extends into and along Schlemm's canal;",
                    "subcomponents": []
                },
                {
                    "component": "anchoring the implant in the eye such that an inflow portion of the implant is positioned to receive fluid from the anterior chamber, and the outflow portion of the implant is positioned in Schlemm's canal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 5 , wherein the anchoring the implant comprises stabilizing the implant with a plurality of protrusions.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 5 , wherein the anchoring the implant comprises exerting a force against Schlemm's canal with a plurality of protrusions.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 7 , wherein the exerting a force against Schlemm's canal comprises exerting traction against an inner surface of Schlemm's canal.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A method of treating glaucoma, comprising:",
            "components": [
                {
                    "component": "providing an implant having a longitudinal axis, said implant comprising a circumferential protrusion, said protrusion comprising a surface extending generally radially outwardly relative to the longitudinal axis;",
                    "subcomponents": []
                },
                {
                    "component": "inserting the implant into an anterior chamber of the eye;",
                    "subcomponents": []
                },
                {
                    "component": "positioning the implant to convey aqueous humor from the anterior chamber to a natural aqueous humor outflow passage of the eye, said positioning comprising positioning the outwardly extending surface within the outflow passage.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 9 , wherein the outflow passage comprises Schlemm's canal of the eye.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 9 , wherein the outflow passage comprises collector channels of the eye.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 9 , wherein providing the implant further comprises providing an implant comprising a tubular body.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 9 , wherein providing the implant further comprises providing an implant comprising a second circumferential protrusion.",
            "components": []
        }
    ],
    "description": [
        "This patent application is a continuation application of U.S. patent application Ser. No. 09/549,350, filed Apr. 14, 2000, now U.S. Pat. No. 6,638,239, which is incorporated in its entirety by reference herein. This application is also related to U.S. patent application Ser. No. 10/309,711, filed Dec. 4, 2002, now U.S. Pat. No. 6,955,656, and to U.S. patent application Ser. No. 10/395,627, filed on Mar. 21, 2003, now U.S. Pat. No. 6,780,164, U.S. patent application Ser. Nos. 10/395,633 and 10/395,472, both filed on Mar. 21, 2003, and both abandoned, all of which are incorporated in their entirety by reference herein.",
        "The present invention generally relates to improved medical devices and methods for the reduction of elevated pressure in organs of the human body. More particularly, the present invention relates to the treatment of glaucoma by trabecular bypass surgery, which is a means for using an implant or seton, such as a micro stent, shunt or the like, to bypass diseased trabecular meshwork at the level of trabecular meshwork and use/restore existing outflow pathways.",
        "About two percent of people in the United States have glaucoma. Glaucoma is a group of eye diseases that causes pathological changes in the optic disk and corresponding visual field loss resulting in blindness if untreated. Intraocular pressure elevation is the major etiologic factor in all glaucomas.",
        "In glaucomas associated with an elevation in eye pressure the source of resistance to outflow is in the trabecular meshwork. The tissue of the trabecular meshwork allows the “aqueous” to enter Schlemm's canal, which then empties into aqueous collector channels in the posterior wall of Schlemm's canal and then into aqueous veins. The aqueous or aqueous humor is a transparent liquid that fills the region between the cornea at the front of the eye and the lens. The aqueous humor is constantly secreted by the ciliary body around the lens, so there is a continuous flow of the aqueous humor from the ciliary body to the eye's front chamber. The eye's pressure is determined by a balance between the production of aqueous and its exit through the trabecular meshwork (major route) or via uveal scleral outflow (minor route). The trabecular meshwork is located between the outer rim of the iris and the internal periphery of the cornea. The portion of the trabecular meshwork adjacent to Schlemm's canal causes most of the resistance to aqueous outflow (juxtacanilicular meshwork).",
        "Glaucoma is grossly classified into two categories: closed-angle glaucoma and open-angle glaucoma. The closed-angle glaucoma is caused by closure of the anterior angle by contact between the iris and the inner surface of the trabecular meshwork. Closure of this anatomical angle prevents normal drainage of aqueous humor from the anterior chamber of the eye. Open-angle glaucoma is any glaucoma in which the angle of the anterior chamber remains open, but the exit of aqueous through the trabecular meshwork is diminished. The exact cause for diminished filtration is unknown for most cases of open-angle glaucoma. However, there are secondary open-angle glaucomas which may include edema or swelling of the trabecular spaces (from steroid use), abnormal pigment dispersion, or diseases such as hyperthyroidism that produce vascular congestion.",
        "All current therapies for glaucoma are directed at decreasing intraocular pressure. This is initially by medical therapy with drops or pills that reduce the production of aqueous humor or increase the outflow of aqueous. However, these various drug therapies for glaucoma are sometimes associated with significant side effects, such as headache, blurred vision, allergic reactions, death from cardiopulmonary complications and potential interactions with other drugs. When the drug therapy fails, surgical therapy is used. Surgical therapy for open-angle glaucoma consists of laser (trabeculoplasty), trabeculectomy and aqueous shunting implants after failure of trabeculectomy or if trabeculectomy is unlikely to succeed. Trabeculectomy is a major surgery which is most widely used and is augmented with topically applied anticancer drugs such as 5-flurouracil or mitomycin-c to decrease scarring and increase surgical success.",
        "Approximately 100,000 trabeculectomies are performed on Medicare age patients per year in the United States. This number would increase if the morbidity associated with trabeculectomy could be decreased. The current morbidity associated with trabeculectomy consists of failure (10–15%), infection (a life long risk about 2–5%), choroidal hemorrhage (1%, a severe internal hemorrhage from pressure too low resulting in visual loss), cataract formation, and hypotony maculopathy (potentially reversible visual loss from pressure too low).",
        "If it were possible to bypass the local resistance to outflow of aqueous at the point of the resistance and use existing outflow mechanisms, surgical morbidity would greatly decrease. The reason for this is that the episcleral aqueous veins have a backpressure that would prevent the eye pressure from going too low. This would virtually eliminate the risk of hypotony maculopathy and choroidal hemorrhage. Furthermore, visual recovery would be very rapid and risk of infection would be very small (a reduction from 2–5% to 0.05%). Because of these reasons surgeons have tried for decades to develop a workable surgery for the trabecular meshwork.",
        "The previous techniques, which have been tried, are goniotomy/trabeculotomy, and other mechanical disruption of the trabecular meshwork, such as trabeculopuncture, goniophotoablation, laser trabecular ablation and goniocurretage. They are briefly described below.",
        "Goniotomy/Trabeculotomy: Goniotomy and trabeculotomy are simple and directed techniques of microsurgical dissection with mechanical disruption of the trabecular meshwork. These initially had early favorable responses in the treatment of open-angle glaucoma. However, long-term review of surgical results showed only limited success in adults. In retrospect, these procedures probably failed secondary to repair mechanisms and a process of “filling in”. The filling in is the result of a healing process which has the detrimental effect of collapsing and closing in of the created opening throughout the trabecular meshwork. Once the created openings close, the pressure builds back up and the surgery fails.",
        "Trabeculopuncture: Q-switched Neodymiun (Nd):YAG lasers also have been investigated as an optically invasive technique for creating full-thickness holes in trabecular meshwork. However, the relatively small hole created by this trabeculopuncture technique exhibits a filling in effect and fails.",
        "Goniophotoablation/Laser Trabecular Ablation: Goniophotoablation is disclosed by Berlin in U.S. Pat. No. 4,846,172 , and describes the use of an excimer laser to treat glaucoma by ablating the trabecular meshwork. This was not demonstrated by clinical trial to succeed. Hill et al. used an Erbium:YAG laser to create full thickness holes through trabecular meshwork (Hill et al., Lasers in Surgery and Medicine 11:341–346, 1991). This technique was investigated in a primate model and a limited human clinical trial at the University of California, Irvine. Although morbidity was zero in both trials, success rates did not warrant further human trials. Failure again was from filling in of created defects in trabecular meshwork by repair mechanisms. Neither of these is a valid surgical technique for the treatment of glaucoma.",
        "Goniocurretage: This is an ab-interno (from the inside) mechanical disruptive technique. This uses an instrument similar to a cyclodialysis spatula with a microcurrette at the tip. Initial results are similar to trabeculotomy that fails secondary to repair mechanisms and a process of filling in.",
        "Although trabeculectomy is the most commonly performed filtering surgery, Viscocanulostomy (VC) and non-penetrating trabeculectomy (NPT) are two new variations of filtering surgery. These are ab-externo (from the outside), major ocular procedures in which Schlemm's canal is surgically exposed by making a large and very deep scleral flap. In the VC procedure, Schlemm's canal is canulated and viscoelastic substance injected (which dilates Schlemm's canal and the aqueous collector channels). In the NPT procedure, the inner wall of Schlemm's canal is stripped off after surgically exposing the canal.",
        "Trabeculectomy, VC, and NPT are performed under a conjunctival and scleral flap, such that the aqueous humor is drained onto the surface of the eye or into the tissues located within the lateral wall of the eye. Normal physiological outflows are not used. These surgical operations are major procedures with significant ocular morbidity. When Trabeculectomy, VC, and NPT are thought to have a low chance for success, a number of implantable drainage devices have been used to ensure that the desired filtration and outflow of aqueous humor through the surgical opening will continue. The risk of placing a glaucoma drainage implant also includes hemorrhage, infection and postoperative double vision that is a complication unique to drainage implants.",
        "Examples of implantable shunts or devices for maintaining an opening for the release of aqueous humor from the anterior chamber of the eye to the sclera or space underneath conjunctiva have been disclosed in U.S. Pat. No. 6,007,511 (Prywes), U.S. Pat. No. 6,007,510 (Nigam), U.S. Pat. No. 5,893,837 (Eagles et al.), U.S. Pat. No. 5,882,327 (Jacob), U.S. Pat. No. 5,879,319 (Pynson et al.), U.S. Pat. No. 5,807,302 (Wandel), U.S. Pat. No. 5,752,928 (de Roulhac et al.), U.S. Pat. No. 5,743,868 (Brown et al.), U.S. Pat. No. 5,704,907 (Nordquist et al.), U.S. Pat. No. 5,626,559 (Solomon), U.S. Pat. No. 5,626,558 (Suson), U.S. Pat. No. 5,601,094 (Reiss), RE. 35,390 (Smith), U.S. Pat. No. 5,558,630 (Fisher), U.S. Pat. No. 5,558,629 (Baerveldt et al.), U.S. Pat. No. 5,520,631 (Nordquist et al.), U.S. Pat. No. 5,476,445 (Baerveldt et al.), U.S. Pat. No. 5,454,796 (Krupin), U.S. Pat. No. 5,433,701 (Rubinstein), U.S. Pat. No. 5,397,300 (Baerveldt et al.), U.S. Pat. No. 5,372,577 (Ungerleider), U.S. Pat. No. 5,370,607 (Memmen), U.S. Pat. No. 5,338,291 (Speckman et al.), U.S. Pat. No. 5,300,020 (L'Esperance, Jr.), U.S. Pat. No. 5,178,604 (Baerveldt et al.), U.S. Pat. No. 5,171,213 (Price, Jr.), U.S. Pat. No. 5,041,081 (Odrich), U.S. Pat. No. 4,968,296 (Ritch et al.), U.S. Pat. No. 4,936,825 (Ungerleider), U.S. Pat. No. 4,886,488 (White), U.S. Pat. No. 4,750,901 (Molteno), U.S. Pat. No. 4,634,418 (Binder), U.S. Pat. No. 4,604,087 (Joseph), U.S. Pat. No. 4,554,918 (White), U.S. Pat. No. 4,521,210 (Wong), U.S. Pat. No. 4,428,746 (Mendez), U.S. Pat. No. 4,402,681 (Haas et al.), U.S. Pat. No. 4,175,563 (Arenberg et al.), and U.S. Pat. No. 4,037,604 (Newkirk).",
        "All of the above embodiments and variations thereof have numerous disadvantages and moderate success rates. They involve substantial trauma to the eye and require great surgical skill by creating a hole over the full thickness of the sclera/cornea into the subconjunctival space. Furthermore, normal physiological outflow pathways are not used. The procedures are mostly performed in an operating room generating a facility fee, anesthesiologist's professional fee and have a prolonged recovery time for vision. The complications of filtration surgery have inspired ophthalmic surgeons to look at other approaches to lowering intraocular pressure.",
        "The trabecular meshwork and juxtacanilicular tissue together provide the majority of resistance to the outflow of aqueous and, as such, are logical targets for surgical removal in the treatment of open-angle glaucoma. In addition, minimal amounts of tissue are altered and existing physiologic outflow pathways are utilized. Trabecular bypass surgery has the potential for much lower risks of choroidal hemorrhage, infection and uses existing physiologic outflow mechanisms. This surgery could be performed under topical anesthesia in a physician's office with rapid visual recovery.",
        "Therefore, there is a great clinical need for the treatment of glaucoma by a method that would be faster, safer and less expensive than currently available modalities. Trabecular bypass surgery is an innovative surgery which uses a micro stent, shunt, or other implant to bypass diseased trabecular meshwork alone at the level of trabecular meshwork and use or restore existing outflow pathways. The object of the present invention is to provide a means and methods for treating elevated intraocular pressure in a manner which is simple, effective, disease site specific and can be performed on an outpatient basis.",
        "In some preferred embodiments, the seton has an inlet portion configured to extend through a portion of the trabecular meshwork of an eye, and an outlet portion configured to extend into Schlemm's canal of the eye, wherein the inlet portion is disposed at an angle relative to the outlet portion. In some embodiments, the outlet portion has a lumen with an oval cross-section having a long axis.",
        "The outlet portion in certain embodiments has a longitudinal axis, such that the long axis of the oval cross-section and the longitudinal axis of the outlet portion define a plane, the inlet portion having a longitudinal axis which lies outside the plane at an angle θ (theta) thereto.",
        "In some preferred arrangements, the seton comprises an inlet portion, configured to extend through a portion of the trabecular meshwork; an outlet portion, configured to extend into Schlemm's canal; and at least one protrusion on the outlet portion, configured to exert traction against an inner surface of Schlemm's canal. This protrusion can comprise at least one barb or ridge.",
        "Some preferred embodiments comprise an inlet portion configured to extend through a portion of the trabecular meshwork, an outlet portion configured to extend into Schlemm's canal, and a one-way valve within the inlet and/or outlet portions.",
        "A method for delivering a seton within an eye is disclosed, comprising providing an elongate guide member, advancing a distal end of the guide member through at least a portion of the trabecular meshwork of the eye, advancing the seton along the guide member toward the distal end, and positioning the seton to conduct aqueous humor between the anterior chamber of the eye and Schlemm's canal.",
        "In certain embodiments, the advancing of the guide member comprises advancing it from the anterior chamber into the trabecular meshwork. In further embodiments, the positioning comprises positioning an end of the seton within Schlemm's canal adjacent to an aqueous collection channel.",
        "Certain preferred embodiments include an apparatus for delivering a seton to the anterior chamber of an eye comprising an elongate tube having a lumen, an outer surface, and a distal end; a removable, elongate guide member within the lumen, configured to permit the seton to be advanced and to be positioned in the trabecular meshwork of the eye. This apparatus can further comprise a cutting member positioned at the distal end of the tube. The cutting member can be selected from the group consisting of a knife, a laser probe, a pointed guide member, a sharpened distal end of said tube, and an ultrasonic cutter. The apparatus can also further comprise an opening in the outer surface of the tube, configured to allow fluid infusion into the eye.",
        "In further preferred embodiments, an apparatus for delivering a seton in an eye, comprises an elongate member adapted for insertion into an anterior chamber of the eye, the elongate member having a distal end portion configured to retain the seton therein, the distal end portion comprising a cutting member configured to form an opening in the trabecular meshwork of the eye for receipt of the seton, such that one end of the seton is in Schlemm's canal. The elongate member can further comprise a lumen which conducts fluid toward said distal end portion.",
        "The preferred embodiment provides further surgical treatment of glaucoma (trabecular bypass surgery) at the level of trabecular meshwork and restores existing physiological outflow pathways. An implant bypasses diseased trabecular meshwork at the level of trabecular meshwork and which restores existing physiological outflow pathways. The implant has an inlet end, an outlet end and a lumen therebetween. The inlet is positioned in the anterior chamber at the level of the internal trabecular meshwork and the outlet end is positioned at about the exterior surface of the diseased trabecular meshwork and/or into fluid collection channels of the existing outflow pathways.",
        "In accordance with a preferred method, trabecular bypass surgery creates an opening or a hole through the diseased trabecular meshwork through minor microsurgery. To prevent “filling in” of the hole, a biocompatible elongated implant is placed within the hole as a seton, which may include, for example, a solid rod or hollow tube. In one exemplary embodiment, the seton implant may be positioned across the diseased trabecular meshwork alone and it does not extend into the eye wall or sclera. In another embodiment, the inlet end of the implant is exposed to the anterior chamber of the eye while the outlet end is positioned at the exterior surface of the trabecular meshwork. In another exemplary embodiment, the outlet end is positioned at and over the exterior surface of the trabecular meshwork and into the fluid collection channels of the existing outflow pathways. In still another embodiment, the outlet end is positioned in the Schlemm's canal. In an alternative embodiment, the outlet end enters into fluid collection channels up to the level of the aqueous veins with the seton inserted in a retrograde or antegrade fashion.",
        "According to the preferred embodiment, the seton implant is made of biocompatible material, which is either hollow to allow the flow of aqueous humor or solid biocompatible material that imbibes aqueous. The material for the seton may be selected from the group consisting of porous material, semi-rigid material, soft material, hydrophilic material, hydrophobic material, hydrogel, elastic material, and the like.",
        "In further accordance with the preferred embodiment, the seton implant may be rigid or it may be made of relatively soft material and is somewhat curved at its distal section to fit into the existing physiological outflow pathways, such as Schlemm's canal. The distal section inside the outflow pathways may have an oval shape to stabilize the seton in place without undue suturing. Stabilization or retention of the seton may be further strengthened by a taper end and/or by at least one ridge or rib on the exterior surface of the distal section of the seton, or other surface alterations designed to retain the seton.",
        "In one embodiment, the seton may include a micropump, one way valve, or semi-permeable membrane if reflux of red blood cells or serum protein becomes a clinical problem. It may also be useful to use a biocompatible material that hydrates and expands after implantation so that the seton is locked into position around the trabecular meshwork opening or around the distal section of the seton.",
        "One of the advantages of trabecular bypass surgery, as disclosed herein, and the use of a seton implant to bypass diseased trabecular meshwork at the level of trabecular meshwork and thereby use existing outflow pathways is that the treatment of glaucoma is substantially simpler than in existing therapies. A further advantage of the invention is the utilization of simple microsurgery that may be performed on an outpatient basis with rapid visual recovery and greatly decreased morbidity. Finally, a distinctly different approach is used than is found in existing implants. Physiological outflow mechanisms are used or re-established by the implant of the present invention, in contradistinction with previously disclosed methodologies.",
        "Additional objects and features of the present invention will become more apparent and the invention itself will be best understood from the following Detailed Description of Exemplary Embodiments, when read with reference to the accompanying drawings.",
        "FIG. 1 is a sectional view of an eye for illustration purposes.",
        "FIG. 2 is a close-up sectional view, showing the anatomical diagram of trabecular meshwork and the anterior chamber of the eye.",
        "FIG. 3 is an embodiment of the seton implant constructed according to the principles of the invention.",
        "FIG. 4 is a top cross-sectional view of section 1—1 of FIG. 3.",
        "FIG. 5 is another embodiment of the seton implant constructed in accordance with the principles of the invention.",
        "FIG. 6 is a perspective view illustrating the seton implant of the present invention positioned within the tissue of an eye.",
        "FIG. 7 is an alternate exemplary method for placing a seton implant at the implant site.",
        "Referring to FIGS. 1 to 7, what is shown is a method for the treatment of glaucoma by trabecular bypass surgery. In particular, a seton implant is used to bypass diseased trabecular meshwork at the level of trabecular meshwork to use or restore existing outflow pathways and methods thereof.",
        "For background illustration purposes, FIG. 1 shows a sectional view of an eye 10, while FIG. 2 shows a close-up view, showing the relative anatomical locations of the trabecular meshwork, the anterior chamber, and Schlemm's canal. Thick collagenous tissue known as sclera 11 covers the entire eye 10 except that portion covered by the cornea 12. The cornea 12 is a thin transparent tissue that focuses and transmits light into the eye and the pupil 14 which is the circular hole in the center of the iris 13 (colored portion of the eye). The cornea 12 merges into the sclera 11 at a juncture referred to as the limbus 15. The ciliary body 16 begins internally in the eye and extends along the interior of the sclera 11 and becomes the choroid 17. The choroid 17 is a vascular layer of the eye underlying retina 18. The optic nerve 19 transmits visual information to the brain and is sequentially destroyed by glaucoma.",
        "The anterior chamber 20 of the eye 10, which is bound anteriorly by the cornea 12 and posteriorly by the iris 13 and lens 26, is filled with aqueous. Aqueous is produced primarily by the ciliary body 16 and reaches the anterior chamber angle 25 formed between the iris 13 and the cornea 12 through the pupil 14. In a normal eye, the aqueous is removed through the trabecular meshwork 21. Aqueous passes through trabecular meshwork 21 into Schlemm's canal 22 and through the aqueous veins 23 which merge with blood-carrying veins and into venous circulation. Intraocular pressure of the eye 10 is maintained by the intricate balance of secretion and outflow of the aqueous in the manner described above. Glaucoma is characterized by the excessive buildup of aqueous fluid in the anterior chamber 20 which produces an increase in intraocular pressure (fluids are relatively incompressible and pressure is directed equally to all areas of the eye).",
        "As shown in FIG. 2, the trabecular meshwork 21 constitutes a small portion of the sclera 11. It is understandable that creating a hole or opening for implanting a device through the tissues of the conjunctiva 24 and sclera 11 is relatively a major surgery as compared to a surgery for implanting a device through the trabecular meshwork 21 only. A seton implant 31 of the present invention for either using or restoring existing outflow pathways positioned through the trabecular meshwork 21 is illustrated in FIG. 5.",
        "In a first embodiment, a method for increasing aqueous humor outflow in an eye of a patient to reduce the intraocular pressure therein. The method comprises bypassing diseased trabecular meshwork at the level of the trabecular meshwork and thereby restoring existing outflow pathways. Alternately, a method for increasing aqueous humor outflow in an eye of a patient to reduce an intraocular pressure therein is disclosed. The method comprises bypassing diseased trabecular meshwork at a level of said trabecular meshwork with a seton implant and using existing outflow pathways. The seton implant 31 may be an elongated seton or other appropriate shape, size or configuration. In one embodiment of an elongated seton implant, the seton has an inlet end, an outlet end and a lumen therebetween, wherein the inlet end is positioned at an anterior chamber of the eye and the outlet end is positioned at about an exterior surface of said diseased trabecular meshwork. Furthermore, the outlet end may be positioned into fluid collection channels of the existing outflow pathways. Optionally, the existing outflow pathways may comprise Schlemm's canal 22. The outlet end may be further positioned into fluid collection channels up to the level of the aqueous veins with the seton inserted either in a retrograde or antegrade fashion with respect to the existing outflow pathways.",
        "In a further alternate embodiment, a method is disclosed for increasing aqueous humor outflow in an eye of a patient to reduce an intraocular pressure therein. The method comprises (a) creating an opening in trabecular meshwork, wherein the trabecular meshwork comprises an interior side and exterior side; (b) inserting a seton implant into the opening; and (c) transporting the aqueous humor by said seton implant to bypass the trabecular meshwork at the level of said trabecular meshwork from the interior side to the exterior side of the trabecular meshwork.",
        "FIG. 3 shows an embodiment of the seton implant 31 constructed according to the principles of the invention. The seton implant may comprise a biocompatible material, such as a medical grade silicone, for example, the material sold under the trademark Silastic™, which is available from Dow Corning Corporation of Midland, Mich., or polyurethane, which is sold under the trademark Pellethane™, which is also available from Dow Corning Corporation. In an alternate embodiment, other biocompatible materials (biomaterials) may be used, such as polyvinyl alcohol, polyvinyl pyrolidone, collagen, heparinized collagen, tetrafluoroethylene, fluorinated polymer, fluorinated elastomer, flexible fused silica, polyolefin, polyester, polysilison, mixture of biocompatible materials, and the like. In a further alternate embodiment, a composite biocompatible material by surface coating the above-mentioned biomaterial may be used, wherein the coating material may be selected from the group consisting of polytetrafluoroethlyene (PTFE), polyimide, hydrogel, heparin, therapeutic drugs, and the like.",
        "The main purpose of the seton implant is to assist in facilitating the outflow of aqueous in an outward direction 40 into the Schlemm's canal and subsequently into the aqueous collectors and the aqueous veins so that the intraocular pressure is balanced. In one embodiment, the seton implant 31 comprises an elongated tubular element having a distal section 32 and an inlet section 44. A rigid or flexible distal section 32 is positioned inside one of the existing outflow pathways. The distal section may have either a tapered outlet end 33 or have at least one ridge 37 or other retention device protruding radially outwardly for stabilizing the seton implant inside said existing outflow pathways after implantation. For stabilization purposes, the outer surface of the distal section 32 may comprise a stubbed surface, a ribbed surface, a surface with pillars, a textured surface, or the like. The outer surface 36, including the outer region 35 and inner region 34 at the outlet end 33, of the seton implant is biocompatible and tissue compatible so that the interaction/irritation between the outer surface and the surrounding tissue is minimized. The seton implant may comprise at least one opening at a location proximal the distal section 32, away from the outlet end 33, to allow flow of aqueous in more than one direction. The at least one opening may be located on the distal section 32 at about opposite of the outlet end 33.",
        "In another exemplary embodiment, the seton implant 31 may have a one-way flow controlling means 39 for allowing one-way aqueous flow 40. The one-way flow controlling means 39 may be selected from the group consisting of a check valve, a slit valve, a micropump, a semi-permeable membrane, or the like. To enhance the outflow efficiency, at least one optional opening 41 in the proximal portion of the distal section 32, at a location away from the outlet end 33, and in an exemplary embodiment at the opposite end of the outlet end 33, is provided.",
        "FIG. 4 shows a top cross-sectional view of FIG. 3. The shape of the opening of the outlet end 33 and the remaining body of the distal section 32 may be oval, round or some other shape adapted to conform to the shape of the existing outflow pathways. This configuration will match the contour of Schlemm's canal to stabilize the inlet section with respect to the iris and cornea by preventing rotation.",
        "As shown in FIG. 3, the seton implant of the present invention may have a length between about 0.5 mm to over a meter, depending on the body cavity the seton implant applies to. The outside diameter of the seton implant may range from about 30 μm to about 500 μm. The lumen diameter is preferably in the range between about 20 μm to about 150 μm. The seton implant may have a plurality of lumens to facilitate multiple flow transportation. The distal section may be curved at an angle between about 30 degrees to about 150 degrees, in an exemplary embodiment at around 70–110 degrees, with reference to the inlet section 44.",
        "FIG. 5 shows another embodiment of the seton implant 45 constructed in accordance with the principles of the invention. In an exemplary embodiment, the seton implant 45 may comprise at least two sections: an inlet section 47 and an outlet section 46. The outlet section has an outlet opening 48 that is at the outlet end of the seton implant 45. The shape of the outlet opening 48 is preferably an oval shape to conform to the contour of the existing outflow pathways. A portion of the inlet section 47 adjacent the joint region to the outlet section 46 will be positioned essentially through the diseased trabecular meshwork while the remainder of the inlet section 47 and the outlet section 46 are outside the trabecular meshwork. As shown in FIG. 5, the long axis of the oval shape opening 48 lies in a first plane formed by an X-axis and a Y-axis. To better conform to the anatomical contour of the anterior chamber 20, the trabecular meshwork 21 and the existing outflow pathways, the inlet section 47 may preferably lie at an elevated second plane, at an angle θ, from the first plane formed by an imaginary inlet section 47A and the outlet section 46. The angle θ may be between about 30 degrees and about 150 degrees.",
        "FIG. 6 shows a perspective view illustrating the seton implant 31, 45 of the present invention positioned within the tissue of an eye 10. A hole/opening is created through the diseased trabecular meshwork 21. The distal section 32 of the seton implant 31 is inserted into the hole, wherein the inlet end 38 is exposed to the anterior chamber 20 while the outlet end 33 is positioned at about an exterior surface 43 of said diseased trabecular meshwork 21. In a further embodiment, the outlet end 33 may further enter into fluid collection channels of the existing outflow pathways.",
        "In one embodiment, the means for forming a hole/opening in the trabecular mesh 21 may comprise an incision with a microknife, an incision by a pointed guidewire, a sharpened applicator, a screw shaped applicator, an irrigating applicator, or a barbed applicator. Alternatively, the trabecular meshwork may be dissected off with an instrument similar to a retinal pick or microcurrette. The opening may alternately be created by retrogade fiberoptic laser ablation.",
        "FIG. 7 shows an illustrative method for placing a seton implant at the implant site. An irrigating knife or applicator 51 comprises a syringe portion 54 and a cannula portion 55. The distal section of the cannula portion 55 has at least one irrigating hole 53 and a distal space 56 for holding a seton implant 31. The proximal end 57 of the lumen of the distal space 56 is sealed from the remaining lumen of the cannula portion 55.",
        "For positioning the seton 31 in the hole or opening through the trabecular meshwork, the seton may be advanced over the guidewire or a fiberoptic (retrograde). In another embodiment, the seton is directly placed on the delivery applicator and advanced to the implant site, wherein the delivery applicator holds the seton securely during the delivery stage and releases it during the deployment stage.",
        "In an exemplary embodiment of the trabecular meshwork surgery, the patient is placed in the supine position, prepped, draped and anesthesia obtained. In one embodiment, a small (less than 1 mm) self sealing incision is made. Through the cornea opposite the seton placement site, an incision is made in trabecular meshwork with an irrigating knife. The seton 31 is then advanced through the cornea incision 52 across the anterior chamber 20 held in an irrigating applicator 51 under gonioscopic (lens) or endoscopic guidance. The applicator is withdrawn and the surgery concluded. The irrigating knife may be within a size range of 20 to 40 gauges, preferably about 30 gauge.",
        "From the foregoing description, it should now be appreciated that a novel approach for the surgical treatment of glaucoma has been disclosed for releasing excessive intraocular pressure. While the invention has been described with reference to a specific embodiment, the description is illustrative of the invention and is not to be construed as limiting the invention. Various modifications and applications may occur to those who are skilled in the art, without departing from the true spirit and scope, of the invention, as described by the appended claims."
    ],
    "citations": [
        "3788327",
        "4037604",
        "4113088",
        "4168697",
        "4175563",
        "4402681",
        "4428746",
        "4501274",
        "4521210",
        "4554918",
        "4583224",
        "4604087",
        "4632842",
        "4634418",
        "4718907",
        "4722724",
        "4733665",
        "4750901",
        "4787885",
        "4804382",
        "4820626",
        "4846172",
        "4846793",
        "4853224",
        "4863457",
        "4883864",
        "4886488",
        "4900300",
        "4936825",
        "4946436",
        "4968296",
        "4997652",
        "5005577",
        "5041081",
        "5073163",
        "5092837",
        "5095887",
        "5127901",
        "5129895",
        "5164188",
        "5171213",
        "5178604",
        "5180362",
        "5207685",
        "5246451",
        "5290295",
        "5300020",
        "5318513",
        "5334137",
        "5338291",
        "5346464",
        "5360399",
        "5370607",
        "5370641",
        "5372577",
        "5397300",
        "5433701",
        "5443505",
        "5454796",
        "5472440",
        "5476445",
        "5486165",
        "5516522",
        "5520631",
        "5557453",
        "5558629",
        "5558630",
        "5558637",
        "5562641",
        "RE35390",
        "5601094",
        "5601549",
        "5626558",
        "5626559",
        "5639278",
        "5651783",
        "5665114",
        "5670161",
        "5676679",
        "5681275",
        "5681323",
        "5702414",
        "5702419",
        "5704907",
        "5713844",
        "5723005",
        "5741333",
        "5743868",
        "5752928",
        "5766242",
        "5766243",
        "5785674",
        "5807302",
        "5810870",
        "5824072",
        "5830139",
        "5830171",
        "5833694",
        "5836939",
        "5840041",
        "5865831",
        "5868697",
        "5879319",
        "5882327",
        "5886822",
        "5893837",
        "5908449",
        "5932299",
        "5968058",
        "5980928",
        "5981598",
        "6004302",
        "6007510",
        "6007511",
        "6033434",
        "6045557",
        "6050970",
        "6050999",
        "6059772",
        "6059812",
        "6063116",
        "6063396",
        "6071286",
        "6077299",
        "6102045",
        "6123668",
        "6142990",
        "6165210",
        "6168575",
        "6174305",
        "6187016",
        "6193656",
        "6197056",
        "6203513",
        "6217895",
        "6228873",
        "6231597",
        "6241721",
        "6251090",
        "6254612",
        "6261256",
        "6266182",
        "6268398",
        "6287256",
        "6287313",
        "6299895",
        "6331313",
        "6342058",
        "6348042",
        "6375642",
        "6413540",
        "6416777",
        "6428501",
        "6436427",
        "6450937",
        "6450984",
        "6464724",
        "6524275",
        "6530896",
        "6533768",
        "6544249",
        "6548078",
        "6579235",
        "6585680",
        "6595945",
        "6622473",
        "6626858",
        "6629981",
        "6638239",
        "6666841",
        "6699211",
        "D490152",
        "6736791",
        "6780165",
        "6783544",
        "6827699",
        "6827700",
        "6955656",
        "7033603",
        "7094225",
        "7135009",
        "2002/0013546",
        "2002/0013572",
        "2002/0026200",
        "2002/0072673",
        "2002/0099434",
        "2002/0133168",
        "2002/0143284",
        "2003/0055372",
        "2003/0060752",
        "2003/0088260",
        "2003/0097151",
        "2003/0181848",
        "2003/0187384",
        "2003/0187385",
        "2003/0229303",
        "2003/0236483",
        "2003/0236484",
        "2004/0024345",
        "2004/0050392",
        "2004/0102729",
        "2004/0111050",
        "2004/0127843",
        "2004/0254520",
        "2005/0038334",
        "2005/0049578",
        "2005/0119737",
        "2005/0192527",
        "200072059",
        "2244646",
        "2244646",
        "198 40 047",
        "198 40 047 A 1",
        "0 858 788",
        "0 858 788",
        "0 898 947",
        "1 114 627",
        "93 11476",
        "2 721 499",
        "2 296 663",
        "2296633",
        "11-123205",
        "11-123205",
        "WO 89/00869",
        "WO89/00869",
        "WO91/18568",
        "WO 91/18568",
        "WO 92/19294",
        "WO94/13234",
        "WO 94/13234",
        "WO 94/21205",
        "WO94/21205",
        "WO 95/08310",
        "WO95/08310",
        "WO 98/30181",
        "WO 98/35639",
        "WO98/35639",
        "WO 99/26567",
        "WO 99/30641",
        "WO99/38470",
        "WO 99/38470",
        "WO 00/13627",
        "WO 00/64389",
        "WO 00/64390",
        "WO 00/64391",
        "WO 00/64393",
        "WO 00/72788",
        "WO 01/50943",
        "WO 01/78631",
        "WO 01/78656",
        "WO 01/78656",
        "WO 03/015659",
        "WO 03/015659",
        "WO 03/073968"
    ],
    "us_classification": "604  8",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "61",
            "subclass": "M",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}