{
    "title": "Bicycloheteroaryl compounds as P2X",
    "abstract": "Bicycloheteroaryl compounds are disclosed that have a formula represented by the following:",
    "inventors": [
        "Kelly",
        "Kincaid"
    ],
    "document_number": "07297700",
    "publication_date": "20071120",
    "assignees": [
        "Renovis, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A bicycloheteroaryl compound capable of modulating P2X",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A compound according to claim 1 wherein each of A, B, Y is CR",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A compound according to claim 1 wherein each of A, B, Y is CH",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A compound according to claim 1 wherein A is CR",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A compound according to claim 1 wherein A is CH",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A compound according to claim 1 wherein each of R",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A compound according to claim 3 wherein one of R",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A compound according to claim 1 wherein each of R",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A compound according to claim 1 wherein the",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A compound according to claim 1 wherein the",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A compound of claim 10 wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A compound of claim 10 wherein each of R",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A compound according to claim 1 wherein the compound is depicted by a formula",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A compound according to claim 13 wherein n is 0.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A compound according to claim 13 wherein n is 1.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A compound of claim 13 wherein each of R",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. A compound of claim 13 wherein each of R",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. A compound of claim 13 wherein two of R",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. A compound of claim 13 wherein one of R",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. A compound according to claim 27 wherein n′ is 1, 2 or 3.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. A compound according to claim 27 wherein each R",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. A compound according to either of claims 1 or 13 wherein L",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. A compound according to either one of claims 1 or 13 wherein each of Z is CH.",
            "components": []
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. A pharmaceutical composition comprising a pharmaceutically acceptable carrier and a pharmaceutically effective amount of a compound of claim 1 .",
            "components": []
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The pharmaceutical composition of claim 33 , wherein the carrier is a parenteral carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. The pharmaceutical composition of claim 33 , wherein the carrier is an oral carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. The pharmaceutical composition of claim 33 , wherein the carrier is a topical carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00037",
            "preamble": "37. A compound according to claim 1 wherein the compound is selected from",
            "components": []
        }
    ],
    "description": [
        "The present application claims the priority of co-pending provisional applications U.S. Ser. No. 60/664,903, filed on Mar. 24, 2005; U.S. Ser. No. 60/709,186 filed on Aug. 18, 2005; U.S. Ser. No. 60/710,077 filed on Aug. 22, 2005; U.S. Ser. No. 60/712,778 filed on Aug. 31, 2005; U.S. Ser. No. 60/721,390 filed on Sep. 28, 2005; and U.S. Ser. No. 60/753,194 filed on Dec. 22, 2005. The disclosures of all of the aforementioned applications are incorporated by reference herein in their entireties. Applicants claim the benefits of these applications under 35 U.S.C. §119(e).",
        "This invention relates to novel compounds of the class bicycloheteroaryls that are capable of modulating P2X7 receptor activity, and to pharmaceutical compositions containing such compounds. This invention also relates to methods for preventing and/or treating conditions that are causally related to aberrant P2X7 activity, such as inflammation-related conditions in mammals, comprising (but not limited to) rheumatoid arthritis, osteoarthritis, Parkinson's disease, uveitis, asthma, cardiovascular conditions including myocardial infarction, the treatment and prophylaxis of pain syndromes (acute and chronic or neuropathic), traumatic brain injury, acute spinal cord injury, neurodegenerative disorders, inflammatory bowel disease and autoimmune disorders, using the compounds and pharmaceutical compositions of the invention.",
        "Cell surface receptors for ATP can be divided into metabotropic (P2Y/P2U) and ionotropic (P2X) classes. The metabotropic class belongs to the superfamily of G protein-coupled receptors, with seven transmembrane segments. The ionotropic class members (P2X1-P2X6) are ligand-gated ion channels, currently thought to be multisubunit proteins with two transmembrane domains per subunit (Buell et al, Europ. J. Neurosci. 8:2221 (1996)). P2Z receptors have been distinguished from other P2 receptors in three primary ways (Buisman et al, Proc. Natl. Acad. Sci. USA 85:7988 (1988); Cockcroft et al, Nature 279:541 (1979); Steinberg et al, J. Biol. Chem. 262:3118 (1987)). First, activation of P2Z receptors leads not only to an inward ionic current, but also to cell permeabilization. Second, 3′-O-(4-benzoyl)benzoyl ATP (BZATP) is the most effective agonist, and ATP itself is of rather low potency. Third, responses are strongly inhibited by extracellular magnesium ions, which has been interpreted to indicate that ATP4—is the active agonist (DiVirgilio, Immunol. Today 16:524 (1995)).",
        "A seventh member of the P2X receptor family has been isolated from a rat cDNA library and, when expressed in human embryonic kidney (HEK293) cells, exhibits the above three properties (Surprenant et al, Science 272:735 (1996)). This receptor (rP2X7) thus corresponds to the P2Z receptor. rP2X7 is structurally related to other members of the P2X family but it has a longer cytoplasmic C-terminus domain (there is 35-40% amino acid identity in the corresponding region of homology, but the C-terminus is 239 amino acids long in the rP2X7 receptor compared with 27-20 amino acids in the others). The rP2X7 receptor functions both as a channel permeable to small cations and as a cytolytic pore. Brief applications of ATP (1-2s) transiently open the channel, as is the case of other P2X receptors. Repeated or prolonged applications of agonist cause cell permeabilization reducing the extracellular magnesium concentration potentiates this effect. The unique C-terminal domain of rP2X7 is required for cell permeabilization and the lytic actions of ATP (Suprenant et al, Science 272:735 (1996)).",
        "The P2Z/rP2X7 receptor has been implicated in lysis of antigen-presenting cells by cytotoxic T lymphocytes, in the mitogenic stimulation of human T lymphocytes, as well as in the formation of multinucleated giant cells (Blanchard et al, Blood 85:3173 (1995); Falzoni et al, J. Clin. Invest. 95:1207 (1995); Baricolrdi et al, Blood 87:682 (1996)). Certain functional differences exist between rodent and man (Hickman et al, Blood 84:2452 (1994)). The human macrophage P2X7 receptor (P2X7) has now been cloned and its functional properties determined (Rassendren et al, J. Biol. Chem. 272:5482 (1997). When compared with the rat P2X7 receptor, elicited cation-selective currents in the human P2X7 receptor required higher concentrations of agonists, were more potentiated by removal of extracellular magnesium ions, and revised more rapidly on agonist removal. Expression of chimeric molecules indicated that some of the differences between rat and human P2X7 receptors could be revised by exchanging the respective C-terminal domains of the receptor proteins.",
        "It has been reported that certain compounds act as P2X7 antagonists. For example, WO99/29660 and WO99/29661 disclose that certain adamantane derivatives exhibit P2X7 antagonistic activity having therapeutic efficacy in the treatment of rheumatoid arthritis and psoriasis. Similarly, WO99/29686 discloses that certain heterocyclic derivatives are P2X7 receptor antagonists and are useful as immunosuppressive agents and treating rheumatoid arthritis, asthma, septic shock and atheroscelerosis. Finally, WO00/71529 discloses certain substituted phenyl compounds exhibiting immunosuppressing activity. All of the references described herein are incorporated herein by reference in their entirety.",
        "A need therefore exists for therapeutic agents, and corresponding pharmaceutical compositions and related methods of treatment, that address the conditions causally related to aberrant P2X7 activity, and it is toward the fulfillment and satisfaction of that need, that the present invention is directed.",
        "Bicycloaryl derivatives of formulas I-VIa, and their pharmaceutical compositions are disclosed as therapeutic agents useful for the treatment of conditions in mammals associated with abnormal or aberrant activity of the P2X7 receptor, including inflammatory-mediated conditions such as (but not limited to) arthritis, myocardial infarction, the treatment and prophylaxis of pain syndromes (acute and chronic [neuropathic]), traumatic brain injury, acute spinal cord injury, neurodegenerative disorders, inflammatory bowel disease and immune dysfunctions such as autoimmune disorders.",
        "It has now been found that the present bicycloheteroaryl compounds are capable of mediating the activity of the P2X7 receptor. This finding leads to novel compounds having therapeutic value. It also leads to pharmaceutical compositions having the compounds of the present invention as active ingredients and to their use to treat, prevent or ameliorate a range of conditions in mammals such as but not limited to inflammation of various genesis or etiology, for example rheumatoid arthritis, cardiovascular disease, inflammatory bowel disease, acute, chronic, inflammatory and neuropathic pain, dental pain and headache (such as migraine, cluster headache and tension headache) and other conditions causally related to inflammation or immune dysfunction.",
        "The compounds of the present invention are also useful for the treatment of inflammatory pain and associated hyperalgesia and allodynia. They are also useful for the treatment of neuropathic pain and associated hyperalgesis and allodynia (e.g. trigeminal or herpetic neuralgia, diabetic neuropathy, causalgia, sympathetically maintained pain and deafferentation syndromes such as brachial plexus avulsion). The compounds of the present invention are also useful as anti-inflammatory agents for the treatment of arthritis, and as agents to treat Parkinson's Disease, uveitis, asthma, myocardial infarction, traumatic brain injury, spinal cord injury, neurodegenerative disorders, inflammatory bowel disease and autoimmune disorders, renal disorders, obesity, eating disorders, cancer, schizophrenia, epilepsy, sleeping disorders, cognition, depression, anxiety, blood pressure, lipid disorders, and atherosclerosis.",
        "In one aspect, this invention provides bicycloheteroaryl compounds which are capable of modulating the activity of the P2X7 receptor, in vivo. In a further aspect, the compounds of the invention are capable of antagonizing (suppressing or inhibiting) the activity of the P2X7 receptor, and thereby treating those conditions, representative ones of which are causally related to aberrant P2X7 activity.",
        "Accordingly, in a first aspect of the invention, bicycloheteroaryl compounds are disclosed that are capable of modulating the activity of the P2X7 receptor in vivo, having a formula (I):",
        "wherein\n        A is selected from CR2′R2″, CO, and CS;\n        B is selected from CR2′, CR2′R2″, CO, and CS;\n        Y is independently selected from CR2′ and CR2′R2″;\n        W, W′ and Z are independently selected from CR4 and N, provided that all three of W, W′ and Z can not be N at the same time;\n        L is a C1-C5 alkylene group, heteroalkyl, 3 to 8 membered cycloalkyl or heterocycloalkyl, alkylcycloalkyl, alkylheterocycloalkyl, cycloalkylalkyl, or heterocycloalkylalkyl group, which can be optionally substituted by a substituent selected from hydroxyl, halogen and C1-C6 alkoxy;\n        n is 1, 2 or 3;\n        R1 is selected from a 3-13 membered cycloalkyl, heterocycloalkyl, aryl and heteroaryl ring system, which can be optionally substituted with one or more substituents independently selected from halo, hydroxyl, amino, cyano, sulfo, sulfanyl, sulfinyl, amido, carboxy, ester, alkyl, substituted alkyl, alkenyl, substituted alkenyl, alkynyl, substituted alkynyl, and sulfonamido; each of R2, R2′ and R2″ is independently selected from hydrogen, substituted or unsubstituted C1-C6 alkyl; or any of R2′ and R2″ can join together to form a cycloalkyl or cycloheteroalkyl ring of 3-7 atoms;\n        R3 is hydrogen or a functional group selected from acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylalkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio; or R3 is a 4-9 membered carbocyclic or heterocyclic ring which can be optionally substituted with at least one substituent selected from a R4 group; or the group “R3-L” is H;\n        R4 is selected from H, alkyl, substituted alkyl, acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylalkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio;\n        and the dotted bond is a single or a double bond;\n        or a pharmaceutically acceptable salt, solvate or prodrug thereof;\n        and stereoisomers and tautomers thereof.",
        "In a second aspect of the invention, bicycloheteroaryl compounds are disclosed that are capable of modulating the activity of the P2X7 receptor in vivo, having a formula (Ia):",
        "wherein\n        A is selected from CR2′R2″, CO, and CS;\n        B is selected from CR2′, CR2′R2″, CO, and CS;\n        Y is independently selected from CR2″ and CR2′R2″;\n        W, W′ and Z are independently selected from CR4 and N, provided that all three of W, W′ and Z can not be N at the same time;\n        L is a C1-C5 alkylene group, heteroalkyl, 3 to 8 membered cycloalkyl or heterocycloalkyl, alkylcycloalkyl, alkylheterocycloalkyl, cycloalkylalkyl, or heterocycloalkylalkyl which can be optionally substituted by a substituent selected from hydroxyl, halogen and C1-C6 alkoxy;\n        n is 1, 2 or 3;\n        R1 is selected from a 3-13 membered cycloalkyl, heterocycloalkyl, aryl and heteroaryl ring system, which can be optionally substituted with one or more substituents independently selected from halo, hydroxyl, amino, cyano, sulfo, sulfanyl, sulfinyl, amido, carboxy, ester, alkyl, substituted alkyl, alkenyl, substituted alkenyl, alkynyl, substituted alkynyl, and sulfonamido;\n        each of R2, R2′ and R2″ is independently selected from hydrogen, substituted or unsubstituted C1-C6 alkyl; or any of R2′ and R2″ can join together to form a cycloalkyl or cycloheteroalkyl ring of 3-7 atoms;\n        R3 is hydrogen or a functional group selected from acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylalkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio; or R3 is a 4-9 membered carbocyclic or heterocyclic ring which can be optionally substituted with at least one substituent selected from a R4 group; or the group “R3-L” is H;\n        R4 is selected from H, alkyl, substituted alkyl, acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylalkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio;\n        and the dotted bond is a single or a double bond;\n        or a pharmaceutically acceptable salt, solvate or prodrug thereof;\n        and stereoisomers and tautomers thereof.",
        "In a further embodiment, with respect to compounds of formula I and Ia, n is 0.",
        "In a further embodiment, with respect to compounds of formula I and Ia, L may be a bond and R3 is selected from H, acyl, substituted acyl, substituted or unsubstituted aminocarbonyl, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, aryloxycarbonyl, substituted aryloxycarbonyl, heteroaryloxycarbonyl, and substituted heteroaryloxycarbonyl.",
        "In a further embodiment, with respect to compounds of formula I and Ia, L is L1; and wherein L1 is a bond, —CO—, —SO2— or a C1-C5 alkylene group which can be optionally substituted by a substituent selected from alkyl, hydroxy, hydroxyalkyl, aminoalkyl, alkylaminoalkyl, dialkylaminoalkyl, halogen, carbamoyl, and C1-C6 alkoxy. In one particular embodiment, when A is CO or CS, L1 is a bond or C1-C5 alkylene group.",
        "In a further embodiment, with respect to compounds of formula I and Ia, L is L1; and wherein L1 is a bond, —CO—, —SO2— or a C1-C5 alkylene group; and R3 is selected from hydrogen, substituted or unsubstituted alkyl, substituted or unsubstituted cycloalkyl, substituted or unsubstituted heterocycloalkyl, substituted or unsubstituted aryl, substituted or unsubstituted heteroaryl, substituted or unsubstituted bicycloaryl, and substituted or unsubstituted bicycloheteroaryl. In one particular embodiment, when R3 is hydrogen L1 is a bond or a C1-C5 alkylene group.",
        "In a further embodiment, with respect to compounds of formula I and Ia, A, B and Y may all represent CR2aR2b. In another embodiment, A is CR2aR2b; and B and Y are independently selected from CR2a and CR2aR2b.",
        "In a further embodiment, with respect to compounds of formula I and Ia, A, B and Y may all represent CH2 and R2 represents hydrogen.",
        "In a further aspect, the present invention provides pharmaceutical compositions comprising a bicycloheteroaryl compound of the invention, and a pharmaceutical carrier, excipient or diluent. In this aspect of the invention, the pharmaceutical composition can comprise one or more of the compounds described herein. Moreover, the compounds of the present invention useful in the pharmaceutical compositions and treatment methods disclosed herein, are all pharmaceutically acceptable as prepared and used.",
        "In a further aspect of the invention, this invention provides a method of treating a mammal susceptible to or afflicted with a condition from among those listed herein, and particularly, such condition as may be associated with e.g. inflammation, such as rheumatoid arthritis, osteoarthritis, uveitis, asthma, myocardial infarction, traumatic brain injury; septic shock, atherosclerosis, chronic pulmonary obstructive disease (COPD), acute spinal cord injury, inflammatory bowel disease and immune dysfunction, including autoimmune disorders, which method comprises administering an effective amount of one or more of the pharmaceutical compositions just described.",
        "In yet another method of treatment aspect, this invention provides a method of treating a mammal susceptible to or afflicted with a condition that is causally related to aberrant P2X7 receptor activity, and that for example, gives rise to pain responses or that relates to imbalances in the maintenance of basal activity of sensory nerves. The amnine compounds of the invention have use as analgesics for the treatment of pain of various geneses or etiology, for example acute, inflammatory pain (such as pain associated with osteoarthritis and rheumatoid arthritis); various neuropathic pain syndromes (such as post-herpetic neuralgia, trigeminal neuralgia, reflex sympathetic dystrophy, diabetic neuropathy, Guillian Barre syndrome, fibromyalgia, phantom limb pain, post-masectomy pain, peripheral neuropathy, HIV neuropathy, and chemotherapy-induced and other iatrogenic neuropathies); visceral pain, (such as that associated with gastroesophageal reflex disease, irritable bowel syndrome, inflammatory bowel disease, pancreatitis, and various gynecological and urological disorders), dental pain and headache (such as migraine, cluster headache and tension headache).",
        "In additional method of treatment aspects, this invention provides methods of treating a mammal susceptible to or afflicted with conditions that are causally related to abnormal activity of the P2X7 receptor, such as neurodegenerative diseases and disorders including, for example, Parkinson's disease, multiple sclerosis; diseases and disorders which are mediated by or result in neuroinflammation such as, for example traumatic brain injury and encephalitis; centrally-mediated neuropsychiatric diseases and disorders such as, for example depression mania, bipolar disease, anxiety, schizophrenia, eating disorders, sleep disorders and cognition disorders; epilepsy and seizure disorders; prostate, bladder and bowel dysfunction such as, for example urinary incontinence, urinary hesitancy, rectal hypersensitivity, fecal incontinence, benign prostatic hypertrophy and inflammatory bowel disease; respiratory and airway disease and disorders such as, for example, allergic rhinitis, asthma and reactive airway disease and chronic obstructive pulmonary disease; diseases and disorders which are mediated by or result in inflammation such as, for example rheumatoid arthritis and osteoarthritis, myocardial infarction, various autoimmune diseases and disorders, uveitis and atherosclerosis; itch/pruritus such as, for example psoriasis; obesity; lipid disorders; cancer; blood pressure; spinal cord injury; and cardiovascular and renal disorders method comprises administering an effective condition-treating or condition-preventing amount of one or more of the pharmaceutical compositions just described.",
        "In additional aspects, this invention provides methods for synthesizing the compounds of the invention, with representative synthetic protocols and pathways disclosed later on herein.",
        "Accordingly, it is a principal object of this invention to provide a novel series of compounds, which can modify the activity of the P2X7 receptor and thus avert or treat any maladies that may be causally related thereto.",
        "It is further an object of this invention to provide a series of compounds that can treat or alleviate maladies or symptoms of same, such as pain and inflammation, that may be causally related to the activation of the P2X7 receptor.",
        "A still further object of this invention is to provide pharmaceutical compositions that are effective in the treatment or prevention of a variety of disease states, including the diseases associated with the central nervous system, cardiovascular conditions, chronic pulmonary obstructive disease COPD), inflammatory bowel disease, rheumatoid arthritis, osteoarthritis, and other diseases where an inflammatory component is present.",
        "Other objects and advantages will become apparent to those skilled in the art from a consideration of the ensuing detailed description.",
        "Definitions",
        "When describing the compounds, pharmaceutical compositions containing such compounds and methods of using such compounds and compositions, the following terms have the following meanings unless otherwise indicated. It should also be understood that, consistent with the scope of the present invention, any of the moieties defined herein and/or set forth below may be substituted with a variety of substituents, and that the respective definitions are intended to include such substituted moieties within their scope. By way of non-limiting example, such substituents may include e.g. halo (such as fluoro, chloro, bromo), —CN, —CF3, —OH, —OCF3, C2-C6 alkenyl, C3-C6 alkynyl, C1-C6 alkoxy, aryl and di-C1-C6 alkylamino.",
        "“Acyl” refers to a radical —C(O)R, where R is hydrogen, alkyl, cycloalkyl, cycloheteroalkyl, aryl, arylalkyl, heteroalkyl, heteroaryl, heteroarylalkyl as defined herein. Representative examples include, but are not limited to, formyl, acetyl, cylcohexylcarbonyl, cyclohexylmethylcarbonyl, benzoyl, benzylcarbonyl and the like.",
        "“Acylamino” refers to a radical —NR′C(O)R, where R′ is hydrogen, alkyl, cycloalkyl, cycloheteroalkyl, aryl, arylalkyl, heteroalkyl, heteroaryl, heteroarylalkyl and R is hydrogen, alkyl, alkoxy, cycloalkyl, cycloheteroalkyl, aryl, arylalkyl, heteroalkyl, heteroaryl or heteroarylalkyl, as defined herein. Representative examples include, but are not limited to, formylamino, acetylamnino, cyclohexylcarbonylamino, cyclohexylmethyl-carbonylamino, benzoylamino, benzylcarbonylamino and the like.",
        "“Acyloxy” refers to the group —OC(O)R where R is hydrogen, alkyl, aryl or cycloalkyl.",
        "“Substituted alkenyl” includes those groups recited in the definition of “substituted” herein, and particularly refers to an alkenyl group having 1 or more substituents, for instance from 1 to 5 substituents, and particularly from 1 to 3 substituents, selected from the group consisting of acyl, acylamino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylamino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, hydroxyl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—.",
        "“Alkoxy” refers to the group —OR where R is alkyl. Particular alkoxy groups include, by way of example, methoxy, ethoxy, n-propoxy, isopropoxy, n-butoxy, tert-butoxy, sec-butoxy, n-pentoxy, n-hexoxy, 1,2-dimethylbutoxy, and the like.",
        "“Substituted alkoxy” includes those groups recited in the definition of “substituted” herein, and particularly refers to an alkoxy group having 1 or more substituents, for instance from 1 to 5 substituents, and particularly from 1 to 3 substituents, selected from the group consisting of acyl, acylamino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylamino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, heteroaryl, hydroxyl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—.",
        "“Alkoxycarbonylamino” refers to the group —NRC(O)OR′ where R is hydrogen, alkyl, aryl or cycloalkyl, and R′ is alkyl or cycloalkyl.",
        "“Aliphatic” refers to hydrocarbyl organic compounds or groups characterized by a straight, branched or cyclic arrangement of the constituent carbon atoms and an absence of aromatic unsaturation. Aliphatics include, without limitation, alkyl, alkylene, alkenyl, alkenylene, alkynyl and alkynylene. Aliphatic groups typically have from 1 or 2 to about 12 carbon atoms.",
        "“Alkyl” refers to monovalent saturated aliphatic hydrocarbyl groups particularly having up to about 11 carbon atoms, more particularly as a lower alkyl, from 1 to 8 carbon atoms and still more particularly, from 1 to 6 carbon atoms. The hydrocarbon chain may be either straight-chained or branched. This term is exemplified by groups such as methyl, ethyl, n-propyl, isopropyl, n-butyl, iso-butyl, tert-butyl, n-hexyl, n-octyl, tert-octyl and the like. The term “lower alkyl” refers to alkyl groups having 1 to 6 carbon atoms. The term “alkyl” also includes “cycloalkyl” as defined below.",
        "“Substituted alkyl” includes those groups recited in the definition of “substituted” herein, and particularly refers to an alkyl group having 1 or more substituents, for instance from 1 to 5 substituents, and particularly from 1 to 3 substituents, selected from the group consisting of acyl, acylamino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylamino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, hydroxyl, heteroaryl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2—, and aryl-S(O)2—.",
        "“Alkylene” refers to divalent saturated aliphatic hydrocarbyl groups particularly having up to about 11 carbon atoms and more particularly 1 to 6 carbon atoms which can be straight-chained or branched. This term is exemplified by groups such as methylene (—CH2—), ethylene (—CH2CH2—), the propylene isomers (e.g., —CH2CH2CH2— and —CH(CH3)CH2—) and the like.",
        "“Substituted alkylene” includes those groups recited in the definition of “substituted” herein, and particularly refers to an alkylene group having 1 or more substituents, for instance from 1 to 5 substituents, and particularly from 1 to 3 substituents, selected from the group consisting of acyl, acylamino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylamino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, halogen, hydroxyl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—.",
        "“Alkenyl” refers to monovalent olefinically unsaturated hydrocarbyl groups preferably having up to about 11 carbon atoms, particularly, from 2 to 8 carbon atoms, and more particularly, from 2 to 6 carbon atoms, which can be straight-chained or branched and having at least 1 and particularly from 1 to 2 sites of olefinic unsaturation. Particular alkenyl groups include ethenyl (—CH═CH2), n-propenyl (—CH2CH═CH2), isopropenyl (—C(CH3)═CH2), vinyl and substituted vinyl, and the like.",
        "“Alkenylene” refers to divalent olefinically unsaturated hydrocarbyl groups particularly having up to about 11 carbon atoms and more particularly 2 to 6 carbon atoms which can be straight-chained or branched and having at least 1 and particularly from 1 to 2 sites of olefinic unsaturation. This term is exemplified by groups such as ethenylene (—CH═CH—), the propenylene isomers (e.g., —CH═CHCH2— and —C(CH3)═CH— and —CH═C(CH3)—) and the like.",
        "“Alkynyl” refers to acetylenically unsaturated hydrocarbyl groups particularly having up to about 11 carbon atoms and more particularly 2 to 6 carbon atoms which can be straight-chained or branched and having at least 1 and particularly from 1 to 2 sites of alkynyl unsaturation. Particular non-limiting examples of alkynyl groups include acetylenic, ethynyl (—C≡CH), propargyl (—CH2C≡CH), and the like.",
        "“Substituted alkynyl” includes those groups recited in the definition of “substituted” herein, and particularly refers to an alkynyl group having 1 or more substituents, for instance from 1 to 5 substituents, and particularly from 1 to 3 substituents, selected from the group consisting of acyl, acylamino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylamino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, hydroxyl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—.",
        "“Alkanoyl” as used herein, which can include “acyl”, refers to the group R—C(O)—, where R is hydrogen or alkyl as defined above.",
        "“Aryl” refers to a monovalent aromatic hydrocarbon group derived by the removal of one hydrogen atom from a single carbon atom of a parent aromatic ring system. Typical aryl groups include, but are not limited to, groups derived from aceanthrylene, acenaphthylene, acephenanthrylene, anthracene, azulene, benzene, chrysene, coronene, fluoranthene, fluorene, hexacene, hexaphene, hexalene, as-indacene, s-indacene, indane, indene, naphthalene, octacene, octaphene, octalene, ovalene, penta-2,4-diene, pentacene, pentalene, pentaphene, perylene, phenalene, phenanthrene, picene, pleiadene, pyrene, pyranthrene, rubicene, triphenylene, trinaphthalene and the like. Particularly, an aryl group comprises from 6 to 14 carbon atoms.",
        "“Substituted Aryl” includes those groups recited in the definition of “substituted” herein, and particularly refers to an aryl group that may optionally be substituted with 1 or more substituents, for instance from 1 to 5 substituents, particularly 1 to 3 substituents, selected from the group consisting of acyl, acylamino, acyloxy, alkenyl, substituted alkenyl, alkoxy, substituted alkoxy, alkoxycarbonyl, alkyl, substituted alkyl, alkynyl, substituted alkynyl, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, hydroxyl, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—.",
        "“Fused Aryl” refers to an aryl having two of its ring carbon in common with a second aryl ring or with an aliphatic ring.",
        "“Alkaryl” refers to an aryl group, as defined above, substituted with one or more alkyl groups, as defined above.",
        "“Aralkyl” or “arylalkyl” refers to an alkyl group, as defined above, substituted with one or more aryl groups, as defined above.",
        "“Aryloxy” refers to —O-aryl groups wherein “aryl” is as defined above.",
        "“Alkylamino” refers to the group alkyl-NR′—, wherein R′ is selected from hydrogen and alkyl.",
        "“Arylamino” refers to the group aryl-NR′—, wherein R′ is selected from hydrogen, aryl and heteroaryl.",
        "“Alkoxyamino” refers to a radical —N(H)OR where R represents an alkyl or cycloalkyl group as defined herein.",
        "“Alkoxycarbonyl” refers to a radical —C(O)-alkoxy where alkoxy is as defined herein.",
        "“Alkylarylamino” refers to a radical —NRR′ where R represents an alkyl or cycloalkyl group and R′ is an aryl as defined herein.",
        "“Alkylsulfonyl” refers to a radical —S(O)2R where R is an alkyl or cycloalkyl group as defined herein. Representative examples include, but are not limited to, methylsulfonyl, ethylsulfonyl, propylsulfonyl, butylsulfonyl and the like.",
        "“Alkylsulfinyl” refers to a radical —S(O)R where R is an alkyl or cycloalkyl group as defined herein. Representative examples include, but are not limited to, methylsulfinyl, ethylsulfinyl, propylsulfinyl, butylsulfinyl and the like.",
        "“Alkylthio” refers to a radical —SR where R is an alkyl or cycloalkyl group as defined herein that may be optionally substituted as defined herein. Representative examples include, but are not limited to, methylthio, ethylthio, propylthio, butylthio, and the like.",
        "“Amino” refers to the radical —NH2.",
        "“Substituted amino” includes those groups recited in the definition of “substituted” herein, and particularly refers to the group —N(R)2 where each R is independently selected from the group consisting of hydrogen, alkyl, substituted alkyl, alkenyl, substituted alkenyl, alkynyl, substituted alkynyl, aryl, cycloalkyl, substituted cycloalkyl, and where both R groups are joined to form an alkylene group. When both R groups are hydrogen, —N(R)2 is an amino group.",
        "“Amninocarbonyl” or “amido” refers to the group —C(O)NRR where each R is independently hydrogen, alkyl, aryl and cycloalkyl, or where the R groups are joined to form an alkylene group.",
        "“Aminocarbonylamino” refers to the group —NRC(O)NRR where each R is independently hydrogen, alkyl, aryl or cycloalkyl, or where two R groups are joined to form an alkylene group.",
        "“Aminocarbonyloxy” refers to the group —OC(O)NRR where each R is independently hydrogen, alkyl, aryl or cycloalky, or where the R groups are joined to form an alkylene group.",
        "“Arylalkyloxy” refers to an —O-arylalkyl radical where arylalkyl is as defined herein.",
        "“Arylamino” means a radical —NHR where R represents an aryl group as defined herein.",
        "“Aryloxycarbonyl” refers to a radical —C(O)—O-aryl where aryl is as defined herein.",
        "“Arylsulfonyl” refers to a radical —S(O)2R where R is an aryl or heteroaryl group as defined herein.",
        "“Azido” refers to the radical —N3.",
        "“Bicycloaryl” refers to a monovalent aromatic hydrocarbon group derived by the removal of one hydrogen atom from a single carbon atom of a parent bicycloaromatic ring system. Typical bicycloaryl groups include, but are not limited to, groups derived from indane, indene, naphthalene, tetrahydronaphthalene, and the like. Particularly, an aryl group comprises from 8 to 11 carbon atoms.",
        "“Bicycloheteroaryl” refers to a monovalent bicycloheteroaromatic group derived by the removal of one hydrogen atom from a single atom of a parent bicycloheteroaromatic ring system. Typical bicycloheteroaryl groups include, but are not limited to, groups derived from benzofuran, benzimidazole, benzindazole, benzdioxane, chromene, chromane, cinnoline, phthalazine, indole, indoline, indolizine, isobenzofuran, isochromene, isoindole, isoindoline, isoquinoline, benzothiazole, benzoxazole, naphthyridine, benzoxadiazole, pteridine, purine, benzopyran, benzpyrazine, pyridopyrinudine, quinazoline, quinoline, quinolizine, quinoxaline, benzomorphan, tetrahydroisoquinoline, tetrahydroquinoline, and the like. Preferably, the bicycloheteroaryl group is between 9-11 membered bicycloheteroaryl, with 5-10 membered heteroaryl being particularly preferred. Particular bicycloheteroaryl groups are those derived from benzothiophene, benzofuran, benzothiazole, indole, quinoline, isoquinoline, benzimidazole, benzoxazole and benzdioxane.",
        "“Carbamoyl” refers to the radical —C(O)N(R)2 where each R group is independently hydrogen, alkyl, cycloalkyl or aryl, as defined herein, which may be optionally substituted as defined herein.",
        "“Carboxy” refers to the radical —C(O)OH.",
        "“Carboxyamino” refers to the radical —N(H)C(O)OH.",
        "“Cycloalkyl” refers to cyclic hydrocarbyl groups having from 3 to about 10 carbon atoms and having a single cyclic ring or multiple condensed rings, including fused and bridged ring systems, which optionally can be substituted with from 1 to 3 alkyl groups. Such cycloalkyl groups include, by way of example, single ring structures such as cyclopropyl, cyclobutyl, cyclopentyl, cyclooctyl, 1-methylcyclopropyl, 2-methylcyclopentyl, 2-methylcyclooctyl, and the like, and multiple ring structures such as adamantanyl, and the like.",
        "“Substituted cycloalkyl” includes those groups recited in the definition of “substituted” herein, and particularly refers to a cycloalkyl group having 1 or more substituents, for instance from 1 to 5 substituents, and particularly from 1 to 3 substituents, selected from the group consisting of acyl, acylamino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylamino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, hydroxyl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—.",
        "“Cycloalkoxy” refers to the group —OR where R is cycloalkyl. Such cycloalkoxy groups include, by way of example, cyclopentoxy, cyclohexoxy and the like.",
        "“Cycloalkenyl” refers to cyclic hydrocarbyl groups having from 3 to 10 carbon atoms and having a single cyclic ring or multiple condensed rings, including fused and bridged ring systems and having at least one and particularly from 1 to 2 sites of olefinic unsaturation. Such cycloalkenyl groups include, by way of example, single ring structures such as cyclohexenyl, cyclopentenyl, cyclopropenyl, and the like.",
        "“Substituted cycloalkenyl” includes those groups recited in the definition of “substituted” herein, and particularly refers to a cycloalkenyl group having 1 or more substituents, for instance from 1 to 5 substituents, and particularly from 1 to 3 substituents, selected from the group consisting of acyl, acylamino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylarnino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, hydroxyl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—.",
        "“Fused Cycloalkenyl” refers to a cycloalkenyl having two of its ring carbon atoms in common with a second aliphatic or aromatic ring and having its olefinic unsaturation located to impart aromaticity to the cycloalkenyl ring.",
        "“Cyanato” refers to the radical —OCN.",
        "“Cyano” refers to the radical —CN.",
        "“Dialkylamino” means a radical —NRR′ where R and R′ independently represent an alkyl, substituted alkyl, aryl, substituted aryl, cycloalkyl, substituted cycloalkyl, cycloheteroalkyl, substituted cycloheteroalkyl, heteroaryl, or substituted heteroaryl group as defined herein.",
        "“Ethenyl” refers to substituted or unsubstituted —(C═C)—.",
        "“Ethylene” refers to substituted or unsubstituted —(C—C)—.",
        "“Ethynyl” refers to —(C≡C)—.",
        "“Halo” or “halogen” refers to fluoro, chloro, bromo and iodo. Preferred halo groups are either fluoro or chloro.",
        "“Hydroxy” refers to the radical —OH.",
        "“Nitro” refers to the radical —NO2.",
        "“Substituted” refers to a group in which one or more hydrogen atoms are each independently replaced with the same or different substituent(s). Typical substituents include, but are not limited to, —X, —R14, —O−, ═O, —OR14, —SR14, —S−, ═S, —NR14R15, ═NR14, —CX3, —CF3, —CH, —OCN, —SCN, —NO, —NO2, ═N2, —N3, —S(O)2O−, —S(O)2OH, —S(O)2R14, —OS(O2)O−, —OS(O)2R14, —P(O)(O—)2, —P(O)(OR14)(O−), —OP(O)(OR14)(OR5), —C(O)R14, —C(S)R14, —C(O)OR14, —C(O)NR14R15, —C(O)O−, —C(S)OR14, —NR16C(O)NR14R15, —NR16C(S)NR14R15, —NR17C(NR16)NR14R15 and —C(NR16)NR14R15, where each X is independently a halogen; each R14, R15, R16 and R17 are independently hydrogen, alkyl, substituted alkyl, aryl, substituted alkyl, arylalkyl, substituted alkyl, cycloalkyl, substituted alkyl, cycloheteroalkyl, substituted cycloheteroalkyl, heteroalkyl, substituted heteroalkyl, heteroaryl, substituted heteroaryl, heteroarylalkyl, substituted heteroarylalkyl, —NR18R19, —C(O)R18 or —S(O)2R18 or optionally R18 and R19 together with the atom to which they are both attached form a cycloheteroalkyl or substituted cycloheteroalkyl ring; and R18 and R19 are independently hydrogen, alkyl, substituted alkyl, aryl, substituted alkyl, arylalkyl, substituted alkyl, cycloalkyl, substituted alkyl, cycloheteroalkyl, substituted cycloheteroalkyl, heteroalkyl, substituted heteroalkyl, heteroaryl, substituted heteroaryl, heteroarylalkyl or substituted heteroarylalkyl.",
        "Examples of representative substituted aryls include the following",
        "",
        "In these formulae one of R6′ and R7′ may be hydrogen and at least one of R6′ and R7′ is each independently selected from alkyl, alkenyl, alkynyl, cycloheteroalkyl, alkanoyl, alkoxy, aryloxy, heteroaryloxy, alkylamino, arylarnino, heteroarylamino, NR10COR11, NR10SOR11, NR10SO2R14, COOalkyl, COOaryl, CONR10R11, CONR10OR11, NR10R11, SO2NR10R11, S-alkyl, S-alkyl, SOalkyl, SO2alkyl, Saryl, SOaryl, SO2aryl; or R6′ and R7′ may be joined to form a cyclic ring (saturated or unsaturated) from 5 to 8 atoms, optionally containing one or more heteroatoms selected from the group N, O or S. R10, R11, and R12 are independently hydrogen, alkyl, alkenyl, alkynyl, perfluoroalkyl, cycloalkyl, cycloheteroalkyl, aryl, substituted aryl, heteroaryl, substituted or hetero alkyl or the like.",
        "“Hetero” when used to describe a compound or a group present on a compound means that one or more carbon atoms in the compound or group have been replaced by a nitrogen, oxygen, or sulfur heteroatom. Hetero may be applied to any of the hydrocarbyl groups described above such as alkyl, e.g. heteroalkyl, cycloalkyl, e.g. cycloheteroalkyl, aryl, e.g. heteroaryl, cycloalkenyl, cycloheteroalkenyl, and the like having from 1 to 5, and especially from 1 to 3 heteroatoms.",
        "“Heteroaryl” refers to a monovalent heteroaromatic group derived by the removal of one hydrogen atom from a single atom of a parent heteroaromatic ring system. Typical heteroaryl groups include, but are not limited to, groups derived from acridine, arsindole, carbazole, β-carboline, chromane, chromene, cinnoline, furan, imidazole, indazole, indole, indoline, indolizine, isobenzofuran, isochromene, isoindole, isoindoline, isoquinoline, tetrahydroisoquinoline, isothiazole, isoxazole, naphthyridine, oxadiazole, oxazole, perimidine, phenanthridine, phenanthroline, phenazine, phthalazine, pteridine, purine, pyran, pyrazine, pyrazole, pyridazine, pyridine, pyrimidine, pyrrole, pyrrolizine, quinazoline, quinoline, tetrahydroquinoline, quinolizine, quinoxaline, tetrazole, thiadiazole, thiazole, thiophene, triazole, xanthene, and the like. Particularly, heteroaryl can include other saturated ring systems, and can therefore be derived from indoline, indolizine, tetrahydroquinoline, and tetrahydroisoquinoline. Preferably, the heteroaryl group is between 5-20 membered heteroaryl, with 5-10 membered heteroaryl being particularly preferred. Particular heteroaryl groups are those derived from thiophene, pyrrole, benzothiophene, benzofuran, indole, pyridine, pyrimidine, quinoline, tetrahydroquinoline, isoquinoline, tetrahydroisoquinoline, imidazole, oxazole and pyrazine.",
        "Examples of representative heteroaryls include the following:",
        "wherein each Y is selected from carbonyl, N, NR4, O, and S, where R4 is as defined herein.",
        "Examples of representative cycloheteroalkyls include the following",
        "wherein each X is selected from CR42, NR4, O and S; and each Y is selected from NR4, O and S, and where R6′ is R2, R2 and R4 being as defined herein.",
        "Examples of representative cycloheteroalkenyls include the following:",
        "wherein each X is selected from CR4, NR4, O and S; and each Y is selected from carbonyl, N, NR4, O and S, where R4 is as defined herein.",
        "Examples of representative aryl having hetero atoms containing substitution include the following:",
        "wherein each X is selected from C—R4, CR42, NR4, O and S; and each Y is selected from carbonyl, NR4, O and S, where R4 is as defined herein.",
        "“Hetero substituent” refers to a halo, O, S or N atom-containing functionality that may be present as an R4 in a CR4 group present as substituents directly on W or Z of the compounds of this invention or may be present as a substituent in the “substituted” aryl, heteroaryl and aliphatic groups present in the compounds.",
        "Examples of hetero substituents include:\n\n    \n    \n        -halo,\n        —NO2, —NH2, —NHR, —N(R)2,\n        —NRCOR, —NRSOR, —NRSO2R, OH, CN, CO2R,\n        —CO2H,\n        —O—R,\n        —CON(R)2, —CONROR,\n        —SO3H, —S—R, —SO2N(R)2,\n        —S(O)R, and —S(O)2R,\n\nwherein each R is independently an aryl or aliphatic, optionally with substitution. Among hetero substituents containing R groups, preference is given to those materials having aryl and alkyl R groups as defined herein. Where feasible, each R may include hydrogen. Also, where feasible, two R groups when on same atom may join to form a heterocyclic ring of 3-8 atoms. For example, two R groups of NR2, SO2NR2, and CONR2 may join, together with the N atom, to form a N-morpholino, N-pyrrolo, N-piperidino, and N-pyrazolylo ring. Preferred hetero substituents are those listed above.",
        "As used herein, the term “cycloheteroalkyl” refers to a stable heterocyclic non-aromatic ring and fused rings containing one or more heteroatoms independently selected from N, O and S. A fused heterocyclic ring system may include carbocyclic rings and need only include one heterocyclic ring.",
        "Examples of heterocyclic rings include, but are not limited to, piperazinyl, homopiperazinyl, piperidinyl and morpholinyl, and are shown in the following illustrative examples:",
        "optionally substituted with one or more groups selected from the group consisting of acyl, acylamnino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylamino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, hydroxyl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—. Substituting groups include carbonyl or thiocarbonyl which provide, for example, lactam and urea derivatives. In the examples, M is CR7, NR2, O or S; Q is O, NR2 or S, where R2 is as defined herein. R7 and R8 are independently selected from the group consisting of acyl, acylamino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylanino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, hydroxyl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—.",
        "“Dihydroxyphosphoryl” refers to the radical —PO(OH)2.",
        "“Substituted dihydroxyphosphoryl” includes those groups recited in the definition of “substituted” herein, and particularly refers to a dihydroxyphosphoryl radical wherein one or both of the hydroxyl groups are substituted. Suitable substituents are described in detail below.",
        "“Aminohydroxyphosphoryl” refers to the radical —PO(OH)NH2.",
        "“Substituted aminohydroxyphosphoryl” includes those groups recited in the definition of “substituted” herein, and particularly refers to an aminohydroxyphosphoryl wherein the amino group is substituted with one or two substituents. Suitable substituents are described in detail below. In certain embodiments, the hydroxyl group can also be substituted.",
        "“Thioalkoxy” refers to the group —SR where R is alkyl.",
        "“Substituted thioalkoxy” includes those groups recited in the definition of “substituted” herein, and particularly refers to a thioalkoxy group having 1 or more substituents, for instance from 1 to 5 substituents, and particularly from 1 to 3 substituents, selected from the group consisting of acyl, acylamino, acyloxy, alkoxy, substituted alkoxy, alkoxycarbonyl, alkoxycarbonylamino, amino, substituted amino, aminocarbonyl, aminocarbonylamino, aminocarbonyloxy, aryl, aryloxy, azido, carboxyl, cyano, cycloalkyl, substituted cycloalkyl, halogen, hydroxyl, keto, nitro, thioalkoxy, substituted thioalkoxy, thioaryloxy, thioketo, thiol, alkyl-S(O)—, aryl-S(O)—, alkyl-S(O)2— and aryl-S(O)2—.",
        "“Sulfanyl” refers to the radical HS—. “Substituted sulfanyl” refers to a radical such as RS— wherein R is any substituent described herein.",
        "“Sulfonyl” refers to the divalent radical —S(O2)—. “Substituted sulfonyl” refers to a radical such as S(O2)—R wherein R is any substituent described herein. “Aminosulfonyl” or “Sulfonamide” refers to the radical H2N(O2)S—, and “substituted aminosulfonyl” “substituted sulfonamide” refers to a radical such as R2N(O2)S— wherein each R is independently any substituent described herein.",
        "“Sulfoxide” refers to the divalent radical —S(O)—. “Substituted sulfoxide” refers to a radical such as S(O)—R, wherein R is any substituent described herein.",
        "“Sulfone” refers to the group —SO2R. In particular embodiments, R is selected from H, lower alkyl, alkyl, aryl and heteroaryl.",
        "“Thioaryloxy” refers to the group —SR where R is aryl.",
        "“Thioketo” refers to the group ═S.",
        "“Thiol” refers to the group —SH.",
        "One having ordinary skill in the art of organic synthesis will recognize that the maximum number of heteroatoms in a stable, chemically feasible heterocyclic ring, whether it is aromatic or non aromatic, is determined by the size of the ring, the degree of unsaturation and the valence of the heteroatoms. In general, a heterocyclic ring may have one to four heteroatoms so long as the heteroaromatic ring is chemically feasible and stable.",
        "“Pharmaceutically acceptable” means approved by a regulatory agency of the Federal or a state government or listed in the U.S. Pharmacopoeia or other generally recognized pharmacopoeia for use in animals, and more particularly in humans.",
        "“Pharmaceutically acceptable salt” refers to a salt of a compound of the invention that is pharmaceutically acceptable and that possesses the desired pharmacological activity of the parent compound. Such salts include: (1) acid addition salts, formed with inorganic acids such as hydrochloric acid, hydrobromic acid, sulfuric acid, nitric acid, phosphoric acid, and the like; or formed with organic acids such as acetic acid, propionic acid, hexanoic acid, cyclopentanepropionic acid, glycolic acid, pyruvic acid, lactic acid, malonic acid, succinic acid, malic acid, maleic acid, fumaric acid, tartaric acid, citric acid, benzoic acid, 3-(4-hydroxybenzoyl) benzoic acid, cinnamic acid, mandelic acid, methanesulfonic acid, ethanesulfonic acid, 1,2-ethane-disulfonic acid, 2-hydroxyethanesulfonic acid, benzenesulfonic acid, 4-chlorobenzenesulfonic acid, 2-naphthalenesulfonic acid, 4-toluenesulfonic acid, camphorsulfonic acid, 4-methylbicyclo[2.2.2]-oct-2-ene-1-carboxylic acid, glucoheptonic acid, 3-phenylpropionic acid, trimethylacetic acid, tertiary butylacetic acid, lauryl sulfuric acid, gluconic acid, glutamic acid, hydroxynaphthoic acid, salicylic acid, stearic acid, muconic acid, and the like; or (2) salts formed when an acidic proton present in the parent compound either is replaced by a metal ion, e.g., an alkali metal ion, an alkaline earth ion, or an aluminum ion; or coordinates with an organic base such as ethanolamine, diethanolamine, triethanolamine, N-methylglucamine and the like. Salts further include, by way of example only, sodium, potassium, calcium, magnesium, ammonium, tetraalkylammonium, and the like; and when the compound contains a basic functionality, salts of non toxic organic or inorganic acids, such as hydrochloride, hydrobromide, tartrate, mesylate, acetate, maleate, oxalate and the like. The term “pharmaceutically acceptable cation” refers to a non toxic, acceptable cationic counter-ion of an acidic functional group. Such cations are exemplified by sodium, potassium, calcium, magnesium, ammonium, tetraalkylammonium cations, and the like.",
        "“Pharmaceutically acceptable vehicle” refers to a diluent, adjuvant, excipient or carrier with which a compound of the invention is administered.",
        "“Preventing” or “prevention” refers to a reduction in risk of acquiring a disease or disorder (i.e., causing at least one of the clinical symptoms of the disease not to develop in a subject that may be exposed to or predisposed to the disease but does not yet experience or display symptoms of the disease).",
        "“Prodrugs” refers to compounds, including derivatives of the compounds of the invention,which have cleavable groups and become by solvolysis or under physiological conditions the compounds of the invention which are pharmaceutically active in vivo. Such examples include, but are not limited to, choline ester derivatives and the like, N-alkylmorpholine esters and the like.",
        "“Solvate” refers to forms of the compound that are associated with a solvent, usually by a solvolysis reaction. Conventional solvents include water, ethanol, acetic acid and the like. The compounds of the invention may be prepared e.g. in crystalline form and may be solvated or hydrated. Suitable solvates include pharmaceutically acceptable solvates, such as hydrates, and further include both stoichiometric solvates and non-stoichiometric solvates.",
        "“Subject” includes humans. The terms “human,” “patient” and “subject” are used interchangeably herein.",
        "“Therapeutically effective amount” means the amount of a compound that, when administered to a subject for treating a disease, is sufficient to effect such treatment for the disease. The “therapeutically effective amount” can vary depending on the compound, the disease and its severity, and the age, weight, etc., of the subject to be treated.",
        "“Treating” or “treatment” of any disease or disorder refers, in one embodiment, to ameliorating the disease or disorder (i.e., arresting or reducing the development of the disease or at least one of the clinical symptoms thereof). In another embodiment “treating” or “treatment” refers to ameliorating at least one physical parameter, which may not be discernible by the subject. In yet another embodiment, “treating” or “treatment” refers to modulating the disease or disorder, either physically, (e.g., stabilization of a discernible symptom), physiologically, (e.g., stabilization of a physical parameter), or both. In yet another embodiment, “treating” or “treatment” refers to delaying the onset of the disease or disorder, or even preventing the same.",
        "It is also to be understood that compounds that have the same molecular formula but differ in the nature or sequence of bonding of their atoms or the arrangement of their atoms in space are termed “isomers”. Isomers that differ in the arrangement of their atoms in space are termed “stereoisomers”.",
        "Stereoisomers that are not mirror images of one another are termed “diastereomers” and those that are non-superimposable mirror images of each other are termed “enantiomers”. When a compound has an asymmetric center, for example, it is bonded to four different groups, a pair of enantiomers is possible. An enantiomer can be characterized by the absolute configuration of its asymmetric center and is described by the R- and S-sequencing rules of Cahn and Prelog, or by the manner in which the molecule rotates the plane of polarized light and designated as dextrorotatory or levorotatory (i.e., as (+) or (−)-isomers respectively). A chiral compound can exist as either individual enantiomer or as a mixture thereof. A mixture containing equal proportions of the enantiomers is called a “racemic mixture”.",
        "“Tautomers” refer to compounds that are interchangeable forms of a particular compound structure, and that vary in the displacement of hydrogen atoms and electrons. Thus, two structures may be in equilibrium through the movement of π electrons and an atom (usually H). For example, enols and ketones are tautomers because they are rapidly interconverted by treatment with either acid or base. Another example of tautomerism is the aci- and nitro-forms of phenylnitromethane, that are likewise formed by treatment with acid or base. Representative enol-keto structures and equilibrium are illustrated below:",
        "",
        "Tautomeric forms may be relevant to the attainment of the optimal chemical reactivity and biological activity of a compound of interest.",
        "The compounds of this invention may possess one or more asymmetric centers; such compounds can therefore be produced as individual (R)- or (S)-stereoisomers or as mixtures thereof. Unless indicated otherwise, the description or naming of a particular compound in the specification and claims is intended to include both individual enantiomers and mixtures, racemic or otherwise, thereof. The methods for the determination of stereochemistry and the separation of stereoisomers are well-known in the art.",
        "The present invention provides bicycloheteroaryl compounds useful for preventing and/or treating a broad range of conditions, associated with abnormalities in the activity of the P2X7 receptor, among them, rheumatoid arthritis, Parkinson's disease, uveitis, asthma, cardiovascular conditions such as myocardial infarction, the treatment and prophylaxis of pain syndromes (acute and chronic or neuropathic), traumatic brain injury, acute spinal cord injury, neurodegenerative disorders, inflammatory bowel disease and immune dysfunctions such as autoimmune disorders or conditions, in mammals.",
        "In a first aspect of the invention, bicycloheteroaryl compounds are disclosed that are capable of modulating the activity of the P2X7 receptor in vivo, having a formula (I):",
        "wherein\n        A is selected from CR2′R2″, CO, and CS;\n        B is selected from CR2′, CR2′R2″, CO, and CS;\n        Y is independently selected from CR2′ and CR2′R2′;\n        W, W′ and Z are independently selected from CR4 and N, provided that all three of W, W′ and Z can not be N at the same time;\n        L is a C1-C5 alkylene group, heteroalkyl, 3 to 8 membered cycloalkyl or heterocycloalkyl, alkylcycloalkyl, alkylheterocycloalkyl, cycloalkylalkyl, or heterocycloalkylalkyl group, which can be optionally substituted by a substituent selected from hydroxyl, halogen and C1-C6 alkoxy;\n        n is 1, 2 or 3;\n        R1 is selected from a 3-13 membered cycloalkyl, heterocycloalkyl, aryl and heteroaryl ring system, which can be optionally substituted with one or more substituents independently selected from halo, hydroxyl, amino, cyano, sulfo, sulfanyl, sulfinyl, amido, carboxy, ester, alkyl, substituted alkyl, alkenyl, substituted alkenyl, alkynyl, substituted alkynyl, and sulfonamido; each of R2, R2′ and R2″ is independently selected from hydrogen, substituted or unsubstituted C1-C6 alkyl; or any of R2′ and R2″ can join together to form a cycloalkyl or cycloheteroalkyl ring of 3-7 atoms;\n        R3 is hydrogen or a functional group selected from acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylalkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio; or R3 is a 4-9 membered carbocyclic or heterocyclic ring which can be optionally substituted with at least one substituent selected from a R4 group; or the group “R3-L” is H;\n        R4 is selected from H, alkyl, substituted alkyl, acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylalkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio; and the dotted bond is a single or a double bond;\n        or a pharmaceutically acceptable salt, solvate or prodrug thereof;\n        and stereoisomers and tautomers thereof.",
        "In another aspect the present invention provides bicycloheteroaryl compounds bicycloheteroaryl compounds are disclosed that are capable of modulating the activity of the P2X7 receptor in vivo, having a formula (Ia):",
        "wherein\n        A is selected from CR2′R2″, CO, and CS;\n        B is selected from CR2′, CR2′R2″, CO, and CS;\n        Y is independently selected from CR2′ and CR2′R2″;\n        W, W′ and Z are independently selected from CR4 and N, provided that all three of W, W′ and Z can not be N at the same time;\n        L is a C1-C5 alkylene group, heteroalkyl, 3 to 8 membered cycloalkyl or heterocycloalkyl, alkylcycloalkyl, alkylheterocycloalkyl, cycloalkylalkyl, or heterocycloalkylalkyl group, which can be optionally substituted by a substituent selected from hydroxyl, halogen and C1-C6 alkoxy;\n        n is 1, 2 or 3;\n        R1 is selected from a 3-13 membered cycloalkyl, heterocycloalkyl, aryl and heteroaryl ring system, which can be optionally substituted with one or more substituents independently selected from halo, hydroxyl, amino, cyano, sulfo, sulfanyl, sulfinyl, amido, carboxy, ester, alkyl, substituted alkyl, alkenyl, substituted alkenyl, alkynyl, substituted alkynyl, and sulfonamido; each of R2, R2′ and R2″ is independently selected from hydrogen, substituted or unsubstituted C1-C6 alkyl; or any of R2′ and R2″ can join together to form a cycloalkyl or cycloheteroalkyl ring of 3-7 atoms;\n        R3 is hydrogen or a functional group selected from acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylalkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio; or R3 is a 4-9 membered carbocyclic or heterocyclic ring which can be optionally substituted with at least one substituent selected from a R4 group; or the group “R3-L” is H;\n        R4 is selected from H, alkyl, substituted alkyl, acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylalkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio; and the dotted bond is a single or a double bond;\n        or a pharmaceutically acceptable salt, solvate or prodrug thereof;\n        and stereoisomers and tautomers thereof.",
        "In a further embodiment as to compounds of formula I and Ia, n may be 0.",
        "In a further embodiment, with respect to compounds of formula I and Ia, L may be a bond and R3 is selected from H, acyl, substituted acyl, substituted or unsubstituted aminocarbonyl, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, aryloxycarbonyl, substituted aryloxycarbonyl, heteroaryloxycarbonyl, and substituted heteroaryloxycarbonyl.",
        "In a further embodiment, with respect to compounds of formula I and Ia, L is L1; and wherein L1 is a bond, —CO—, —SO2— or a C1-C5 alkylene group which can be optionally substituted by a substituent selected from alkyl, hydroxy, hydroxyalkyl, aminoalkyl, alkylaminoalkyl, dialkylaminoalkyl, halogen, carbamoyl, and C1-C6 alkoxy. In one particular embodiment, when A is CO or CS, L1 is a bond or C1-C5 alkylene group.",
        "In a further embodiment, with respect to compound of formula I and Ia, L is L1; and wherein L1 is a bond, —CO—, —SO2— or a C1-C5 alkylene group; and R3 is selected from hydrogen, substituted or unsubstituted alkyl, substituted or unsubstituted cycloalkyl, substituted or unsubstituted heterocycloalkyl, substituted or unsubstituted aryl, substituted or unsubstituted heteroaryl, substituted or unsubstituted bicycloaryl, and substituted or unsubstituted bicycloheteroaryl. In one particular embodiment, when R3 is hydrogen, L1 is a bond or a C1-C5 alkylene group.",
        "In a further embodiment, with respect to compound of formula I and Ia, A, B and Y may all represent CR2aR2b. In another embodiment, A is CR2aR2b; and B and Y are independently selected from CR2a and CR2aR2b.",
        "In another aspect the present invention provides bicycloheteroaryl compounds bicycloheteroaryl compounds are disclosed that are capable of modulating the activity of the P2X7 receptor in vivo, having a formula (II or Ia):",
        "wherein\n        A is selected from CR2aR2b;\n        B and Y are independently selected from CR2a and CR2aR2b;\n        W, W′ and Z are independently selected from CR4 and N, provided that all three of W, W′ and Z can not be N at the same time;\n        L1 is a bond, —CO—, —SO2— or a C1-C5 alkylene group which can be optionally substituted by a substituent selected from alkyl, hydroxy, hydroxyalkyl, aminoalkyl, alkylaminoalkyl, dialkylaminoalkyl, halogen, carbamoyl, and C1-C6 alkoxy;\n        n is 0, 1, 2 or 3;\n        R1 is selected from a 3-13 membered cycloalkyl, heterocycloalkyl, aryl and heteroaryl ring system, which can be optionally substituted with one or more substituents independently selected from halo, hydroxyl, amino, cyano, sulfo, sulfanyl, sulfinyl, amido, carboxy, ester, alkyl, substituted alkyl, alkenyl, substituted alkenyl, alkynyl, substituted alkynyl, and sulfonamido;\n        each of R2, R2a, R2b, R2′ and R2″ is independently selected from hydrogen, substituted or unsubstituted C1-C6 alkyl; or any of R2′ and R2″ can join together to form a cycloalkyl or cycloheteroalkyl ring of 3-7 atoms;\n        R3 is selected from hydrogen, substituted or unsubstituted alkyl, substituted or unsubstituted cycloalkyl, substituted or unsubstituted heterocycloalkyl, substituted or unsubstituted aryl, substituted or unsubstituted heteroaryl, substituted or unsubstituted bicycloaryl, and substituted or unsubstituted bicycloheteroaryl;\n        R4 is selected from H, alkyl, substituted alkyl, acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylalkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio; and the dotted bond is a single or a double bond;\n        or a pharmaceutically acceptable salt, solvate or prodrug thereof;\n        and stereoisomers and tautomers thereof.",
        "In one particular embodiment, with respect to compounds of formula II and IIa, when R3 is hydrogen, L1 is a bond or a C1-C5 alkylene group.",
        "In a further embodiment, with respect to compounds of formula II and IIa, A, B and Y may all represent CR2aR2b and the dotted bond is a single bond.",
        "In a further embodiment, with respect to compounds of formula II and IIa, A is CR2aR2b; and B and Y each represent CR2a and the dotted bond is a double bond.",
        "In a further embodiment, with respect to compounds of formula II and IIa, A, B and Y may all represent CH2 and the dotted bond is a single bond.",
        "In a further embodiment, with respect to compounds of formula II and IIa, A is CH2; and B and Y each represent CH and the dotted bond is a double bond.",
        "In one embodiment, with respect to compounds of formula II and IIa, W′ is N.",
        "In another embodiment, with respect to compounds of formula II and IIa, W′ is CR4.",
        "In another embodiment, with respect to compounds of formula II and IIa, W′ is CR4 and R4′ is selected from hydrogen, halo, alkoxy, alkyl, and dialkylamino.",
        "In another embodiment, with respect to compounds of formula II and IIa each of R2′ and R2″ of the",
        "group is H.",
        "In another embodiment, with respect to compound of formula II and IIa, wherein one of R2′ and R2″ of the",
        "group is Me and the other is H.",
        "In another embodiment, with respect to compounds of formula II and IIa, each of R2′ and R2″ of the",
        "group is Me.",
        "In another embodiment, with respect to compounds of formula II and IIa, n is 0 or 1. In one particular embodiment, n is 0. In yet another particular embodiment, n is 1.",
        "In another embodiment, with respect to compounds of formula II and IIa, wherein the",
        "group is selected from substituted or unsubstituted",
        "",
        "In another embodiment, with respect to compound of formula II and IIa, wherein the",
        "group is",
        "and wherein Ra, Rb and Rc are independently selected from H, halo, hydroxyl, substituted hydroxyl, alkyl, substituted alkyl, amino, substituted amino, aryl and substituted aryl.",
        "In another embodiment, with respect to compounds of formula II and IIa, the",
        "group is as described in the preceding paragraph, and Ra, Rb and Rc are independently selected from H, Br, Cl, OH, Me, NHAc, Ph and F. In one particular embodiment, each of Ra, Rb and Rc is H.",
        "In another aspect the present invention provides bicycloheteroaryl compounds and bicycloheteroaryl compounds are disclosed that are capable of modulating the activity of the P2X7 receptor in vivo, and that have a formula (III, IIIa, IV or IVa):",
        "wherein L1, R3, W, Z, W′ and n are as described for formula II or IIa; and wherein Ra, Rb and Rc are independently selected from H, halo, hydroxyl, substituted hydroxyl, alkyl, substituted alkyl, amino, substituted amino, aryl and substituted aryl.",
        "In one embodiment, with respect to compounds of formulae II-IVa, each of W, W′ and Z is independently CR4.",
        "In one embodiment, with respect to compounds of formulae II-IVa, each of W, W′ and Z is independently CH.",
        "In one embodiment, with respect to compounds of formulae II-IVa, W′ is C-Me and W and Z both are CHs.",
        "In one embodiment, with respect to compounds of formulae II-IVa, W′ is N and W and Z both are CR4s.",
        "In one embodiment, with respect to compounds of formulae II-IVa, W′ is N and W and Z both are CHs.",
        "In one embodiment, with respect to compounds of formulae II-IVa, Z is CR4 and W and W′ both are Ns.",
        "In one embodiment, with respect to compounds of formulae II-IVa, Z is CH and W and W′ both are Ns.",
        "In one embodiment, with respect to compounds of formulae II-IVa, Z is N and W and W′ both are CR4s.",
        "In another aspect the present invention provides bicycloheteroaryl compounds and bicycloheteroaryl compounds are disclosed, that are capable of modulating the activity of the P2X7 receptor in vivo, having a formula (V, Va, VI or VIa):",
        "and wherein L1, R3, Z, and n are as described for formula II or ha; and wherein Ra, Rb and Rc are independently selected from H, halo, hydroxyl, substituted hydroxyl, alkyl, substituted alkyl, amino, substituted amino, aryl and substituted aryl.",
        "In one embodiment, with respect to compounds of formulae II-VIa, n is 0.",
        "In another embodiment, with respect to compounds of formulae II-VIa, n is 1.",
        "In one embodiment, with respect to compounds of formulae II-VIa, each of Ra, Rb and Rc is H.",
        "In one embodiment, with respect to compounds of formulae II-VIa, each of Ra, Rb and Rc is Me.",
        "In another embodiment, with respect to compounds of formulae II-VIa, two of Ra, Rb and Rc is Me.",
        "In another embodiment, with respect to compounds of formulae II-VIa, one of Ra, Rb and Rc is OH.",
        "In another embodiment, with respect to compounds of formulae II-VIa, Z is CR4′ and R4′ is selected from hydrogen, halo, alkoxy, alkyl, and dialkylamino.",
        "In one embodiment, with respect to compounds of formulae II-VIa, L1 is a bond and R3 is H.",
        "In another embodiment, with respect to compounds of formulae II-VIa, L1 is a C1-C5 alkylene group which can be optionally substituted by a substituent selected from alkyl, hydroxy, hydroxyalkyl, aminoalkyl, alkylaminoalkyl, dialkylaminoalkyl, halogen, carbamoyl, and C1-C6 alkoxy; and R3 is H.",
        "In another embodiment, with respect to compounds of formulae II-VIa, L1 is —CO—, or —SO2—.",
        "In another embodiment, with respect to compounds of formulae II-VIa, L1 is C1-C5 alkylene group which can be optionally substituted by a substituent selected from alkyl, hydroxy, hydroxyalkyl, aminoalkyl, alkylaminoalkyl, dialkylaminoalkyl, halogen, carbamoyl, and C1-6 alkoxy.",
        "Further in accordance with compounds of formulae II-VIa, L1 may be a substituted or unsubstituted C1-C6 alkylene group, and particularly, may be CH2, —(CH2)2—, —(CH2)3—, or —(CH2)4—.",
        "In one embodiment, with respect to compounds of formulae II-VIa, R3 is substituted or unsubstituted alkyl.",
        "In one particular embodiment, with respect to compounds of formulae II-VIa, R3 is substituted alkyl; and the substitution on alkyl is selected from aryl, heteroaryl, cycloalkyl, heteroalkyl, halo, alkoxy, hydroxy, cyano, and aryloxy. In another particular embodiment, the substitution on alkyl is selected from Ph, Cl, F, Br, CN, OH, OMe, OPh, CF3, CHF2, OCF3, t-Bu, SMe, SOMe, SO2Me, SO3H, SO3Me, pyridyl, cyclopropyl, cyclopentyl and cyclohexyl.",
        "Still further in accordance with the invention, and with respect to the compounds of formalae II-VIa, where present, -L1-R3 may be selected from H, Me, Et, benzyl, —(CH2)3—OH, —(CH2)4—NHMe, —(CH2)4—OH, —(CH2)2—CH(OH)—CH2OH, —(CH2)4—CO2H, —(CH2)4—NHEt, —(CH2)3—NHEt, —(CH2)2—NH—(CH2)2OH, —(CH2)3—NH—(CH2)3OH, —(CH2)4—NH2, —(CH2)3—NHCONHSO2Me, —(CH2)3—NH—(CH2)2-Me, or —(CH2)2CO2H.",
        "In one embodiment, with respect to compounds of formulae II-VIa, L1 is a —CO—, —SO2— or a C1-C5 alkylene group and R3 is substituted or unsubstituted aryl.",
        "In one particular embodiment, with respect to compounds of formulae II-VIa, L1 is a —CO—, —SO2— or a C1-C5 alkylene group and R3 is",
        "and wherein n′ is selected from 1-5 and each of R4′ is independently selected from hydrogen, alkyl, substituted alkyl, acyl, substituted acyl, substituted or unsubstituted acylamino, substituted or unsubstituted alkylamino, substituted or unsubstituted alkythio, substituted or unsubstituted alkoxy, aryloxy, alkoxycarbonyl, substituted alkoxycarbonyl, substituted or unsubstituted alkylarylamino, arylkyloxy, substituted arylalkyloxy, amino, aryl, substituted aryl, arylalkyl, substituted or unsubstituted sulfoxide, substituted or unsubstituted sulfone, substituted or unsubstituted sulfanyl, substituted or unsubstituted aminosulfonyl, substituted or unsubstituted arylsulfonyl, sulfuric acid, sulfuric acid ester, substituted or unsubstituted dihydroxyphosphoryl, substituted or unsubstituted aminodihydroxyphosphoryl, azido, carboxy, substituted or unsubstituted carbamoyl, cyano, substituted or unsubstituted cycloalkyl, substituted or unsubstituted cycloheteroalkyl, substituted or unsubstituted dialkylamino, halo, heteroaryloxy, substituted or unsubstituted heteroaryl, substituted or unsubstituted heteroalkyl, hydroxy, nitro, and thio.",
        "In one particular embodiment, n′ is 1, 2 or 3. In another particular embodiment, n′ is 1, or 2. In yet another particular embodiment, n′ is 1.",
        "In one particular embodiment, each R4′ is independently selected from Me, Et, Ph, Cl, F, Br, CN, OH, OMe, OPh, COPh, CF3, CHF2, OCF3, t-Bu, SMe, CH═CH—CO2H, SOMe, SO2Me, SO3H, SO3Me, and pyridyl.",
        "In one particular embodiment, with respect to compound of formulae II-VIa, L1 is a —CO—, —SO2— or a C1-C5 alkylene group and R3 is substituted or unsubstituted cycloalkyl, heterocycloalkyl, heteroaryl, bicycloaryl or bicycloheteroaryl. In another particular embodiment, the substitution is selected from Me, Et, Ph, Cl, F, Br, CN, OH, OMe, OPh, COPh, CF3, CHF2, OCF3, t-Bu, SMe, CH═CH—CO2H, SOMe, SO2Me, SO3H, and SO3Me.",
        "In one particular embodiment, with respect to compound of formulae II-VIa, L1 is a —CO—, —SO2— or a C1-C5 alkylene group and R3 is substituted or unsubstituted naphthalene, furanyl, thiophenyl, pyrrolyl, pyrazolyl, imidazolyl, triazolyl, pyridyl, pyrimidinyl, quinoline, isoquinolinyl, tetrahydroquinolinyl, tetrahydroisoquinolinyl, indolyl, benzopyranyl, benzofuranyl, benzoxazinyl, or benzodioxanyl. In another particular embodiment, the substitution is selected from Me, Et, Ph, Cl, F, Br, CN, OH, OMe, OPh, COPh, CF3, CHF2, OCF3, t-Bu, SMe, CH═CH—CO2H, SOMe, SO2Me, SO3H, and SO3Me.",
        "In certain aspects, the present invention provides prodrugs and derivatives of the compounds according to the formulae above. Prodrugs are derivatives of the compounds of the invention, which have metabolically cleavable groups and become by solvolysis or under physiological conditions the compounds of the invention, which are pharmaceutically active, in vivo. Such examples include, but are not limited to, choline ester derivatives and the like, N-alkylmorpholine esters and the like.",
        "Other derivatives of the compounds of this invention have activity in both their acid and acid derivative forms, but the acid sensitive form often offers advantages of solubility, tissue compatibility, or delayed release in the mammalian organism (see, Bundgard, H., Design of Prodrugs, pp. 7-9, 21-24, Elsevier, Amsterdam 1985). Prodrugs include acid derivatives well know to practitioners of the art, such as, for example, esters prepared by reaction of the parent acid with a suitable alcohol, or amides prepared by reaction of the parent acid compound with a substituted or unsubstituted amine, or acid anhydrides, or mixed anhydrides. Simple aliphatic or aromatic esters, amides and anhydrides derived from acidic groups pendant on the compounds of this invention are preferred prodrugs. In some cases it is desirable to prepare double ester type prodrugs such as (acyloxy)alkyl esters or ((alkoxycarbonyl)oxy)alkylesters. Preferred are the C1 to C8 alkyl, C2-C8 alkenyl, aryl, C7-C12 substituted aryl, and C7-C12 arylalkyl esters of the compounds of the invention.",
        "When employed as pharmaceuticals, the compounds of this invention are typically administered in the form of a pharmaceutical composition. Such compositions can be prepared in a manner well known in the pharmaceutical art and comprise at least one active compound.",
        "Generally, the compounds of this invention are administered in a pharmaceutically effective amount. The amount of the compound actually administered will typically be determined by a physician, in the light of the relevant circumstances, including the condition to be treated, the chosen route of administration, the actual compound-administered, the age, weight, and response of the individual patient, the severity of the patient's symptoms, and the like.",
        "The pharmaceutical compositions of this invention can be administered by a variety of routes including oral, rectal, transdermal, subcutaneous, intravenous, intramuscular, and intranasal. Depending on the intended route of delivery, the compounds of this invention are preferably formulated as either injectable or oral compositions or as salves, as lotions or as patches all for transdermal administration.",
        "The compositions for oral administration can take the form of bulk liquid solutions or suspensions, or bulk powders. More commonly, however, the compositions are presented in unit dosage forms to facilitate accurate dosing. The term “unit dosage forms” refers to physically discrete units suitable as unitary dosages for human subjects and other mammals, each unit containing a predetermined quantity of active material calculated to produce the desired therapeutic effect, in association with a suitable pharmaceutical excipient. Typical unit dosage forms include prefilled, premeasured ampules or syringes of the liquid compositions or pills, tablets, capsules or the like in the case of solid compositions. In such compositions, the furansulfonic compound is usually a minor component (from about 0.1 to about 50% by weight or preferably from about 1 to about 40% by weight) with the remainder being various vehicles or carriers and processing aids helpful for forming the desired dosing form.",
        "Liquid forms suitable for oral administration may include a suitable aqueous or nonaqueous vehicle with buffers, suspending and dispensing agents, colorants, flavors and the like. Solid forms may include, for example, any of the following ingredients, or compounds of a similar nature: a binder such as microcrystalline cellulose, gum tragacanth or gelatin; an excipient such as starch or lactose, a disintegrating agent such as alginic acid, Primogel, or corn starch; a lubricant such as magnesium stearate; a glidant such as colloidal silicon dioxide; a sweetening agent such as sucrose or saccharin; or a flavoring agent such as peppermint, methyl salicylate, or orange flavoring.",
        "Injectable compositions are typically based upon injectable sterile saline or phosphate-buffered saline or other injectable carriers known in the art. As before, the active compound in such compositions is typically a minor component, often being from about 0.05 to 10% by weight with the remainder being the injectable carrier and the like.",
        "Transdermal compositions are typically formulated as a topical ointment or cream containing the active ingredient(s), generally in an amount ranging from about 0.01 to about 20% by weight, preferably from about 0.1 to about 20% by weight, preferably from about 0.1 to about 10% by weight, and more preferably from about 0.5 to about 15% by weight. When formulated as a ointment, the active ingredients will typically be combined with either a paraffinic or a water-miscible ointment base. Alternatively, the active ingredients may be formulated in a cream with, for example an oil-in-water cream base. Such transdermal formulations are well-known in the art and generally include additional ingredients to enhance the dermal penetration of stability of the active ingredients or the formulation. All such known transdermal formulations and ingredients are included within the scope of this invention.",
        "The compounds of this invention can also be administered by a transdermal device. Accordingly, transdermal administration can be accomplished using a patch either of the reservoir or porous membrane type, or of a solid matrix variety.",
        "The above-described components for orally administrable, injectable or topically administrable compositions are merely representative. Other materials as well as processing techniques and the like are set forth in Part 8 of Remington's Pharmaceutical Sciences, 17th edition, 1985, Mack Publishing Company, Easton, Pa., which is incorporated herein by reference.",
        "The compounds of this invention can also be administered in sustained release forms or from sustained release drug delivery systems. A description of representative sustained release materials can be found in Remington's Pharmaceutical Sciences.",
        "The following formulation examples illustrate representative pharmaceutical compositions of this invention. The present invention, however, is not limited to the following pharmaceutical compositions.",
        "A compound of the invention is admixed as a dry powder with a dry gelatin binder in an approximate 1:2 weight ratio. A minor amount of magnesium stearate is added as a lubricant. The mixture is formed into 240-270 mg tablets (80-90 mg of active amide compound per tablet) in a tablet press.",
        "A compound of the invention is admixed as a dry powder with a starch diluent in an approximate 1:1 weight ratio. The mixture is filled into 250 mg capsules (125 mg of active amide compound per capsule).",
        "A compound of the invention (125 mg), sucrose (1.75 g) and xanthan gum (4 mg) are blended, passed through a No. 10 mesh U.S. sieve, and then mixed with a previously made solution of microcrystalline cellulose and sodium carboxymethyl cellulose (11:89, 50 mg) in water. Sodium benzoate (10 mg), flavor, and color are diluted with water and added with stirring. Sufficient water is then added to produce a total volume of 5 mL.",
        "A compound of the invention is admixed as a dry powder with a dry gelatin binder in an approximate 1:2 weight ratio. A minor amount of magnesium stearate is added as a lubricant. The mixture is formed into 450-900 mg tablets (150-300 mg of active amide compound) in a tablet press.",
        "A compound of the invention is dissolved or suspended in a buffered sterile saline injectable aqueous medium to a concentration of approximately 5 mg/ml.",
        "Stearyl alcohol (250 g) and a white petrolatum (250 g) are melted at about 75° C. and then a mixture of a compound of the invention (50 g) methylparaben (0.25 g), propylparaben (0.15 g), sodium lauryl sulfate (10 g), and propylene glycol (120 g) dissolved in water (about 370 g) is added and the resulting mixture is stirred until it congeals.",
        "The present compounds are used as therapeutic agents for the treatment of conditions in mammals that are causally related or attributable to aberrant activity of the P2X7 receptor. Accordingly, the compounds and pharmaceutical compositions of this invention find use as therapeutics for preventing and/or treating autoimmune, inflammatory and cardiovascular conditions in mammals including humans.",
        "In a method of treatment aspect, this invention provides a method of treating a mammal susceptible to or afflicted with a condition associated with arthritis, uveitis, asthma, myocardial infarction, traumatic brain injury, acute spinal cord injury, inflammatory bowel disease and autoimmune disorders, which method comprises administering an effective amount of one or more of the pharmaceutical compositions just described.",
        "In yet another method of treatment aspect, this invention provides a method of treating a mammal susceptible to or afflicted with a condition that gives rise to pain responses or that relates to imbalances in the maintenance of basal activity of sensory nerves. The present amines have use as analgesics for the treatment of pain of various geneses or etiology, for example acute, inflammatory pain (such as pain associated with osteoarthritis and rheumatoid arthritis); various neuropathic pain syndromes (such as post-herpetic neuralgia, trigeminal neuralgia, reflex sympathetic dystrophy, diabetic neuropathy, Guillian Barre syndrome, fibromyalgia, phantom limb pain, post-masectomy pain, peripheral neuropathy, HIV neuropathy, and chemotherapy-induced and other iatrogenic neuropathies); visceral pain, (such as that associated with gastroesophageal reflex disease, irritable bowel syndrome, inflammatory bowel disease, pancreatitis, and various gynecological and urological disorders), dental pain and headache (such as migraine, cluster headache and tension headache).",
        "In additional method of treatment aspects, this invention provides methods of treating a mammal susceptible to or afflicted with neurodegenerative diseases and disorders such as, for example Parkinson's disease, multiple sclerosis; diseases and disorders which are mediated by or result in neuroinflammation such as, for example traumatic brain injury, and encephalitis; centrally-mediated neuropsychiatric diseases and disorders such as, for example depression mania, bipolar disease, anxiety, schizophrenia, eating disorders, sleep disorders and cognition disorders; epilepsy and seizure disorders; prostate, bladder and bowel dysfunction such as, for example urinary incontinence, urinary hesitancy, rectal hypersensitivity, fecal incontinence, benign prostatic hypertrophy and inflammatory bowel disease; respiratory and airway disease and disorders such as, for example, allergic rhinitis, asthma and reactive airway disease and chronic obstructive pulmonary disease; diseases and disorders which are mediated by or result in inflammation such as, for example rheumatoid arthritis and osteoarthritis, myocardial infarction, various autoimmune diseases and disorders, uveitis and atherosclerosis; itch/pruritus such as, for example psoriasis; obesity; lipid disorders; cancer; blood pressure; spinal cord injury; and renal disorders method comprises administering an effective condition-treating or condition-preventing amount of one or more of the pharmaceutical compositions just described.",
        "As a further aspect of the invention there is provided the present amine compounds for use as a pharmaceutical especially in the treatment or prevention of the aforementioned conditions and diseases. We also provide use of a present amine compound in the manufacture of a medicament for the treatment or prevention of one of the aforementioned conditions and diseases.",
        "Injection dose levels range from about 0.1 mg/kg/hour to at least 10 mg/kg/hour, all for from about 1 to about 120 hours and especially 24 to 96 hours. A preloading bolus of from about 0.1 mg/kg to about 10 mg/kg or more may also be administered to achieve adequate steady state levels. The maximum total dose is not expected to exceed about 2 g/day for a 40 to 80 kg human patient.",
        "For the prevention and/or treatment of long-term conditions, such as neurodegenerative and autoimmune conditions, the regimen for treatment usually stretches over many months or years so oral dosing is preferred for patient convenience and tolerance. With oral dosing, one to five and especially two to four and typically three oral doses per day are representative regimens. Using these dosing patterns, each dose provides from about 0.01 to about 20 mg/kg of the compound of the invention, with preferred doses each providing from about 0.1 to about 10 mg/kg and especially about 1 to about 5 mg/kg.",
        "Transdermal doses are generally selected to provide similar or lower blood levels than are achieved using injection doses.",
        "When used to prevent the onset of a neurodegenerative, autoimmune or inflammatory condition, the compounds of this invention will be administered to a patient at risk for developing the condition, typically on the advice and under the supervision of a physician, at the dosage levels described above. Patients at risk for developing a particular condition generally include those that have a family history of the condition, or those who have been identified by genetic testing or screening to be particularly susceptible to developing the condition.",
        "The compounds of this invention can be administered as the sole active agent or they can be administered in combination with other agents, including other compounds that demonstrate the same or a similar therapeutic activity, and that are determined to safe and efficacious for such combined administration.",
        "The bicycloheteroaryl compounds of this invention can be prepared from readily available starting materials using the following general methods and procedures. It will be appreciated that where typical or preferred process conditions (i.e., reaction temperatures, times, mole ratios of reactants, solvents, pressures, etc.) are given, other process conditions can also be used unless otherwise stated. Optimum reaction conditions may vary with the particular reactants or solvent used, but such conditions can be determined by one skilled in the art by routine optimization procedures.",
        "Additionally, as will be apparent to those skilled in the art, conventional protecting groups may be necessary to prevent certain functional groups from undergoing undesired reactions. The choice of a suitable protecting group for a particular functional group as well as suitable conditions for protection and deprotection are well known in the art. For example, numerous protecting groups, and their introduction and removal, are described in T. W. Greene and P. G. M. Wuts, Protecting Groups in Organic Synthesis, Second Edition, Wiley, N.Y., 1991, and references cited therein.",
        "The following schemes are presented with details as to the preparation of representative bicycloheteroaryls that have been listed hereinabove. The compounds of the invention may be prepared from known or commercially available starting materials and reagents by one skilled in the art of organic synthesis.",
        "The intermediate heteroaryl amines, heteroaryl acids, acid chlorides (Intermediate 1-16) can be obtained using synthetic methods given below.",
        "",
        "Ethyl 1-benzyl-3-oxopiperidine-4-carboxylate (30 g, 101 mmol) was combined with formamidine aceate (10.5 g, 101 mmol) and EtOH (450 mL) in a 2-liter flask. The resulting mixture was stirred at 0° C. and treated with NaOEt (21% in EtOH) (112.6 mL, 299 mmol). The reaction was heated at 60° C. overnight and monitored for completion via 1 cms and TLC (DCM:MeOH:: 95:5). Additional ethyl 1-benzyl-3-oxopiperidine-4-carboxylate (2 g, 6.6 mmol) was added after 12 h with continued heating at 60° C. The reaction was complete after 4 h as indicated by LCMS. The cooled reaction was reduced in vacuo and the residue was treated concentrated HCl (300 mL) and stirred overnight at room temperature. The solvents were removed under vacuum and the resulting solids treated with EtOH (300 mL), stirred for 15 minutes, and then filtered. The mother liquor was discarded and the precipitate dried in a vacuum oven affording 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-ol (44 g) as the tri-HCl salt which was used directly in the next step.",
        "LCMS (ESI+) m/z 242.2 [M+H]+",
        "1H NMR (300 MHz CD3OD) δ 7.98 (s, 1H), 7.35-7.32 (m, 5H), 3.72 (s, 2H), 3.41-3.40 (m, 2H), 2.75 (t 2H), 2.57 (m, 2H).",
        "",
        "7-Benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-ol.HCl (35.5 g, 0.101 mol) was added in a 250 ml round bottom flask, equipped with a reflux condenser, followed by the addition of POCl3 (100.5 g, 0.655 mol). The resulting mixture was refluxed for 4 h under argon, cooled to room temperature, and diluted with DCM (200 mL). The crude reaction was then poured into ice-cold water (200 mL) and stirred overnight at 0° C. The layers were separated and the pH of aqueous layer was carefully adjusted to 7 via the addition of satd. NaHCO3. The aqueous layer was extracted with DCM (3×100 mL) and the combined organics washed with satd. NaHCO3 (50 mL), dried over anhyd. Na2SO4, and reduced in vacuo to yield 7-benzyl-4-chloro-5,6,7,8-tetrahydropyrido[3,4-d]pyriridine as a viscous dark brown oil (21 g, 80%).",
        "LCMS (ESI+) m/z 260.1 [M+H]+",
        "1H NMR (300 MHz CD3OD) δ 8.68 (s, 1H), 7.36-7.29 (m, 5H), 3.75 (s, 2H), 3.65 (s, 2H), 3.65 (s, 2H), 2.86 (s, 4H).",
        "",
        "7-Benzyl-4-chloro-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine (9.83 g, 38 mmol) was dissolved in solution of NH3 in MeOH (7N, 60 mL) in a re-sealable tube. The sealed tube was heated at 100° C. for 21 h. The reaction was cooled to room temperature and kept standing at room temperature for 48 h which led to the precipitation of the desired product 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine. (5.1 g, 56%). The mother liquor was evaporated and dried under vacuum to yield a mixture of 4.12 g of desired product together with the side product 7-benzyl-4-methoxy-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine.",
        "LCMS (ESI+) m/z 241.3 [M+H]+",
        "1H-NMR (300 MHz, CDCl3) δ 8.33 (s, 1H), 7.28 (m, 5H), 4.86 (br ‘s’, 2H), 3.69 (s, 2H, 3.55 (s, 2H), 2.79 (t, 2H), 2.48 (t, 2H).",
        "13C NMR (75 MHz, CDCl3) δ 161.2, 161.1, 155.8, 137.6, 129.3, 128.6, 127.5, 110.2, 62.6, 57.6, 49.5, 23.2.",
        "",
        "To a solution of 7-benzyl-4-methoxy-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine and 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine (1.2 g, 5 mmol (based on 5)) in THF (15 mL was added NaH (60% in mineral oil) (0.04 g, 1.67 mmol) and the resulting mixture was stirred for 1 h. 1-adamant-1-yl -acetyl chloride (1.11 g, 0.86 mmol) was then added to the reaction mixture and the reaction stirred at room temperature for 18 h. The reaction was monitored by LCMS and treated with an additional amount each of NaH (0.3 g) and 1-adamant-1-yl-acetyl chloride (0.3 g). Upon completion the reaction mixture was treated with saturated. NaHCO3 (50 mL) and extracted with EtOAc (2×50 ml). The combined organics were dried over anhydrous Na2SO4, filtered and concentrated to yield 2-Adamantan-1-yl-N-(7-benzyl-5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-acetamide (2.06 g)",
        "LCMS (ESI+) m/z 417.5 [M+H]+",
        "1H-NMR (300 MHz, CDCl3) δ 8.68 (s, 1H), 7.50 (s, 1H), 7.30 (m, 5H), 3.70 (s, 4H), 2.74 (s, 4H), 2.30 (s, 2H), 1.98 (br ‘s’, 3H), 1.65 (m, 12H).",
        "",
        "To a solution of 2-adamantan-1-yl-N-(7-benzyl-5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin 4-yl)-acetamide in glacial acetic acid (15 mL) in a 250 ml round bottom flask was added 10% Pd/C (0.45 g). The resulting mixture was stirred for 15 h under an atmosphere of hydrogen (via a balloon), which was introduced after evacuation of air from the reaction vessel. The reaction was then filtered over celite, washed with EtOAc (20 mL) and the filtrate concentrated under reduced pressure. The residue was re-dissolved on EtOAc (50 mL) and stirred with aq. 10% NaOH solution (50 mL) for 1 h. The layers were separated and the aqueous layer washed with EtOAc (5×50 mL). The combined organics were dried over anhyd. Na2SO4, filtered and concentrated to yield 2-adamantan-1-yl-N-(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-acetamide (0.68 g, 2.1 mmol, 87%) as a tan colored solid. LCMS (ESI+) m/z 327.3 [M+H]+",
        "1H-NMR (300 MHz, CDCl3) δ 8.70 (s, 1H), 7.73 (s, 1H), 4.06 (s, 2H), 3.13 (t, J=5.7 Hz, 2H), 2.66 (t, 2H), 2.29 (s, 2H), 1.99 (br s, 3H), 1.71 (m, 12H).",
        "",
        "The bromide (24.32 g, 100 mmol) in dichloroethane was added into 90% H2SO4 solution at 10° C. (cold water bath). The reaction mixture was stirred at 10° C. for 1 hr. Then BF3 etherate (2.84 g, 20 mmol) was added dropwise in 30 minutes via a syringe. The reaction mixture was stirred at 10-15° C. for 2 more hours with additional BF3 etherate was added until complete consumption of the starting bromide before pouring onto ice. The water was adjusted to pH=9 followed by extraction with ether. The aqueous layer was acidified with HCl to pH=3 followed by extraction with ether, dried, removal of organic solvent to give solid product, which was taken on directly to the next step.",
        "1H NMR (300 MHz, CD3Cl3), 2.13 (s, 2H), 1.74 (s, 1H), 1.02-1.38 (m, 12H), δ 0.82(s, 6H),",
        "",
        "Into a flask containing 3,5-dimethyl-adamantan-1-yl)-acetic acid in toluene (50 ml) was added SOCl2 and 1 drop of DMF. Reaction was then heated to 60° C. for 1 hour. After removal of solvent and co-evaporation with toluene (2 ml), the crude product was used without further purification.",
        "",
        "3,5,7-trimethyl adamantane-1-carboxylic acid was converted to it's acid chloride per the procedure described for 3,5-dimethyl-adamantan-1-yl)-acetic acid. It was then homologated to the corresponding benzyl ester via the procedure described in Tetrahedron Letters, 1980, 21, 4461-4462. The benzyl ester was converted to the acid by standard hydrogenation conditions of 10% Pd/C in MeOH/EtOAc::1:1. The acid was then converted to the acid chloride via standard treatment with thionyl chloride at reflux for 1 to 2 hours. Excess reagent was azeotropically removed with hexanes and the resulting acid chloride was used without further purification.",
        "",
        "The methyl ester was prepared via the route described in Tetrahedron Letters, 1978, 17, 1455-1458. Thus 1-bromoadamantane (6.17 g, 28.7 mmol), (1-methoxy-2-methylprop-1-enyloxy)-trimethylsilane (5.5 g, 31.6 mmol), and ZnCl2 (300 mg) in DCM (40 ml) was stirred at rt for 3 days. The reaction was monitored for the disappearance of the bromide by LCMS and worked up according to the literature reference.",
        "The methyl ester was dissolved in DMSO (15 ml) and treated with NaSMe (6.654 g, 9.3 mmol, 2 equiv.) and heated at 80° C. for 3 h. The reaction was cooled to room temperature and treated with 100 ml of water, extracted with Et2O and the layers were then separated. The aqueous layer was acidified to ph 3 to give 1.07 g of 2-Adamantan-1-yl-2-methyl-propionic acid as a white solid.",
        "2-Adamantan-1-yl-2-methyl-propionyl chloride was prepared via treatment with SOCl2 at reflux for 1 to 2 h. Excess reagent was removed under reduced pressure and the mixture azeotroped with hexanes and the resulting acid chloride was used without further purification in the next step.",
        "",
        "Prepared in an analogous manner to that for 2-Adamantan-1-yl-2-methyl-propionyl chloride, Intermediate 5.",
        "",
        "The reaction was performed in DMF under an inert atmosphere as follows: 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimdin-4-amine (30 mg, 0.012 mmol) in 1 ml of DMF was treated with 15 mg of NaH and the result stirred at rt for 10 minutes. 40 uL intermediate 3 was added and stirring continued for 1 h at rt. After quenching with water (8 ml) and Satd. NaHCO3 (10 ml) the resulting mixture was extracted with Et2O. The combined organics were concentrated under reduced pressure to give the crude product, which was purified by HPLC to give the pure product (19 mg, 0.042 mmol) in a 35% yield.",
        "",
        "In a 20 ml microwave vessel was added 7-benzyl-5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-ylamine (1.5 g, 6.3 mmole) in 7.0 ml of chloroform, diisopropylethylarnine (2.2 ml, 12.6 mmole) and 1-adamantane carbonylchloride (2.51 g, 12.6 mmole). The reaction was heated at 160° C. for 7.0 minutes in a microwave. After completion the solvent was evaporated and the residue was dissolved in EtOAc and washed with sat. NaHCO3, washed with brine and dried over sodium sulphate. The solvents were removed under reduced pressure and the residue was chromatographed using chloroform (100%) to give the desired product as a white solid (1.06 g).",
        "ESI-MS m/z 403 [M+H]+.",
        "The following examples were prepared in a manner analogous to that given for Method A or Method B using 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine and the appropriate intermediate acid or acid chloride as listed in the table below.",
        "Prepared by reacting 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine with cyclohexylacetyl chloride.",
        "Prepared by reacting 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine with cycloheptylacetyl chloride.",
        "Prepared by reacting 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine with 3-(3-methoxyphenyl)propanoyl chloride.",
        "Prepared by reacting 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine with Intermediate 5.",
        "Prepared by reacting 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine with Intermediate 3.",
        "Prepared by reacting 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine with Intermediate 7.",
        "Prepared by reacting 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine with Intermediate 4.",
        "Prepared by reacting 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine with Intermediate 6.",
        "Prepared by reacting 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-amine with 3,5,7-trimethyl-adamantane-1-carbonyl chloride.",
        "The following examples were prepared by debezylation of the corresponding N-benzyl derivatives and in a manner analogous to that given for the preparation of 2-adamantan-1-yl-N-(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-acetamide (Compound 6).",
        "Prepared by debenzylation of Compound 9.",
        "Prepared by debenzylation of Compound 10.",
        "Prepared by debenzylation of Compound 24.",
        "Prepared by debenzylation of Compound 339.",
        "Prepared by debenzylation of Compound 341",
        "",
        "Adamantane-1-carboxylic acid (7-benzyl-5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-amide (1.1 g, 2.64 mmole) was suspended in 30 ml of methanol. To the mixture was added palladium hydroxide on carbon (20% wt, 0.41 g) and the reaction was shaken under 60 PSI of hydrogen gas for 16 hrs. The mixture was filtered through celite and the filtrate was concentrated to give the desired product as an off white solid (0.8 g).",
        "ESI-MS m/z 313 [M+H]+.",
        "",
        "2-adamantan-1-yl-N-(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-acetamide (0.05 g, 0.153 mmol) and 2,3-dihydrobenzo[b][1,4]dioxine-6-carbaldehyde (0.0504 g, 0.306 mmol) in DCE (1 mL) was treated with NaBH(OAc)3 (0.065 g, 0.306 mmol) and the resulting mixture agitated overnight at room temperature. The crude reaction was purified by HPLC affording the desired compound.",
        "LCMS (ESI+) m/z 474.9 [+H]+",
        "NMR (300 MHz, CD3OD): δ 8.65 (s, 1H), 6.86-6.79 (m, 3H), 4.21 (s, 4H), 3.62 (m, 4H), 2.76 (s, 4H), 2.22 (s, 2H), 1.97 (br s, 3H), 1.74-1.64 (m, 12H).",
        "The reductive alkylation products with other aldehydes and ketones to obtain specified examples in Table 1A-1E were obtained in an analogous manner by using 2-adamantan-1-yl-N-(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-acetamide, or the appropriate corresponding amine (0.05 g, 0.153 mmol) and 2 mmol of the corresponding aldehyde or ketone and reducing agent.",
        "",
        "To a solution of 1,1-dimethyl-2-adamantyl-N-(5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-yl)acetamide (29 mg, 0.082 mmol) in anhydrous dichloroethane (2 mL) was added diisopropylethylamine (0.04 mL, 0.24 mmol) and 2,6-difluorobenzoyl chloride (21.7 mg, 0.12 mmol) at room temperature. After stirring at room temperature for 5 h, the reaction was quenched with water (0.5 mL) and evaporated to dryness. The dry residue was purified by prep-HPLC directly and afforded desired product.",
        "LCMS (ESI+) m/z 495.3 [M+H]+",
        "NMR (300 MHz, CDCl3): δ 8.80 (s, 0.5H), 8.72 (s,0.5H), 7.64 (m, 1H), 7.37 (m, 1H), 6.97 (m, 2H), 5.01 (s, 1H), 4.56 (s, 1H), 4.04 (t, 1H), 3.57 (t, 1H), 2.85 (t, 1H), 2.75 (t, 1H), 2.03 (br m, 3H), 1.57-1.73 (m, 12H), 1.27 (s, 3H), 1.24 (s, 3H).",
        "Specific representative examples of N-benzoyl and N-sulfonyl derivatives of 1,1-dimethyl-2-adamantyl-N-(5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-yl)acetamide given in Table 1A-1E can be or were prepared in an analogous manner by using either 1,1-dimethyl-2-adamantyl-N-(5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-yl)acetamide (29 mg, 0.082 mmol) or 2-(3,5-dimethyl)adamantyl-N-(5,6,7,8-tetrahydropyrido[3,4d]pyrimidin-4-yl)acetamide (26 mg, 0.073 mmol), and 0.12 mmol of the corresponding acyl chlorides and sulfonyl chlorides.",
        "",
        "In one well of a 96-well polypropylene reaction plate was added 2-Adamantan-1-yl-N-(7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-yl)acetamide (3.27 mg, 10 μmol) in 100 μl of anhydrous chloroform. To the reaction was added benzoyl chloride (2.1 mg, 15 μmol), followed by diisopropylethylamine (5.2 mg, 40 μmol). The reaction plate was heated at 50° C. for 15 minutes and the solvent was evaporated. The residue was dissolved in DMSO and purified using LC-MS based purification.",
        "ESI-MS m/z 431 [M+H]+.",
        "Specified examples of Table 1A-1E compounds were prepared in an analogous manner using the appropriate acyl chloride",
        "",
        "In one well of a 96-well polypropylene reaction plate was added 2-2-Adamantan-1-yl-N-(7-benzenesulfonyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-yl)acetamide (3.27 mg, 10 μmol) in 100 μl of anhydrous chloroform. To the reaction was added benzenesulphonyl chloride (2.64 mg, 15 μmol), followed by diisopropylethylamine (5.2 mg, 40 μmol). The reaction plate was heated at 50° C. for 15 minutes and the solvent was evaporated. The residue was dissolved in DMSO and purified using LC-MS based purification",
        "ESI-MS m/z 467 [M+H]+.",
        "Specified examples of Table 1A-1E compounds were prepared in an analogous manner using the appropriate sulphonyl chloride.",
        "",
        "In a 2.0 ml -wave vessel was added 2-Adamantan-1-yl-N-(7-benzenesulfonyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidin-4-yl)acetamide (3.27 mg, 10 mol) in 600 μl of absolute ethanol. To the reaction was added benzaldehyde (2.1 mg, 15 mol), followed by acetic acid (60 l) and silica bound sodium cyanoborohydride (15 mg, 15 mol). The reaction was heated at 120° C. for 5 minutes and the solvent was evaporated. The residue was dissolved in DMSO and purified using LC-MS based purification.",
        "ESI-MS m/z 417 [M+H]+.",
        "Specified examples of Table 1A-1E compounds were prepared in an analogous manner using the appropriate aldehyde",
        "",
        "In one well of a 96-well polypropylene reaction plate was added adamantane-1-carboxylic acid(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-amide (3.12 mg, 10 μmol) in 100 μl of anhydrous chloroform. To the reaction was added benzoyl chloride (2.1 mg, 15 μmol), followed by diisopropylethylamine (5.2 mg, 40 μmol). The reaction plate was heated at 50° C. for 15 minutes and the solvent was evaporated. The residue was dissolved in DMSO and purified using LC-MS based purification.",
        "ESI-MS m/z 417 [M+H]+.",
        "Specified examples of Table 1A-1E compounds were prepared in an analogous manner using the appropriate acyl chloride",
        "",
        "In one well of a 96-well polypropylene reaction plate was added 2-adamantane-1-carboxylic acid(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-amide (3.12 mg, 10 μmol) in 100 μl of anhydrous chloroform. To the reaction was added benzenesulphonyl chloride (2.64 mg, 15 μmol), followed by diisopropylethylamine (5.2 mg, 40 μmol). The reaction plate was heated at 50° C. for 15 minutes and the solvent was evaporated. The residue was dissolved in DMSO and purified using LC-MS based purification.",
        "ESI-MS m/z 453 [M+H]+.",
        "Specified examples of Table 1A-1E compounds were prepared in an analogous manner using the appropriate sulphonyl chloride.",
        "",
        "In a 2.0 ml microwave vessel was added adamantane-1-carboxylic acid (5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-amide (3.12 mg, 10 μmol) in 600 μl of absolute ethanol. To the reaction was added benzaldehyde (2.1 mg, 15 μmol), followed by acetic acid (60 μl) and silica bound sodium cyanoborohydride (15 mg, 15 μmol). The reaction was heated at 120° C. for 5 minutes and the solvent was evaporated. The residue was dissolved in DMSO and purified using LC-MS based purification",
        "ESI-MS m/z 403 [M+H]+.",
        "Specified examples of Table 1A-1E compounds were prepared in an analogous manner using the appropriate aldehyde.",
        "",
        "Four 10-20 mL microwave vials were each charged with 7-benzyl-4-chloro-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine (1 g, 4 mmol), Pd((PPh3)4 (500 mg, 0.4 mmol) and Zn(CN)2 (300 mg, 2 mmol) were suspended in dry DMF (7 mL). These sealed suspensions were then heated at 160° C. for 50 min in a microwave reactor. After cooling the reaction mixture an aliquot was taken and the sample tested by LCMS. The reaction showed 100% conversion of 7-benzyl-4-chloro-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine to desired product. The crude reaction mixtures were poured into water (200 mL), resulting in the precipitation of a brown solid, which was filtered and dried. The aqueous filtrate was extracted with DCM (2×100 mL). The organic layer was filtered through a Horizon Technology DryDisk and concentrated. The crude solids and oil were purified via column chromatography first with DCM/MeOH (20:1)of 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine-4-carbonitrile. (2.1 g, 55%)",
        "ESI-MS n/z 251.3 [M+H]+.",
        "1H NMR (300 MHz, CD3OD) δ 8.99 (s, 1H), 7.4-7.3 (m, 5H), 3.79 (s, 2H), 3.73 (s, 2H), 3.05 (t, 2H), 2.91 (t, 2H).",
        "",
        "7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine-4-carbonitrile (2.1 g, 8.38 mmol) was dissolved in satd. solution of HCl/MeOH (15 mL) in a microwave tube. The vial was heated in a microwave reactor at 70° C. for 1 h. The reaction was cooled and depressurized and concentrated under reduced pressure. The crude oil was dissolved in MeOH followed by removal of MeOH under reduced pressure to assist with the remove of excess HCl. The red-brown oil was dissolved in minimal amount of water (10 mL) and added to an ice cold sat. NaHCO3 solution (200 mL). The aqueous layer was extracted with DCM (3×100 mL). The combined organic layers were then filtered through a Horizon Technologies DryDisk and concentrated. The resulting red-brown oil was purified by flash chromatographed using DCM/MeOH (20:1) as elutant. The pure fractions were combined, treated with norite, filtered through a pad of celite and the filtrate concentrated to afford methyl 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine-4-carboxylate (1.01 g, 42.3%.)",
        "ESI-MS m/z 284.3 [M+H]+.",
        "1H NMR (300 MHz, CD3OD) δ 8.94 (s, 1H), 7.4-7.3 (m, 5H), 3.96 (s, 3H), 3.76 (s, 2H), 3.73 (s, 2H), 3.15 (t,2H), 2.82 (t, 2H),",
        "",
        "Methyl 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine-4-carboxylate (0.2 g, 0.705 mmol) was dissolved in MeOH (10 mL). 10% NaOH solution (1.5 mL) was added. The solution was heated at 85° C. for 1 h. Solvent was removed under reduced pressure. The aqueous. layer was acidified to ca. pH 4. The aqueous layer was then extracted with DCM (2×50 mL) to remove organic impurities. The acidic aqueous layer was dried on the lyophilizer. The resulting solids were washed with MEOH (10 mL) and filtrate concentrated to give 7-benzyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine-4-carboxylic acid (0.173 g, 0.642 mmol, 91%) as a brown oil. The resulting product was used without further purification.",
        "ESI-MS m/z 270.3 [M+H]+.",
        "1H NMR (300 MHz, CD3OD) δ 8.75 (s, 1H), 7.4-7.3 (m, 5H), 3.74 (s, 2H), 3.65 (s, 2H), 3.00 (t, 2H), 2.82 (t, 2H).",
        "",
        "In a 2-dram vial, intermediate 11 (0.5 g, 1.85 mmol) was dissolved in DMF (1 mL) with 1-adamantyl methylamine (0.37 g, 2.24 mmol) and HATU (1.2 g, 2.8 mmol) followed by DIEA (300 μL, 2.79 mmol) was added to the mixture. The vial was sealed and placed on an orbital shaker for 16 h. The reaction mixture was diluted with DCM (50 mL). The organic layer was washed with sat. NaHCO3 solution (1×25 mL) and water (1×25 mL). The organic layer was filtered through a Horizon Technologies DryDisk and concentrated. The crude product was purified by column chromatography to afford 7-benzyl-N-adamantylmethyl-5,6,7,8-tetrahydropyrido[3,4-d]pyrimidine-4-carboxarnide (0.048 g 6.2%) which was taken on to the next step without further purification.",
        "ESI-MS m/z 417.1 [M+H]+.",
        "1H NMR (300 MHz, CD3OD) δ 8.91 (s, 1H), 7.4-7.3 (m, 5H), 3.75 (s, 2H), 3.7 (s, 2H), 3.25 (t, 2H), 3.08 (s, 2H), 2.81 (t, 2H), 1.98 (s, 3H), 1.78-1.6 (m, 12H).",
        "",
        "Prepared by standard LAH reduction in THF at 0° C. using 1.49 g (9.74 mmol) of 1-hydroxy-3,3-dimethylcyclohexanecarbonitrile and 740 mg (19.48 mmol) of LAH. The mixture was stirred at room temperature overnight. The mixture was quenched with 740 ul of water and 740 ul of 15% methanol in water, stirred for 2 hours and then filterered. The filtrate was washed with EtOAc, concentrated under reduced pressure and dried under high vacuum. The dark viscous oil was taken up in 50 ml of EtOAc and was treated with 20 ml of 4M HCl solution in 1,4-dioxane followed by 10% MeOH and then heated to ensure dissolution. Upon cooling to room temperature followed by further cooling to −78° C. 1 g (73%) of the recrystallized HCl salt of 1-(aminomethyl)-3,3-dimethylcyclohexanol was obtained.",
        "",
        "The title intermediates were prepared in an analogous manner to that for 1-(aminomethyl)-3,3-dimethylcyclohexanol using the appropriate nitrile.",
        "The title compounds were prepared in a manner analogous to that given for Compound 17 using the Intermediate 11 and the appropriate amine.",
        "",
        "In a round bottom flask, 7-Benzyl-5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimdine-4-carboxylic acid(adamantan-1-ylmethyl)-amide(1.15 g, 2.74 mmol) was dissolved in glacial acetic acid (10 mL) with stirring and 10% Pd/C (417 mg) was added. The suspension was stirred under an atmosphere of H2 for 16 h. By LCMS and TLC (DCM:MeOH::20:1), no starting material appeared to be present. The desired m/z was observed at 327.3 (M+H). The reaction mixture was then filtered through a pad of celite. The filtrate was concentrated. The resulting oil was re-dissolved in EtOAc (50 mL) with stirring. A 10% NaOH solution (50 mL) was added. The mixture was stirred at RT for 1 h. The layers were separated and the aqueous layer was extracted with EtOAc (3×50 mL). The combined organic layers were filtered through a Horizon Technologies DryDisk and concentrated. The crude oil was chromatographed using DCM/MeOH (0-30% gradient) as elutant affording 0.133 g of the title compound.",
        "ESI-MS m/z 327.3 [M+H]+.",
        "1H NMR (300 MHz, CD3OD) δ 8.96 (s, 1H), 4.13 (s, 2H), 3.3-3.2 (m, 4H), 3.07 (s, 2H), 1.98 (s, 3H), 1.79-1.6 (m, 12H).",
        "The title compounds were prepared in a manner analogous to that given for intermediate 16 using Compounds 4 and 1 as starting materials, respectively.",
        "",
        "In a 2-dram vial, a solution of 5,6,7,8-Tetrahydro-pyrido[3,4-d]pyrimidine-4-carboxylic acid (adamantan-1-ylmethyl)-amide (0.44 g, 0.134 mmol) in DCE was added followed by 2,4-difluorbenzaldehyde (0.26 g, 0.18 mmol). The solution was placed on an orbital shaker at room temperature for 1 h. Sodium triacetoxyborohydride (0.43 g, 0.2 mmol) was added. The mixture was agitated for an additional 16 h at room temperature. LCMS and TLC (DCM:MeOH::20:1), indicated that no starting material remained. The reaction was quenched by the addition of MeOH (0.5 mL). The mixture was then filtered through a pad of celite®. The pad was subsequently washed with MeOH (2 mL). The filtrate was concentrated and the crude solid was purified via HPLC to yield the title compound (0.0166 g) as a yellow oil.",
        "ESI-MS m/z 453.3 [M+H]+.",
        "1H NMR (300 MHz, CD3OD) δ 8.92 (s, 1H), 7.51 (q,2H), 6.97, (t, 1H), 3.81 (s, 2H), 3.38 (s, 2H), 3.25 (t, 2H), 3.23 (s, 2H), 2.84 (t, 2H), 1.98 (s, 3H), 1.79-1.6 (m, 12H).",
        "Specified examples of Table 1A-1E compounds were prepared from 5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidine-4-carboxylic acid(adamantan-1-ylmethyl)-amide, and Compound 2 in an analogous manner using the appropriate aldehyde.",
        "",
        "A solution of 2-adamantan-1-yl-N-(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-acetamide (0.1 g, 0.306 mmol) and 2-Methoxymethyl-oxirane (0.035 g, 0.398 mmol) in i-PrOH (5 mL) was stirred at 60° C. for 20 h. The reaction vessel was allowed to cool to room temperature, opened, and the volatiles were removed under reduced vacuum. The crude product was purified by HPLC to afford 2-adamantan-1-yl-N-[7-(2-hydroxy-3-methoxy-propyl)-5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl]-acetamide (Compound 13) (0.0134 g, 0.032 mmol, 100%) in 100% purity as determined by LCMS.",
        "ESI-MS m/z 415.5 [M+H]+.",
        "1H-NMR (300 MHz, CDCl3): δ 8.71 (s, 1H), 7.88 (s, 1H), 3.99 (m, 1H), 3.86 (d, 1H), 3.71 (d, 1H), 3.46 (m, 2H), 3.40 (s, 3H), 2.94 (m, 1H), 2.76 (m, 3H), 2.70-2.55 (m, 2H), 2.28 (s, 2H), 1.99 (br s, 3H), 1.74-1.65 (m, 12H).",
        "",
        "2-Adamantan-1-yl-N-[7-(2,3-dihydroxy-propyl)-5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl]-acetamide was synthesized from 2-adamantan-1-yl-N-(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-acetamide (0.05 g, 0.153 mmol) and glycidol (0.015 g, 0.2 mmol) in i-PrOH (3 mL) in a manner analogous to the preparation of Compound 13. Preparative TLC purification using DCM/MeOH/TEA (10:1:1)) afforded the desired product (0.0074 mg, 12%).",
        "ESI-MS m/z 401.3 [M+H]+.",
        "",
        "A solution of 2-adamantan-1-yl-N-(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-acetamide (0.05 g, 0.153 mmol), 3-bromo-1-propanol (0.021 g, 0.15 mmol) and DIPEA (0.045 g, 0.35 mmol) in EtOH (4 mL) was stirred at 75° C. for 17 h. The reaction vessel was allowed to cool to room temperature, opened, and the volatiles were removed on a rotary evaporator. The residue was redissolved in THF (3 mL). PL-NCO resin (300 mg) was added, and the resulting suspension was stirred at room temperature for 16 h. The resin was filtered and the volatiles were removed under vacuum. The crude product was purified by HPLC to afford 2-adamantan-1-yl-N-[7-(3-hydroxy-propyl)-5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl]-acetamide (0.0098 g, 17%).",
        "ESI-MS m/z 385.5 [M+H]+.",
        "1H-NMR (300 MHz, CDCl3): δ 8.71 (s, 1H), 7.65 (s, 1H), 3.82 (t, 2H), 3.75 (s, 2H), 2.86-2.75 (m, 6H), 2.30 (s, 2H), 1.99 (br‘s’, 3H), 1.83 (m, 2H), 1.74-1.60 (m, 12H).",
        "The title compound was prepared in a manner analogous to that given for Compound 21 using the appropriate starting material.",
        "",
        "2-Adamantan-1-yl-N-[7-(2-hydroxy-ethyl)-5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl]-acetamide was synthesized from 2-adamantan-1-yl-N-(5,6,7,8-tetrahydro-pyrido[3,4-d]pyrimidin-4-yl)-acetamide (0.05 g, 0.153 mmol), 2-bromoethanol (0.019 g, 0.15 mmol) and DIPEA (0.052 g, 0.4 mmol) in EtOH (4 mL) in a manner analogous to compound 21 The crude reaction was purified by HPLC affording the desired product (0.0064 g, 0.017 mmol, 12%).",
        "ESI-MS m/z 371.3 [M+H]+.",
        "The title compound was prepared in a manner analogous to that given for Compound 21 using the appropriate starting materials.",
        "",
        "A solution of β-aminocrotononitrile (12 g, 147 mmol) and NEt3 (37 mL, 266 mmol) in CH2Cl2 (150 mL) was cooled with an ice bath to 0°. TiCl4 (7.9 mL, 72 mmol) in CH2Cl2 (100 mL) was added slowly with stirring followed by N-benzyl-4-piperidone (21.4 mL, 120 mmol) in one portion. The mixture was stirred for 24 h at ambient temperature and the volatiles were removed under reduced pressure. Ethly ether (400 mL) was added, and the resulting mixture was stirred vigorously until the residue was ground to a fine powder. The powder was filtered off and washed with ethyl ether (400 mL) and evaporation of the solvent afforded (E)-3-amino-2-(1-benzyl-1,2,3,6-tetrahydro-pyridin-4-yl)-but-2-enenitrile as an oil (20 g, 70%), which was used without further purification.",
        "To a solution of (E)-3-amino-2-(1-benzyl-1,2,3,6-tetrahydro-pyridin-4-yl)-but-2-enenitrile (15 g, 0.056 mole) in dichloromethane (200 mL), freshly prepared benzotriazol-1-ylmethylene-dimethyl-ammonium chloride (12 g, 0.068 mole) was added in one portion. The mixture was stirred for 24 h at ambient temperature. NaOH (2N, 200 mL) was added, and the resulting mixture was stirred vigorously for 5 min. The phases were separated and the aqueous phase was extracted with dichloromethane (100 mL). The combined organic phases were dried over magnesium sulfate, and the solvent was removed in vacuo. The crude product was purified by column chromatography to give 7-benzyl-3-methyl-5,6,7,8-tetrahydro-2,7-naphthyridine-4-carbonitrile as a colorless oil (8.9 g, 53% yield).",
        "1H NMR (CDCl3) δ 8.28 (s, 1H), 7.36-7.31 (m, 5H), 3.72 (s, 2H), 3.59 (s, 2H), 3.01 (t, 2H), 2.80 (t, 2H), 2.71 (s, 3H)",
        "",
        "NaOH (9.1 mg, 2.24 mmol) was added to 0.5 ml of EtOH, which contained 30 mg (0.114 mmol) of the nitrile and the resulting mixture was heated at 100° C. overnight. The mixture was acidified by concentrated HCl to pH>2 and extracted with dichloromethane. The pH of the aqueous layer was then adjusted to 7 and extracted with dichlormethane. The combined DCM layers were washed with brine, dried, and concentrated under reduced pressure to afford the crude product, which was purified by column chromatography using MeOH:DCM (3-25%) to afford the pure product (22 mg, 0.078 mmol) in a 69% yield.",
        "",
        "7-benzyl-5,6,7,8-tetrahydro-3-methyl-2,7-naphthyridine-4-carboxamide (40 mg, 0.142 mmol) was taken up in anhydrous DMF (0.5 ml) under an inert atmosphere. NaH (60% in mineral oil) (6.8 mg, 0.17 mmol) was added to the reaction vessel and the mixture stirred for 30 minutes until the evolution of hydrogen gas ceased. To this mixture was added 1-adamantylmethylbromide in DMF (0.5 ml) and reaction was stirred at room temperature for 4 hr. The reaction was monitored by TLC and LCMS. Excess NaH and 1-adamantylmethylbromide and heated from 40 to 75° C. for 3 days. The mixture was cooled to room temperature, and added to ice water. The aqueous layer was extracted with EtOAc, washed with water, brine, dried over sodium sulfate, and reduced in vacuo. The crude was purified by flash chromatography followed by prep. TLC using MeOH:DCM (5-10%) to afford the title compound. (5 mg, 8%).",
        "",
        "Ethyl 1-benzyl-3-oxopiperidine-4-carboxylate (25 g, 83.96 mM) and ammonium acetate (32.36 g, 419.79 mM) in MeOH (250 mL) were agitated overnight. The mixture was concentrated, the crude product was dissolved in methylene chloride and washed sequentially with aqueous saturated potassium carbonate solution and water. The organic was dried and reduced in vacuo to yield the title compound (24.0 g, 110%, higher yield possibly due to accluded solvents) as an oil which solidified on standing.",
        "",
        "To a suspension of NaOtBu (4.23 g, 34.57 mM) in THF (50 mL) was added a mixture of ethyl 3-amino-1-benzyl-1,2,5,6-tetrahydropyridine-4-carboxylate (3.0 g, 11.52 mM) and methyl 3,3-dimethoxypropanoate (5.12 g, 34.57 mM) in THF (20 mL) in one portion and the mixture was agitated at ambient temperature overnight. The mixture was concentrated to half the volume before being quenched with ice-cold water. The homogeneous solution was extracted ethyl ether and the aqueous layer was carefully acidified with HCl until acidic. The precipitate was filtered, washed with water, and dried under vacuum to obtain the title compound as an off-white solid (1.6 g, 47%).",
        "",
        "In a round bottom flask, 7-Benzyl-4-hydroxy-5,6,7,8-tetrahydro-[1,7]naphthyridine-3-carboxylic acid methyl ester (56 mg) was dissolved in methanol (15 mL) and a 10% NaOH solution in water (5 mL) was added with stirring. The mixture was heated at reflux for 2 hours, reduced in vacuo, and the aqueous remainder was acidified with 1N HCl. The aqueous layer was extracted with with dichloromethane. The aqueous layer was concentrated to give 0.06 grams of the product as its hydrochloride salt after drying.",
        "",
        "7-Benzyl-4-hydroxy-5,6,7,8-tetrahydro-[1,7]naphthyridine-3-carboxylic acid (0.025 g, 0.089 mmol) in 2 ml of I-PrOH and column packed with Cu(O) was heated to 270° C. under 1000 psi in a continuous flow reactor. The flow rate was adjusted to 1.5 μl/min. After cooling, filtering, and washing with methanol the filtrate was concentrated to afford 50 mg (0.208 mmol) of the desired product.",
        "ESI-MS m/z 241.1 [M+H]+.",
        "",
        "7-Benzyl-5,6,7,8-tetrahydro-[1,7]naphthyridin-4-ol (0.1 g, 0.417 mmol) in 3 ml of POCl3 was refluxed for 40 minutes. LCMS indicated complete coversion to the desired product. The excess POCl3 was removed under reduced pressure and taken on to the next step without further purification.",
        "ESI-MS m/z 259.5 [M+H]+.",
        "",
        "7-Benzyl-4-chloro-5,6,7,8-tetrahydro-[1,7]naphthyridine (0.417 mmol) was treated with 5 equiv. of NaN3 (135 mg) in DMF (0.5 ml) and heated to 70° C. for 4 h. The residue was dissolved on 50 ml of DCM and washed with brine. The organic layer was concentrated to afford a black oil, which was purified by column chromatography to afford the desired azide (61 mg), which was used directly in the next step.",
        "ESI-MS m/z 266.5 [M+H]+.",
        "",
        "4-azido-7-benzyl-5,6,7,8-tetrahydro-1,7-naphthyridine (0.06 g, 0.226 mmol) was treated with 0.5 g of PS-PPh3 resin in a 8 ml mixture THF:H2O (18:1) at 32° C. ON. The reaction was monitored by LCMS and TLC. The reaction mixture was filtered and washed with THF and methanol. The combined filtrate was concentrated and used directly in the next step.",
        "ESI-MS m/z 240.3 [M+H]+.",
        "",
        "7-Benzyl-5,6,7,8-tetrahydro-[1,7]naphthyridin-4-ylamine (48 mg, 0.202 mmol) in 6 ml of dioxane was treated with NMM (22 μl, 0.202 mmol) followed by adamantan-1-yl-acetyl chloride (0.043 g, 0.202 mmol) and stirred at rt under argon. The reaction was monitored by TLC and LCMS. Excess acid chloride was added and the reaction was stirred. The contents were concentrated and purified by HPLC to afford the desired product (3.3 mg, 4%).",
        "ESI-MS m/z 416.7 [M+H]+.",
        "Exemplary Compounds of the Invention",
        "In addition to the compounds exemplified above, the following compounds recited below in Tables 1A-1E, which comprise various substituted amides of this invention, are prepared or can be prepared using the procedure and synthetic schemes described above, or some modification thereof, and the corresponding starting materials, appropriate reagents, and purification methods known to those skilled in the art. Modifications of the methods described herein are within the scope of the invention and will be obvious to one of skill in the art.",
        "TABLE 1A\n\n\n\n\n\n\n\nAdamantane Substituted Amide Compounds\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nID\nL1\nR3a\nR3b\nR3c\nR3d\nR3e\nn\nR2′\nR2″\nRa\nRb\nRc\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5\nCH2\nH\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n15\nCH2\nH\nH\nMeO2S\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n27\nCH2\nCl\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n28\nCH2\nF\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n29\nCH2\nMeO\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n30\nCH2\nMeO\nH\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n31\nCH2\nMe\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n32\nCH2\nMe\nH\nH\nMe\nH\n1\nH\nH\nH\nH\nH\n\n\n33\nCH2\nH\nF\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n34\nCH2\nH\nCl\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n35\nCH2\nH\nMeO\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n36\nCH2\nH\nMeO\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n37\nCH2\nH\nMeO\nH\nMeO\nH\n1\nH\nH\nH\nH\nH\n\n\n38\nCH2\nH\nMe\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n39\nCH2\nH\nMe\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n40\nCH2\nH\nH\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n41\nCH2\nH\nH\nCl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n42\nCH2\nH\nH\nCN\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n44\nCH2\nH\nH\nMe\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n45\nCH2\nH\nH\nC2H5\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n47\nCH2\nF\nH\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n62\nCH2\nH\nH\nAcNH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n65\nCH2\nH\nH\n2-Pyridyl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n68\nCH2\nH\nPhO\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n70\nCH2\nH\nCF3\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n71\nCH2\nH\nH\nt-Bu\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n72\nCH2\nH\nH\nCF3\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n74\nCH2\nH\nH\nCF3O\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n75\nCH2\nH\nH\nPhO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n76\nCH2\nCF3O\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n77\nCH2\nOCHF2\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n78\nCH2\nH\nH\nOCHF2\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n84\nCH2\nH\nCN\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n85\nCH2\nH\nF\nMe\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n86\nCH2\nH\nMe\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n87\nCH2\nF\nMe\nH\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n88\nCH2\nCl\nMe\nH\nH\nF\n1\nH\nH\nH\nH\nH\n\n\n89\nCH2\nH\nH\nN(Me)—CH2CH2OH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n91\nCH2\nH\nH\nOCH2CONH2\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n92\nCH2\nH\nH\nH\nH\nC2H4NO2\n1\nH\nH\nH\nH\nH\n\n\n95\nCH2\nF\nH\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n96\nCH2\nCF3\nH\nH\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n97\nCH2\nH\nF\nCF3\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n98\nCH2\nH\nH\n1-imidazolyl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n99\nCH2\nH\nH\nOCH2CH2OH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n100\nCH2\nOCH2CH2OH\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n101\nCH2\nH\nOCH2CH2OH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n102\nCH2\nMeO\nH\nH\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n103\nCH2\nH\nMeO\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n104\nCH2\nF\nH\nH\nMeO\nH\n1\nH\nH\nH\nH\nH\n\n\n106\nCH2\nH\nCF3\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n107\nCH2\nCF3\nH\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n108\nCH2\nH\nCF3\nH\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n109\nCH2\nH\nCF3\nH\nH\nF\n1\nH\nH\nH\nH\nH\n\n\n110\nCH2\nF\nH\nCF3\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n111\nCH2\nCF3\nH\nH\nH\nF\n1\nH\nH\nH\nH\nH\n\n\n113\nCH2\nH\nH\nO-isoPr\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n114\nCH2\nH\nCF3O\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n115\nCH2\nH\nH\nCH═CHCO2H\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n116\nCH2\nH\nH\nMeS\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n117\nCH2\nH\nMeO\nHO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n119\nCH2\nH\nF\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n120\nCH2\nCF3\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n123\nCH2\nH\nH\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n131\nCH2\nF\nCF3\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n140\nCH2\nH\nH\nOCH2CO2H\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n141\nCH2\nH\nH\nH\nH\nOCH2CO2H\n1\nH\nH\nH\nH \nH\n\n\n143\nSO2\nH\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n144\nSO2\nH\nH\nMe\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n149\nSO2\nH\nH\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n150\nSO3\nH\nH\nCl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n151\nSO2\nH\nH\nMeO\nMeO\nH\n1\nH\nH\nH\nH\nH\n\n\n152\nSO2\nH\nH\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n154\nSO2\nH\nH\nH\nCF3\nH\n1\nH\nH\nH\nH\nH\n\n\n155\nSO2\nH\nH\nCl\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n156\nSO2\nH\nH\nCF3O\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n161\nSO2\nH\nH\nH\nCF3O\nH\n1\nH\nH\nH\nH\nH\n\n\n162\nSO2\nH\nH\nH\nMeO\nH\n1\nH\nH\nH\nH\nH\n\n\n165\nSO2\nH\nH\nCN\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n166\nSO2\nH\nH\nH\nH\nF\n1\nH\nH\nH\nH\nH\n\n\n167\nSO2\nH\nH\nCN\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n168\nSO2\nH\nH\nH\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n172\nSO2\nH\nH\nO-2-pyridyl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n173\nSO2\nH\nH\nO-3-pyridyl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n174\nSO2\nH\nH\nO-3-pyridyl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n175\nSO2\nH\nH\nO-(4-MeOPh)\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n176\nSO2\nH\nH\nO-(3,4-di Cl Ph)\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n177\nSO2\nH\nH\nO-(4-CF3Ph)\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n178\nSO2\nH\nH\nH\n(3,4-di Cl Ph)O\nH\n1\nH\nH\nH\nH\nH\n\n\n179\nSO2\nH\nH\n4-MeOPh\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n181\nSO2\nCl\nH\nH\nCF3\nH\n1\nH\nH\nH\nH\nH\n\n\n190\nSO2\nH\nH\nOCHF2\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n191\nSO2\nH\nH\nPhO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n192\nSO2\nH\nH\nH\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n193\nSO2\nH\nH\nF\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n194\nSO2\nH\nH\nH\nH\nC6H5\n1\nH\nH\nH\nH\nH\n\n\n195\nSO2\nH\nH\nH\nH\nCF3\n1\nH\nH\nH\nH\nH\n\n\n196\nSO2\nH\nH\n1-pyrazolyl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n197\nSO2\nH\nH\nMeO\nH\nMeO\n1\nH\nH\nH\nH\nH\n\n\n199\nSO2\nH\nH\nH\nH\nMe\n1\nH\nH\nH\nH\nH\n\n\n201\nSO2\nH\nH\nCF3\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n202\nSO2\nH\nH\nCl\nH\nF\n1\nH\nH\nH\nH\nH\n\n\n203\nSO2\nF\nH\nH\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n204\nSO2\nCl\nH\nH\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n205\nSO2\nF\nH\nH\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n206\nSO2\nF\nH\nH\nH\nF\n1\nH\nH\nH\nH\nH\n\n\n207\nSO2\nH\nH\nMe\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n208\nSO2\nH\nCI\nH\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n209\nSO2\nH\nH\nF\nH\nF\n1\nH\nH\nH\nH\nH\n\n\n210\nSO2\nCl\nH\nH\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n211\nSO2\nH\nH\nF\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n212\nSO2\nMe\nH\nH\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n214\nSO2\nH\nMe\nH\nH\nMeO\n1\nH\nH\nH\nH\nH\n\n\n215\nSO2\nH\nH\nH\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n216\nSO2\nMeO\nH\nH\nMeO\nH\n1\nH\nH\nH\nH\nH\n\n\n217\nSO2\nH\nMe\nH\nMe\nH\n1\nH\nH\nH\nH\nH\n\n\n218\nCO\nCI\nH\nH\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n220\nCO\nH\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n221\nCO\nH\nH\nC6H5\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n226\nCO\nH\nH\nCl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n227\nCO\nH\nF\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n228\nCO\nH\nH\nCF3O\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n229\nCO\nH\nH\nC2H5\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n230\nCO\nH\nMe\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n232\nCO\nH\nF\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n233\nCO\nH\nCF3\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n234\nCO\nH\nH\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n242\nCO\nH\nCN\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n243\nCO\nH\nH\nCF3\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n245\nCO\nH\nCl\nCl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n246\nCO\nH\nMeO\nH\nMeO\nH\n1\nH\nH\nH\nH\nH\n\n\n247\nCO\nF\nH\nH\nH\nF\n1\nH\nH\nH\nH\nH\n\n\n250\nCO\nH\nMeO\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n251\nCO\nH\nH\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n253\nCO\nH\nCl\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n257\nCO\nH\nH\nCN\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n258\nCO\nCl\nH\nCl\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n266\nCO\nF\nH\nCF3\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n267\nCO\nH\nCF3\nH\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n268\nCO\nCF3O\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n269\nCO\nH\nCF3O\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n270\nCO\nCF3\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n271\nCO\nH\nCF3\nH\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n272\nCO\nF\nH\nH\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n275\nCO\nMeO\nH\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n277\nCO\nF\nH\nF\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n278\nCO\nMe\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n279\nCO\nF\nH\nH\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n280\nCO\nF\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n282\nCO\nCl\nCl\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n291\nCO\nH\nH\nMe\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n292\nCO\nMeO\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n294\nCO\nCl\nH\nH\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n301\nCO\nH\nH\nt-Bu\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n310\nCO\nH\nF\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n312\nCO\nH\nMeO\nMeO\nH\nH\n1\nH\nH\nH\nH\nH\n\n\n314\nCO\nCl\nH\nH\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n315\nCO\nH\nCl\nH\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n319\nCH2\nH\nH\nCl\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n320\nCH2\nH\nH\nMe\nH\nMe\n1\nH\nH\nH\nH\nH\n\n\n322\nCH2\nH\nH\nF\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n323\nCH2\nH\nH\nF\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n324\nCH2\nH\nH\nMeO\nCl\nH\n1\nH\nH\nH\nH\nH\n\n\n325\nCH2\nH\nH\nCl\nCF3\nH\n1\nH\nH\nH\nH\nH\n\n\n326\nCH2\nH\nH\nF\nH\nCl\n1\nH\nH\nH\nH\nH\n\n\n327\nCH2\nH\nH\nCF3\nH\nCF3\n1\nH\nH\nH\nH\nH\n\n\n328\nCH2\nH\nH\nCl\nH\nF\n1\nH\nH\nH\nH\nH\n\n\n329\nCH2\nH\nH\nCl\nF\nH\n1\nH\nH\nH\nH\nH\n\n\n330\nCH2\nH\nH\nOCH2Ph\nH\nMeO\n1\nH\nH\nH\nH\nH\n\n\n331\nCH2\nH\nH\nOCH2CH2CO2H\nH\nMeO\n1\nH\nH\nH\nH\nH\n\n\n334\nCH2\nH\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n339\nCH2\nH\nH\nH\nH\nH\n1\nMe\nMe\nH\nH\nH\n\n\n341\nCH2\nH\nH\nH\nH\nH\n1\nH\nH\nMe\nMe\nH\n\n\n343\nCH2\nH\nH\nH\nH\nH\n1\nMe\nMe\nMe\nMe\nH\n\n\n344\nCH2\nH\nH\nH\nH\nH\n1\nH\nH\nMe\nMe\nMe\n\n\n345\nCH2\nH\nH\nH\nH\nH\n1\nMe\nMe\nMe\nMe\nMe\n\n\n346\nCH2\nH\nH\nH\nH\nH\n0\n—\n—\nMe\nMe\nMe\n\n\n347\nCH2\nF\nH\nF\nH\nH\n1\nMe\nMe\nH\nH\nH\n\n\n348\nCH2\nCl\nH\nH\nH\nH\n1\nMe\nMe\nH\nH\nH\n\n\n349\nCH2\nMe\nH\nH\nH\nH\n1\nMe\nMe\nH\nH\nH\n\n\n352\nCH2\nH\nH\nF\nH\nH\n1\nMe\nMe\nH\nH\nH\n\n\n354\nSO2\nH\nCl\nH\nH\nH\n1\nMe\nMe\nH\nH\nH\n\n\n355\nSO2\nH\nH\nF\nF\nH\n1\nMe\nMe\nH\nH\nH\n\n\n358\nCO\nH\nMe\nH\nH\nH\n1\nMe\nMe\nH\nH\nH\n\n\n359\nCO\nH\nH\nH\nCF3\nH\n1\nMe\nMe\nH\nH\nH\n\n\n360\nCO\nH\nH\nCl\nCl\nH\n1\nMe\nMe\nH\nH\nH\n\n\n361\nCO\nF\nH\nH\nH\nF\n1\nMe\nMe\nH\nH\nH\n\n\n362\nCO\nF\nH\nH\nH\nCl\n1\nMe\nMe\nH\nH\nH\n\n\n363\nCO\nF\nH\nH\nF\nH\n1\nMe\nMe\nH\nH\nH\n\n\n364\nCO\nCl\nCl\nH\nH\nH\n1\nMe\nMe\nH\nH\nH\n\n\n369\nCH2\nF\nH\nH\nH\nH\n1\nMe\nMe\nH\nH\nH\n\n\n370\nCH2\nH\nH\nH\nH\nCl\n1\nH\nH\nH\nMe\nMe\n\n\n371\nCH2\nH\nH\nH\nH\nF\n1\nH\nH\nH\nMe\nMe\n\n\n372\nCH2\nH\nH\nH\nH\nMe\n1\nH\nH\nH\nMe\nMe\n\n\n374\nCH2\nH\nH\nF\nH\nF\n1\nH\nH\nH\nMe\nMe\n\n\n376\nCH2\nH\nH\nF\nH\nH\n1\nH\nH\nH\nMe\nMe\n\n\n380\nSO2\nH\nH\nH\nCl\nH\n1\nH\nH\nH\nMe\nMe\n\n\n381\nSO2\nH\nH\nH\nF\nF\n1\nH\nH\nH\nMe\nMe\n\n\n382\nCO\nH\nH\nH\nMe\nH\n1\nH\nH\nMe\nH\nMe\n\n\n383\nCO\nH\nCF3\nH\nH\nH\n1\nH\nH\nMe\nH\nMe\n\n\n385\nCO\nH\nCl\nCl\nH\nH\n1\nH\nH\nMe\nH\nMe\n\n\n387\nCO\nF\nH\nH\nH\nF\n1\nH\nH\nMe\nH\nMe\n\n\n389\nCO\nF\nH\nH\nH\nCl\n1\nH\nH\nMe\nH\nMe\n\n\n390\nCO\nF\nH\nH\nF\nH\n1\nH\nH\nMe\nH\nMe\n\n\n391\nCO\nCl\nCl\nH\nH\nH\n1\nH\nH\nMe\nH\nMe\n\n\n392\nCO\nCl\nH\nH\nH\nCl\n0\n—\n—\nH\nH\nH\n\n\n394\nCO\nH\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n399\nCO\nH\nH\nCI\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n400\nCO\nH\nH\nH\nF\nH\n0\n—\n—\nH\nH\nH\n\n\n401\nCO\nH\nH\nCF3O\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n402\nCO\nH\nH\nC2H5\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n403\nCO\nH\nH\nH\nMe\nH\n0\n—\n—\nH\nH\nH\n\n\n405\nCO\nH\nH\nF\nF\nH\n0\n—\n—\nH\nH\nH\n\n\n406\nCO\nH\nH\nH\nCF3\nH\n0\n—\n—\nH\nH\nH\n\n\n407\nCO\nH\nH\nMeO\nH\nH\n0 \n—\n—\nH\nH\nH\n\n\n414\nCO\nH\nH\nH\nCN\nH\n0 \n—\n—\nH\nH\nH\n\n\n415\nCO\nH\nH\nCF3\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n417\nCO\nH\nH\nCl\nCl\nH\n0\n—\n—\nH\nH\nH\n\n\n418\nCO\nH\nMeO\nH\nMeO\nH\n0\n—\n—\nH\nH\nH\n\n\n419\nCO\nF\nH\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n422\nCO\nH\nH\nH\nMeO\nH\n0\n—\n—\nH\nH\nH\n\n\n423\nCO\nH\nH\nF\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n425\nCO\nH\nH\nH\nCl\nH\n0\n—\n—\nH\nH\nH\n\n\n429\nCO\nH\nH\nCN\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n430\nCO\nH\nH\nCl\nH\nCl\n0\n—\n—\nH\nH\nH\n\n\n438\nCO\nH\nH\nCF3\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n439\nCO\nH\nF\nH\nCF3\nH\n0\n—\n—\nH\nH\nH\n\n\n440\nCO\nH\nH\nH\nH\nCF3O\n0\n—\n—\nH\nH\nH\n\n\n441\nCO\nH\nH\nH\nCF3O\nH\n0\n—\n—\nH\nH\nH\n\n\n442\nCO\nH\nH\nH\nH\nCF3\n0\n—\n—\nH\nH\nH\n\n\n443\nCO\nCl\nH\nH\nCF3\nH\n0\n—\n—\nH\nH\nH\n\n\n444\nCO\nCl\nH\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n447\nCO\nH\nH\nMeO\nH\nMeO\n0\n—\n—\nH\nH\nH\n\n\n449\nCO\nH\nH\nF\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n450\nCO\nH\nH\nH\nH\nMe\n0\n—\n—\nH\nH\nH\n\n\n451\nCO\nH\nF\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n452\nCO\nH\nH\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n454\nCO\nH\nH\nH\nCl\nCl\n0\n—\n—\nH\nH\nH\n\n\n461\nCO\nH\nH\nMe\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n462\nCO\nH\nH\nH\nH\nMeO\n0\n—\n—\nH\nH\nH\n\n\n464\nCO\nH\nH\nH\nH\nCl\n0\n—\n—\nH\nH\nH\n\n\n469\nCO\nH\nH\nt-Bu\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n475\nCO\nH\nH\nMeO\nF\nH\n0\n—\n—\nH\nH\nH\n\n\n476\nCO\nH\nH\nMeO\nMeO\nH\n0\n—\n—\nH\nH\nH\n\n\n478\nCO\nH\nF\nH\nH\nCl\n0\n—\n—\nH\nH\nH\n\n\n479\nCO\nH\nCl\nH\nCl\nH\n0\n—\n—\nH\nH\nH\n\n\n481\nSO2\nH\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n482\nSO2\nH\nH\nMe\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n487\nSO2\nH\nH\nMeO\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n488\nSO2\nH\nH\nCl\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n489\nSO2\nH\nMeO\nMeO\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n490\nSO2\nH\nH\nF\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n492\nSO2\nH\nCF3\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n493\nSO2\nH\nH\nCF3O\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n497\nSO2\nH\nCF3O\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n498\nSO2\nH\nMeO\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n500\nSO2\nCl\nH\nCN\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n501\nSO2\nF\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n502\nSO2\nH\nH\nCN\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n506\nSO2\nH\nH\nO-2-pyridyl\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n507\nSO2\nH\nH\nO-3-pyridyl\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n508\nSO2\nH\nH\nO-4-pyridyl\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n509\nSO2\nH\nH\nO-(4-MeOPh)\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n510\nSO2\nH\nH\nO-(4-CF3Ph)\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n511\nSO2\nH\nO-(3,4-di Cl Ph)\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n512\nSO2\nH\nH\n4-MeOPh\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n514\nSO2\nH\nCF3\nH\nH\nCl\n0\n—\n—\nH\nH\nH\n\n\n523\nSO2\nH\nH\nCHF2O\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n524\nSO2\nH\nH\nC6H5O\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n525\nSO2\nCl\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n526\nSO2\nH\nCl\nF\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n527\nSO2\nC6H5\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n528\nSO2\nCF3\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n529\nSO2\nH\nH\n1-pyrazolyl\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n530\nSO2\nMeO\nH\nMeO\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n532\nSO2\nCF3O\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n533\nSO2\nMe\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n535\nSO2\nH\nH\nCF3\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n536\nSO2\nF\nH\nCl\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n537\nSO2\nH\nF\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n538\nSO2\nH\nCl\nH\nH\nCl\n0\n—\n—\nH\nH\nH\n\n\n539\nSO2\nH\nCl\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n540\nSO2\nF\nH\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n541\nSO2\nH\nCl\nMe\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n542\nSO2\nH\nCl\nH\nCl\nH\n0\n—\n—\nH\nH\nH\n\n\n543\nSO2\nF\nH\nF\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n544\nSO2\nCl\nH\nH\nH\nCl\n0\n—\n—\nH\nH\nH\n\n\n545\nSO2\nCl\nH\nF\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n546\nSO2\nH\nF\nH\nH\nMe\n0\n—\n—\nH\nH\nH\n\n\n548\nSO2\nMeO\nH\nH\nMe\nH\n0\n—\n—\nH\nH\nH\n\n\n549\nSO2\nH\nMeO\nH\nH\nMeO\n0\n—\n—\nH\nH\nH\n\n\n550\nSO2\nH\nMe\nH\nMe\nH\n0\n—\n—\nH\nH\nH\n\n\n551\nSO2\nCN\nH\nH\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n562\nCH2\nH\nH\nMeO\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n566\nCH2\nH\nH\nMeO\nMeO\nH\n0\n—\n—\nH\nH\nH\n\n\n568\nCH2\nH\nH\nH\nC6H5O\nH\n0\n—\n—\nH\nH\nH\n\n\n569\nCH2\nH\nBr\nH\nH\nMeO\n0\n—\n—\nH\nH\nH\n\n\n570\nCH2\nH\nH\nCl\nH\nCl\n0\n—\n—\nH\nH\nH\n\n\n571\nCH2\nH\nH\nH\nCN\nH\n0\n—\n—\nH\nH\nH\n\n\n572\nCH2\nH\nH\nt-Bu\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n574\nCH2\nH\nH\nH\nCF3\nH\n0\n—\n—\nH\nH\nH\n\n\n575\nCH2\nH\nH\nNMe2\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n576\nCH2\nH\nH\nC6H5O\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n577\nCH2\nCl\nH\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n584\nCH2\nH\nH\nH\nMeO\nH\n0\n—\n—\nH\nH\nH\n\n\n585\nCH2\nH\nH\nMe\nMe\nH\n0\n—\n—\nH\nH\nH\n\n\n586\nCH2\nH\nH\nMeO\nMeO\nCl\n0\n—\n—\nH\nH\nH\n\n\n588\nCH2\nH\nH\nOCH2Ph\nMeO\nH\n0\n—\n—\nH\nH\nH\n\n\n590\nCH2\nH\nH\nCl\nCl\nH\n0\n—\n—\nH\nH\nH\n\n\n591\nCH2\nH\nH\nH\nMeO\nMeO\n0\n—\n—\nH\nH\nH\n\n\n592\nCH2\nH\nH\nMeO\nOCH2Ph\nH\n0\n—\n—\nH\nH\nH\n\n\n593\nCH2\nH\nH\nMeO\nHO\nH\n0\n—\n—\nH\nH\nH\n\n\n594\nCH2\nH\nMeO\nMeO\nBr\nH\n0\n—\n—\nH\nH\nH\n\n\n595\nCH2\nH\nH\nF\nCN\nH\n0\n—\n—\nH\nH\nH\n\n\n597\nCH2\nH\nH\nBr\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n598\nCH2\nH\nH\nH\nCl\nH\n0\n—\n—\nH\nH\nH\n\n\n601\nCH2\nH\nH\nCl\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n602\nCH2\nH\nH\nMe\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n603\nCH2\nH\nH\nCN\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n604\nCH2\nH\nH\nCF3\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n605\nCH2\nH\nH\nH\nF\nH\n0\n—\n—\nH\nH\nH\n\n\n606\nCH2\nH\nH\nH\nMe\nH\n0\n—\n—\nH\nH\nH\n\n\n607\nCH2\nH\nH\nF\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n608\nCH2\nH\nH\nMeO\nH\nMeO\n0\n—\n—\nH\nH\nH\n\n\n609\nCH2\nH\nH\nF\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n611\nCH2\nH\nH\nCl\nF\nH\n0\n—\n—\nH\nH\nH\n\n\n612\nCH2\nH\nH\nCF3\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n614\nCH2\nH\nH\nH\nBr\nH\n0\n—\n—\nH\nH\nH\n\n\n615\nCH2\nH\nH\nH\nH\nMeO\n0\n—\n—\nH\nH\nH\n\n\n616\nCH2\nH\nH\nNHAc\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n617\nCH2\nH\nH\nH\nH\nBr\n0\n—\n—\nH\nH\nH\n\n\n618\nCH2\nH\nBr\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n620\nCH2\nH\nH\nCF3O\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n621\nCH2\nH\nH\nCHF2O\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n622\nCH2\nH\nH\nOCH2-(4-F-Ph)\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n623\nCH2\nH\nMeO\nMeO\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n624\nCH2\nF\nH\nMeO\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n625\nCH2\nH\nH\nH\nC2H5O\nH\n0\n—\n—\nH\nH\nH\n\n\n626\nCH2\nH\nH\nH\n(3-CF3Ph)O)\nH\n0\n—\n—\nH\nH\nH\n\n\n628\nCH2\nH\nMeO\nH\nH\nF\n0\n—\n—\nH\nH\nH\n\n\n629\nCH2\nH\nH\nF\nMeO\nH\n0\n—\n—\nH\nH\nH\n\n\n630\nCH2\nH\nH\nC2H5O\nH\nH\n0\n—\n—\nH\nH\nH\n\n\n631\nCH2\nH\nMeO\nH\nH\nMeO\n0\n—\n—\nH\nH\nH\n\n\n632\nCH2\nH\nH\nH\nCF3O\nH\n0\n—\n—\nH\nH\nH\n\n\n633\nCH2\nH\nMeO\nH\nMeO\nH\n0\n—\n—\nH\nH\nH\n\n\n635\nCH2\nH\nH\nCl\nH\nF\n0\n—\n—\nH\nH\nH",
        "TABLE 1B\n\n\n\n\n\n\n\nAdamantane Substituted Amide Compounds\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nID\nL1—R3\nn\nR2′\nR2″\nRa\nRb\nRc\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n6\nH\n1\nH\nH\nH\nH\nH\n\n\n7\nmethyl\n1\nH\nH\nH\nH\nH\n\n\n8\nethyl\n1\nH\nH\nH\nH\nH\n\n\n13\n2-hydroxy-3-methoxy-propyl\n1\nH\nH\nH\nH\nH\n\n\n14\nphenethyl\n1\nH\nH\nH\nH\nH\n\n\n16\n3-pyridylmethyl\n1\nH\nH\nH\nH\nH\n\n\n18\n2-hydroxyethyl\n1\nH\nH\nH\nH\nH\n\n\n19\n3-hydroxypropyl\n1\nH\nH\nH\nH\nH\n\n\n23\n2,3-dihydroxypropyl\n1\nH\nH\nH\nH\nH\n\n\n43\n4-pyridylmethyl\n1\nH\nH\nH\nH\nH\n\n\n46\n2,5-dioxabicyclo[4.4.0deca-6,8,10-trien-9-\n1\nH\nH\nH\nH\nH\n\n\n\nylmethyl\n\n\n61\n2-pyridylmethyl\n1\nH\nH\nH\nH\nH\n\n\n63\n3-phenylpropyl\n1\nH\nH\nH\nH\nH\n\n\n64\n1H-indol-5-ylmethyl\n1\nH\nH\nH\nH\nH\n\n\n66\n[(5-methyl-2-thienyl)methyl\n1\nH\nH\nH\nH\nH\n\n\n67\n(1-methylimidazol-2-yl)methyl\n1\nH\nH\nH\nH\nH\n\n\n69\n4-quinolylmethyl\n1\nH\nH\nH\nH\nH\n\n\n73\n2-quinolylmethyl\n1\nH\nH\nH\nH\nH\n\n\n79\n(5-phenyl-2-thienyl)methyl\n1\nH\nH\nH\nH\nH\n\n\n80\n(2-butyl-1H-imidazol-4-yl)methyl\n1\nH\nH\nH\nH\nH\n\n\n81\n(5-methyl-3H-imidazol-4-yl)methyl\n1\nH\nH\nH\nH\nH\n\n\n82\n1H-imidazol-4-ylmethyl\n1\nH\nH\nH\nH\nH\n\n\n83\n(5-chloro-2-thienyl)methyl\n1\nH\nH\nH\nH\nH\n\n\n90\n(2,2-difluorobenzo[1,3dioxol-4-yl)methyl\n1\nH\nH\nH\nH\nH\n\n\n105\n2,3-dihydrobenzofuran-5-ylmethyl\n1\nH\nH\nH\nH\nH\n\n\n112\n(4-methyl-1-naphthyl)methyl\n1\nH\nH\nH\nH\nH\n\n\n118\n(6-methyl-2-pyridyl)methyl\n1\nH\nH\nH\nH\nH\n\n\n121\ncyclopentylmethyl\n1\nH\nH\nH\nH\nH\n\n\n122\ncyclohexylmethyl\n1\nH\nH\nH\nH\nH\n\n\n142\nmethylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n145\n2-naphthylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n146\n8-quinolylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n147\npropylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n148\nethylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n153\nbenzylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n157\n(5-methyl-2-oxa-5-azabicyclo[4.4.0deca-7,9,11-\n1\nH\nH\nH\nH\nH\n\n\n\ntrien-9-yl)sulfonyl\n\n\n158\n5-chloro-1,3-dimethyl-pyrazol-4-yl)sulfonyl\n1\nH\nH\nH\nH\nH\n\n\n159\n[5-methyl-2-(trifluoromethyl)-3-furylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n160\n5-methyl-1-phenyl-pyrazol-4-yl)sulfonyl\n1\nH\nH\nH\nH\nH\n\n\n163\n\n1\nH\nH\nH\nH\nH\n\n\n164\n1,2-dimethylimidazol-4-yl)sulfonyl\n1\nH\nH\nH\nH\nH\n\n\n169\n3,5-dimethylisoxazol-4-yl)sulfonyl\n1\nH\nH\nH\nH\nH\n\n\n170\nmethylsulfonylmethylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n171\n(2-oxochromen-6-yl)sulfonyl\n1\nH\nH\nH\nH\nH\n\n\n180\n3-pyridylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n182\n[3,5-bis(trifluoromethyl)phenylmethylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n183\n[4-(trifluoromethyl)phenylmethylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n184\n(4-fluorophenyl)methylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n185\n(3,4-dichlorophenyl)methylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n186\n(3,5-dichlorophenyl)methylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n187\n[3-(trifluoromethyl)phenylmethylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n188\n\n1\nH\nH\nH\nH\nH\n\n\n189\n(4-chlorophenyl)methylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n198\n1,3,5-trimethylpyrazol-4-yl)sulfonyl\n1\nH\nH\nH\nH\nH\n\n\n200\n2,5-dioxabicyclo[4.4.0deca-7,9,11-trien-9-\n1\nH\nH\nH\nH\nH\n\n\n\nylsulfonyl)\n\n\n213\nisopropylsulfonyl\n1\nH\nH\nH\nH\nH\n\n\n219\nacetyl\nI\nH\nH\nH\nH\nH\n\n\n222\n2-chloropyridine-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n223\npropanoyl\n1\nH\nH\nH\nH\nH\n\n\n224\n2-(4-methoxyphenyl)acetyl\n1\nH\nH\nH\nH\nH\n\n\n225\n2-phenylacetyl\n1\nH\nH\nH\nH\nH\n\n\n231\n3-cyclopentylpropanoyl\n1\nH\nH\nH\nH\nH\n\n\n235\n3,5,5-trimethylhexanoyl\n1\nH\nH\nH\nH\nH\n\n\n236\n2,2-diphenylacetyl\n1\nH\nH\nH\nH\nH\n\n\n237\npyridine-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n238\ncyclopentanecarbonyl\n1\nH\nH\nH\nH\nH\n\n\n239\n2-(2,5-dimethoxyphenyl)acetyl\n1\nH\nH\nH\nH\nH\n\n\n240\n2-methoxyacetyl\n1\nH\nH\nH\nH\nH\n\n\n241\n2-(4-fluorophenyl)acetyl\n1\nH\nH\nH\nH\nH\n\n\n244\ncyclohexanecarbonyl\n1\nH\nH\nH\nH\nH\n\n\n248\n3-phenylpropanoyl\n1\nH\nH\nH\nH\nH\n\n\n249\n2-phenoxyacetyl\n1\nH\nH\nH\nH\nH\n\n\n252\n2,2-dimethylpropanoyl\n1\nH\nH\nH\nH\nH\n\n\n254\n2-(3,4-dimethoxyphenyl)acetyl\n1\nH\nH\nH\nH\nH\n\n\n255\n3-methylbutanoyl\n1\nH\nH\nH\nH\nH\n\n\n256\n2-benzyloxyacetyl\n1\nH\nH\nH\nH\nH\n\n\n259\nquinoxaline-2-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n260\ncyclopropanecarbonyl\n1\nH\nH\nH\nH\nH\n\n\n261\n2-(3-methoxyphenyl)acetyl\n1\nH\nH\nH\nH\nH\n\n\n262\n3,3-dimethylbutanoyl\n1\nH\nH\nH\nH\nH\n\n\n263\n2-cyclopentylacetyl\n1\nH\nH\nH\nH\nH\n\n\n264\n2-(4-chlorophenoxy)acetyl\n1\nH\nH\nH\nH\nH\n\n\n265\n2-(4-chlorophenyl)acetyl\n1\nH\nH\nH\nH\nH\n\n\n273\n5-methyl-2-phenyl-triazole-4-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n274\n2-phenoxypyridine-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n276\n7,10-dioxabicyclo[4.4.0deca-2,4,11-triene-9-\n1\nH\nH\nH\nH\nH\n\n\n\ncarbonyl)\n\n\n281\n6-chloropyridine-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n283\n5-methylisoxazole-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n284\n1,5-dimethylpyrazole-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n285\n2,5-dimethylpyrazole-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n286\n1-phenyl-5-(trifluoromethyl)pyrazole-4-\n1\nH\nH\nH\nH\nH\n\n\n\ncarbonyl\n\n\n287\n\n1\nH\nH\nH\nH\nH\n\n\n288\n5-methyl-1-phenyl-pyrazole-4-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n289\n5-(4-chlorophenyl)-2-methyl-furan-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n290\nnaphthalene-2-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n293\n2,5-dimethylfuran-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n295\n1-acetylpiperidine-4-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n296\nisoxazole-5-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n297\n3,5-dimethylisoxazole-4-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n298\n2-chloropyridine-4-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n299\n5-methylisoxazole-4-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n300\n5-methyl-2-tert-butyl-pyrazole-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n302\n2-(2-bromophenyl)acetyl\n1\nH\nH\nH\nH\nH\n\n\n303\nquinoline-2-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n304\npyridine-4-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n305\npyridme-2-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n306\n1-(2,2,2-trifluoroacetyl)pyrrolidine-2-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n307\n3-methoxypropanoyl\n1\nH\nH\nH\nH\nH\n\n\n308\npyrazine-2-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n309\n2,3-dihydrobenzofuran-5-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n311\nquinoxaline-6-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n313\nchroman-3-carbonyl\n1\nH\nH\nH\nH\nH\n\n\n317\n1-(2,5-dioxabicyclo[4.4.0deca-6,8,10-trien-9-\n1\nH\nH\nH\nH\nH\n\n\n\nyl)ethyl\n\n\n318\n9H-fluoren-2-ylmethyl\n1\nH\nH\nH\nH\nH\n\n\n321\nbenzo[1,3dioxol-5-ylmethyl\n1\nH\nH\nH\nH\nH\n\n\n332\n1H-indol-6-ylmethyl\n1\nH\nH\nH\nH\nH\n\n\n333\n2,6-dioxabicyclo[5.4.0undeca-7,9,11-trien-9-\n1\nH\nH\nH\nH\nH\n\n\n\nylmethyl\n\n\n350\n(7,10-dioxabicyclo[4.4.0deca-1,3,5-trien-4-\n1\nCH3\nCH3\nH\nH\nH\n\n\n\nylmethyl)\n\n\n351\n(1H-indol-6-ylmethyl)\n1\nCH3\nCH3\nH\nH\nH\n\n\n353\nbenzylsulfonyl\n1\nCH3\nCH3\nH\nH\nH\n\n\n356\n(3,4-dichlorophenyl)methylsulfonyl\n1\nCH3\nCH3\nH\nH\nH\n\n\n357\n(4-chlorophenyl)methylsulfonyl\n1\nCH3\nCH3\nH\nH\nH\n\n\n365\n(2-cyclopentylacetyl)\n1\nCH3\nCH3\nH\nH\nH\n\n\n366\n(cyclohexanecarbonyl)\n1\nCH3\nCH3\nH\nH\nH\n\n\n367\n(3,3-dimethylbutanoyl)\n1\nCH3\nCH3\nH\nH\nH\n\n\n373\n7,10-dioxabicyclo[4.4.0deca- 1,3,5-trien-4-\n1\nH\nH\nCH3\nCH3\nH\n\n\n\nylmethyl)\n\n\n375\n2-(3,5-dimethyl-1-adamantyl)-1H-indol-6-\n1\nH\nH\nCH3\nCH3\nH\n\n\n\nylmethyl)\n\n\n377\nbenzylsulfonyl\n1\nH\nH\nH\nCH3\nCH3\n\n\n378\n(3,4-dichlorophenyl)methylsulfonyl\n1\nH\nH\nH\nCH3\nCH3\n\n\n379\n(4-chlorophenyl)methylsulfonyl\n1\nH\nH\nH\nCH3\nCH3\n\n\n384\n(2-cyclopentylacetyl)\n1\nH\nH\nH\nCH3\nCH3\n\n\n386\n(cyclohexanecarbonyl)\n1\nH\nH\nH\nCH3\nCH3\n\n\n388\n(3,3-dimethylbutanoyl)\n1\nH\nH\nH\nCH3\nCH3\n\n\n393\nacetyl\n0\n—\n—\nH\nH\nH\n\n\n397\n[2-(4-methoxyphenyl)acetyl]\n0\n—\n—\nH\nH\nH\n\n\n398\n(2-phenylacetyl)\n0\n—\n—\nH\nH\nH\n\n\n409\n(2,2-diphenylacetyl)\n0\n—\n—\nH\nH\nH\n\n\n411\n[2-(2,5-dimethoxyphenyl)acetyl]\n0\n—\n—\nH\nH\nH\n\n\n412\n(2-methoxyacetyl)\n0\n—\n—\nH\nH\nH\n\n\n413\n[2-(4-fluorophenyl)acetyl]\n0\n—\n—\nH\nH\nH\n\n\n420\n(3-phenylpropanoyl)\n0\n—\n—\nH\nH\nH\n\n\n421\n(2-phenoxyacetyl)\n0\n—\n—\nH\nH\nH\n\n\n424\n(2,2-dimethylpropanoyl)\n0\n—\n—\nH\nH\nH\n\n\n428\n(2-benzyloxyacetyl)\n0\n—\n—\nH\nH\nH\n\n\n431\n(quinoxaline-2-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n432\n(cyclopropanecarbonyl)\n0\n—\n—\nH\nH\nH\n\n\n433\n[2-(3-methoxyphenyl)acetyl]\n0\n—\n—\nH\nH\nH\n\n\n436\n[2-(4-chlorophenoxy)acetyl]\n0\n—\n—\nH\nH\nH\n\n\n437\n[2-(4-chlorophenyl)acetyl]\n0\n—\n—\nH\nH\nH\n\n\n445\n(5-methyl-2-phenyl-triazole-4-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n446\n(2-phenoxypyridine-3-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n453\n(6-chloropyridine-3-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n455\n(5-methylisoxazole-3-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n456\n(1,5-dimethylpyrazole-3-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n458\n(5-methyl-1-phenyl-pyrazole-4-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n459\n[5-(4-chlorophenyl)-2-methyl-furan-3-carbonyl]\n0\n—\n—\nH\nH\nH\n\n\n460\n(naphthalene-2-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n463\n(2,5-dimethylfuran-3-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n465\n(1-acetylpiperidine-4-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n466\n(isoxazole-5-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n468\n(5-methyl-2-tert-butyl-pyrazole-3-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n470\n[2-(2-bromophenyl)acetyl]\n0\n—\n—\nH\nH\nH\n\n\n471\n(quinoline-2-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n472\n[1-(2,2,2-trifluoroacetyl)pyrrolidine-2-carbonyl]\n0\n—\n—\nH\nH\nH\n\n\n474\n(2,3-dihydrobenzofuran-5-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n477\n(chroman-3-carbonyl)\n0\n—\n—\nH\nH\nH\n\n\n480\nmethylsulfonyl\n0\n—\n—\nH\nH\nH\n\n\n483\n(2-naphthylsulfonyl)\n0\n—\n—\nH\nH\nH\n\n\n484\n(8-quinolylsulfonyl)\n0\n—\n—\nH\nH\nH\n\n\n485\npropylsulfonyl\n0\n—\n—\nH\nH\nH\n\n\n486\nethylsulfonyl\n0\n—\n—\nH\nH\nH\n\n\n491\nbenzylsulfonyl\n0\n—\n—\nH\nH\nH\n\n\n494\n[(5-methyl-2-oxa-5-azabicyclo[4.4.0]deca-\n0\n—\n—\nH\nH\nH\n\n\n\n7,9,11-trien-9-yl)sulfonyl]\n\n\n495\n(5-chloro-1,3-dimethyl-pyrazol-4-yl)sulfonyl\n0\n—\n—\nH\nH\nH\n\n\n496\n(5-methyl-1-phenyl-pyrazol-4-yl)sulfonyl\n0\n—\n—\nH\nH\nH\n\n\n499\n(1,2-dimethylimidazol-4-yl)sulfonyl\n0\n—\n—\nH\nH\nH\n\n\n503\n(3,5-dimethylisoxazol-4-yl)sulfonyl\n0\n—\n—\nH\nH\nH\n\n\n505\n(2-oxochromen-6-yl)sulfonyl\n0\n—\n—\nH\nH\nH\n\n\n515\n[[3,5-\n0\n—\n—\nH\nH\nH\n\n\n\nbis(trifluoromethyl)phenyl]methylsulfonyl]\n\n\n516\n[[4-(trifluoromethyl)phenyl]methylsulfonyl]\n0\n—\n—\nH\nH\nH\n\n\n517\n[(4-fluorophenyl)methylsulfonyl]\n0\n—\n—\nH\nH\nH\n\n\n518\n[(3,4-dichlorophenyl)methylsulfonyl]\n0\n—\n—\nH\nH\nH\n\n\n519\n[(3 ,5-dichlorophenyl)methylsulfonyl]\n0\n—\n—\nH\nH\nH\n\n\n520\n[[3-(trifluoromethyl)phenyl]methylsulfonyl]\n0\n—\n—\nH\nH\nH\n\n\n522\n[(4-chlorophenyl)methylsulfonyl]\n0\n—\n—\nH\nH\nH\n\n\n531\n(1,3,5-trimethylpyrazol-4-yl)sulfonyl\n0\n—\n—\nH\nH\nH\n\n\n534\n(2,5-dioxabicyclo[4.4.0]deca-7,9,11-trien-9-\n0\n—\n—\nH\nH\nH\n\n\n\nylsulfonyl)\n\n\n547\nisopropylsulfonyl\n0\n—\n—\nH\nH\nH\n\n\n552\n(3,5,5-trimethyihexyl)\n0\n—\n—\nH\nH\nH\n\n\n553\n(2,2-diphenylethyl)\n0\n—\n—\nH\nH\nH\n\n\n554\n(2-phenylpropyl)\n0\n—\n—\nH\nH\nH\n\n\n555\npropyl\n0\n—\n—\nH\nH\nH\n\n\n556\n(cyclohexylmethyl)\n0\n—\n—\nH\nH\nH\n\n\n557\n(cyclopropylmethyl)\n0\n—\n—\nH\nH\nH\n\n\n558\npentyl\n0\n—\n—\nH\nH\nH\n\n\n559\n(3-phenylpropyl)\n0\n—\n—\nH\nH\nH\n\n\n560\n(3-pyridylmethyl)\n0\n—\n—\nH\nH\nH\n\n\n564\n(benzo[1,3]dioxol-5-ylmethyl)\n0\n—\n—\nH\nH\nH\n\n\n565\n(2-naphthylmethyl)\n0\n—\n—\nH\nH\nH\n\n\n567\n[(6-methyl-4-oxo-chromen-3-yl)methyl]\n0\n—\n—\nH\nH\nH\n\n\n580\n[(1-methylindol-3-yl)methyl]\n0\n—\n—\nH\nH\nH\n\n\n581\n(2-ethylbutyl)\n0\n—\n—\nH\nH\nH\n\n\n582\n(2-methylpentyl)\n0\n—\n—\nH\nH\nH\n\n\n583\nisopentyl\n0\n—\n—\nH\nH\nH\n\n\n589\n(2,5-dioxabicyclo[4.4.0]deca-6,8,10-trien-9-\n0\n—\n—\nH\nH\nH\n\n\n\nylmethyl)\n\n\n596\n(benzo[1,3]dioxol-4-ylmethyl)\n0\n—\n—\nH\nH\nH\n\n\n599\n[(6-chlorobenzo[1,3]dioxol-5-yl)methyl]\n0\n—\n—\nH\nH\nH\n\n\n600\nneopentyl\n0\n—\n—\nH\nH\nH\n\n\n610\n(4-pyridylmethyl)\n0\n—\n—\nH\nH\nH\n\n\n613\n[(6-bromo-3-pyridyl)methyl]\n0\n—\n—\nH\nH\nH\n\n\n619\n(cyclopentylmethyl)\n0\n—\n—\nH\nH\nH\n\n\n627\n[(2,2-difluorobenzo[1,3]dioxol-5-yl)methyl]\n0\n—\n—\nH\nH\nH\n\n\n634\n[(6-chloro-3-pyridyl)methyl]\n0\n—\n—\nH\nH\nH",
        "TABLE 1C\n\n\n\n\n\n\n\nSubstituted Amide Compounds\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nID\nL1—R3\nR1a\n\n\n\n\n\n\n\n\n\n\n\n\n9\n4-benzyl\ncyclohexylmethyl\n\n\n10\n4-benzyl\ncycloheptylmethyl\n\n\n11\nH\ncyclohexylmethyl\n\n\n12\nH\ncycloheptylmethyl\n\n\n20\nethyl\ncyclohexylmethyl\n\n\n21\n(3-hydroxypropyl)\ncyclohexylmethyl\n\n\n22\n(2-hydroxyethyl)\ncyclohexylmethyl\n\n\n24\nbenzyl\n(2-methoxyphenyl)ethyl\n\n\n25\nH\n(2-methoxyphenyl)ethyl\n\n\n26\nmethyl\ncyclohexylmethyl\n\n\n93\n(3-pyridylmethyl)\ncycloheptylmethyl\n\n\n94\n(2-pyridylmethyl)\ncycloheptylmethyl\n\n\n124\n(3-phenylpropyl)\n(3-phenylpropyl)\n\n\n125\n(5-methyl-2-thienyl)methyl\ncycloheptylmethyl\n\n\n126\n(1H-imidazol-4-ylmethyl)\ncycloheptylmethyl\n\n\n127\n(cyclohexylmethyl)\ncycloheptylmethyl\n\n\n128\n(cyclopentylmethyl)\ncycloheptylmethyl\n\n\n129\nphenethyl\ncycloheptylmethyl\n\n\n130\n(4-fluorophenyl)methyl\ncycloheptylmethyl\n\n\n132\n(3-pyridylmethyl)\n(2-methoxyphenyl)ethyl\n\n\n133\n(4-pyridyl)methyl\n(2-methoxyphenyl)ethyl\n\n\n134\n(2-pyridylmethyl)\n(2-methoxyphenyl)ethyl\n\n\n135\n(1H-imidazol-4-ylmethyl)\n(2-methoxyphenyl)ethyl\n\n\n136\n(cyclohexylmethyl)\n(2-methoxyphenyl)ethyl",
        "TABLE 1D\n\n\n\n\n\n\n\nSubstituted Amide Compounds\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nID\nL1—R3\nR1a\n\n\n\n\n\n\n\n\n\n\n\n\n1\nbenzyl\n2-(2-chlorophenyl)ethyl]\n\n\n2\nH\n(cyclohexylmethyl)\n\n\n3\nH\nphenethyl\n\n\n4\nbenzyl\n(cyclohexylmethyl)\n\n\n17\nbenzyl\n(1-adamantylmethyl)\n\n\n48\n(3-pyridylmethyl)\n(cyclohexylmethyl)\n\n\n49\n(4-pyridylmethyl)\n(cyclohexylmethyl)\n\n\n50\n(2-chlorophenyl)methyl\n(cyclohexylmethyl)\n\n\n51\n(4-chlorophenyl)methyl\n(cyclohexylmethyl)\n\n\n52\n(2-pyridylmethyl)\n(cyclohexylmethyl)\n\n\n53\n(3-chlorophenyl)methyl\n(cyclohexylmethyl)\n\n\n54\n(4-methoxyphenyl)methyl\n(cyclohexylmethyl)\n\n\n55\n(p-tolylmethyl)\n(cyclohexylmethyl)\n\n\n56\n(4-methylsulfonylphenyl)methyl\n(cyclohexylmethyl)\n\n\n57\n(4-acetamidophenyl)methyl\n4-[(4-acetamidophenyl)methyl]-\n\n\n\n\n(cyclohexylmethyl)\n\n\n58\nbenzyl\n[(1-hydroxycycloheptyl)methyl]\n\n\n59\nbenzyl\n[(1-hydroxy-3,3-dimethyl-\n\n\n\n\ncyclohexyl)methyl]\n\n\n60\nbenzyl\n[[1-(p-tolyl)cyclohexyl]methyl]\n\n\n137\n(2,4-difluorophenyl)methyl\n(1-adamantylmethyl)\n\n\n138\n(7,10-dioxabicyclo[4.4.0]deca-\n(1-adamantylmethyl)\n\n\n\n1,3,5-trien-4-ylmethyl)\n\n\n139\n[(2-fluorophenyl)methyl]\n(1-adamantylmethyl)\n\n\n316\n[(3-fluorophenyl)methyl]\n(1-adamantylmethyl)\n\n\n335\n[(3-methoxyphenyl)methyl]\n(1-adamantylmethyl)\n\n\n336\n(o-tolylmethyl)\n(1-adamantylmethyl)\n\n\n337\n[(2-chlorophenyl)methyl]\n(1-adamantylmethyl)\n\n\n338\n(4-fluorophenyl)methyl\n(1-adamantylmethyl)\n\n\n340\nbenzo[1,3]dioxol-5-ylmethyl\n(1-adamantylmethyl)",
        "TABLE 1E\n\n\n\n\n\n\n\nMisc. Amide Compounds\n\n\n\n\n\n\n\n\nID\nSTRUCTURE\n\n\n\n\n\n368\n\n\n\n\n\n\n \n\n\n342\n\n\n\n\n\n\n \n\n\n636",
        "TABLE 2\n\n\n\n\n\n\n\nNMR Data for Exemplary Compounds of the Invention.\n\n\n\n\n\n\n\n\nID\nNMR Data\n\n\n\n\n\n\n\n\n\n\n\n5\n(CDCl3) ‘δ’ 8.68(s, 1H), 7.50(s, 1H), 7.30(m, 5H), 3.70(s, 4H), 2.74(s, 4H), 2.30(s, 2H),\n\n\n\n1.98(br ‘s’, 3H), 1.65(m, 12H).\n\n\n6\n(CDCl3) ‘δ’ 8.70(s, 1H), 7.73(s, 1H), 4.06(s, 2H), 3.13(t, J=5.7Hz, 2H), 2.66(t, J=5.7Hz, 2H),\n\n\n\n2.29(s, 2H), 1.99(br‘s’, 3H), 1.\n\n\n7\n(CDCl3) δ 8.71(s, 1H), 7.60(s, 1H), 3.63(s, 3H), 2.91-2.83(m, 6H), 2.48(s, 2H), 2.33(s, 2H),\n\n\n\n2.04-1.55(m, 1H).\n\n\n8\n(CDCl3) δ 8.71(s, 1H), 7.60(s, 1H), 3.68(s, 2H), 2.76(brs, 4H), 2.62(q, 2H), 2.34(brs, 2H), 1.99(brs,\n\n\n\n3H), 1.80-1.48(m, 12H), 1.18(t, 3H).\n\n\n9\n(CD3OD) δ 8.64(s, 1H), 7.42-7.21(m, 5H), 3.73(s, 2H), 3.64(s, 2H), 2.83-2.65(m, 4H), 2.36(d, 2H),\n\n\n\n1.95-1.50(m, 6H), 1.40-0.95(m, 5H).\n\n\n10\n(CD3OD) δ 8.64(s, 1H), 7.40-7.20(m, 5H), 3.73(s, 2H), 3.64(s, 2H), 2.75-2.66(m, 4H), 2.40(d, 2H),\n\n\n\n2.10-2.0(m, 1H), 1.94-1.90(m, 12H).\n\n\n11\n(CD3OD) δ 8.66(s, 1H), 3.95(brs, 2H), 3.09(t, 2H), 2.67(t, 2H), 2.36(d, 2H), 1.95-0.98(m, 11H).\n\n\n13\n(CDCl3) δ 8.71(s, 1H), 7.89(s, 1H), 4.05-3.66(m, 3H), 3.55-3.39(m, 5H), 2.98-2.55(m, 5H), 2.28(brs,\n\n\n\n2H), 1.99(brs, 4H), 1.75-1.60(m, 14H).\n\n\n17\nCD3OD) ‘δ’ 8.91(s, 1H), 7.4-7.3(m, 5H), 3.75(s, 2H), 3.7(s, 2H), 3.25(t, J=5.8, 2H), 3.08(s,\n\n\n\n2H), 2.81(1, J=5.8, 2H), 1.98(s, 4H), 1.78-1.6(m, 16H).\n\n\n26\n(CD3OD) δ 8.67(s, 1H), 2.83(s, 2H), 2.72(s, 3H), 2.47(brs, 4H), 2.36(d, 2H), 1.98-1.59(m, 6H),\n\n\n\n1.40-0.95(m, 5H).\n\n\n27\n(CD3OD) δ 8.65(s, 1H), 7.54-7.24(m, 4H), 3.86(s, 2H), 3.57(s, 2H), 2.84(t, 2H), 2.76(t, 2H), 2.22(s,\n\n\n\n2H), 2.0-1.60(m, 15H).\n\n\n28\n(DMSO-d6) δ 10.16(s, 1H), 8.70(s, 1H), 7.32-7.27(m, 1H), 7.48(dt, 1H) 7.39-7.32(m, 1H),\n\n\n\n7.24-7.17(m, 2H) 3.76(s, 2H), 3.61(s, 2H), 2.70(t, 2H), 2.62(t, 2H), 2.15(s, 2H) 1.93(br s, 3H) 1.70-1.53(m, 12H)\n\n\n30\n(CD3OD) δ 8.64(s, 1H), 7.22(d, 1H), 6.59-6.44(m, 2H), 3.81(s, 3H), 3.78(s, 3H), 3.72(s, 2H), 3.66(s,\n\n\n\n2H), 2.81(t, 2H), 2.76(t, 2H), 2.20(s, 2H), 2.05-1.60(m, 15H).\n\n\n31\n(DMSO-d6) δ 10.16(s, 1H), 8.70(s, 1H), 7.32-7.27(m, 1H), 7.21-7.15(m, 3H), 3.65(s, 2H), 3.58(s, 2H),\n\n\n\n2.68(t, 2H), 2.60(t, 2H), 2.34(s, 3H), 2.15(s, 2H) 1.93(br s, 3H) 1.70-1.53(m, 12H)\n\n\n39\n(CD3OD) δ 8.64(s, 1H), 7.14-7.12(m, 2H), 6.85(d, 1H), 3.81(s, 3H), 3.64(s, 2H), 3.62(s, 2H),\n\n\n\n2.77(brs, 4H), 2.22(s, 2H), 2.17(s, 3H), 2.0-1.56(m, 15H).\n\n\n41\n(CD3OD) δ 8.65(s, 1H), 7.37(d, 2H), 7.33(d, 2H), 3.72(s, 2H), 3.64(s, 2H), 2.77(brs, 4H), 2.22(s, 2H),\n\n\n\n2.0-1.48(m, 15H).\n\n\n46\n(CD3OD) δ 8.65(s, 1H), 6.84-6.65(m, 3H), 4.21(brs, 4H), 3.63(brs, 4H), 2.78(brs, 4H), 2.22(s, 2H),\n\n\n\n2.04-1.60(m, 15H).\n\n\n47\n(CD3OD) δ 8.65(s, 1H), 7.29-7.21(m, 1H), 7.0-6.84(m, 2H), 3.79(s, 2H), 3.68(s, 2H), 2.82-2.65(m,\n\n\n\n4H), 2.21(s, 2H), 2.05-1.60(m, 15H).\n\n\n58\n(CD3OD) δ 8.92(s, 1H), 7.41-7.25(m, 5H), 3.75(s, 2H), 3.71(s, 2H), 3.38-3.30(m, 3H), 2.81(t, 2H),\n\n\n\n1.70-1.45(m, 13H).\n\n\n60\n(CD3OD) δ 8.82(s, 1H), 8.53(s, 1H), 7.20-7.05(m, 9H), 3.89-3.19(m, 8H), 3.05(t, 2H), 2.74(t, 2H),\n\n\n\n2.20-2.05(m, 5H), 1.85-1.10(m, 7H).\n\n\n71\n(CD3OD) δ 8.65(s, 1H), 7.38(d, 2H), 7.29(d, 2H), 3.71(s, 2H), 3.64(s, 2H), 2.79(brs, 4H), 2.22(s, 2H),\n\n\n\n2.0-1.60(m, 15H), 1.32(s, 9H).\n\n\n90\n(CD3OD) δ 8.65(s, 1H), 7.23-7.10(m, 3H), 3.85(s, 2H), 3.70(s, 2H), 2.83-2.65(m, 4H), 2.22(s, 2H),\n\n\n\n2.01-1.60(m, 15H).\n\n\n107\n(CD3OD) δ 8.65(s, 1H), 7.86(dd, 1H), 7.43-7.25(m, 2H), 3.86(s, 2H), 3.69(s, 2H), 2.77(brs, 4H),\n\n\n\n2.22(s, 2H), 2.10-1.58(m, 15H).\n\n\n137\n(CD3OD) δ 8.65(s, 1H), 7.60-7.41(m, 1H), 7.02-6.95(m, 2H), 3.81(s, 2H), 3.70(s, 2H), 3.03(s, 2H),\n\n\n\n2.80(brt, 4H), 2.06-1.56(m, 15H).\n\n\n140\n(CD3OD) δ 8.66(s, 1H), 7.30(d, 2H), 6.90(d, 2H), 4.45(s, 2H), 3.79(s, 2H), 3.76(s, 2H), 2.96-2.70(m,\n\n\n\n4H), 2.21(s, 2H), 2.0-1.60(m, 15H).\n\n\n168\n(DMSO-d6) δ 10.28(s, 1H), 8.76(s, 1H), 7.90(t, 1H), 7.86-7.78(m, 2H), 7.67(t, 1H), 4.27(s, 2H),\n\n\n\n3.39(t, 2H), 2.66(t, 2H), 2.16(s, 2H), 1.94(br s, 3H), 1.71-1.56(m, 12H)\n\n\n316\n(CD3OD) δ 8.92(s, 1H), 7.36-6.90(m, 4H), 3.79(s, 2H), 3.75(s, 2H), 3.03(brs, 2H), 2.80(brs, 2H),\n\n\n\n2.62(s, 2H), 2.10-1.56(m, 15H).\n\n\n321\n(DMSO-d6) δ 10.15(s, 1H), 8.70(s, 1H), 6.93-6.79(m, 3H), 6.0(s, 2H), 3.59(s, 2H), 3.55(s, 2H),\n\n\n\n2.68-2.58(m, 4H), 2.15(s, 2H) 1.93(br s, 3H), 1.71-1.52(m, 12H)\n\n\n334\n(d6-DMSO) δ 9.77(s, 1H), 8.72(s, 1H), 7.20-7.10(m, 5H), 3.68(s, 2H), 3.59(s, 2H), 2.64(brs, 4H),\n\n\n\n2.05-1.80(m, 15H).\n\n\n338\n(CDCl3) δ 8.89(s, 1H), 7.39-7.28(m, 2H), 7.20-6.90(m, 2H), 3.68(d, 2H), 3.46(t, 2H), 3.10(d, 2H),\n\n\n\n2.76(t, 2H), 2.15(s, 2H), 2.0-1.20(m, 15H).\n\n\n339\n(CDCl3) δ 8.66(s, 1H), 7.39-7.24(m, 5H), 3.71(brs, 4H), 2.74(brs, 4H), 2.01(brs, 2H), 1.78-1.46(m,\n\n\n\n13H), 1.25(s, 6H).\n\n\n368\n(CDCl3) δ 8.13(s, 1H), 7.40-7.20(m, 5H), 3.68(s, 2H), 3.58(s, 2H), 3.14(d, 2H), 2.88(t, 2H), 2.74(t,\n\n\n\n2H), 2.51(s, 3H), 2.0(brs, 3H), 1.80-1.52(m, 12H).\n\n\n535\n(CDCl3) δ 8.33(d, 1H), 7.97(d, 1H), 7.49(t, 1H), 7.33-7.28(m, 2H), 7.13-7.08(m, 2H), 7.02(t, 2H),\n\n\n\n6.45(d, 1H), 5.18(s, 2H), 2.20(s, 2H), 2.02(brs, 3H), 1.75-1.54(m, 12H)",
        "The following biological examples, Examples 1-9, are offered to illustrate the present invention and are not to be construed in any way as limiting its scope. In the examples below, all temperatures are in degrees Celsius (unless otherwise indicated).",
        "The P2X7 receptor is strongly expressed in macrophage-derived cell lines, including, but not limited to, J774 (mouse macrophage line, American Type Culture Collection (ATCC), Rockville, Md., ATCC TIB-67), P388.(mouse cell line, ATCC CCL-46), P815 (mouse mast cell mastocytoma-derived line, ATCC TIB-64), THP-1 (Human monocyte-derived cell line, ATCC TIB202) and U937 (human cell line derived from histiocytic lymphoma, induceable to monocyte differentiation, ATCC CRL-1593.2) and in isolated macrophage cultures. Human or non-human animal macrophages are isolated using the procedure noted below.",
        "The P2Z/P2X7 receptor can be characterized by measuring channel opening, for instance ion flux, and/or by assessing pore formation, including by monitoring dye uptake or cell lysis in cells naturally expressing this receptor. Compounds such as ATP, 2′ and 3′-(O)-(4-benzoyl benzoyl) ATP (BzATP) effect the formation of pores in the plasma membrane of these cells, particularly at low extracellular divalent ion concentrations (Buisman et al, Proc. Natl. Acad. Sci. USA 85:7988 (1988); Zambon et al, Cell. Immunol 156:458 (1994); Hickman et al Blood 84:2452 (1994)). Large molecular size dyes, including propidium dye YO-PRO-1, can be seen entering macrophage-derived cell lines during cell recordings (Hickman et al, Blood 84:2452 (1994); Wiley et al, Br J Pharmacol 112:946 (1994); Steinberg et al, J Biol Chem 262:8884 (1987)). Ethidium bromide (a fluorescent DNA probe) can also be monitored, where an increase in the fluorescence of intracellular DNA-bound ethidium bromide is observed. Expression of recombinant rat or human rP2X7 in cells, including HEK293 cells, and in Xenopus oocytes demonstrates influx and pore formation by whole cell recordings and YO-PRO-1 fluorescence (Suprenant et al, Science 272:735 (1996); Rassendren et al, J Biol Chem 272:5482 (1997)).",
        "The compounds of the invention may be tested for antagonist activity at the P2X7 receptor. Tests that may be performed include and are selected from: (i) electrophysiological experiments; (ii) YO-PRO1 fluorescence; (iii) ethidium bromide fluorescence; and (iv) IL-1β release from stimulated macrophages, including as described below. Compounds can be tested in vivo in animal models including for inflammation models (e.g paw edema model, collagen-induced arthritis, EAE model of MS).",
        "Isolation of Human Macrophages",
        "Monocyte-derived human or non-human animal macrophage cultures are prepared as described by Blanchard et al (Blanchard et al, J Cell Biochem 57:452 (1995); Blanchard et al, J Immunol 147:2579 (1991)). Briefly, monocytes are isolated from leukocyte concentrates obtained from a healthy volunteer. Leukocytes are suspended in RPMI 1460 medium (Life Techologies, Inc.) with 20% serum (human for human cells), 2 mM glutamine, 5 mM HEPES, and 100 μg/ml streptomycin. Cells are allowed to adhere to culture flasks for 1-2 h, after which nonadherent cells are washed away. Adherent cells are cultured for 7-14 d in this medium plus interferon-y (human for human cells) (1000 units/ml). Macrophages are recovered from the culture flask by pipetting with cold phosphate-buffered saline and plated onto glass coverslips for electrophysiological or other experiments carried out 12-24 h later.",
        "Whole cell recordings are made using the EPC9 patch-clamp amplifier and Pulse acquisition programs (HEKA, Lambrecht, Germany). Whole-cell recordings are obtained from cells, e.g. J774A.1 cells (American Type Culture Collection, Rockville, Md., ATCC TIB-67)); agonists are applied for periods of 1 to 3 s by a fast-flow U-tube delivery system [E. M. Fenwick, A. Marty, E. Neher, J. Physiol, (London) 331, 577 (1982)]. The internal pipette solution is 140 mM cesium-aspartate or potassium-aspartate, 20 mM NaCl, 10 mM EGTA, and 5 mM Hepes; normal external solution is 145 mM NaCl, 2 mM KCl, 2 mM CaCl2, 1 mM MgCl2, 10 mM Hepes, and 12 mM glucose. Low divalent external solution is nominally magnesium-free with 0.3 mM CaCl2. Concentration-response curves are constructed in low divalent solution by recording currents in response to 1 s applications of agonist at 8 min intervals with normal external solution present for 6 min before each application. This protocol is necessary to prevent the development of sustained inward currents.",
        "Reversal potentials (Erev) are obtained by application of ATP (300 μM) or BzATP (30 μM)(controls), or the compound being tested, while the membrane is held at various potentials or by application of voltage ramps from −120 to 30 or 50 mV. Permeability ratios are calculated from Erev by first computing α (=PNa/PK, where P is permeability) for internal (i) and external (o) concentrations [Na]i=20 mM, [Na]o=145 mM, [K]o=0 mM, and [K]i=140 mM from α=([145/exp(ErevFIRT)]−20)/140 (where F is the Faraday, R is the gas constant, and T is the absolute temperature). Other Px/PNa values, when [X]o=145 mM, [Na]i=20 mM, [K]i=140 mM, and [Na]o=[K]o=[X]i=0 mM, are computed from Px/PNa=[(exp)ErevF/RT)] (20+140α))/145. In order of size, X is cesium, methylamine, tris(hydroxymethyl)-aminomethane, tetraethylammonium, and N-methyl-D-glucamine. The internal solution also contains 10 mM EGTA and 5 mM Hepes. External solutions also contain 10 mM glucose and normal or low concentrations of divalent cations; pH is maintained at 7.3 with HCl, histidine, or Hepes as required, and the osmolarity of all solutions is 295 to 315.",
        "The Photonics Imaging (IDEA) system for microscopic fluorescence measurements (Photonics, Planegg, Germany) is used. Coverslips are placed at the stage of a Zeiss Axiovert 100 or equivalent inverted microscope and viewed under oil immersion with a 40× Fluor objective. YO-PRO-1 (10 μM; Molecular Probes, Eugene, Oreg.) is added to the superfusion fluid during electrophysiological recordings 3 to 6 min before switching to low divalent solution and washed out upon switching back to normal divalent solution, after which the fluorescent lamp is turned on and cells are examined with a fluorescein isothiocyanate filter. YO-PRO1 fluorescence is measured using 491/509 nm excitation/emission wavelengths. Images are obtained at 5-20 s intervals during continuous superfusion (2 ml/min) with YO-PRO1 and varying concentrations of control ATP, BzATP or compound to be tested. For each experiment, the time course of YO-PRO1 fluorescence is obtained for 10-20 individual cells and then averaged to obtain the mean fluorescence signal. Results are expressed as mean signal at 3 min for rP2X7, and the signal at 10 min is used for P2X7 and human macrophage cells. All experiments are carried out at room temperature.",
        "Compounds of the invention are tested for antagonist activity at the P2X7 receptor by monitoring Ethidium Bromide entering P2X7 receptor-expressing cells on pore formation. The test is performed in 96-well flat bottomed microtitre plates, the wells being filled with 250 μl of test solution comprising 200 μl of a suspension of P2X7-expressing cells (e.g. THP-1 cells, J774 cells, etc.)(2.5×106 cells/ml) containing 10−4M ethidium bromide, 25 μl of a high potassium buffer solution containing 10−5M BzATP, and 25 μl of a high potassium buffer solution containing test compound. The plate is covered with a plastic sheet and incubated at 37° C. for one hour. The plate is then read in a Perkin-Elmer fluorescent plate reader, excitation 520 nm, emission 595 nm, slit widths: Ex 15 nm, EM 20 nm. For the purposes of comparison, BzATP (a P2X7 receptor agonist) and pyridoxal 5-phosphate (a P2X7 receptor agonist) are used separately in the test as controls. From the readings obtained, a pIC50 figure is calculated for each test compound. This figure is the negative logarithm of the concentration of test compound necessary to reduce the BzATP agonist activity by 50%.",
        "This Example demonstrates the testing of the compounds of this invention for efficacy as inhibitors of P2X7-mediated release of IL-1β from human macrophages activated by the Alzheimer's beta amyloid peptide 1-42.",
        "Cell Isolation",
        "Monocytes are isolated from peripheral blood mononuclear cells (PBMCs) as follows. Whole blood is layered directly onto Histopak 1077-1 columns (Sigma Biochemicals) and centrifuged at 800×g for 15 minutes. The PBMC band of cells is removed to a fresh 50 ml culture tube and diluted 1:1 with wash buffer (Phosphate buffered saline, pH 7.4 containing 2 mM EDTA and 5 mg/ml BSA) followed by centrifugation at 800×g for 5 minutes. Cells are then washed by sequential resuspension of the cell pellet in wash buffer and centrifugation at 600×g for 5 minutes. The wash process is repeated until the supernatent is clear of contaminating platelets (generally, 5 to 6 washes). Monocytes are then purified from the PBMCs by negative selection using a monocyte isolation kit (Miltenyi Biotec, Inc.) that contains antibodies to non-monocytic cells, running the cells over a magnetic column to remove antibody-bound cells, and collecting the flow through volume of monocytes. Monocytes are washed once with wash buffer and seeded at 10E5 cells per well in 100 μl serum-free RPMI 1640 in 96-well plates and incubated for 1 hour at 37° C. in a 5% CO2/95% humidified tissue culture incubator. After 1 hour, the medium is replaced with 100 μl complete culture medium (RPMI 1640, 10% human serum-type AB (heat inactivated), 25 mM HEPES, 2 mM glutamine, 50 U/ml each of penicillin and streptomycin) and incubated overnight (16 hours).",
        "Dosing Regimen",
        "The next day, the culture medium is replaced with 100 μl fresh complete culture medium in the absence or presence of human beta amyloid 142 peptide (5 μM) and incubated at 37° C. in a 5% CO2/95% humidified tissue culture incubator for 5 hours. Medium is then removed and discarded. Each well is washed once with Hanks buffered saline (HBSS) containing 1 mM CaCl2 followed by the addition of 80 μl of HBSS/CaCl2-inhibiting compound of the present invention (10× stock in HBSS/CaCl2 for a final concentration of 23 nM and 206 nM) and incubated 15 minutes in the tissue culture incubator followed by the addition of either 10 μl of HBSS/CaCl2 or 10 μl of benzoyl ATP (BzATP; 3 mM stock in HBSS/CaCl2 for a 300 μM final concentration) and incubated for a further 30 minutes in the tissue culture incubator. Medium is then removed to new 96-well plates for storage at −70° C. until the IL-1β content is quantitated by ELISA (from R&D Systems). The cells are washed once with HBSS/CaCl2 followed by lysing the cells with 100 μl ice cold lysis buffer (100 mM Tris, pH 7.6, 1% Triton X-100, and 1 tablet per 30 ml Complete TM protease inhibitor from Roche Biochemicals, Inc). Cell lysates are stored at −70° C. until the IL-1β is quantitated by ELISA.",
        "A. This example illustrates the efficacy of the compounds of this invention in the treatment of multiple sclerosis. As described herein, an experimental autoimmune encephalomyelitis (EAE) model is used to show such efficacy. The following procedures are employed in this model.",
        "Animals",
        "SJL/J female mice, 8 wks. old, are obtained from Jackson Laboratories.",
        "Antigens",
        "Myelin Proteolipid Protein (PLP 139-151) (HSLGKWLGHPDKF) (Cat #H-2478) is obtained from BACHEM, Bioscience, Inc., King of Prussia, Pa.",
        "Complete Freund's Adjuvant H37 Ra [1 mg/ml Mycobacterium Tuberculosis H37 Ra] is obtained from Difco (Cat #3114-60-5, 6×10 ml).",
        "Mycobacterium Tuberculosis is also obtained from Difco, (Cat #3114-33-8, 6.times 100 mg).",
        "Pertussis Toxin",
        "Bordetella Pertussis, (Lyophilized powder containing PBS and lactose) is obtained from List Biological Laboratories, (Product #180, 50 ug).",
        "Induction of EAE in Mice",
        "PLP139-151 peptide is dissolved in H2O:PBS (1:1) solution to a concentration 7.5 mg/10 ml (for 75 μg PLP per group) and emulsified with an equal volume of CFA supplemented with 40 mg/10 ml heated-killed mycobacterium tuberculosis H37Ra. Mice are injected s.c. with 0.2 ml of peptide emulsion in the abdominal flank (0.1 ml on each side). On the same day and 72 hours later, mice are injected i.v. with 100% of 35 ng and 50 ng of Bordetella Pertussis toxin in saline respectively.",
        "Clinical Assessment\n\n    STAGE 0: Normal\n    STAGE 0.5: Partial limp tail\n    STAGE 1: Complete Limp Tail\n    STAGE 2: Impaired righting reflex\n    STAGE 2.5: Righting reflex is delayed (Not weak enough to be stage 3).\n    STAGE 3: Partial hind limb paralysis\n    STAGE 3.5: One leg is completely paralyzed, and one leg is partially paralyzed,\n    STAGE 4: Complete hind limb paralysis\n    STAGE 4.5: Legs are completely paralyzed and Moribund\n    STAGE 5: Death due to EAE",
        "Clinical Courses of EAE\n\n    Acute phase: First clinical episode (Day 10-18)\n    Remission: Phase of clinical improvement following a clinical episode; characterized by a reduction (>=one grade) in clinical score for at least two days after the peak score of acute phase or a disease relapse.",
        "Relapse: Increase of at least one grade in clinical score for at least two days after remission has been attained.",
        "The animals treated with the compounds of this invention generally would be expected to show improvements in clinical scores.",
        "B. This Example illustrates a protocol for determining the efficacy of the compounds of the present invention for the treatment of stroke using an animal model.",
        "Male Sprague Dawley rats (Charles River) weighing 280-320 g are given free access to food and water and acclimatized for a minimum of 4 days before use in experiments. All rats for use in studies are to be fasted beginning at 3:00 pm the day prior to surgery but given free access to water. Prior to surgery each rat is weighed. The rat is initially induced with 5% isoflurane (Aerrane, Fort Dodge), combined with 30% O2, 70% N2O for 2-5 minutes. The rat is then placed on a circulating water-heating pad and into a nose cone for spontaneous respiration of anesthetic gases. The isoflurane is reduced to 2%. A rectal probe is inserted and body temperature maintained at 36.5-37.5° C. The hair is clipped at all surgical sites and these regions will then be scrubbed with Betadine.",
        "Surgical Procedure",
        "A temporalis muscle probe is placed into the right temporalis muscle and “brain” temperature” is monitored. A midline neck incision is made in the upper thorax of the rat. Careful dissection, isolation and retraction of the sternomastoideus, digastricus, and sternohyoideus muscles is made to expose the right common, internal and external carotid arteries. The right common carotid artery is isolated with a 5-0 silk suture. During surgery the suture is released allowing reperfusion every 2-4 minutes. The right external carotid and superior thyroid arteries are also isolated and the superior thyroid is cauterized, while the external carotid is ligated distally with a 5-0 silk suture. Another 5-0 silk suture is loosely tied around the external carotid artery. The occipital artery is isolated, ligated and incised. The internal carotid is isolated.",
        "With the common and external carotid arteries immobilized, an aneurysm clip is placed onto the internal carotid artery. A small incision is made at the distal end of the external carotid. A 3-0 nylon suture coated with poly-L-lysine is then inserted into the external carotid and up into the common carotid artery. The loosely tied 5-0 silk suture around the external carotid is now gently tightened around the filament. The external carotid artery is then incised and the remaining piece of the external carotid artery with the filament is rotated so that the filament may be inserted into the internal carotid artery the length of insertion depending on the weight and rat strain. In Sprague Dawley rats the monofilament is inserted 18-19 mm (18 mm for rats weighing<300 gm,19 mm for rats weighing 300 gm) effectively blocking blood flow to the middle cerebral artery.",
        "The external jugular vein will be cannulated with PE 50 tubing for I.V. administration of compounds. The cannula will be exteriorized at the previously shaven, scruff of the neck and sutured in place. The wound will be closed by means of suture. The right femoral artery is catheterized for blood gas and glucose determination during surgery.",
        "Two hours after the insertion of the monofilament suture the rats are re-anesthetized with the same anesthetic combination used initially and placed back into the nose cone with the reduction of isoflurane concentration to 2%. The neck incision is reopened to expose the external carotid artery. The restoration of blood flow is accomplished by completely withdrawing the intraluminal suture from the carotid arteries. The incision is then closed with 3-0 silk in an interrupted stitch.",
        "Compound Administration",
        "Five groups of 15 animals are subjected to the above methodology. Compounds are infused (I.V.) at various doses (dose response) over different time periods post MCAo.",
        "A pre-determined concentration is infused over a pre-selected time period beginning at various intervals post MCAo. Vehicle-treated controls receive an infusion of normally 0.9 ml/hr. A positive control compound is run at the same time.",
        "Neurological Tests",
        "Prior to surgery, 2 hours following the onset of ischaemia and 24 hours after ischaemia, a battery of neurological tests are performed. The postural reflex test, which is designed to examine upper body posture, when the rat is suspended by the tail above a flat surface. A normal rat will extend the entire body and both forelimbs towards the surface. Rats with an infarction will consistently flex the contralateral limb and show signs of body rotation.",
        "The rats' response to a gentle lateral push with a finger behind the shoulders is observed and noted. A normal rat would resist such a push, whereas a rat with an infarction will not. The elicited forelimb placing in response to visual and tactile stimuli. The animal is held by the body so that the lateral or dorsal forepaw surface is placed against a bench. This test is repeated but on this occasion obstructing the view of the rat.",
        "Upon completion of each experiment, all animals are deeply anaesthetized with isoflurane (5%), euthanized by decapitation, and the brains removed, the extent and location of the ischaemic damage is verified histologically by means of tetrazolium chloride.",
        "C. This Example illustrates the anti-inflammatory activity of the compounds of this invention using a model of 2,4-dinitrobenzenesulfonic acid (DNBS) induced distal colitis (a model of inflammatory bowel disease).",
        "Test Substance and Dosing Pattern",
        "A compound of this invention is dissolved in vehicle of 2% Tween 80 in distilled water for oral administration at a dose of 50 mg/kg or dissolved in vehicle of 2% Tween 80 and 0.9% NaCl for intraperitoneal injection at 30 mg/kg. The dose is given once daily for 7 consecutive days. Dosing volume was 10 ml/kg. DNBS is challenged 2 hours after dosing on the second day.",
        "Animals",
        "In these studies, male Wistar, Long Evans rats provided by the animal breeding center of MDS Panlabs Taiwan, Ltd. and Balb/cByJ derived male mice (weighing 20±2 gms), provided by National Laboratory Animals Breeding Research center (NALBRC, Taiwan), may be used. Space allocation of 6 animals may be 45×23×15 cm. Animals are housed in APEC® cages (Allentown Caging, Allentown, N.J. 08501, USA) in a positive pressure isolator (NuAire®, Mode: Nu-605, airflow velocity 50±5 ft/min, HEPA Filter) and maintained in a controlled temperature (22° C.-24° C.) and humidity (60%-80%) environment with 12 hours light dark cycles for at least one week in MDS Panlabs Taiwan laboratory prior to being used. Free access to standard lab chow for rats (Fwusow Industry Co., Limited, Taiwan) and tap water is granted. All aspects of this work including housing, experimentation and disposal of animals would be performed in general accordance with the International Guiding Principles for Biomedical Research Involving Animals (CIOMS Publication No. ISBN 92 90360194, 1985).",
        "Chemicals",
        "DNBS is obtained from TCI, Tokyo, Japan, ethanol is from Merck, Germany and Sulfasalazine is purchased from Sigma, USA.",
        "Equipment",
        "Electriconic scale (Tanita, Model 1140, Japan), Electriconic scale (Sartorius, R160P, Germany), Glass syringe (2 ml, Mitsuba, Japan), Rat oral needle, Hypodermic needle (25G×1 ″ TOP Corporation, Japan), Stainless Scissors (Klappenclear, Germany), Stainless Forceps (Klappenclear, Germany).",
        "Method",
        "Groups of 3 Wistar derived male rats weighing 180±20 gms are used. Distal colitis is induced by intra-colonic instillation of DNBS (2,4-dinitrobenzene sulfonic acid, 30 mg in 0.5 ml ethanol 30%) after which, 2 ml of air is gently injected through the cannula to ensure that the solution remains in the colon. Test substance is administered orally (PO) at a dose of 50 mg/kg or intraperitoneally (IP) at 30 mg/kg once daily for 7 consecutive days. DNBS is instillated into the distal colon of each animal 2 hours after dosing on the second day. The control group is similarly treated with vehicle alone and sulfasalazine (300 mg/kg, PO) is used as reference agent. Animals are fasted 24 hours before DNBS challenge and 24 hours after the final treatment when they are sacrificed and each colon is removed and weighed. During the experiments, presence of diarrhea is recorded daily. When the abdominal cavity is opened before removal of the colon, adhesions between the colon and other organs are noted. After weighing the colon, the extent of colonic ulceration is observed and noted as well. Colon-to-body weight ratio is then calculated for each animal according to the formula: Colon (g)/BW×100%. The “Net” increase in ratio of Vehicle-control+DNBS group relative to Vehicle-control group is used as a base value for comparison with test substance treated groups and expressed as % decrease in inflammation. A 30 percent or more (30%) decrease in “Net” colon-to-body weight ratio for each test substance treated group relative to the “Net” vehicle+DNBS treated group is considered significant.",
        "D. This Example illustrates the anti-inflammatory activity of the present compounds using a model of carrageenan induced paw edema (a model of inflammation, carrageenan).",
        "Test Substance and Dosing Pattern",
        "A compound of this invention is dissolved in vehicle of 2% Tween 80/0.9% NaCl and administered intraperitoneally at a dose of 30 mg/kg 30 minutes before carrageenan (1% 0.1 ml/paw) challenge. Dosing volume is 10 ml/kg.",
        "Animals",
        "Animals are conditioned in accordance with the procedures set forth in the previous Example.",
        "Chemicals",
        "Carrageenan is obtained from TCI, Japan; Pyrogen free saline is from Astar, Taiwan; and Aspirin is purchased from ICN BioMedicals, USA.",
        "Equipment",
        "Glass syringe (1 ml and 2 ml Mitsuba, Japan), Hypodermic needle 24G×1″ (Top Corporation, Japan), Plethysmometer #7150 (Ugo Basile, Italy), and Water cell 25 mm Diameter, #7157 (UGO Basile, Italy).",
        "Method",
        "Test substance (Example) is administered IP (30 mg/kg) to groups of 3 Long Evans derived male overnight fasted rats weighing 150±20 gms 30 minutes before right hind paw injection of carrageenan (0.1 ml of 1% suspension intraplantar). Hind paw edema, as a measure of inflammation, is recorded 3 hours after carrageenan administration using a plethysmometer (Ugo Basile Cat. #7150) with water cell (25 mm diameter, Cat. #7157). Reduction of hind paw edema by 30 percent or more (30%) indicated significant acute anti-inflammatory activity.",
        "E. This Example illustrates the anti-inflammatory activity of the present compounds using a model of Balb/c mice subjected to monoclonal antibody (mAb) type II collagen induced arthritis.",
        "Test Substance and Dosing Pattern",
        "A compound of this invention is dissolved in vehicle of 2% Tween 80/0.9% NaCl, at doses of 50 or 30 and administered orally (50 mg/kg) or intraperitoneally at 30 mg/kg once daily for 3 consecutive days after monoclonal antibody of collagen is injected. Dosing volume is 20 ml/kg.",
        "Animals",
        "Animals are conditioned in accordance with the procedures set forth in the previous Example.",
        "Chemicals",
        "Lipopolysaccharide is obtained from Sigma, USA; Indomethacin is from Sigma, USA; Arthrogen-CIA.™. Monoclonal Antibodies D8, F10, DI-2G and A2 are obtained from IBL, Japan; Phosphated-Buffer Saline is purchased from Sigma, USA; and Tween 80 is from Wako, Japan.",
        "Equipment",
        "Plethysmometer (Ugo Basile, Italy) and Water Cell (Ugo Basile, Italy).",
        "Method",
        "Groups of 5 Balb/cByJ mice strain, 6-8 weeks of age, are used for the induction of arthritis by monoclonal antibodies (mAbs) responding to type II collagen, plus lipopolysaccharide (LPS). The animals are administered intravenously with a combination of 4 different mAbs in a total of 4 mg/mouse at day 0, and followed by intravenous 25 μg of LPS 72 hours later (day 3). From day 3, one hour after LPS administration, ML-659 at 50 mg/kg (PO) or 30 mg/kg (IP) and vehicle (2% Tween 80/0.9% NaCl, PO) as well as the positive control indomethacin, 3 mg/kg (PO) are administrated once daily for 3 consecutive days. A plethysmometer (Ugo Basile Cat #7150) with water cell (12 mm diameter) is used for the measurement of increase in volume of the two hind paws at day 0, 5, 7, 10, 14, and 17. The percent inhibition of increase in volume is calculated by the following formula:\n\nInhibition (%): [1−(Tn−To)/(Cn−Co)]×100\n\nWhere:\n\n    Co (Cn): volume of day 0 (day n) in vehicle control\n    To (Tn): volume of day 0 (day n) in test compound-treated group\n\nThe reduction of both of two hind paws edema by more than 30% is considered significant.",
        "This example illustrates the analgesic activity of the compounds of this invention using a Sciatic Nerve ligation model of mononeuropathic pain.",
        "Test System",
        "Adult male Sprague Dawley (SD) rats weighing 250-300 gm (Charles River Laboratories, San Diego, Calif.) are used. The animal room is lighted artificially at a 12-hr light-dark cycle (e.g. from 7:00 A.M. to 7:00 P.M) with water and food supply ad libitum. Animals are allocated randomly into groups.",
        "Model Induction",
        "Sciatic nerve ligation (SNL, Seltzer's model):",
        "Under anesthesia with pentobarbital (50 mg/kg, i.p.) and aseptic techniques, the selective nerve injury is created by tightly ligating the selective portion of the common sciatic nerve according to the method of Seltzer (1990). Briefly, the high-thigh level of the left sciatic nerve is exposed after skin incision and blunt separation of muscles at a site near the trochanter just distal to the point at which the posterior biceps semitendious nerve nerve branches from the common sciatic nerve. The nerve is then fixed in this position with fine forceps by pinching the epineurium on its dorsal aspect, taking care not to press the nerve against underlying structures. An 8-0 silicon-treated silk suture is inserted into the nerve with a ⅜ curved, reversed-cutting mini-needle, and tightly ligated so that the dorsal ⅓-½ of the nerve is trapped in the ligature. The muscles are sutured in layers, and the skin closed with wound clips. Animals are then returned to their home cages. Rats exhibiting postoperative neurological deficits or poor grooming are excluded from the experiments.",
        "Equipment",
        "The following equipment is used in the current studies: von Frey filament set (Touch-test Sensory Evaluator, North Coast Medical Inc., Morgan Hill, Calif.).",
        "Statistical Methods:",
        "Within each experiment mean, standard error of the mean (SEM) and statistical significance are calculated using the average, standard error of the mean and unpaired, two-tailed t-Test functions, respectively, using Microsoft Excel. Statistical significance of effects observed between individual experiments is determined, using Prism (GraphPad Software Inc., San Diego, Calif.). for the one-way or two-way analysis of variance (ANOVA) function. Statistical analyses are performed with a confidence limit of 0.95 and a significance level of 0.05.",
        "THP-1 cells (ATCC Cat #285-IF-100) are plated in 96 well plates at a concentration of 200,000 cells per well and allowed to differentiate in RPMI-1640 media (ATCC Cat #30-2001) containing 10% FBS, 100 IU/mL penicillin, 100 ug/mL streptomycin, 100 ng/mL LPS and 100 ng/mL IFN-γ for 16 hours. Following differentiation, the cells are pretreated with the compound of interest at the appropriate concentration for 30 minutes in RPMI-1640 media containing 100 IU/mL penicillin, 100 ug/mL streptomycin. The pretreatment media is then replaced with assay buffer (20 mM HEPES, 10 mM D-glucose, 118 mM NMDG, 5 mM KCl, 0.4 mM CaCl2) containing 5 uM Yo-Pro 1 (Molecular Probes Cat #Y3603) and the compound of interest at the appropriate concentration and the cells are incubated for an additional 10 minutes. 2′, 3′-O-(4-benzoylbenzoyl)-adenosine 5′-triphosphate (Sigma Aldrich Cat#B6396) is then added to a final concentration of 40 uM and fluoroscence readings measured at 491/509 excitation/emission every minute for 50 minutes using a Tecan Safire plate reader. During this time temperature is maintained at of 37° C. Background adjusted fluorescence levels between drug treated and non-treated cells are used to calculate the percent inhibition.",
        "THP-1 cells (ATCC Cat #285-IF-100) are plated in 96 well plates at a concentration of 200,000 cells per well and allowed to differentiate in RPMI-1640 media (ATCC Cat #30-2001) containing 10% FBS, 100 IU/mL penicillin, 100 ug/mL streptomycin, 100 ng/mL LPS and 100 ng/mL IFN-γ for 16 hours. Following differentiation, the cells are treated for an additional 2 hours in RPMI-1640 media containing 100 IU/mL penicillin, 100 ug/mL streptomycin and fresh LPS at 100 ng/mL. The cells are then pretreated for 30 minutes with the compound of interest at the appropriate concentration in RPMI media containing 100 IU/mL penicillin, 100 ug/mL streptomycin. Following the pretreatment 2′, 3′-O-(4-benzoylbenzoyl)-adenosine 5′-triphosphate (Sigma Aldrich Cat#B6396) is added to a final concentration of 250 uM and the cells incubated for an additional 45 minutes. 30 uL of cell supernatant is then collected and IL-1β levels determined via ELISA (R&D systems Cat. #HSLB50) according to manufacturer's recommendations using the Tecan Safire plate reader. Background adjusted IL-1β levels of drug treated and non-treated cells are used to calculate the percent inhibition.",
        "The synthetic and biological examples described in this application are offered to illustrate this invention and are not to be construed in any way as limiting the scope of this invention. In the examples, all temperatures are in degrees Celsius (unless otherwise indicated). The compounds that have been prepared in accordance with the invention along with their biological activity data are presented in the following Table (Table 3). The syntheses of compounds of this invention are carried out in accordance with the methods set forth above.",
        "Activity of Compounds of the Invention",
        "The % Inhibition data for the representative compounds of the inventions are given in Table 3 below. For purposes of Table 3, activity of each compound is expressed as follows:\n\n    “+” compound exhibited 0-25% inhibition at 0.3 μM\n    “++” compound exhibited 25-50% inhibition at 0.3 μM\n    “+++” compound exhibited 50-75% inhibition at 0.3 μM\n    “++++” compound exhibited 75% or greater inhibition at 0.3 μM",
        "Compounds with a percent inhibition represented by “++++” are of particular interest.",
        "TABLE 3\n\n\n\n\n\n\n\nAmide Compounds\n\n\n\n\n\n\n\n\n\n\n\n\nMethod of\nMW\nMS\nIL-1β\n\n\nID\nSynthesis\n(calcd)\n(obs)\n% inhibition\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\nΔ\n406.91\n\n+\n\n\n2\nΔ\n274.37\n\n+\n\n\n3\nΔ\n282.35\n\n+\n\n\n4\nΔ\n364.49\n\n+\n\n\n5\nΔ\n416.57\n417.78\n++\n\n\n6\nΔ\n326.44\n327.58\n+\n\n\n7\nC\n340.47\n341.40\n+\n\n\n8\nC\n354.50\n355.72\n+\n\n\n9\nA\n364.49\n365.72\n+\n\n\n10\nA\n378.52\n379.69\n+\n\n\n11\nΔ\n274.37\n275.22\n+\n\n\n12\nΔ\n288.39\n289.56\n+\n\n\n13\n\n414.55\n415.66\n+\n\n\n14\nC\n430.59\n431.84\n+\n\n\n15\nC\n494.66\n495.77\n+\n\n\n16\nC\n417.55\n418.71\n+\n\n\n17\nΔ\n416.57\n417.82\n++++\n\n\n18\nC\n370.49\n371.59\n+\n\n\n19\nΔ\n384.52\n385.60\n+\n\n\n20\nC\n302.42\n303.73\n+\n\n\n21\nΔ\n332.45\n333.72\n+\n\n\n22\nΔ\n318.42\n319.53\n+\n\n\n23\nΔ\n400.52\n401.64\n+\n\n\n24\nA\n402.50\n403.75\n+\n\n\n25\nΔ\n312.37\n—\n+\n\n\n26\nC\n288.39\n289.50\n+++\n\n\n27\nC\n451.01\n452.29\n+++\n\n\n28\nC\n434.56\n435.77\n++++\n\n\n29\nC\n446.59\n447.40\n+\n\n\n30\nC\n476.62\n477.43\n++++\n\n\n31\nC\n430.59\n431.90\n+++\n\n\n32\nC\n444.62\n445.63\n+\n\n\n33\nC\n434.56\n435.25\n+\n\n\n34\nC\n451.01\n451.31\n+\n\n\n35\nC\n446.59\n447.69\n+++\n\n\n36\nC\n476.62\n477.44\n+\n\n\n37\nC\n476.62\n477.43\n+\n\n\n38\nC\n430.59\n431.82\n+\n\n\n39\nC\n460.62\n461.77\n+\n\n\n40\nC\n446.59\n447.73\n+\n\n\n41\nC\n451.01\n451.40\n+\n\n\n42\nC\n441.58\n442.62\n+\n\n\n43\nC\n417.55\n418.67\n+\n\n\n44\nC\n430.59\n431.69\n+\n\n\n45\nC\n444.62\n445.63\n+\n\n\n46\nC\n474.60\n475.45\n++++\n\n\n47\nC\n452.55\n453.26\n++++\n\n\n48\nK\n365.48\n366.60\n+\n\n\n49\nK\n365.48\n366.63\n+\n\n\n50\nK\n398.94\n399.32\n+\n\n\n51\nK\n398.94\n399.32\n+\n\n\n52\nK\n365.48\n366.66\n+\n\n\n53\nK\n398.94\n399.34\n+\n\n\n54\nK\n394.52\n395.60\n+\n\n\n55\nK\n378.52\n379.73\n+\n\n\n56\nK\n442.58\n443.64\n+\n\n\n57\nK\n421.54\n422.67\n+\n\n\n58\nΔ\n394.52\n395.10\n+\n\n\n59\nΔ\n408.54\n409.41\n+\n\n\n60\nΔ\n454.61\n455.49\n+\n\n\n61\nC\n417.55\n418.74\n+\n\n\n62\nC\n473.62\n474.72\n+++\n\n\n63\nC\n444.62\n445.88\n+\n\n\n64\nC\n455.60\n456.71\n+\n\n\n65\nC\n493.65\n494.87\n+\n\n\n66\nC\n436.62\n437.43\n+\n\n\n67\nC\n420.56\n421.70\n++\n\n\n68\nC\n508.66\n509.74\n+\n\n\n69\nC\n467.61\n468.86\n+\n\n\n70\nC\n484.56\n485.78\n+\n\n\n71\nC\n472.67\n473.75\n+\n\n\n72\nC\n484.56\n485.77\n+\n\n\n73\nC\n467.61\n468.86\n+\n\n\n74\nC\n500.56\n501.76\n+\n\n\n75\nC\n508.66\n509.76\n+\n\n\n76\nC\n500.56\n501.82\n+\n\n\n77\nC\n482.57\n483.69\n+\n\n\n78\nC\n482.57\n483.70\n+\n\n\n79\nC\n498.69\n499.85\n+\n\n\n80\nC\n462.64\n463.81\n++\n\n\n81\nC\n420.56\n421.67\n+++\n\n\n82\nC\n406.53\n407.71\n+++\n\n\n83\nC\n457.04\n457.37\n++++\n\n\n84\nC\n459.57\n460.72\n+\n\n\n85\nC\n448.58\n449.68\n+\n\n\n86\nC\n448.58\n449.67\n++\n\n\n87\nC\n483.03\n483.37\n++\n\n\n88\nC\n483.03\n483.38\n+++\n\n\n89\nC\n489.66\n490.73\n+\n\n\n90\nC\n496.56\n497.98\n+\n\n\n91\nC\n489.62\n490.72\n+\n\n\n92\nC\n489.62\n490.78\n+++\n\n\n93\nC\n379.51\n380.67\n+\n\n\n94\nC\n379.51\n380.74\n+\n\n\n95\nC\n464.58\n465.80\n++++\n\n\n96\nC\n502.55\n503.68\n+\n\n\n97\nC\n502.55\n503.67\n++\n\n\n98\nC\n482.63\n483.72\n++\n\n\n99\nC\n476.62\n477.63\n+\n\n\n100\nC\n476.62\n477.65\n++\n\n\n101\nC\n476.62\n477.63\n++\n\n\n102\nC\n464.58\n465.83\n+\n\n\n103\nC\n464.58\n465.79\n+\n\n\n104\nC\n464.58\n465.81\n+++\n\n\n105\nC\n458.60\n459.75\n+\n\n\n106\nC\n502.55\n503.70\n+\n\n\n107\nC\n502.55\n503.68\n+\n\n\n108\nC\n502.55\n503.68\n+\n\n\n109\nC\n502.55\n503.75\n++\n\n\n110\nC\n502.55\n503.70\n+\n\n\n111\nC\n502.55\n503.76\n++\n\n\n112\nC\n480.65\n481.61\n+\n\n\n113\nC\n474.65\n475.72\n+\n\n\n114\nC\n500.56\n501.80\n+\n\n\n115\nC\n486.61\n487.73\n+\n\n\n116\nC\n462.66\n463.75\n+\n\n\n117\nC\n462.59\n463.68\n+\n\n\n118\nC\n431.58\n432.87\n+\n\n\n119\nC\n464.58\n465.80\n++\n\n\n120\nC\n484.56\n485.78\n+\n\n\n121\nC\n408.59\n409.80\n+\n\n\n122\nC\n422.61\n423.72\n+\n\n\n123\nC\n434.56\n435.69\n+\n\n\n124\nC\n406.57\n407.78\n+\n\n\n125\nC\n398.57\n399.68\n+\n\n\n126\nC\n368.48\n369.61\n+\n\n\n127\nC\n384.56\n385.67\n+\n\n\n128\nC\n370.54\n371.71\n+\n\n\n129\nC\n392.54\n393.76\n+\n\n\n130\nC\n396.51\n397.70\n+\n\n\n131\nC\n502.55\n503.73\n+\n\n\n133\nC\n403.48\n404.68\n+\n\n\n134\nC\n403.48\n404.68\n+\n\n\n135\nC\n392.46\n393.40\n+\n\n\n136\nC\n408.54\n409.70\n+\n\n\n137\nK\n452.55\n451.46\n+++\n\n\n138\nK\n474.60\n475.66\n++++\n\n\n139\nK\n434.56\n435.90\n++\n\n\n140\nC\n490.60\n491.78\n+\n\n\n141\nC\n490.60\n491.82\n+\n\n\n142\nF\n404.53\n405.38\n+++\n\n\n143\nF\n466.60\n467.26\n+\n\n\n144\nF\n480.63\n481.24\n+++\n\n\n147\nF\n432.59\n433.30\n++++\n\n\n148\nF\n418.56\n419.26\n+\n\n\n149\nF\n496.63\n497.39\n+++\n\n\n150\nF\n501.05\n501.20\n+\n\n\n151\nF\n526.65\n527.26\n+\n\n\n152\nF\n484.59\n485.33\n+\n\n\n153\nF\n480.63\n481.24\n++++\n\n\n154\nF\n534.60\n535.18\n++++\n\n\n155\nF\n535.49\n535.03\n+\n\n\n157\nF\n537.68\n538.42\n+\n\n\n158\nF\n519.07\n519.30\n+\n\n\n159\nF\n538.59\n539.32\n+\n\n\n160\nF\n546.69\n547.31\n++++\n\n\n161\nF\n550.60\n551.34\n++\n\n\n162\nF\n496.63\n497.40\n+\n\n\n164\nF\n484.62\n485.35\n+\n\n\n165\nF\n526.06\n526.20\n+++\n\n\n166\nF\n484.59\n485.33\n++\n\n\n167\nF\n491.61\n492.23\n++\n\n\n168\nF\n501.05\n501.20\n++++\n\n\n169\nF\n485.61\n486.30\n++\n\n\n172\nF\n559.69\n560.15\n+++\n\n\n173\nF\n559.69\n560.16\n\n\n174\nF\n559.69\n560.15\n++++\n\n\n175\nF\n588.73\n589.31\n+++\n\n\n177\nF\n626.70\n627.38\n++\n\n\n181\nF\n569.05\n569.20\n++\n\n\n182\nF\n616.62\n617.35\n+++\n\n\n183\nF\n548.63\n549.32\n++\n\n\n184\nF\n498.62\n499.25\n++++\n\n\n185\nF\n549.52\n549.26\n++\n\n\n186\nF\n549.52\n549.27\n++++\n\n\n187\nF\n548.63\n549.33\n++++\n\n\n189\nF\n515.07\n515.29\n++++\n\n\n190\nF\n532.61\n533.16\n+++\n\n\n191\nF\n558.70\n559.21\n+\n\n\n192\nF\n501.05\n501.21\n+++\n\n\n193\nF\n519.04\n519.29\n+\n\n\n194\nF\n542.70\n543.28\n++++\n\n\n195\nF\n534.60\n535.20\n+\n\n\n197\nF\n526.65\n527.28\n++++\n\n\n198\nF\n498.65\n499.31\n+\n\n\n199\nF\n480.63\n481.26\n++++\n\n\n200\nF\n524.64\n525.34\n+\n\n\n202\nF\n519.04\n519.28\n++\n\n\n203\nF\n502.58\n503.25\n+\n\n\n204\nF\n535.49\n535.07\n+\n\n\n205\nF\n519.04\n519.27\n+\n\n\n206\nF\n502.58\n503.26\n+\n\n\n207\nF\n515.07\n515.29\n+++\n\n\n208\nF\n535.49\n535.08\n+++\n\n\n209\nF\n502.58\n503.26\n++++\n\n\n210\nF\n535.49\n535.08\n+\n\n\n211\nF\n519.04\n519.27\n+\n\n\n212\nF\n498.62\n499.28\n+++\n\n\n214\nF\n510.66\n511.41\n+\n\n\n215\nF\n484.59\n485.34\n+++\n\n\n216\nF\n526.65\n527.28\n+++\n\n\n217\nF\n494.66\n495.35\n+\n\n\n218\nE\n499.44\n499.16\n++++\n\n\n219\nE\n368.48\n369.24\n+\n\n\n220\nE\n430.55\n431.50\n++++\n\n\n222\nE\n465.98\n466.32\n+++\n\n\n223\nE\n382.51\n383.30\n+\n\n\n224\nE\n474.60\n475.26\n+\n\n\n225\nE\n444.58\n445.36\n++\n\n\n227\nE\n448.54\n449.15\n+\n\n\n228\nE\n514.55\n515.31\n+\n\n\n229\nE\n458.60\n459.39\n+++\n\n\n230\nE\n444.58\n445.36\n++++\n\n\n231\nE\n450.62\n451.27\n++\n\n\n232\nE\n466.53\n467.27\n+++\n\n\n233\nE\n498.55\n499.29\n++++\n\n\n234\nE\n460.57\n461.28\n++\n\n\n235\nE\n466.67\n467.33\n++++\n\n\n236\nE\n520.67\n521.33\n+++\n\n\n237\nE\n431.54\n432.39\n+\n\n\n238\nE\n422.57\n423.26\n++++\n\n\n239\nE\n504.63\n505.27\n++\n\n\n240\nE\n398.50\n399.25\n+\n\n\n241\nE\n462.57\n463.29\n+++\n\n\n242\nE\n455.56\n456.28\n+++\n\n\n243\nE\n498.55\n499.29\n+++\n\n\n244\nE\n436.60\n437.27\n++\n\n\n245\nE\n499.44\n499.17\n+++\n\n\n246\nE\n490.60\n491.29\n++\n\n\n247\nE\n466.53\n467.27\n++++\n\n\n248\nE\n458.60\n459.38\n+\n\n\n249\nE\n460.57\n461.29\n+\n\n\n250\nE\n460.57\n461.29\n+++\n\n\n251\nE\n448.54\n449.15\n+\n\n\n252\nE\n410.56\n411.30\n++\n\n\n253\nE\n464.99\n465.22\n+++\n\n\n254\nE\n504.63\n505.27\n+\n\n\n255\nE\n410.56\n411.30\n++\n\n\n256\nE\n474.60\n475.26\n+++\n\n\n257\nE\n455.56\n456.31\n+\n\n\n258\nE\n499.44\n499.18\n++++\n\n\n260\nE\n394.52\n395.18\n+++\n\n\n261\nE\n474.60\n475.27\n+\n\n\n262\nE\n424.59\n425.28\n+\n\n\n263\nE\n436.60\n437.28\n++++\n\n\n264\nE\n495.02\n495.34\n+++\n\n\n265\nE\n479.02\n479.13\n++\n\n\n266\nE\n516.54\n517.29\n+\n\n\n267\nE\n516.54\n517.28\n++\n\n\n269\nE\n514.55\n515.31\n++\n\n\n270\nE\n498.55\n499.30\n+\n\n\n271\nE\n532.99\n533.17\n++++\n\n\n272\nE\n482.98\n483.30\n++++\n\n\n273\nE\n511.63\n512.46\n++++\n\n\n274\nE\n523.63\n524.50\n+\n\n\n275\nE\n490.60\n491.29\n+++\n\n\n276\nE\n488.58\n489.33\n++++\n\n\n277\nE\n466.53\n467.27\n+++\n\n\n278\nE\n444.58\n445.37\n+++\n\n\n279\nE\n466.53\n467.27\n++++\n\n\n280\nE\n448.54\n449.19\n+++\n\n\n281\nE\n465.98\n466.32\n+\n\n\n282\nE\n499.44\n499.19\n++++\n\n\n283\nE\n435.53\n436.32\n+++\n\n\n284\nE\n448.57\n449.22\n++\n\n\n285\nE\n448.57\n449.22\n+\n\n\n286\nE\n564.61\n565.37\n+++\n\n\n288\nE\n510.64\n511.45\n+\n\n\n290\nE\n480.61\n481.29\n++++\n\n\n291\nE\n444.58\n445.37\n++++\n\n\n292\nE\n460.57\n461.28\n+++\n\n\n293\nE\n448.56\n449.20\n+++\n\n\n294\nE\n464.99\n465.23\n+++\n\n\n295\nE\n479.62\n480.21\n+\n\n\n296\nE\n421.50\n422.09\n+++\n\n\n297\nE\n449.55\n450.19\n+\n\n\n298\nE\n465.98\n466.32\n++++\n\n\n299\nE\n435.53\n436.32\n+\n\n\n300\nE\n490.65\n491.32\n+\n\n\n301\nE\n486.66\n487.36\n++++\n\n\n302\nE\n523.47\n523.35\n+++\n\n\n303\nE\n481.60\n482.22\n+++\n\n\n304\nE\n431.54\n432.38\n+\n\n\n306\nE\n519.56\n520.28\n+\n\n\n307\nE\n412.53\n413.33\n++\n\n\n308\nE\n432.53\n433.33\n\n\n309\nE\n472.59\n473.26\n++++\n\n\n310\nE\n478.56\n479.13\n+++\n\n\n311\nE\n482.59\n483.31\n\n\n312\nE\n490.60\n491.29\n+\n\n\n313\nE\n486.61\n487.33\n++++\n\n\n316\nK\n434.56\n435.41\n+\n\n\n317\nC\n488.63\n489.69\n+\n\n\n318\nC\n504.67\n505.72\n+\n\n\n319\nC\n485.46\n485.45\n+\n\n\n320\nC\n444.62\n445.88\n+\n\n\n321\nC\n460.57\n461.74\n++++\n\n\n322\nC\n452.55\n453.60\n+\n\n\n323\nC\n469.00\n469.60\n+\n\n\n324\nC\n481.04\n481.39\n+\n\n\n325\nC\n519.01\n519.44\n+\n\n\n326\nC\n469.00\n469.61\n++\n\n\n327\nC\n552.56\n553.75\n+\n\n\n328\nC\n469.00\n469.60\n+++\n\n\n329\nC\n469.00\n469.61\n+++\n\n\n330\nC\n552.72\n553.96\n+++\n\n\n331\nC\n548.68\n549.84\n+\n\n\n332\nC\n455.60\n456.75\n+++\n\n\n333\nC\n488.63\n489.78\n+++\n\n\n334\nB\n402.54\n403.72\n+++\n\n\n335\nK\n446.59\n447.72\n++\n\n\n336\nK\n430.59\n431.84\n++++\n\n\n337\nK\n451.01\n451.37\n++\n\n\n338\nK, B\n434.56\n435.75\n++++\n\n\n339\nΔ\n444.62\n445.89\n+\n\n\n340\nk\n460.57\n461.72\n+++\n\n\n341\nB\n444.62\n445.92\n++\n\n\n342\nΔ\n415.58\n416.81\n+\n\n\n343\nB\n472.67\n473.86\n+\n\n\n344\nB\n458.65\n459.60\n+\n\n\n345\nB\n486.70\n487.64\n+\n\n\n346\nB\n444.62\n445.68\n+\n\n\n347\nC\n480.60\n481.32\n+\n\n\n348\nC\n479.06\n479.41\n+\n\n\n349\nC\n458.65\n459.61\n+\n\n\n350\nC\n502.66\n503.48\n+\n\n\n351\nC\n483.66\n484.42\n+\n\n\n352\nC\n462.61\n463.48\n+\n\n\n353\nD\n508.68\n509.78\n+\n\n\n354\nD\n529.10\n529.37\n+\n\n\n355\nD\n530.64\n531.58\n+\n\n\n356\nD\n577.57\n577.60\n+\n\n\n357\nD\n543.13\n543.54\n+\n\n\n358\nD\n472.63\n473.79\n+\n\n\n359\nD\n526.60\n527.74\n+\n\n\n360\nD\n527.49\n527.55\n+\n\n\n361\nD\n494.58\n495.77\n+\n\n\n362\nD\n511.04\n511.57\n+\n\n\n363\nD\n494.58\n495.82\n+\n\n\n364\nD\n527.49\n527.50\n+\n\n\n365\nD\n464.65\n465.74\n+\n\n\n366\nD\n464.65\n465.81\n+\n\n\n367\nD\n452.64\n453.70\n+\n\n\n368\nΔ\n429.60\n430.78\n+\n\n\n369\nC\n462.61\n463.49\n+\n\n\n370\nC\n479.06\n479.01\n++\n\n\n371\nC\n462.61\n463.49\n+++\n\n\n372\nC\n458.65\n459.50\n+++\n\n\n373\nC\n502.66\n503.34\n++++\n\n\n374\nC\n480.60\n481.34\n++\n\n\n375\nC\n483.66\n484.34\n++\n\n\n376\nC\n462.61\n463.47\n++\n\n\n377\nD\n508.68\n509.31\n++++\n\n\n378\nD\n577.57\n577.18\n+++\n\n\n379\nD\n543.13\n543.50\n+++\n\n\n380\nD\n529.10\n529.26\n+\n\n\n381\nD\n530.64\n531.21\n+\n\n\n382\nD\n472.63\n473.40\n++\n\n\n383\nD\n526.60\n527.41\n+\n\n\n384\nD\n464.65\n465.50\n++\n\n\n385\nD\n527.49\n527.34\n+\n\n\n386\nD\n464.65\n465.50\n++\n\n\n387\nD\n494.58\n495.26\n+\n\n\n388\nD\n452.64\n453.34\n+\n\n\n389\nD\n511.04\n511.25\n++\n\n\n390\nD\n494.58\n495.26\n+\n\n\n391\nD\n527.49\n527.33\n+\n\n\n394\nH\n416.52\n417.34\n++\n\n\n398\nH\n430.55\n431.33\n+++\n\n\n399\nH\n450.97\n451.08\n+\n\n\n400\nH\n434.51\n435.30\n+\n\n\n401\nH\n500.52\n501.23\n+\n\n\n402\nH\n444.58\n445.32\n+\n\n\n403\nH\n430.55\n431.33\n++\n\n\n405\nH\n452.50\n453.02\n++\n\n\n406\nH\n484.52\n485.32\n++\n\n\n407\nH\n446.55\n447.19\n+\n\n\n409\nH\n506.65\n507.30\n+\n\n\n413\nH\n448.54\n449.02\n++\n\n\n414\nH\n441.53\n442.31\n++\n\n\n415\nH\n484.52\n485.32\n+\n\n\n417\nH\n485.41\n485.29\n+\n\n\n418\nH\n476.57\n477.23\n++\n\n\n419\nH\n452.50\n453.03\n+\n\n\n421\nH\n446.55\n447.19\n+\n\n\n422\nH\n446.55\n447.19\n++\n\n\n423\nH\n434.51\n435.30\n++\n\n\n424\nH\n396.53\n397.24\n+\n\n\n425\nH\n450.97\n451.09\n+\n\n\n428\nH\n460.57\n461.28\n+\n\n\n430\nH\n485.41\n485.28\n++\n\n\n433\nH\n460.57\n461.27\n++\n\n\n436\nH\n480.99\n481.16\n++\n\n\n437\nH\n464.99\n465.13\n+\n\n\n438\nH\n502.51\n503.26\n++\n\n\n439\nH\n502.51\n503.27\n++\n\n\n442\nH\n484.52\n485.32\n++\n\n\n443\nH\n518.96\n519.28\n++\n\n\n444\nH\n468.96\n469.29\n+\n\n\n446\nH\n509.61\n510.36\n++\n\n\n449\nH\n452.50\n453.03\n++\n\n\n450\nH\n430.55\n431.33\n+\n\n\n451\nH\n452.50\n453.02\n+\n\n\n452\nH\n434.51\n435.31\n++\n\n\n453\nH\n451.96\n452.10\n+\n\n\n454\nH\n485.41\n485.29\n++\n\n\n455\nH\n421.50\n422.02\n\n\n459\nH\n531.05\n531.09\n\n\n460\nH\n466.58\n467.26\n+\n\n\n461\nH\n430.55\n431.33\n+\n\n\n463\nH\n434.54\n435.32\n++\n\n\n464\nH\n450.97\n451.09\n++\n\n\n466\nH\n407.47\n408.19\n+\n\n\n470\nH\n509.45\n509.21\n+\n\n\n471\nH\n467.57\n468.20\n++\n\n\n475\nH\n464.54\n465.18\n++\n\n\n476\nH\n476.57\n477.23\n++\n\n\n477\nH\n472.59\n473.25\n++\n\n\n479\nH\n485.41\n485.29\n+\n\n\n480\nH\n390.51\n391.30\n+\n\n\n481\nH\n452.58\n453.02\n++\n\n\n482\nH\n466.60\n467.24\n++\n\n\n483\nH\n502.64\n503.26\n+++\n\n\n485\nI\n418.56\n419.24\n+\n\n\n486\nI\n404.53\n405.33\n+\n\n\n487\nI\n482.60\n483.29\n++\n\n\n488\nI\n487.02\n487.25\n+\n\n\n489\nI\n512.63\n513.33\n+++\n\n\n490\nI\n470.57\n471.35\n+++\n\n\n491\nI\n466.60\n467.25\n+\n\n\n492\nI\n520.57\n521.23\n+++\n\n\n493\nI\n536.57\n537.30\n++\n\n\n494\nI\n523.65\n524.45\n+++\n\n\n495\nI\n505.04\n505.09\n++\n\n\n497\nI\n536.57\n537.30\n+\n\n\n498\nI\n482.60\n483.30\n+\n\n\n499\nI\n470.60\n471.38\n+\n\n\n500\nI\n512.03\n512.29\n+++\n\n\n501\nI\n470.57\n471.35\n++\n\n\n503\nI\n471.58\n472.28\n+\n\n\n505\nI\n520.61\n521.23\n+\n\n\n506\nI\n545.66\n546.17\n++++\n\n\n509\nI\n574.70\n575.32\n+++\n\n\n510\nI\n612.67\n613.09\n++++\n\n\n512\nI\n558.70\n559.19\n++\n\n\n514\nI\n555.02\n555.07\n+\n\n\n515\nI\n602.60\n603.35\n+++\n\n\n516\nI\n534.60\n535.14\n++\n\n\n517\nI\n484.59\n485.32\n++\n\n\n518\nI\n535.49\n535.04\n++++\n\n\n519\nI\n535.49\n535.03\n+++\n\n\n520\nI\n534.60\n535.14\n++\n\n\n522\nI\n501.05\n501.20\n+++\n\n\n523\nI\n518.58\n519.29\n+\n\n\n524\nI\n544.67\n545.25\n++++\n\n\n525\nI\n487.02\n487.24\n+\n\n\n526\nI\n505.01\n505.07\n++\n\n\n527\nI\n528.67\n529.17\n+++\n\n\n528\nI\n520.57\n521.23\n++\n\n\n531\nI\n484.62\n485.34\n++\n\n\n532\nI\n536.57\n537.30\n+\n\n\n533\nI\n466.60\n467.25\n+++\n\n\n534\nI\n510.61\n511.35\n+++\n\n\n535\nI\n520.57\n521.23\n++\n\n\n536\nI\n505.01\n505.06\n++\n\n\n537\nI\n488.56\n489.26\n++\n\n\n538\nI\n521.47\n521.11\n++\n\n\n539\nI\n505.01\n505.05\n++\n\n\n540\nI\n488.56\n489.25\n+\n\n\n541\nI\n501.05\n501.19\n++++\n\n\n542\nI\n521.47\n521.10\n+\n\n\n543\nI\n488.56\n489.26\n++\n\n\n545\nI\n505.01\n505.03\n++\n\n\n546\nI\n484.59\n485.32\n+\n\n\n548\nI\n496.63\n497.36\n+\n\n\n549\nI\n512.63\n513.33\n++\n\n\n550\nI\n480.63\n481.21\n+\n\n\n552\nJ\n438.66\n439.43\n++++\n\n\n553\nJ\n492.66\n493.37\n++\n\n\n554\nJ\n430.59\n431.35\n++++\n\n\n555\nJ\n354.50\n355.27\n+\n\n\n556\nJ\n408.59\n409.36\n+\n\n\n557\nJ\n366.51\n367.23\n+\n\n\n558\nJ\n382.55\n383.31\n++\n\n\n559\nJ\n430.59\n431.35\n++\n\n\n560\nJ\n403.53\n404.45\n++\n\n\n562\nJ\n432.56\n433.30\n+\n\n\n564\nJ\n446.55\n447.20\n++++\n\n\n565\nJ\n452.60\n453.09\n++++\n\n\n566\nJ\n462.59\n463.29\n+\n\n\n567\nJ\n484.60\n485.34\n++\n\n\n568\nJ\n494.64\n495.34\n+\n\n\n570\nJ\n471.43\n471.34\n++\n\n\n571\nJ\n427.55\n428.17\n++++\n\n\n572\nJ\n458.65\n459.35\n++++\n\n\n576\nJ\n494.64\n495.35\n+++\n\n\n583\nJ\n382.55\n383.31\n+\n\n\n584\nJ\n432.56\n433.30\n+\n\n\n585\nJ\n430.59\n431.35\n++\n\n\n586\nJ\n497.04\n497.38\n+\n\n\n588\nJ\n538.69\n539.37\n++\n\n\n589\nJ\n460.57\n461.27\n+++\n\n\n590\nJ\n471.43\n471.33\n+\n\n\n591\nJ\n462.59\n463.29\n+\n\n\n592\nJ\n538.69\n539.37\n++++\n\n\n593\nJ\n448.56\n449.09\n+\n\n\n594\nJ\n541.49\n541.24\n+\n\n\n595\nJ\n445.54\n446.17\n+\n\n\n596\nJ\n446.55\n447.20\n+++\n\n\n597\nJ\n481.44\n481.05\n+++\n\n\n598\nJ\n436.98\n437.12\n+\n\n\n599\nJ\n480.99\n481.17\n+\n\n\n601\nJ\n436.98\n437.12\n+++\n\n\n602\nJ\n416.57\n417.37\n++\n\n\n603\nJ\n427.55\n428.16\n+\n\n\n604\nJ\n470.54\n471.38\n++++\n\n\n605\nJ\n420.53\n421.21\n+\n\n\n606\nJ\n416.57\n417.37\n+\n\n\n607\nJ\n420.53\n421.21\n++++\n\n\n608\nJ\n462.59\n463.30\n+\n\n\n610\nJ\n403.53\n404.46\n+\n\n\n611\nJ\n454.97\n455.21\n+++\n\n\n612\nJ\n488.53\n489.30\n++++\n\n\n613\nJ\n482.42\n482.13\n+\n\n\n614\nJ\n481.44\n481.04\n+\n\n\n615\nJ\n432.56\n433.30\n+++\n\n\n618\nJ\n499.43\n499.13\n+\n\n\n619\nJ\n394.56\n395.19\n+\n\n\n620\nJ\n486.54\n487.29\n++\n\n\n621\nJJ\n468.55\n469.31\n+++\n\n\n622\nJ\n526.65\n527.31\n++\n\n\n623\nJ\n480.58\n481.25\n+\n\n\n624\nJ\n468.55\n469.32\n+\n\n\n625\nJ\n446.59\n447.23\n+\n\n\n626\nJ\n562.63\n563.31\n++\n\n\n627\nJ\n482.53\n483.31\n++++\n\n\n628\nJ\n450.55\n451.20\n+\n\n\n629\nJ\n450.55\n451.20\n+\n\n\n630\nJ\n446.59\n447.22\n++++\n\n\n631\nJ\n462.59\n463.29\n+\n\n\n632\nJ\n486.54\n487.29\n++\n\n\n633\nJ\n462.59\n463.29\n+\n\n\n634\nJ\n437.97\n438.15\n+\n\n\n635\nJ\n454.97\n455.22\n+\n\n\n636\nJ\n430.56\n\n+\n\n\n\n\n\nΔ - Method of synthesis described in “Synthetic Methods” section",
        "At least some of the chemical names of compounds of the invention as given and set forth in this application, may have been generated on an automated basis by use of a commercially available chemical naming software program, and have not been independently verified. Representative programs performing this function include the Lexichem naming tool sold by Open Eye Software, Inc. and the Autonom Software tool sold by MDL, Inc. Also, the various groups as recited in Tables 1A-1D may be attached to the core structure in a conventional manner which should occur to those skilled in the art.",
        "From the foregoing description, various modifications and changes in the compositions and methods of this invention will occur to those skilled in the art. All such modifications coming within the scope of the appended claims are intended to be included therein.",
        "All publications, including but not limited to patents and patent applications, cited in this specification are herein incorporated by reference as if each individual publication were specifically and individually indicated to be incorporated by reference herein as though fully set forth."
    ],
    "citations": [
        "5034393",
        "2003/0191143",
        "2005/0038023",
        "2005/0165032",
        "2005/0277643",
        "04224580",
        "WO98/37079",
        "WO99/21836",
        "WO 01/32632",
        "WO 02/22602",
        "WO 02/22604",
        "WO 02/50065",
        "WO 02/053558",
        "WO 02/057259",
        "WO 02/059111",
        "WO 02 062789",
        "WO 00/59510",
        "WO 02/087513",
        "WO 03/049739",
        "WO 03/062225",
        "WO 03/076427",
        "WO 03/104230",
        "WO 2004/007468",
        "WO 2004/072086",
        "WO 2004/087056",
        "WO 2005/005397",
        "WO 2005/014558",
        "WO 2005/042537",
        "WO 2005/049033",
        "WO 2005/066171",
        "WO 2006/035061",
        "WO 2006/062981",
        "WO 2006/074057"
    ],
    "us_classification": "5142581",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "01",
            "subclass": "N",
            "main_group": "43",
            "subgroup": "54"
        }
    ]
}