{
    "title": "SS7 gateway for wireless communication networks",
    "abstract": "The present disclosure provides a system and method for an SS7 gateway for wireless networks.",
    "inventors": [
        "Baker",
        "Hui",
        "Greenwood",
        "Zhoe",
        "Buckley",
        "Linden"
    ],
    "document_number": "07298751",
    "publication_date": "20071120",
    "assignees": [
        "Intel Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A Wireless Access Internet Network architecture for providing users access to a communications network, the architecture comprising:",
            "components": [
                {
                    "component": "a wireless client wherein the wireless client provides an authentication;",
                    "subcomponents": []
                },
                {
                    "component": "a wireless server in communication with the wireless client wherein the wireless server includes:",
                    "subcomponents": [
                        "a charging module;",
                        "a Home Location Register (HLR) signaling module; and",
                        "a Domain Naming System (DNS)/Dynamic Host Configuration Protocol (DHCP) module;"
                    ]
                },
                {
                    "component": "a charging module;",
                    "subcomponents": []
                },
                {
                    "component": "a Home Location Register (HLR) signaling module; and",
                    "subcomponents": []
                },
                {
                    "component": "a Domain Naming System (DNS)/Dynamic Host Configuration Protocol (DHCP) module;",
                    "subcomponents": []
                },
                {
                    "component": "an Internet Protocol (IP) network in communication with the wireless server;",
                    "subcomponents": []
                },
                {
                    "component": "a Signaling System Number 7 (SS7) gateway device connected to the IP network wherein the gateway device includes a protocol converter that provides conversion from IP messages from the wireless server into SS7 messages authenticating the wireless client;",
                    "subcomponents": []
                },
                {
                    "component": "a HLR connected to the gateway device that receives the converted SS7 messages and the identity information from the wireless client for the authentication; and",
                    "subcomponents": []
                },
                {
                    "component": "a Short Message Service Gateway (SMS-GW) connected to the wireless server wherein the wireless server transmits Short Message Service (SMS) messages to the SMS-GW.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The architecture of claim 1 further including a second wireless client in communication with the wireless server.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The architecture of claim 1 further including:",
            "components": [
                {
                    "component": "a wireless mobile device with a cellular protocol; and",
                    "subcomponents": []
                },
                {
                    "component": "a base station system (BSS) in communication with the wireless mobile device and connected to the data network wherein the wireless server can transmit messages from the wireless client to the wireless mobile device through the data network and the BSS.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The architecture of claim 1 further including:",
            "components": [
                {
                    "component": "a wireless mobile device with a wireless protocol;",
                    "subcomponents": []
                },
                {
                    "component": "a receiving system in communication with the wireless mobile device; and",
                    "subcomponents": [
                        "a SGSN in communication with the receiving system and connected to the data network wherein the wireless server can transmit messages from the wireless client to the wireless mobile device through the data network, the SGSN and the receiving system."
                    ]
                },
                {
                    "component": "a SGSN in communication with the receiving system and connected to the data network wherein the wireless server can transmit messages from the wireless client to the wireless mobile device through the data network, the SGSN and the receiving system.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The architecture of claim 1 further including a charge and billing gateway device in communication with the wireless server wherein the wireless server transmits charge and billing information to the charge and billing gateway device.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The architecture of claim 1 further including a RADIUS server connected to the wireless server wherein the authentication includes a User ID and a password and wherein the wireless server transmits the User ID and password to the RADIUS server and the wireless server receives an appropriate approve/deny message back from the RADIUS server.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The architecture of claim 1 further including a RADIUS server connected to the wireless server wherein the wireless server transmits accounting data to the RADIUS server.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The architecture of claim 1 wherein the SMS-GW encodes the SMS messages to the wireless client.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The architecture of claim 1 wherein the wireless client encodes the SMS messages to the SMS-GW.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The architecture of claim 1 wherein the SMS-GW decodes the SMS messages from the wireless client.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The architecture of claim 1 wherein the wireless client decodes the SMS messages from the SMS-GW.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A method for transmitting wireless messages from a Wireless Access Internet Network architecture for providing users access to a communications network, the method comprising:",
            "components": [
                {
                    "component": "transmitting an authentication message from a wireless client;",
                    "subcomponents": []
                },
                {
                    "component": "receiving the authentication message at a wireless server in communication with the wireless client wherein the wireless server includes:",
                    "subcomponents": [
                        "a charging module;",
                        "a Home Location Register (HLR) signaling module; and",
                        "a Domain Naming System (DNS)/Dynamic Host Configuration Protocol (DHCP) module;"
                    ]
                },
                {
                    "component": "a charging module;",
                    "subcomponents": []
                },
                {
                    "component": "a Home Location Register (HLR) signaling module; and",
                    "subcomponents": []
                },
                {
                    "component": "a Domain Naming System (DNS)/Dynamic Host Configuration Protocol (DHCP) module;",
                    "subcomponents": []
                },
                {
                    "component": "transmitting the authentication message from the wireless server to an Internet Protocol (IP) network;",
                    "subcomponents": []
                },
                {
                    "component": "receiving the authentication message at a Signaling System Number 7 (SS7) gateway device connected to the IP network wherein the SS7 gateway device includes a protocol converter that provides conversion from IP messages from the wireless server into SS7 messages identifying the wireless client;",
                    "subcomponents": []
                },
                {
                    "component": "transmitting the authentication message from the SS7 gateway to a HLR; and",
                    "subcomponents": []
                },
                {
                    "component": "transmitting a short message to a Short Message Service Gateway (SMS-GW) from the wireless server.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 12 further including transmitting from a second wireless client to the wireless server.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 12 further including:",
            "components": [
                {
                    "component": "transmitting a plurality of messages from a wireless mobile device with a cellular protocol; and",
                    "subcomponents": []
                },
                {
                    "component": "receiving the plurality of messages at a base station system (BSS) in communication with the wireless mobile device and connected to the data network wherein the wireless server can transmit messages from the wireless client to the wireless mobile device through the data network and the BSS.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 12 further including:",
            "components": [
                {
                    "component": "transmitting a plurality of messages from a wireless mobile device with a wireless protocol;",
                    "subcomponents": []
                },
                {
                    "component": "receiving the plurality of messages at a receiving system in communication with the wireless mobile device; and",
                    "subcomponents": []
                },
                {
                    "component": "transmitting the plurality of messages from the receiving system to a SGSN in communication with the receiving system and connected to the data network wherein the wireless server can transmit messages from the wireless client to the wireless mobile device through the data network, the SGSN and the receiving system.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 12 further including transmitting billing information to a charge and billing gateway device in communication with the wireless server.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 12 further including transmitting a User ID and Password to a RADIUS server connected to the wireless server and receiving an appropriate approve/deny message back from the RADIUS server.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 12 further including transmitting an authentication information request message to a HLR connected to the wireless server and receiving requested authentication data back from the HLR.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The architecture of claim 12 wherein the SMS-GW encodes the SMS messages to the wireless client.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The architecture of claim 12 wherein the wireless client encodes the SMS messages to the SMS-GW.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The architecture of claim 12 wherein the SMS-GW decodes the SMS messages from the wireless client.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The architecture of claim 12 wherein the wireless client decodes the SMS messages from the SMS-GW.",
            "components": []
        }
    ],
    "description": [
        "The present application claims the benefit of U.S. Provisional Application No. 60/384,945, filed on May 31, 2002.",
        "The present disclosure relates generally to a communications system and, more particularly, to a method and system for an SS7 gateway for wireless communication networks.",
        "Today, the SS7 signaling network is used for some wireless networks. However, there are no efficient networks that combine other wireless protocol networks with the SS7 network while reducing costs.",
        "Therefore, what is needed, is a cost effective, efficient SS7 gateway to be used on other wireless networks.",
        "The present disclosure provides a system and method for an SS7 gateway for wireless networks.",
        "Therefore, in accordance with the previous summary, objects, features and advantages of the present disclosure will become apparent to one skilled in the art from the subsequent description and the appended claims taken in conjunction with the accompanying drawings.",
        "FIG. 1 illustrates an example of a GPRS network architecture;",
        "FIG. 2 illustrates the Wireless Access Internet Node (WAIN) system utilizing the 802.11 radio transport;",
        "FIG. 3 shows details of the system elements of the WAIN client, the WAIN server and the SS7 gateway of the WAIN system;",
        "FIG. 4 illustrates the WAIN system connected to the UMTS core network;",
        "FIG. 5 illustrates the WAIN server integrated with a 3G RNC;",
        "FIG. 6 illustrates the WAIN system connected to a cdma2000 network;",
        "FIG. 7 illustrates GPRS networks with a roaming arrangement;",
        "FIG. 8 illustrates a WAIN system supporting roaming users in GPRS/3G networks;",
        "FIG. 9 illustrates the WAIN system connected to the SS7 network through a SS7 Gateway;",
        "FIG. 10 illustrates the WAIN system with a subscription/authentication database HLR'/AuC' with an IP interface;",
        "FIG. 11 illustrates how the WAIN signaling protocol is simplified;",
        "FIG. 12 illustrates GPRS data protocol migration from 2.5G to 3G;",
        "FIG. 13 illustrates GPRS control protocol migration from 2.5G to 3G;",
        "FIG. 14 compares the SGSN/HLR/SMS-GW interface to the WAIN server/HLR/SMS-GW interface via the SS7 Gateway;",
        "FIG. 15 focuses on how the GPRS/3G protocols are adapted to the Packet Radio Subsystem in the WAIN architecture;",
        "FIG. 16 illustrates GPRS data and signaling protocols for an integrated 2.5G/WAIN server over 802.11;",
        "FIG. 17 illustrates 3G data and signaling protocols for an integrated RNC/3G/WAIN server;",
        "FIG. 18 illustrates how the GPRS user data transfer is simplified utilizing the WAIN system;",
        "FIG. 19 illustrates how the GPRS data protocols are integrated with the WLAN protocols in the WAIN system;",
        "FIG. 20 illustrates how a WAIN server could connect to a home GGSN in a mobile network; and",
        "FIG. 21 focuses on the interface between the WAIN server and the CGF in the mobile network.",
        "The present disclosure can be described by the embodiments given below. It is understood, however, that the embodiments below are not necessarily limitations to the present disclosure, but are used to describe a typical implementation of the invention. A list of definitions and abbreviations will first be described and then the details of the embodiment will be described.",
        "2G\nSecond generation; generic name for second generation of\n\n\n\ndigital mobile networks (such as GSM)\n\n\n2.5G\n2G mobile system enhanced with higher data rates and\n\n\n\ngenerally including packet radio transmission and switching\n\n\n\nsuch as GPRS\n\n\n3G\nThird generation; generic name for next-generation mobile\n\n\n\nnetworks (UTMS, cdma2000; sometimes GPRS with an\n\n\n\nenhanced radio system is also called 3G in North America)\n\n\nAAA\nAuthentication, Authorization, and Accounting\n\n\nAuC\nAuthentication Center\n\n\nBG\nBorder Gateway\n\n\nBGP\nBorder Gateway Protocol\n\n\nBSC\nBase Station Controller\n\n\nBSS\nBase Station System\n\n\nBTS\nBase Transceiver Station\n\n\nCDMA\nCode Division Multiple Access; wireless access protocol\n\n\nCDR\nCall Detail Record\n\n\nCGF\nCharging Gateway Functionality\n\n\nEIR\nEquipment Identity Register\n\n\nESP\nEnhanced Security Protocol\n\n\nETSI\nEuropean Telecommunications Standards Institute\n\n\nGb\nInterface between a SGSN and a BSS\n\n\nGc\nInterface between a GGSN and a HLR\n\n\nGd\nInterface between a SMS-Gateway and a SGSN, and between\n\n\n\na SMS-IWMSC and a SGSN\n\n\nGf\nInterface between a SGSN and an EIR\n\n\nGGSN\nGateway GPRS Support Node\n\n\nGi\nReference point between a GPRS and an external packet\n\n\n\ndata network\n\n\nGn\nInterface between two GSNs within the same PLMN (a GSN\n\n\n\ncan be a SGSN or a GGSN)\n\n\nGp\nInterface between two GSNs in different PLMNs\n\n\nGPRS\nGeneral Packet Radio Service\n\n\nGr\nInterface between a SGSN and a HLR\n\n\nGs\nInterface between a GGSN and a MSC/VLR\n\n\nGSM\nGlobal System for Mobile communications; wireless standard\n\n\nGW\nGateway\n\n\nHDLC\nHigh-level Data Link Control\n\n\nHLR\nHome Location Register\n\n\nIMSI\nInternational Mobile Subscriber Identity\n\n\nIP\nInternet Protocol\n\n\nISP\nInternet Service Provider\n\n\nIWMSC\nInter Working Mobile Switching Center\n\n\nLLC\nLogical Link Control\n\n\nMAC\nMedium Access Control\n\n\nMM\nMobility Management\n\n\nMS\nMobile Station\n\n\nMSC\nMobile Services Switching Center\n\n\nMT\nMobile Terminal\n\n\nPDA\nPersonal Digital Assistant\n\n\nPDN\nPacket Data Network\n\n\nPDP\nPacket Data Protocol\n\n\nPLMN\nPublic Land Mobile Network\n\n\nPSTN\nPublic Switched Telephone Network\n\n\nQoS\nQuality of Service\n\n\nRADIUS\nRemote Authentication Dial-in User Service\n\n\nRNC\nRadio Network Controller (3G)\n\n\nSGSN\nServing GPRS Support Node\n\n\nSIM\nSubscriber Identity Module\n\n\nSMS\nShort Message Service\n\n\nSMSC\nShort Message Service Center; also known as SMS-C\n\n\n\nand SM-SC\n\n\nSS7\nSignaling System Number 7\n\n\nSMSC\nShort Message Service Center\n\n\nTDMA\nTime-division Multiple Access Protocol; wireless protocol\n\n\nUm\nRadio interface between the MS and the GPRS network\n\n\nUMTS\nUniversal Mobile Telecommunications System\n\n\nVLR\nVisitor Location Register\n\n\nVPN\nVirtual Private Network\n\n\nWAIN\nWireless Access Internet Node\n\n\nWISP\nWireless Internet Service Provider\n\n\nWC\nWAIN Client\n\n\nWS\nWAIN Server",
        "Now turning to FIG. 1 a General Packet Radio Service (GPRS) based mobile data network architecture is shown. GPRS is a new enhancement to GSM communications for supporting packet data transfer over a mobile network. GPRS is the basis for packet data service in a 3rd Generation (3G) mobile standard called Universal Mobile Telecommunications System (UMTS). UMTS is one of the major new 3G mobile communications systems being developed within the framework which has been defined by the ITU and known as IMT-2000. The subject of intense worldwide efforts on research and development throughout the present decade, UMTS has the support of many major telecommunications operators and manufacturers because it represents a unique opportunity to create a mass market for highly personalized and user-friendly mobile access to tomorrow's “Information Society.”",
        "UMTS delivers pictures, graphics, video communications and other wide-band information as well as voice and data, directed to people who may be on the move. UMTS builds on and extends the capability of mobile technologies (like digital cellular and cordless) by providing increased capacity, data capability and a far greater range of services using an innovative radio access scheme and an enhanced, evolving core network. The packet domain of UMTS is based on GPRS. Some characteristics of GPRS include: a data rate up to 150+ kbps (on entire radio channel, 8 time slots); “always connected”—session active even without radio resource assigned; error detection and correction for reliability; security functions to protect mobile's identity and packet data transfer; roaming through a secure tunneling (over IP network); standardized IP protocols; and volume based charging.",
        "The Base Station Systems (BSSs) 100, 102 are responsible for radio transmission, radio source management and access control. The BSSs 100, 102 include, Base Transceiver Station (BTS) 104, 106, 108 and Base Station Controllers (BSC) 110, 112. The BSSs 100, 102 serve the Mobile Stations (MSs) 114, 116, 118, 120 in their coverage area via a radio link 122.",
        "One or more mobile BSSs 100, 102 are connected to a Serving GPRS Support Node (SGSN) 124 which performs packet switching and mobility management functions. Some SGSN functions include: Frame Relay based Gb interface to BS; GPRS attach, authentication, routing area updating, paging; coordination between GPRS and CS via Gs interface; PDP context activation/deactivation; encryption and error protection (LLC); compression and segmentation; Short Message Services (SMS) Control/Relay functions and Gd interface; GTP tunneling over Gn/Gp interface; Gr interface to HLR; and charging data collection (S-CDR, M-CDR, SMS-CDRs) and Ga interface to CGF.",
        "The SGSN 124 also detects MSs 114, 116, 118, 120 in the local area for the transmission and receipt of packets. Additionally, the SGSN 124 locates and identifies the status of MSs 114, 116, 118, 120 and gathers crucial call information, which is an essential aspect of billing. Accordingly, the SGSN 124 is connected to the Charge Gateway Function (CGF) 128, which in turn is connected to the Billing System 130. In addition to providing mobility management and connectivity between the BSSs 100, 102 and the Gateway GPRS Serving Node 126, other key SGSN 124 functions include ciphering, compression and interaction with GSM circuit switched services for mobile paging and SMS. The SGSN 124 in this embodiment is connected to the Short Message Service Center (SM-SC) 132 through the SMS Gateway 134.",
        "One or more SGSNs 124 can be connected to a GGSN 126 for interworking with external IP Network (also known as PDN for Packet Data Network) 136. The GGSN 126 acts as a gateway between GSM networks and public IP networks. Some of the GGSN functions include: a Gn Interface (similar to SGSN's); Packet Data Routing and Relay; PDP context activation and deactivation; address translation and mapping; packet store/forward and sequencing; Gi Interface; IP interworking including transparent IP access and non-transparent IP access requiring authentication; interworking for other PDP types (PPP, OSP); Gc interface to HLR; and charging data collection (G-CDR) and Ga interface to CGF.",
        "The GGSN 126 can connect directly to the Internet using IP over a variety of physical and tunneling protocols. The GGSN 126 can also function as a fire wall, to ensure that all incoming and outgoing data is authorized adding security to an enterprise network. In addition to providing GSM connectivity to external data networks such as the Internet, the GGSN 126 includes all standard based functionality and even more with authentication, encryption, routing, firewall filtering, bandwidth and system management.",
        "Moreover, there is a database called Home Location Register (HLR) 138 connected to the SGSN 124 and GGSN 126 that stores subscription data for all mobile users that are subscribed in any particular home network 140. Further, an MS's security information is stored in an Authentication Center (AuC) 138 (depicted as the same entity as the HLR in this figure) which communicates with the SGSN 124 via the HLR 138 for authentication purposes.",
        "In the GSM/GPRS architecture, a MS 114 consists of a Mobile Terminal (MT) 140 and a Subscriber Identity Module (SIM) 142 (both MT and SIM are shown as the same entity as MS in this figure). The MT 140 supports the radio interface communicating with the BSS 100 and the SIM 142 card stores a subscriber's subscription and security information (there is also a Universal Subscriber Identity Module defined in the UMTS standard).",
        "The SIM 142, the MT 140, the SGSN 124 and the AuC 138 are the only entities involved in the security procedure in this embodiment. In particular, the SIM 142 in MS 114 and the AuC 138 are the two authenticating entities where a unique authentication key (Ki) is stored for each mobile subscriber. The authentication information is exchanged between the MT 140 and SGSN 124. However, the SIM 142 is the key to the personalized service, security and billing. Before a MS 114 can use any GPRS services, it must attach itself to the network 140 through a GPRS Attach procedure, as dictated within the GPRS standard. More details are discussed in co-pending U.S. patent application Ser. No. 10/200,994 which is incorporated by reference above.",
        "Now referring to the rest of the GPRS architecture depicted, the SGSN 124 is also shown connected to another SGSN 144 and Border Gateway 146. The BG 146 in turn connects this network 140 to another Public Land Mobile Network (PLMN) 148 with its own BG 150, a BSS 152, another SGSN 154 and a GGSN 156, along with its MS 158. The BG 150 provides security for communication between two networks.",
        "The SGSN 124 is also connected to an Equipment Identity Register (EIR) 162 and a MSC/VLR 162, which in turn is connected to the Public Switched Telephone Network (PSTN) 164.",
        "Now turning to FIG. 2, the Wireless Access Internet Node (WAIN) technology of the invention is shown. The WAIN system integrates the GPRS network and security functionality with an independent high speed radio system such as IEEE 802.11. The WAIN system consists of a WAIN Client (WC) 200 and a WAIN Server (WS) 204 in the network. The WAIN supports wireless Internet access and data transfer at a high speed while providing connectivity to the mobile network for mobility, security and billing services. The WC 200 supports high layer GPRS terminal functions, interfaces to the SIM card and adapts to the underlying radio system 206, which in this case is 802.11.",
        "The WS 204 supports the GPRS network functions of the SGSN, and the GGSN and interfaces to a HLR/AuC 208 through a SS7 Gateway 210. The WS also connects through the IP network 212 to the 802.11 Access Point (AP) 214, that in turn communicates with the 802.11 Station (STA) module 206 in the WC 200. By combining the multiple network elements into one single node, all unnecessary intermediate interfaces and protocols are removed in the WS 204. Therefore, the system architecture can be greatly simplified and cost can be significantly reduced compared to the conventional mobile network architecture. More detail about the WAIN technology can be found in co-pending U.S. application Ser. No. 09/851,681, which is commonly assigned. The radio link adaptation in both the WC 200 and the WS 204 also allows the WAIN architecture to support multiple radio technologies. More details follow on the methodology implemented to support multiple radio technologies.",
        "In addition to the HLR/AuC 208 node, the SS7 gateway 210 also connects the WS 204 to a SMS-Gateway (SMS-GW) 216 within the GPRS/3G network 218 shown. The GPRS/3G network also shows a CGF 220 and a GGSN 222 that connect to the WS 204 through the IP network 212.",
        "Now turning to FIG. 3, the system elements of the WC 300 and the WS 302 are shown as they are adapted to communicate over the 802.11 radio transport. In addition, the system elements of the SS7 Gateway 304 are also shown, along with the connections between IP network 306 and the WS 302 and the SS7 Gateway 304. The SS7 Gateway 304 allows the WAIN architecture to communicate with SS7 network nodes without the WC 300 and the WS 302 having to encode SS7 messages.",
        "The peer system elements in the WC 300 and the WS 302 include: system controllers 308, 310; registration modules 312, 314; IP Relay modules 316, 318; SM modules 320, 322; GMM modules 324, 326; SNDCP modules 328, 330; LLC modules 332, 334; and Radio Link Adaptation modules 336, 338, respectively. In addition, the WC 300 also contains an applications layer 340 and an applications GUI 342, a Comm WSAP (WAIN Service Access Point) 344, a SIM interface 346 connected to a SIM card 348, and a 802.11 station module 350.",
        "The WS 302 also contains an Operation and Maintenance (O&M) module 352, a charging module (for billing) 354, a HLR signaling module 356, a DNS/DHCP RADIUS module 360, and an 802.11 AP 362.",
        "The peer modules between the WS 302 and the SS7 Gateway 304 include: GTP/E-GTP modules 364, 366; TCP/UDP and TCP modules 368, 370; and IP/L2/L1 modules 372, 374. The SS7 Gateway also includes a E-GTP to MAP Interworking module 376, a MAP module 378, a TCAP/SCCP module 380, and a MTP/L2/L1 module 382. The WS 302 connects to the SS7 Gateway 304 which in turn connects to the SS7 network and specifically to any HLR/AuC that is utilized for authentication purposes. Additionally, the IP network 306 is connected to the other WAIN servers, GGSNs, or CGFs 386.",
        "Now turning to FIG. 4, the WAIN system is depicted connected to the UMTS core network. In this embodiment, two MSs 400, 402 are connected to two Node Bs 404, 406, and in turn connected to a RNC 408 which is connected to a 3G-SGSN 410. In addition, the 802.11 WLAN 412, which includes two WAIN Clients 414, 416, connected to two APs 418, 420, and connects to the WAIN server (WS) 422. In turn, the WS 422 connects to the RADIUS server 424 for User ID/Password authentication, and the Intra-PLMN IP Backbone 426 to connect to the data network and the CGF/Billing server 428. Moreover, the WS 422 connects to the HLR/AuC 432 and the SMS-GW 434 through the SS7 Gateway 436 and the SS7 Network 430. Also depicted in this figure, is a GGSN 438 and the public Internet 440.",
        "Now turning to FIG. 5, a WAIN server is shown integrated with a 3G RNC. Although most elements are similar to FIG. 4, the WS is shown integrated with a 3G RNC and depicted as WS/3G RNC 500. Additionally, a MS 502 is shown connected to a Node B 504 which in turn is connected to the combined WS/3G RNC 500.",
        "Now turning to FIG. 6, the WAIN system is shown connected to a cdma2000 network. In this embodiment, two MTs 600, 602 are connected to two BTS 604, 606, and in turn connected to a BSC 608 which is connected to a MSC/VLR 610 and a private IP backbone 626. In addition, the 802.11 WLAN 612, which includes two wireless SIM users 614, 616, connected to two APs 618, 620, and connects to the WAIN server (WS) 622. In turn, the WS 622 connects to the AAA server 624 for authentication, the HA (Home Agent) 630 and the PDSN/FA (Foreign Agent) 628 through the Private IP Backbone 626. Moreover, the MSC/VLR 610 connects through the SS7 Network 632 to the HLR/AuC 634. Also depicted in the this figure, is the public Internet 636 connected to the WS 622 through the private IP backbone 626.",
        "Now turning to FIG. 7, two GPRS networks with a roaming arrangement are depicted. Operator A's network 700 includes MSs 702, 704 connected to the a BSS 706 and SGSN 708. Moreover, a SMS-GW 710, a GGSN 712, a HLR/AuC 714 and a CGF/Billing server 716 are connected to the SGSN 708, as well as BG 718. The GGSN 712 is connected to a VPN 720 and the public Internet 722.",
        "In turn the BG 718 connects to Operator B's network 724 through a Roaming exchange network 726 to Operator B's BG 728. In addition, Operator B's network 724 also includes MTs 730, 732 connected to the a BSS 734 and SGSN 736. Moreover, a SMS-GW 738, a GGSN 740, a HLR/AuC 742 and a CGF/Billing server 744 are connected to the SGSN 736. The GGSN 740 is also connected to the public Internet 722.",
        "Now turning to FIG. 8, a WAIN system supporting roaming users in GPRS/3G networks is shown. Within one WLAN 800, two WCs 802, 804 are shown connected to two Access Points 806, 808 which are connected to WS 810. Another WLAN 812 is shown with one WC 814 and one Access Point 816 connected to another WS 818. The WSs 810, 818 are in turn connected to the public Internet 826 and the HLR/AuC 836 and SMS-GW 834 through the SS7 Gateway 824 and the SS7 Network 838. Again, the functionality of the SS7 Gateway 824 allows the WAIN nodes to communicate without having to encode SS7 messages.",
        "The WSs 810, 818 are also connected to a RADIUS server 820 for non-SIM authentication purposes, an O&M Control Station 822, a CGF/Billing server 828 and a GGSN 830, both within a GPRS/3G network 832. However, the WAIN System can connect to multiple GPRS/3G networks.",
        "In this embodiment, authentication can be accomplished in one of two methods. One method is utilizing the RADIUS server for non-SIM users. However, this method can sometimes be costly and difficult to manage. Another method is to transport the SIM information to the WAIN servers 818, 810 which forward the SIM information to the HLR/AuC 836 through the SS7 gateway 824 to obtain authentication information for authenticating the client.",
        "Now turning to FIG. 9, the WAIN system is shown connected to the SS7 network through a SS7 Gateway. Within one WLAN 900, two WCs 902, 904 are shown connected to two APs 906, 908 which are connected to WS 910. Another WLAN 912 is shown with two WCs 914, 916 and two APs 918, 920 connected to another WS 922. The WSs 910, 922 are in turn connected to the public Internet 924. Moreover, the WSs 910, 922 also connect to the a HLR/AuC 926 through a SS7 Gateway 928 and the SS7 Network 930. Again, the presence of the SS7 Gateway allows the WSs 910, 922 to send messages to the HLR/AuC without actually encoding SS7 messages and therefore simplifies the authentication process.",
        "Another alternative to the SS7 gateway is depicted in FIG. 10. In this figure, the WAIN system is shown with a subscription/authentication database HLR'/AuC' with an IP interface. Within one WLAN 1000, two WCs 1002, 1004 are shown connected to two APs 1006, 1008 which are connected to WS 1010. Another WLAN 1012 is shown with two WCs 1014, 1016 and two APs 1018, 1020 connected to another WS 1022. The WSs 1010, 1022 are in turn connected to the public Internet 1024. However, unlike FIG. 9, this figure connects the WSs 1010, 1022 to the HLR'/AuC' 1026 without the use of a SS7 Gateway or a SS7 Network.",
        "Now turning to FIG. 11, the WAIN signaling protocol is shown. Instead of the having the Gb-L1 layer 1100, the network service layer 1102 and the BSSGP layer 1104 in the SGSN and the BSS in a conventional GPRS system, the WAIN server eliminates them and lays just the SM/GMM layer 1106 and the LLC layer 1108 on top of the RLC layer 1110, the MAC layer 1112 and the Um-L1 layer 1114. In turn the RLC layer 1110, the MAC layer 1112 and the Um-L1 layer 1114 communicate directly with the corresponding layers 1116, 1118, 1120 in the MS 1122. The RLC, MAC and Um-L1 can be replaced by the 802.11 protocol layers.",
        "Now turning to FIG. 12, data protocol migration from 2.5G to 3G is depicted. When the WAIN server replaces the conventional 2.5G BSS/SGSN/GGSN, the BSSGP 1200, the Network Service 1202, and the Gb-L1 1204 layers are eliminated in the BSS 1206 and the SGSN 1208. Additionally, the GTP 1210, the UDP 1212, the IP 1214, the L2 1216 and the Gn-L1 1218 layers are also eliminated from the SGSN 1208 and the GGSN 1220. The simplified 2.5G WAIN server 1238 thus includes the IP Relay layer 1222, the SNDCP layer 1224, the LLC layer 1226, the RLC layer 1228, the MAC layer 1230, the Um-L1 layer 1232, the L2 layer 1234 and the Gi-L1 layer 1236.",
        "Moreover, since the 3G WAIN server eliminates the GTP-U 1240, the UDP/IP 1242, the AAL5 1244 and the ATM 1246 layers are eliminated in the RNS 1248 and the SGSN 1250. Additionally, the GTP-U 1252, the UDP/IP 1254, the L2 1256 and the Gn-L1 1258 layers are also eliminated from the SGSN 1250 and the GGSN 1260. The simplified 3G WAIN server 1262 therefore includes the IP Relay layer 1264, the PDCP layer 1266, the RLC layer 1228, the MAC layer 1270, the Uu-L1 layer 1272, the L2 layer 1274 and the Gi-L1 layer 1276. In sum, the intermediate interfaces are eliminated; Frame Relay and ATM are eliminated in the WAIN server; the PDCP layer is similar to the SNDCP layer; the LLC and the RLC are combined in the 3G server; and the major differences are in the MAC and U-L1 layers, but they can also be replaced by 802.11.",
        "Now turning to FIG. 13, control protocol migration from 2.5G to 3G is depicted. When the WAIN server replaces the conventional 2.5G BSS/SGSN/GGSN, the BSSGP 1300, the Network Service 1302, and the Gb-L1 1304 layers are eliminated in the BSS 1306 and the SGSN 1308. The simplified 2.5G WAIN server 1310 thus includes the SM/GMM/SMS layer 1312, the RRM/LLC layer 1314, the RLC layer 1316, the MAC layer 1318, and the UM-L1 layer 1320.",
        "Furthermore, since the 3G WAIN server eliminates the RANAP 1322, the SCCP 1324, the Signaling Bearer 1326, the AAL5 1328 and the ATM 1340 layers are eliminated in the RNS 1342 and the SGSN 1344. The simplified 3G WAIN server 1346 therefore includes the SM/GMM/SMS layer 1348, the RRC layer 1350, the RLC layer 1352, the MAC layer 1354, and the Uu-L1 layer 1356. In sum, the Gb/Iu interfaces are eliminated; there is no Frame Relay and ATM in the WAIN server; the SM/GMM/SMS layers are similar; and the major differences are the MAC and U-L1 layers, but can be replaced by 802.11.",
        "Now turning to FIG. 14 the SGSN/HLR/SMS-GW interface is compared to the WAIN Server/HLR/SMS-GW interface via the SS7 Gateway. In a conventional GPRS architecture, the SS7 layers of an SGSN 1400 communicate directly to the peer layers of HLR or SMS-GW 1402. However, in the WAIN architecture, the SS7 gateway 1404 maps the IP based layers of the WAIN server 1406 to the SS7 layers of HLR or SMS-GW 1402, thus taking the SS7 layers out of the WAIN server.",
        "In sum, the WAIN system centralizes the SS7 stack in the SS7 gateway 1404 which performs E-GTP/IP to MAP/SS7 conversion for the Gr and Gd interfaces. Accordingly, this conversion makes all network interfaces IP based. Therefore, the overall signaling architecture is greatly simplified and becomes very cost effective. In addition, one SS7 Gateway can be used for many WAIN servers.",
        "FIG. 15 illustrates how the GPRS/3G protocols are conceptionally adapted to the Packet Radio Subsystem in the WAIN architecture. As depicted, the SIM module 1500 communicates directly with the GPRS/3G protocols 1502 in the WAIN client 1504. In turn those protocols 1502 are directly linked to the Radio Link adaptation layer 1506 and then to the Radio Subsystem 1508. In turn, the Radio Subsystem 1508 of the WAIN client 1504 communicates directly to the Radio Subsystem 1510 of the WAIN server 1512, which in turn is linked to the its respective Radio Link adaptation layer 1514 and its protocols 1516. The division of the Radio Link adaptation layer and the Radio Subsystem allow the WAIN system architecture to accommodate multiple radio protocols. For example, although 802.11, BlueTooth, 3G and GPRS are illustrated, the WAIN system could also be adapted for 802.15, HIPERLAN and other types of wireless protocols.",
        "The WAIN server protocols 1516 connect the WAIN server to the IP network, which in turn is connected directly to the CGF 1520 and any GGSNs 1522 in the GPRS/3G network 1524. Also, through the SS7 gateway 1526, the IP network is connected to the SMS-GW 1528, and the HLR/AuC 1530. Such an architecture allows packet radio (e.g. 802.11) to provide high-speed and low-cost radio communication. In addition, the GPRS/3G standard interfaces and protocols enable mobility, security and billing. Moreover, the GSM SIM card provides convenient subscriber data for authentication and billing.",
        "Now turning to FIG. 16, data and signaling protocols for an integrated 2.5G/WAIN server over 802.11 are shown. In comparison with FIG. 3, the WAIN client in this figure includes similar modules, but the 802.11 AP 362 in this is detailed as a 802.11 module 1600 that communicates to a 802.3 module 1602 that connects the AP 362 through a wired LAN to the 802.3 module 1604 in the WAIN server 302.",
        "Now turning to FIG. 17, data and signaling protocols for a 3G-WAIN Server are shown. The elements of the 3G-WAIN Server 1700 include the PDCP, the RLC, the MAC and the Uu-L1 layers, the SM/GMM/SMS, the IP Relay, the GTP/GTP'/E-GTP, the TCP % UDP, the IP, the L2 and L1 for Gp/GA/Gr/Gd, the L2 and L1 for Gi, the O&M, the Charging and the HLR Signaling modules. In addition, the 3G-MS or 3G-WAIN client functions 1706 are also shown. Moreover, the MAC and L1 layers 1708 can be replaced by the 802.11 radio protocol.",
        "FIG. 18 illustrates how the GPRS user data transfer is simplified utilizing the WAIN system. As indicted by the figure, the BSSGP 1800, the Network service 1802, and the Gb-L1 1804 layers are eliminated from the BSS 1806 and the SGSN 1808, as well as the GTP 1810, the UDP 1812, the IP 1814, the L2 1816, and Gn-L1 1818 layers are eliminated from the SGSN 1808 and the GGSN 1820. In addition, the RLC 1822, the MAC 1824, and Um-L1 layers in the MS 1826 and the BSS 1806 can be replaced in this figure with 802.11.",
        "FIG. 19 illustrates how the GPRS data protocols are integrated with the WLAN protocols in the WAIN system. In comparison with FIG. 3, the WAIN client in this figure includes similar modules, but the 802.11 AP 362 in this is detailed as a 802.11 module 1900 that communicates to a 802.3 module 1902 that connects the AP 362 through a wired LAN to the 802.3 module 1904 in the WAIN server 302.",
        "FIG. 20 illustrates how a WAIN server could connect to a home GGSN in a mobile network. Similar to FIGS. 3 and 19, this figure shows how the protocol layers communicate between the WAIN client 300 and the WAIN server 302. However, this figure also shows the protocol layer communications from the WAIN server 302 and a Home GGSN 2000. Reciprocal layers to the WAIN server 302 in the GGSN include: the Gp-L1 2002, the L2 2004, the IP 2006, the UDP 2008, the GTP 2010, the IP Relay 2012, the L2 2014, and the Gi-L1 2016 layers.",
        "Now turning to FIG. 21, the interface between the WAIN server and the CGF in the mobile network is described. The WAIN server 2100 and the CGF 2102 in the mobile network both contain GTP layers 2104, the TCP/UDP layers 2106, the IP layers 2108, the L2 layers 2110, and the L1 layers 2112. All Call Detail Records (CDRs) from the WAIN server are transmitted to the CGF through this interface.",
        "It is understood that several modifications, changes and substitutions are intended in the foregoing disclosure and in some instances some features of the invention will be employed without a corresponding use of other features. Accordingly, it is appropriate that the appended claims be construed broadly and in a manner consistent with the scope of the invention."
    ],
    "citations": [
        "5608780",
        "5623534",
        "5828737",
        "5991292",
        "5991639",
        "5999813",
        "6104803",
        "6212395",
        "6219395",
        "6333919",
        "6415151",
        "6418324",
        "6490451",
        "6636502",
        "6683881",
        "6687243",
        "6728215",
        "6760343",
        "6775549",
        "7079499",
        "2001/0055298",
        "2002/0058495",
        "2003/0007625",
        "2003/0053444",
        "2003/0076808",
        "2006/0030304"
    ],
    "us_classification": "370401",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "04",
            "subclass": "L",
            "main_group": "12",
            "subgroup": "28"
        }
    ]
}