{
    "title": "Ink jet ink and ink jet recording method",
    "abstract": "Ink jet ink which sufficiently suppresses curling phenomenon of printed matters and satisfies ejection stability, the ink comprising at least water, a colorant, a water-soluble organic compound",
    "inventors": [
        "Shinjo",
        "Shirota",
        "Kurabayashi",
        "Kawabe"
    ],
    "document_number": "07297194",
    "publication_date": "20071120",
    "assignees": [
        "Canon Kabushiki Kaisha"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. Ink jet ink comprising at least water, a colorant, a water-soluble organic compound",
            "components": [
                {
                    "component": "wherein a viscosity of the ink jet ink is 1 to 5 cps at 25° C.,",
                    "subcomponents": []
                },
                {
                    "component": "the water content (%) is 77 mass % or less based on the total amount of the ink jet ink,",
                    "subcomponents": []
                },
                {
                    "component": "the content Y(%) of the water-soluble organic compound",
                    "subcomponents": []
                },
                {
                    "component": "the content X(%) of the water-soluble organic compound",
                    "subcomponents": [
                        "",
                        ""
                    ]
                },
                {
                    "component": "",
                    "subcomponents": []
                },
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The ink jet ink according to claim 1 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The ink jet ink according to claim 1 or 2 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The ink jet ink according to claim 1 , wherein the sum X+Y of the contents of the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The ink jet ink according to claim 4 , wherein the X+Y is X+Y≧25 mass %.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The ink jet ink according to claim 1 , wherein the water content (%) is 71 mass % or less.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The ink jet ink according to claim 1 , wherein the difference between water retention abilities is 40% or more.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. Ink jet ink comprising at least water and a colorant, and further comprising a water-soluble organic compound",
            "components": [
                {
                    "component": "wherein the content X",
                    "subcomponents": [
                        "",
                        "",
                        ""
                    ]
                },
                {
                    "component": "",
                    "subcomponents": []
                },
                {
                    "component": "",
                    "subcomponents": []
                },
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The ink jet ink according to claim 8 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The ink jet ink according to claim 8 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The ink jet ink according to claim 8 , wherein the sum X",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The ink jet ink according to claim 11 , wherein the X",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The ink jet ink according to claim 8 , wherein the content X",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The ink jet ink according to claim 8 , wherein the water content (%) is 77 mass % or less based on the total amount of the ink jet ink.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The ink jet ink according to claim 14 , wherein the water content (%) is 71 mass % or less.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The ink jet ink according to claim 8 , wherein the content Y",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. An ink jet recording method which comprises applying the ink jet ink according to claim 1 or 8 to a recording medium by an ink jet head to form an image.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. An ink cartridge containing the ink jet ink according to claim 1 or 9 .",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. An ink jet recording apparatus equipped with the ink jet ink according to claim 1 or 9 .",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The ink jet ink according to claim 1 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The ink jet ink according to claim 1 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The ink jet ink according to claim 1 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The ink jet ink according to claim 1 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The ink jet ink according to claim 8 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The ink jet ink according to claim 8 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The ink jet ink according to claim 8 , wherein the water-soluble organic compound",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The ink jet ink according to claim 8 , wherein the water-soluble organic compound",
            "components": [
                {
                    "component": "wherein the water-soluble organic compound",
                    "subcomponents": []
                },
                {
                    "component": "wherein the water-soluble organic compound",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. Ink jet ink comprising at least water, a colorant, a water-soluble organic compound",
            "components": [
                {
                    "component": "wherein a viscosity of the ink jet ink is 1 to 5 cps at 25° C., and",
                    "subcomponents": []
                },
                {
                    "component": "the water content (%) is 77 mass % or less based on the total amount of the ink jet ink, and",
                    "subcomponents": []
                },
                {
                    "component": "the content Y(%) of the water-soluble organic compound",
                    "subcomponents": []
                },
                {
                    "component": "the water-soluble organic compound",
                    "subcomponents": []
                },
                {
                    "component": "the content X(%) of the water-soluble organic compound",
                    "subcomponents": [
                        "",
                        ""
                    ]
                },
                {
                    "component": "",
                    "subcomponents": []
                },
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application is a continuation of International Application No. PCT/JP2005/005309, filed Mar. 16, 2005, which claims the benefit of Japanese Patent Application Nos. 2004-075391 filed on Mar. 16, 2004, 2004-075392 filed on Mar. 16, 2004, 2004-289652 filed on Oct. 1, 2004 and 2005-072040 filed on Mar. 14, 2005.",
        "1. Field of the Invention",
        "The present invention relates to ink jet ink, an ink jet recording method, an ink cartridge, and an ink jet recording apparatus.",
        "2. Related Background Art",
        "An ink jet recording method refers to a method which conducts recording of images and texts by allowing fine droplets of ink to fly according various operational principles to apply them on a recording medium (e.g. paper). The technique has features like high speed, low noise, ease in multicolor printing, high flexibility of recording patterns and no need for development and fixing, and is therefore rapidly spreading to a wide variety of applications. In addition, full color ink jet recording system has been recently developed and this enables formation of multi-color images comparable to those by polychromic printing according to a prepress method or printed images produced by color photography. For printing in small numbers, the technique can produce printed matters at lower costs than usual polychromic or photographic printing. Under such circumstances, in response to the demand for improved recording properties including high speed, high definition and full color of recording, improvement of ink jet recording apparatus and recording method has been attempted. Since image forming apparatuses such as printers to which the ink jet recording system is applied are used in various situations, recording stability is also important and in addition, improved durability of images is a property required for ink.",
        "As recording media used in the ink jet recording method, various items such as plain paper, coated paper, glossy paper, OHP sheet and back print film are marketed, while for general use in offices, low price plain paper is mostly used. However, when plain paper is used as a recording medium, it becomes necessary to decrease or prevent curling phenomenon (warping or curl of paper) which occurs when a large amount of ink is applied on the recording medium, while satisfying the aforementioned properties. This curling phenomenon is mainly attributable to applied moisture. That is, it is known that considerable curling phenomenon occurs when moisture is applied to a large area, or in a greater amount. In the case of ink jet recording conducted on plain paper, reduction or suppression of not only curling phenomenon during printing but also curling phenomenon after printing caused by drying and evaporation of moisture (curling phenomenon after printing) have become important.",
        "The printed matter (print) obtained according to the ink jet system are used for various purposes, but curled paper cannot be kept flat, causing a lot of troubles such as curling phenomenon when being piled or put in files. In addition, test printing of presentation documents such as slides and OHP sheet is often conducted on inexpensive plain paper and when figures, photographs or background are printed with the secondary color (blue, etc.), paper becomes warped, making it difficult to handle in many cases.",
        "Some approaches to decrease or prevent curling phenomenon have been proposed so far. For example, ink jet ink containing a solid substance which is soluble in water or an aqueous organic solvent and has four or more hydroxyl groups in a molecular structure is proposed (e.g. see Japanese Patent Application Laid-Open No. H04-332775). In addition, ink containing a saccharide, a sugar alcohol and a specific amide compound as anti-curling agents is proposed (e.g. see Japanese Patent Application Laid-Open No. H06-157955, Japanese Patent Laid-Open No. H06-240189, Japanese Patent Application Laid-Open No. H09-165539 and Japanese Patent Application Laid-Open No. H09-176538). Further, ink containing a specific polyhydric alcohol and glycerol in combination is proposed (see e.g. Japanese Patent Application Laid-Open No. H10-130550). Moreover, ink containing a solvent, a polymer binder, a dye mordant, a water-soluble anti-curling compound, a water-soluble desizing compound, a light resistant compound and a defoaming agent is proposed (e.g. see Japanese Patent Application Laid-Open No. 2000-198267).",
        "Curling phenomenon can be suppressed to some extent by incorporating conventional compounds for preventing curling phenomenon, but ink jet recording has been advanced and involves even higher speed, and ejection stability and reliability are important in the process of high speed printing. Accordingly, in addition to ensuring properties such as stability, permeability and viscosity of the ink itself, it is also important to maintain a high level of basic properties of ink for ink jet recording, in particular, ink jet ejection stability, which is more specifically an anti-clogging property at a ejection port (nozzle) of an ink jet recording head, and a start-up characteristic (re-eject ability of ink from a nozzle after temporal suspension (stopping or pausing) of ink ejection), and at the same time to decrease or prevent curling phenomenon.",
        "Accordingly, an object of the present invention is to provide ink jet ink which can decrease or prevent curling phenomenon with ensuring, as required for conventional ink jet ink, a ejection stability after leaving a head and a ejection stability which can prevent initial portions of printing from being unstable or blurred at the beginning of printing (start-up characteristic), an ink jet recording method, an ink cartridge and an ink jet recording apparatus.",
        "In addition, another object of the present invention is to sufficiently decrease or prevent curling phenomenon, thereby making it easier to handle printed matters prepared by using plain paper.",
        "The above-mentioned objects are achieved by the present invention described below.",
        "That is, the ink jet ink of the present invention comprises at least water, a colorant, a water-soluble organic compound 1 and a water-soluble organic compound 2,",
        "wherein the content X(%) of the water-soluble organic compound 1 is 10 mass % or more based on the total amount of the ink jet ink and the content X(%) of the water-soluble organic compound 1 and the content Y(%) of the water-soluble organic compound 2 based on the total amount of the ink jet ink satisfy the relation of the following formula (I) and formula (II):\n\n0<Y/X≦0.9,  (I)\n\nX+Y≧15% by mass,  (II)\n\nand wherein the water-soluble organic compound 1 is a water-retentive, water-soluble organic compound having a difference between the water retention ability in an environment of a temperature of 23° C. and a humidity of 45% and the water retention ability in an environment of a temperature of 30° C. and a humidity of 80% of 36% or less, and the water-soluble organic compound 2 is a water-soluble organic compound other than the colorant and the water-soluble organic compound 1.",
        "In particular, it is preferable that the content Y(%) of the water-soluble organic compound 2 is Y<15% by mass and the difference between water retention abilities is 40% or more.",
        "Further, another embodiment of the present invention is ink jet ink comprising at least water and a colorant, further comprising a water-soluble organic compound 1-1, a water-soluble organic compound 1-2, and a water-soluble organic compound 2-1, wherein the content X1(%) of the water-soluble organic compound 1-1 based on the total amount of the ink jet ink, the content X2(%) of the water-soluble organic compound 1-2 based on the total amount of the ink jet ink and the content Y1(%) of the water-soluble organic compound 2-1 based on the total amount of the ink jet ink satisfy the relation of the following formulas (1) to (3):\n\n0.1≦(X2+Y1)/X1≦2.5,  (1)\n\nX1+X2≧10% by mass,  (2)\n\nX2+Y1≧3% by mass  (3)\n\nand wherein the water-soluble organic compound 1-1 is a water-soluble polyhydric alcohol or water-soluble amide compound having a difference between the water retention ability in an environment of a temperature of 23° C. and a humidity of 45% and the water retention ability in an environment of a temperature of 30° C. and a humidity of 80% of 36% or less, and a molecular weight Mw in the range of 100≦Mw≦1000, the water-soluble organic compound 1-2 is a water-soluble alkanediol having a difference between the water retention ability in an environment of a temperature of 23° C. and a humidity of 45% and the water retention ability in an environment of a temperature of 30° C. and a humidity of 80% of 36% or less, and a molecular weight Mw in the range of 100≦Mw≦150, the alkanediol further containing an —OH group at both terminals of a main chain, and the water-soluble organic compound 2-1 is a water-soluble organic compound other than the colorant, the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2.",
        "In particular, it is preferable that the content Y1(%) of the water-soluble organic compound 2-1 is Y1<15% by mass and the difference between water retention abilities is 40% or more.",
        "The ink jet recording method of the present invention comprises applying the above-mentioned ink jet ink to a recording medium by an ink jet head to form an image.",
        "The ink cartridge of the present invention contains the above-mentioned ink jet ink.",
        "The ink jet recording apparatus of the present invention is equipped with the above-mentioned ink jet ink.",
        "According to the present invention, curling phenomenon can be sufficiently prevented and handling of printed matters of plain paper, in particular, is thus made easier in an ink jet recording method using plain paper. In addition, ink and a recording method using the same which can achieve ejection stability of ink in ink jet recording are provided. Furthermore, ink and a recording method using the same which can achieve excellent image characteristics are provided.",
        "FIG. 1 illustrates the results of measurement of water retention ability of water-soluble organic compounds;",
        "FIG. 2 illustrates the difference between water retention abilities in two specific environments;",
        "FIG. 3 is a perspective view illustrating an example of an ink jet recording apparatus;",
        "FIG. 4 is a vertical cross-sectional view of an ink cartridge;",
        "FIG. 5 is a perspective view of a recording unit; and",
        "FIG. 6 is a schematic perspective view illustrating an example of an ink jet cartridge having a liquid ejection head.",
        "Hereinafter, the present invention is described in more detail referring to preferred embodiments.",
        "[Mechanism of Occurrence of Curling Phenomenon]",
        "The present invention has been made with the aim of preventing curling phenomenon of recording media after applying ink jet ink (hereinafter referred to as “ink”) on recording media by an ink jet recording method.",
        "The mechanism of occurrence of curling phenomenon after printing on a recording medium is as follows. Cellulose fiber is formed into paper by a papermaking machine so as to be aligned (substantially forcibly oriented) along the direction of flow of paper. Since cellulose fiber has greatly different degrees of expansion due to moisture in the machine direction and the cross direction, dimensional change which occurs upon application of moisture varies in the short grain and in the long grain. Therefore, when moisture is applied on paper, cellulose fiber in the cross direction of paper is swelled and the length of paper is increased in the direction (mostly the long grain of paper) perpendicular to the flow direction (mostly the short grain of paper) of the papermaking machine when paper is formed. For this reason, when the amount of ink applied, i.e., the amount of moisture applied, is large upon printing, curling phenomenon occurs toward the direction opposite to the plane on which moisture is applied, namely, negative curling phenomenon occurs. However, due to gradual vaporization of moisture which was once absorbed into cellulose fiber, cellulose fiber starts to shrink to allow paper to shrink. According to this, the length of paper becomes shorter than that before moisture is applied. Thus, the paper gradually curls toward the direction of the plane on which moisture is applied, namely, positive curling phenomenon occurs. This seems to occur because moisture applied by printing first enters into hydrogen bond between fibers and as the moisture is transferred due to evaporation or the like, the tension applied at an initial stage is released and printed portions are shrunk. This positive curling phenomenon poses problems when ink jet recording is conducted on recording media such as plain paper.",
        "The inventors of the present invention carried out detail observation of positive curling phenomenon which occurs when printing is conducted by an ink jet recording method. As a result, they have found that the positive curling phenomenon continuously progresses for a long period when ink jet ink is applied on paper unlike the case where moisture is simply applied to paper.",
        "At present, organic compounds such as glycerol and urea which are contained in most kinds of ink jet ink greatly contribute to reliability, in particular, ejection stability of ink jet ink. On the contrary, it is considered that these organic compounds may be a cause of continuous progress of positive curling phenomenon.",
        "[Water-Retentive, Water-Soluble Organic Compound]",
        "Since curling phenomenon after applying a liquid medium containing water on paper seems to have a correlation with vaporization of moisture applied on the paper, inventors of the present invention conducted the following detailed studies on the water retention ability of water-soluble organic compounds which are commonly used for ink jet ink.",
        "First, 20 mass % aqueous solutions of various water-soluble organic compounds were prepared and 10 g of each solution was precisely weighed and put in a glass petri dish, and left to stand in an environment of a temperature of 23° C. and a humidity of 45%. Pure water containing no water-soluble organic compound was also left to stand. Due to vaporization of water, the solution in the petri dish decreased and consequently the weight becomes constant. In glass petri dish also left, which contained only pure water, all pure water was vaporized at this point, and it is thus considered that those remained in the petri dish containing a water-soluble organic compound is the water-soluble organic compound and the moisture retained in the substance. Based on this, the water retention ability of each water-soluble organic compound was calculated according to the following formula.",
        "Water\n    ⁢\n    \n      \n    \n    ⁢\n    retention\n    ⁢\n    \n      \n    \n    ⁢\n    ability\n    ⁢\n    \n      \n    \n    ⁢\n    %\n  \n  =\n  \n    \n      \n        (\n        \n          Mass\n          ⁢\n          \n            \n          \n          ⁢\n          of\n          ⁢\n          \n            \n          \n          ⁢\n          remaining\n          ⁢\n          \n            \n          \n          ⁢\n          substance\n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            g\n            )\n          \n        \n        )\n      \n      -\n      \n        \n\n      \n      ⁢\n      \n        (\n        \n          \n            Mass\n            ⁢\n            \n              \n            \n            ⁢\n            of\n            ⁢\n            \n              \n            \n            ⁢\n            water\n          \n          -\n          \n            soluble\n            ⁢\n            \n              \n            \n            ⁢\n            \n              compound\n              ⁡\n              \n                (\n                g\n                )\n              \n            \n          \n        \n        )\n      \n    \n    \n      (\n      \n        \n          Mass\n          ⁢\n          \n            \n          \n          ⁢\n          of\n          ⁢\n          \n            \n          \n          ⁢\n          water\n        \n        -\n        \n          soluble\n          ⁢\n          \n            \n          \n          ⁢\n          compound\n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            g\n            )\n          \n        \n      \n      )",
        "Next, the above petri dish was moved to an environment of a temperature of 30° C. and humidity of 80% and after waiting until equilibrium is reached as in the above, then the water retention ability was measured under this condition. Further, the same petri dish was moved to an environment of a temperature of 23° C. and a humidity of 45% again and the water retention ability was measured. The obtained results are shown in FIG. 1. In addition, differences of water retention abilities in both environments are shown in FIG. 2.",
        "The inventors of the present invention have considered some correlation between the difference between water retention abilities under the aforementioned environments and the occurrence of curling phenomenon of plain paper. Based on this, occurrence of curling phenomenon was studied by applying, on plain paper, aqueous solutions containing a water-soluble organic compound examined above. As a result, it has been found that the water-soluble organic compound 1 which has a difference between the water retention ability in an environment of a temperature of 23° C. and a humidity of 45% and the water retention ability in an environment of a temperature of 30° C. and a humidity of 80% of 36% or less can significantly prevent curling phenomenon. Then, ink containing a coloring material, additives and these water-soluble organic compounds was prepared and ink jet recording was conducted to observe occurrence of curling phenomenon. As a result, it was confirmed that no curling phenomenon occurred even after lapse of a few days at room temperature after printing.",
        "The water-retentive water-soluble organic compound in the present invention refers to a water-soluble organic compound having a water retention ability of 5% or more in an environment of a temperature of 23° C. and a humidity of 45%.",
        "However, when ink composed of a water-soluble organic compound 1 as only water-soluble organic compound is put in an ink jet recording head which ejects droplets from nozzles and the head is attached to an ink jet recording apparatus and left for a long time, there arose other problems that the ejection stability is deteriorated due to clogging of the nozzles and that printing of initial portions is unstable at the beginning of printing in a low temperature, low humidity environment.",
        "In such circumstances, the inventors of the present invention have continued further studies with the aim of ensuring ejection stability equal to that of conventional ink jet ink with preventing curling phenomenon to a certain degree or more. As a result, it has been finally found that the above-mentioned problems can be solved by adding, to ink jet ink, in addition to the a water-soluble organic compound 1, a water-soluble organic compound other than the water-soluble organic compound 1, which is more specifically a water-soluble organic compound 2 having a difference between the water retention ability in an environment of a temperature of 23° C. and a humidity of 45% and the water retention ability in an environment of a temperature of 30° C. and a humidity of 80% of more than 36%, in a proportion satisfying the conditions of the following formula (I) and formula (II)\n\n0<Y/X≦0.9  (I)\n\nX+Y≧15 mass %  (II)\n\n(X: content (%) of water-soluble organic compound 1 based on the total amount of the ink jet ink, Y: content (%) of water-soluble organic compound based on the total amount of the ink jet ink).",
        "Furthermore, the studies by the inventors of the present invention has revealed that when a large amount, specifically more than 3.0 g/m2, of ink is applied, the content X(%) of the water-soluble organic compound 1 needs to be 10 mass % or more based on the total amount of the ink jet ink, in addition to the above-mentioned conditions.",
        "The water-soluble organic compound 1 is preferably a polyhydric alcohol having an amide bond or polyhydric alcohol having a sulfone group.",
        "The water-soluble organic compound 2 in the present invention corresponds to water-soluble organic compounds generally used for ink jet ink. The water-soluble organic compound 2 has a great difference between water retention abilities, easily releases moisture in the process of drying of recording media to which moisture is applied, and accelerates shrinkage of cellulose fiber. Most of the water-soluble organic compounds 2 have small molecular weight of about 100 or less, and easily migrate within a recording medium as moistures do, and are difficult to be fixed on cellulose fiber. Accordingly, the water-soluble organic compound 2 gradually migrates within the recording medium to accelerate curling phenomenon. Therefore, curling phenomenon is rather great when a large amount of ink containing a water-soluble organic compound 2 which is usually used for ink jet ink is applied on plain paper.",
        "The studies by the inventors of the present invention have revealed that even if ink jet ink contains a water-soluble organic compound 2 which has a property of accelerating curling phenomenon, curling phenomenon can be effectively prevented and ejection stability is improved when the above-mentioned water-soluble organic compound is contained and the content ratio Y/X of the water-soluble organic compound and the water-soluble organic compound is adjusted to 0<Y/X≦0.9 as shown in the formula (1).",
        "In addition, the inventors of the present invention have also found that the total content X+Y(%) of the water-soluble organic compound 1 and the water-soluble organic compound 2 must be X+Y≧15 mass %. This is because when ink is applied on paper, it is necessary to relatively reduce the moisture content by increasing the total content of the water-soluble organic compounds in the ink jet ink in order to prevent vaporization of water in a short term and paper shrinkage due to migration in particular. In addition to this, it is speculated that, in order to prevent vaporization of ink applied on paper, the total amount of water-retentive water-soluble organic compounds, i.e., the water-soluble organic compound 1 and the water-soluble organic compound 2, needs to be 15 mass % or more.",
        "The above-mentioned X+Y satisfies the relation of more preferably X+Y≧20 mass %, further preferably X+Y≧25 mass %. The inventors of the present invention prepared ink having a greater total content X+Y (%) of the water-soluble organic compound 1 and the water-soluble organic compound 2 and observed curling phenomenon. As a result, when the above-mentioned X+Y is great, curling phenomenon which occurs within a short time after printing can be effectively prevented. In particular, when the X+Y is X+Y≧25 mass %, curling phenomenon which occurs within a short time after printing has improved quite effectively.",
        "In addition, the water content is preferably 77 mass % or less, more preferably 71 mass % or less based on the total amount of the ink jet ink.",
        "In addition, the content Y(%) of the water-soluble organic compound 2 is preferably Y<15 mass % based on the total amount of the ink jet ink. The reason for this can be presumed as follows. As described above, since the water-soluble organic compound has a property of accelerating curling phenomenon, the higher the content thereof in the ink, the higher the occurrence of curling phenomenon. For this reason, even if ink jet ink contains a large amount of water-soluble organic compound 1, the water-soluble organic compound causes migration of the water-soluble organic compound 1, reducing the effect of preventing curling phenomenon of the water-soluble organic compound 1. The difference between water retention abilities of the water-soluble organic compound is preferably 40% or more.",
        "Another embodiment of the present invention described below can also effectively prevent curling phenomenon after printing on a recording medium, in particular, plain paper, and can achieve excellent ejection stability.",
        "The inventors of the present invention continued further studies using the water-soluble organic compound and the water-soluble organic compound 2. As a result, it has been found that the above-mentioned problems can be effectively solved by incorporating, in ink jet ink, one or more of each of specific water-soluble organic compound 1-1 and water-soluble organic compound 1-2 among the water-soluble organic compounds 1. That is, it has been found that the above-mentioned problems can be solved by incorporating a water-soluble organic compound 1-1, a water-soluble organic compound 1-2, and a water-soluble organic compound 2-1 in a proportion that the contents X1(%), X2(%) and Y1(%) of the aforementioned water-soluble organic compounds based on the total amount of the ink jet ink satisfy the following conditions.\n\n0.1≦(X2+Y1)/X1≦2.5  (1)\n\n10 mass %≦X1+X2  (2)\n\n3 mass %≦X2+Y1  (3)\n\n(X1: content (%) of water-soluble organic compound 1-1 based on the total amount of the ink jet ink, X2: content (%) of the water-soluble organic compound 1-2 based on the total amount of the ink jet ink, Y1: content (%) of water-soluble organic compound 2-1 based on the total amount of the ink jet ink)",
        "The action of the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2 in this embodiment is described below.",
        "The water-soluble organic compound 1-1 is a water-soluble polyhydric alcohol or water-soluble amide compound having a difference between the water retention ability in an environment of a temperature of 23° C. and a humidity of 45% and the water retention ability in an environment of a temperature of 30° C. and a humidity of 80% of 36% or less, and a molecular weight Mw in the range of 100≦Mw≦1000.",
        "Because the water-soluble organic compound 1-1 has large molecules, it is difficult to penetrate into cellulose fiber and thus has little effect on curling phenomenon occurring within a relatively short time after printing. However, once the compound enters into cellulose fiber, it hardly causes migration. This seems to be because the compound has moderate water retention ability and is less likely to accumulate water more than needed, and has high affinity with cellulose fiber because the compound has, in the molecule, a plurality of, specifically, at least three portions which easily form a hydrogen bond.",
        "For example, triols have 3 or more —OH groups, saccharides have 2 or more —OH groups and a carbonyl group, N,N′-bis-(2-hydroxyethyl)-urea has 2 or more —OH groups and an amide bond, bishydroxyethyl sulfone has 2 or more —OH groups and a sulfone group, and tetraethylene glycol has 2 or more —OH groups and 3 or more ether bonds. It is also considered that a plurality of factors such as large molecular size and low possibility of migration with water are playing some part effectively.",
        "On the other hand, although diethylene glycol, for example, has a molecular weight of 100 or more and 2—OH groups at both terminals of the molecule and an ether bond in the molecule, the effect of preventing curling phenomenon is low. This seems to be because the hydrophilicity (property of bonding to hydrogen) is smaller with only one ether bond compared to one —OH group, and in an aqueous solution containing the same, molecules are bent due to interaction between the ether bond and water molecules and the molecular size becomes smaller. It is thus considered that diols having an ether bond in the molecule needs to have at least three ether bonds so as to exhibit the effect of preventing curling phenomenon.",
        "The water-soluble organic compound 1-2 is water-soluble alkane diol having a difference between the water retention ability in an environment of a temperature of 23° C. and a humidity of 45% and the water retention ability in an environment of a temperature of 30° C. and a humidity of 80% of 36% or less, and a molecular weight Mw in the range of 100≦ Mw≦150 and an —OH group at both terminals of the main chain.",
        "The action of the water-soluble organic compound 1-2 is to prevent curling phenomenon which occurs within a relatively short time after printing (a few hours after printing). Although the water-soluble organic compound 1-2 effectively prevents curling phenomenon which occurs within a relatively short time after printing, it has a smaller effect on curling phenomenon which occurs within a time frame longer than that (5, 6 hours to several weeks). This seems to be because the water-soluble organic compound 1-2 is alkane diol which has a molecular weight of 100 to 150 or lower and contains a —OH group at both terminals of the main chain, and as it contains no hydrophilic bond such as an ether bond in the molecule, the molecules are not bent, making the molecular size relatively large. In addition, it is considered that due to its lipophilic intermolecular structure and hydrophilic molecular terminals, the compound has a characteristic similar to that of a surfactant and thus tends to moisten the cellulose fiber quickly. Further, the moderate molecular size may make it easier to penetrate into the cellulose fiber, enabling the prevention of curling phenomenon which occurs within a short time. However, it is considered that because the number of —OH groups which have an affinity to cellulose fiber is small, migration may occur in a long time.",
        "The inventors of the present invention have found that combination use of the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2 has an effect of preventing curling phenomenon for a short time to a long time after printing compared to the case in which only one kind of the water-soluble organic compounds is contained. This seems to be because the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2 have a similar structure and therefore have a high compatibility, and thus the water-soluble organic compound 1-1 can be effectively introduced to cellulose fiber together with the water-soluble organic compound 1-2, thereby achieving prevention of curling phenomenon for a short time to a long time after printing.",
        "The inventors of the present invention have found that prevention of short-time curling phenomenon can be effectively improved particularly when the total content of the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2 in the case of combination use is less than 25 mass % based on the total amount of the ink jet ink, or when the water content is more than 71 mass % based on the total amount of the ink jet ink. In particular, in the aforementioned conditions, ink containing a water-soluble organic compound 1-2 and ink which does not contain the same present a remarkable contrast in curling phenomenon which occurs within a relatively short time after printing.",
        "As described above, ink jet ink containing the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2 can prevent curling phenomenon effectively. However, to satisfy the ejection stability of ink jet ink, it is necessary to use a water-soluble organic compound 2-1 in combination.",
        "Herein, the water-soluble organic compound 2-1 is other than a colorant, a water-soluble organic solvent 1-1 and a water-soluble organic solvent 1-2. More specifically, it is a water-soluble organic compound having a difference between the water retention ability in an environment of a temperature of 23° C. and a humidity of 45% and the water retention ability in an environment of a temperature of 30° C. and a humidity of 80% of more than 36%.",
        "The reason can be assumed as follows. As described above, the water-soluble organic compound 1-2 has a surfactant-like characteristic, and has low compatibility with a colorant. Therefore, the water-soluble organic compound 1-2 exists near the ink jet nozzle at a concentration higher than those of other components, and this prevents vaporization of moisture near the nozzle. By using a water-soluble organic compound 2-1 which has high compatibility with colorant and high water retention ability, increase in viscosity inside the nozzle can be prevented and the ejection stability is improved.",
        "The studies by the inventors of the present invention have revealed that even if ink jet ink contains water-soluble organic compound 2-1 which has a property of accelerating curling phenomenon, curling phenomenon can be continuously prevented for a short time to a long time after printing and ejection stability can be improved when the above-mentioned water-soluble organic compound 1-1 and water-soluble organic compound 1-2 are contained and the proportion (X2+Y1)/X1 of the water-soluble organic compound 1-1, the water-soluble organic compound 1-2 and the water-soluble organic compound 2-1 is set to 0.1≦(X2+Y1)/X1≦2.5 as shown in the formula (1).",
        "The studies by the inventors of the present invention have also revealed that in order to prevent curling phenomenon when a large amount, specifically more than 3.0 g/m2, of ink is applied, the sum X1+X2(%) of the contents of the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2 must be X1+X2≧10 mass %.",
        "The studies by the inventors of the present invention have also revealed that to improve the ejection stability, the sum X2+Y1 of the contents of the water-soluble organic compound 1-2 and the water-soluble organic compound 2-1 must be X2+Y1≧3 mass %, in addition to the above-mentioned conditions.",
        "In addition, the water content is preferably 77 mass % or less, more preferably 71 mass % or less based on the total amount of the ink jet ink.",
        "Further, the content Y1 (%) of the water-soluble organic compound 2-1 is preferably Y1<15 mass % based on the total amount of the ink jet ink. The reason can be assumed as follows. As described above, the water-soluble organic compound 2-1 has a property of accelerating curling phenomenon, and the higher the content thereof in the ink, the higher the occurrence of curling phenomenon. For this reason, even if ink jet ink contains large amounts of the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2, the water-soluble organic compound 2-1 causes migration of the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2, and reduces the effect of preventing curling phenomenon of the water-soluble organic compound 1-1 and the water-soluble organic compound 1-2. Further, the difference between water retention abilities of the water-soluble organic compound 2-1 is preferably 40% or more.",
        "In addition to the formulae (1) to (3), at least one condition selected from the following (A) to (F) is preferably satisfied.\n\n    (A) X1, X2 and Y1 further satisfy the following formulae\n\n0.2≦(X2+Y1)/X1≦2.0, X1+X2≧13 mass % and X1+X2+Y1≧15 mass %\n\n    (B) X1, X2 and Y1 further satisfy the following formula\n\n0.2≦(X2+Y1)/X1≦1.5\n\n    (C) X1, X2 and Y1 further satisfy the following formulae\n\n0.2≦(X2+Y1)/X1<1.5, 0 mass %<Y1<11 mass % and X1+X2+Y1≧20 mass %\n\n    (D) X1, X2 and Y1 further satisfy the following formulae\n\n0.2≦(X2+Y1)/X1≦1.5 and X1+X2+Y1≧25 mass %\n\n    (E) X1, X2 and Y1 further satisfy the following formulae\n\n0.2≦(X2+Y1)/X1≦1.0, X1+X2≧13 mass % and X1+X2Y1≧20 mass %\n\n    (F) X1, X2 and Y1 further satisfy the following formula\n\n0<Y1/(X1+X2)≦0.9\n\n[Ink Jet Ink]",
        "Components constituting the ink jet ink of the present invention are described in detail.",
        "(Water-Retentive, Water-Soluble Organic Compound)",
        "In the following, specific examples of the water-soluble organic compound or the water-soluble organic compound 1-1, the water-soluble organic compound 1-2, and the water-soluble organic compound 2 or the water-soluble organic compound 2-1 are shown.\n\n    \n    \n        Specific examples of water-soluble organic compound 1",
        "Water-soluble organic compounds having a polyethylene structure and containing a hydrophilic bonding group other than an —OH group, such as ethylene oxide modified glycerol triacrylate (the number of ethylene oxide added: 6 to 30), dipentaerythritol and ethylene oxide modified acrylate ester (the number of ethylene oxide added: 8 to 40).\n\n    \n    \n        Specific Examples of Water-Soluble Organic Compound 1 or Water-Soluble Organic Compound 1-1",
        "Polyethylene glycols having an average\n\n    molecular weight of 200 (main component:\n    tetraethylene glycol), 300 (main component:\n    hexaethylene glycol), 400 (main component:\n    nonaethylene glycol), 600 (main component:\n    tridecaethylene glycol) and 1000 (main component:\n\ndocosaethylene glycol), tri- or higher valent alcohol compounds such as 1,2,6-hexanetriol, trimethylolpropane, trimethylolethane, pentaerythritol and diglycerol, and polyhydric alcohol compounds containing a group having a property of bonding to hydrogen, such as a carbonyl group, a sulfone group and an amide group, such as glucose, sorbitol, bishydroxyethyl sulfone, N,N′-bis -(2-hydroxyethyl)-urea and tetra-(2-hydroxyethyl) -phenyldiamide. Of these, in particular, polyethylene glycol having an average molecular weight of 200, 1,2,6-hexanetriol, trimethylolpropane, bishydroxyethyl sulfone and N,N′-bis-(2-hydroxyethyl)-urea are preferable.\n    \n        Specific Examples of Water-Soluble Organic Compound 1 or Water-Soluble Organic Compound 1-2",
        "Alkane diols having an —OH group at both terminals of the carbon main chain which may have a substituent, such as 1,5-pentanediol, 1,6-hexanediol, 1,7-heptanediol, 3-methyl-1,5-pentanediol, 2-amino-2-methyl-1,3-propanediol and 2-amino-2-ethyl-1,3-propanediol. Of these, in particular, 1,6-hexanediol is preferable.\n\n    \n    \n        Specific Examples of Water-Soluble Organic Compound 2 or Water-Soluble Organic Compound 2-1",
        "Water-soluble organic compounds which contain a hydrophilic group and have a small number of carbon atoms, such as urea, ethylene glycol, 2-pyrrolidone, ethylene urea, glycerol and diethylene glycol. Of these, in particular, urea, 2-pyrrolidone, ethylene urea and glycerol are preferable.",
        "In the present invention, at least one of the above-mentioned water-soluble organic compounds 1 or the water-soluble organic compounds 1-1 preferably has an amide bond in the molecule. In particular, N,N′-bis-(2-hydroxyethyl)-urea is preferable. The reason is because N,N′-bis-(2-hydroxyethyl)-urea has an ability to prevent association of molecules, and in the present invention where it is essential to use other water-soluble organic compounds together, it would prevent the association of the water-soluble organic compounds. Particularly, in the case of ink used for an ink jet recording method, abilities such as prevention of clogging and solubility of dye can be exhibited more easily, whereby curling phenomenon can be effectively prevented and ejection stability and reliability can be greatly improved. In particular, when N,N′-bis-(2-hydroxyethyl)-urea or bishydroxyethyl sulfone is used as a water-soluble organic compound or a water-soluble organic compound 1-1, diol or triol having 5 or more carbon atoms is preferably used in combination. Of the diols or triols having 5 or more carbon atoms, in particular, 1,6-hexanediol and 1,2,6-hexanetriol are preferable. When they are used in combination, the above-mentioned ability to prevent association of molecules can be more effectively exerted, and a particularly excellent curling phenomenon prevention effect and ejection stability can be obtained.",
        "Generally, those classified into water-soluble organic compound often increase viscosity when added to ink, and curling phenomenon can be improved when the amount to be added is increased, but in some cases, there was a problem of, in particular, start-up characteristic of the ejection stabilities. To solve this problem, at least one of the above-mentioned water-soluble organic compounds 1 or the water-soluble organic compounds 1-1 is preferably a water-soluble organic compound containing a sulfone bond in the molecule. Of such compounds, bishydroxyethyl sulfone is most preferable. This is because, when used in combination with other components, bishydroxyethyl sulfone makes solvation between the other components and water difficult, and reduces viscosity. Thus, in the case of ink jet ink recording method in particular, bishydroxyethyl sulfone is effective for improving start-up characteristic of the ejection stabilities.",
        "In addition, water-soluble organic compounds such as urea and ethylene urea are preferable because they have a small molecular weight and do not easily increase the viscosity even if added in greater amounts. Water-soluble organic compounds such as urea and ethylene urea can be used as a water-retentive water-soluble organic compound in the present invention, by combining with a water-soluble organic solvent or a water-soluble compound such as dye. The result of measuring the water retention ability of ethylene urea (difference due to environment) shown in FIG. 1 indicates the data measured using a dye together.",
        "For the molecular weight of the water-soluble organic compounds which have a molecular weight distribution, such as a polyhydric alcohol having an amide bond and polyethylene glycol mentioned above, an average molecular weight was determined by any of the followings.\n\n    (1) In accordance with JIS Handbook, Chemical Analysis, K0118 and K0123, mass spectrum measurement, gas chromatography-mass spectrometry (GC-MS) and liquid chromatography-mass spectrometry (LC-MS) were conducted to measure molecular weights.\n    (2) For polyethylene glycol having a molecular weight distribution, an average molecular weight thereof was measured by size exclusion chromatography (GPC) in accordance with JIS Handbook, Chemical Analysis, K0124 and determined to be the molecular weight. Further, for water-soluble organic compounds having a molecular weight distribution other than polyethylene glycol, weight average molecular weights converted to polyethylene glycol were calculated and determined to be the molecular weight.\n    (3) According to NMR, infrared spectroscopy or elemental analysis, structures of water-soluble organic compounds were identified to determine the molecular weight.\n\n(Colorant)",
        "Examples of the colorant used for the ink jet ink of the present invention include water-soluble dyes and pigments. The colorant may be used alone or in a combination of two or more.",
        "(Dye)",
        "Examples of the dye to be used in the present invention include anionic water-soluble dyes having a hue of black, cyan, magenta and yellow. The anionic water-soluble dye is not particularly limited as long as it is an acid dye, a direct dye or a reactive dye listed in COLOUR INDEX. In addition, even if not listed in COLOUR INDEX, the dye is not particularly limited as long as it contains an anionic group such as a sulfone group. These dyes are used in the range of from 1 to 10 mass %, preferably from 1 to 5 mass % based on the total amount of the ink jet ink. A dye other than the above-mentioned dyes can be also used. One specific example is a dye containing a carboxyl group as a solubilizing group. Of these dyes, a dye having a pH-dependent solubility is preferable. These dyes can be used in the range of 1 to 10 mass %, preferably 1 to 7 mass % in the ink.",
        "In terms of the color index (C.I.) number, the following dyes can be listed. Obviously, dyes are not limited to the followings.\n\n    C.I. direct yellow: 8, 11, 12, 27, 28, 33, 39, 44, 50, 58, 85, 86, 87, 88, 98, 100, 110\n    C.I. direct red: 2, 4, 9, 11, 20, 23, 24, 31, 39, 46, 62, 75, 79, 80, 83, 89, 95, 197, 201, 218, 220, 224, 225, 226, 227, 228, 230\n    C.I. direct blue: 1, 15, 22, 25, 41, 76, 77, 80, 86, 90, 98, 106, 108, 120, 158, 163, 168, 199, 226\n    C.I. acid yellow: 1, 3, 7, 11, 17, 23, 25, 29, 36, 38, 40, 42, 44, 76, 98, 99\n    C.I. acid red: 6, 8, 9, 13, 14, 18, 26, 27, 32, 35, 42, 51, 52, 80, 83, 87, 89, 92, 94, 106, 114, 115, 133, 134, 145, 158, 198, 249, 265, 289\n    C.I. acid blue: 1, 7, 9, 15, 22, 23, 25, 29, 40, 43, 59, 62, 74, 78, 80, 90, 100, 102, 104, 117, 127, 138, 158, 161\n    C.I. direct black: 17, 19, 22, 31, 32, 51, 62, 71, 74, 112, 113, 154, 168\n    C.I. acid black: 2, 48, 51, 52, 110, 115, 156\n    C.I. reactive black: 1, 8, 12, 13\n    C.I. food black: 1, 2\n\n(Pigment)",
        "Examples of the pigment used in the present invention include carbon black and organic pigments. These pigments are used in the range of 1 to 20 mass %, preferably 2 to 12 mass % based on the total amount of the ink jet ink.\n\n    \n    \n        Carbon Black",
        "Specific examples of carbon black include carbon black pigments including furnace black, lamp black, acetylene black and channel black, and usable are, for example, Raven 7000, Raven 5750, Raven 5250, Raven 5000, Raven 3500, Raven 2000, Raven 1500, Raven 1250, Raven 1200, Raven 1190 ULTRA-II, Raven 1170, Raven 1255 (available from Colombian Carbon), Black Pearls L, Regal 400R, Regal 330R, Regal 660R, Mogul L, Monarch 700, Monarch 800, Monarch 880, Monarch 900, Monarch 1000, Monarch 1100, Monarch 1300, Monarch 1400, Valcan XC-72R (available from Cabot), Color Black FW1, Color Black FW2, Color Black FW2V, Color Black FW18, Color Black FW200, Color Black S150, Color Black S160, Color Black S170, Printex 35, Printex U, Printex V, Printex 140U, Printex 140V, Special Black 6, Special Black 5, Special Black 4A, Special Black 4 (available from Degussa), No. 25, No. 33, No. 40, No. 47, No. 52, No. 900, No. 2300, MCF-88, MA600, MA7, MA8, MA100 (available from Mitsubishi Chemical). Obviously, carbon black is not limited to these and conventionally known carbon black may also be used. In addition, fine particles of magnetic materials such as magnetite and ferrite or titanium black may be used as black pigment.\n\n    \n    \n        Organic Pigment",
        "Specific examples of organic pigment include insoluble azo pigments such as Toluidine Red, Toluidine Maroon, Hansa Yellow, Benzidine Yellow and Pyrazolone Red, soluble azo pigments such as Lithol Red, Helio Bordeaux, Pigment Scarlet and Permanent Red 2B, derivatives from vat dyes such as Alizarin, Indanthrone and Thioindigo Maroon, phthalocyanine pigments such as Phthalocyanine Blue and Phthalocyanine Green, quinacridone pigments such as Quinacridone Red and Quinacridone Magenta, perylene pigments such as Perylene Red and Perylene Scarlet, isoindorinone pigments such as Isoindorinone Yellow and Isoindorinone Orange, imidazolone pigments such as Benzoimidazolone Yellow, Benzoimidazolone Orange and Benzoimidazolone Red, pyranthrone pigments such as Pyranthrone Red and Pyranthrone Orange, and other pigments such as thioindigo pigments, condensed azo pigments, Flavanthrone Yellow, Acylamide Yellow, Quinophtharone Yellow, Nickel Azo Yellow, Copper Azomethine Yellow, Perinone Orange, Anthrone Orange, Dianthraquinonyl Red and Dioxadine Violet.",
        "In terms of the color index (C.I.) number, the following organic pigments can be listed. Obviously, conventionally known organic pigments other than the followings can be used.\n\n    C.I. pigment yellow: 12, 13, 14, 17, 20, 24, 74, 83, 86, 93, 109, 110, 117, 120, 125, 128, 137, 138, 147, 148, 151, 153, 154, 166, 168\n    C.I. pigment orange: 16, 36, 43, 51, 55, 59, 61\n    C.I. pigment red: 9, 48, 49, 52, 53, 57, 97, 122, 123, 149, 168, 175, 176, 177, 180, 192, 215, 216, 217, 220, 223, 224, 226, 227, 228, 238, 240\n    C.I. pigment violet: 19, 23, 29, 30, 37, 40, 50\n    C.I. pigment blue: 15, 15:1, 15:3, 15:4, 15:6, 22, 60, 64\n    C.I. pigment green: 7, 36\n    C.I. pigment brown: 23, 25, 26\n    \n        Dispersant",
        "When the above-mentioned carbon black and organic pigment are used, a dispersant may be used together. As such dispersant, one which can achieve stable dispersion of the above-mentioned pigment into an aqueous medium by the action of an anionic group is preferably used. Specific examples of the dispersant include a styrene-acrylic acid copolymer, a styrene-acrylic acid-acrylic acid alkyl ester copolymer, a styrene-maleic acid copolymer, a styrene-maleic acid-acrylic acid alkyl ester copolymer, a styrene-methacrylic acid copolymer, a styrene-methacrylic acid-acrylic acid alkyl ester copolymer, a styrene-maleic acid half-ester copolymer, a vinyl naphthalene-acrylic acid copolymer, a vinyl naphthalene-maleic acid copolymer, a styrene-maleic anhydride-maleic acid half-ester copolymer and a salt thereof. Of these dispersants, those having a weight average molecular weight in the range of 1,000 to 30,000 are preferable, and those having a weight average molecular weight in the range of 3,000 to 15,000 are particularly preferable.\n\n    \n    \n        Self-Dispersing Pigment",
        "As a colorant, a pigment which is dispersible in an aqueous medium without a dispersant because of an ionic group (anionic group) bonded to the surface, so-called a self-dispersing pigment, may also be used. One example of such pigments is self-dispersing carbon black. Self-dispersing carbon black is, for example, anionic carbon black having anionic groups bonded to its surface.\n\n    \n    \n        Anionic Carbon Black",
        "Examples of anionic carbon black are those having at least one anionic group selected from the group consisting of —COOM, —SO3M, —PO3HM and —PO3M2 bonded to its surface. In the formulas, M represents a hydrogen atom, alkali metal, ammonium or organic ammonium. Of these, in particular, anionically charged carbon black having —COOM or —SO3M bonded to its surface is excellent in dispersibility in the ink, and therefore can be especially suitably used in the present invention.",
        "Of those represented by “M” in the above hydrophilic groups, specific examples of alkali metals include Li, Na, K, Rb and Cs. In addition, specific examples of organic ammonium include methyl ammonium, dimethyl ammonium, trimethyl ammonium, ethyl ammonium, diethyl ammonium, triethyl ammonium, methanol ammonium, dimethanol ammonium and trimethanol ammonium.",
        "The ink of the present invention containing self-dispersing carbon black in which M is ammonium or organic ammonium can further improve the water resistance of recorded images, and the ink is especially suitable in this respect. This seems to be because when the ink is applied on a recording medium, ammonium is decomposed and ammonia is evaporated. Self-dispersing carbon black in which M is ammonium is obtained, for example, by a method of replacing alkaline metal M of self-dispersing carbon black with ammonium by an ion exchange method, or by a method in which an acid is added to convert M into an H type, and then ammonium hydroxide is added to convert M into ammonium.",
        "One example of the methods of producing anionic carbon black is a method in which carbon black is subjected to oxidation treatment with sodium hypochlorite. According to this method, a —COONa group can be chemically bonded to the surface of carbon black.",
        "The above-described hydrophilic groups may be bonded directly to the surface of carbon black. Alternatively, the hydrophilic group may be bonded indirectly to the surface of carbon black with allowing another atomic group to be present between the surface of carbon black and the hydrophilic group. Here, specific examples of other atomic groups include a linear or branched alkylene group having 1 to 12 carbon atoms, a substituted or unsubstituted phenylene group and a substituted or unsubstituted naphthylene group. Examples of substituent of the phenylene group and the naphthylene group include a linear or branched alkyl group having 1 to 6 carbon atoms. In addition, specific examples of combination of other atomic groups and the hydrophilic group include —C2H4COOM, —Ph—SO3M and —Ph—COOM (Ph represents a phenylene group).",
        "In the present invention, two or more of the above-mentioned examples of self-dispersing carbon black may be accordingly selected and used as a coloring material of the ink. The amount added of self-dispersing carbon black in the ink is preferably 0.1 mass % or more to 15 mass % or less, particularly preferably 1 mass % or more to 10 mass % or less based on the total amount of the ink. By setting the amount of self-dispersing carbon black to this range, the dispersion state of self-dispersing carbon black can be maintained well in the ink. Furthermore, for adjusting the color tone of the ink, a dye may be added as a coloring material in addition to self-dispersing carbon black.\n\n    \n    \n        Colored fine particles/micro-capsulated pigments",
        "In addition to the coloring materials described above, pigments micro-capsulated with polymer or colored fine particles obtained by coating resin particles by a coloring material may be used. Although microcapsules themselves have dispersibility in an aqueous medium, a dispersant as described above may also be contained in the ink in order to improve dispersion stability. In addition, when colored fine particles are used as a coloring material, the above-mentioned anionic dispersant is preferably used.",
        "(Aqueous Medium)",
        "In the present invention, water or a mixed solvent of water and a water-soluble organic solvent may be accordingly used within the limit that the effect of the addition can be ensured and the objects and effects of the present invention are not damaged. Specific examples of the water-soluble organic solvent include alkyl alcohols having 1 to 4 carbon atoms such as methyl alcohol, ethyl alcohol, n-propyl alcohol, isopropyl alcohol, n-butyl alcohol, sec-butyl alcohol and tert-butyl alcohol; amides such as dimethylformamide and dimethylacetamide; ketones or ketoalcohols such as acetone and diacetone alcohol; ethers such as tetrahydrofuran and dioxane; polyalkylene glycols; alkylene glycols of which alkylene group has 2 to 6 carbon atoms such as ethylene glycol, propylene glycol, butylene glycol, triethylene glycol, thiodiglycol, hexylene glycol and diethylene glycol; glycerol; lower alkyl ethers of polyhydric alcohols such as ethylene glycol monomethyl (or ethyl) ether, diethylene glycol methyl (or ethyl) ether and triethylene glycol monomethyl (or ethyl) ether; N-methyl-2-pyrrolidone, 2-pyrrolidone and 1,3-dimethyl-2-imidazolidinone. The water-soluble organic solvent listed above can be used alone or in the form of a mixture. Further, deionized water (ion-exchanged water) is preferably used as water.",
        "(Other Components)",
        "In addition to the above-mentioned components, a humectant may be added to the ink jet ink of the present invention according to need. Additionally, for desired property values, a viscosity modifier, a pH adjustor, a surfactant, a defoaming agent, a preservative, an anti-mold agent and an antioxidant may be added within the limit that the effect of the addition can be ensured and the objects and effects of the present invention are not damaged.",
        "(Properties)",
        "Suitable ranges of properties of the ink jet ink of the present invention are, at about 25° C., a pH of 3 to 12, preferably 7 to 10, a surface tension of 10 to 60 dyn/cm, preferably 10 to 40 dyn/cm, and a viscosity of 1 to 30 cps, preferably 1 to 5 cps.",
        "[Ink Jet Recording Apparatus]",
        "By using the ink jet ink of the present invention described above, curling phenomenon can be decreased or prevented and recording properties such as excellent ejection stability can be obtained when ink jet recording is conducted on a recording medium. The ink jet recording apparatus of the present invention comprises a recording unit provided with an ink container containing the above-mentioned ink and a head part for ejecting the ink, and an ink cartridge provided with the ink container containing the ink.",
        "A recording apparatus suitable for conducting recording using the ink jet ink of the present invention is an apparatus which exerts thermal or mechanical energy corresponding to a recording signal to the ink within the recording head which has an ink container containing the ink, which energy generates ink droplets.",
        "FIG. 3 shows an example of the ink jet recording apparatus to which the above head is attached. In FIG. 3, reference numeral 61 denotes a blade which is a wiping member, and one end of the blade is supported and fixed by a blade supporting member to form a cantilever end. The blade 61 is placed at a position adjacent to the region where the recording head conducts recording, and in the example shown in FIG. 3, the blade 61 is held in such a manner that it protrudes into the path through which the recording head moves. Reference numeral 62 denotes a cap which is placed at a home position adjacent to the blade 61. The cap has a configuration such that it moves in the direction perpendicular to the moving direction of the recording head to cap the head when brought into contact with the ejection face. Reference numeral 63 in FIG. 3 denotes an ink-absorber provided adjacent to the blade 61, which is held in such a manner that it protrudes into the moving path of the recording head as the blade 61 does.",
        "The above-mentioned blade 61, cap 62 and absorber 63 constitute an ejection recovery unit 64, and the blade 61 and the absorber 63 serve to remove moisture and dust on the ink ejection port face. Reference numeral 65 denotes a recording head which has means for generating ejecting energy and conducts recording by ejecting ink on a recording medium faced to the ejection port face having an ejection port. Reference numeral 66 denotes a carriage on which the recording head 65 is mounted to be carried. The carriage 66 is engaged with a guide shaft 67 in a slidable manner, and part of the carriage 66 is connected to a belt 69 driven by a motor 68. Thus the carriage 66 can move along the guide shaft 67, and the recording head 65 can move within the recording region and the region adjacent thereto.",
        "Reference numeral 51 denotes a paper feeding part into which a recording medium is inserted and reference numeral 52 denotes a paper-feeding roller driven by a motor not shown in the figure. With such an arrangement, a recording medium is fed to the position facing the ink ejection port face of the recording head and as recording proceeds, the recording medium is delivered through a paper output unit provided with a paper output roller 53.",
        "In the above arrangement, when the recording head 65 returns to its home position upon completion of recording, the cap 62 of the ejection recovery unit 64 recedes from the moving path of the recording head 65, but the blade 61 protrudes into the moving path. As a result, the ejection port face of the recording head 65 is wiped. When the cap 62 caps the recording head 65 upon contact with the ejection port face of the head, the cap 62 moves so as to protrude into the moving path of the recording head.",
        "When the recording head 65 is moved from its home position to the position at which recording is started, the cap 62 and the blade 61 are at the same positions as the wiping position described above. As a result, the ejection port face of the recording head 65 is also wiped at the time of this movement. The above movement of the recording head to its home position is made not only when the recording is completed or ejection is recovered, but also when the recording head moves within the recording region for recording. The recording head moves to the home position adjacent to the recording region within a pre-determined distance and with this movement, the head is wiped as described above.",
        "FIG. 4 is a cross-sectional view illustrating an example of an ink cartridge 45 containing ink which is fed to a head via an ink supplying member such as a tube. In the figure, reference numeral 40 denotes an ink container containing ink to be supplied, for example, an ink bag, and a rubber stopper 42 is put on the tip. By inserting a needle (not shown in the figure) into the stopper 42, ink in the ink bag 40 can be fed to the head. Reference numeral 44 denotes an ink absorber for receiving waste ink.",
        "The ink jet recording apparatus used in the present invention is not limited to those in which the head and the ink cartridge are separated as described above, but those in which they are integrally formed as shown in FIG. 5 can also be suitably used. In FIG. 5, reference numeral 70 denotes a recording unit which contains an ink container containing ink such as an ink absorber, and it is arranged so that ink contained in the ink absorber is ejected in the form of droplets through a head part 71 having a plurality of orifices. Reference numeral 72 denotes an air-communicating port for communicating the inside of the recording unit to air. The recording unit 70 is used in place of the recording head 65 shown in FIG. 3 and detachable from the carriage 66.",
        "FIG. 6 shows an example of an ink jet cartridge that can be attached to the above-mentioned ink jet recording apparatus. The cartridge 1012 in this example is of serial-type and an ink jet recording head 100 and a liquid tank 1001 for containing liquid such as ink constitute the main part. The ink jet recording head 100 has many ejection holes 832 for ejecting liquid, and liquid such as ink is introduced to a common liquid chamber of the liquid ejection head 100 from the liquid tank 1001 via a liquid supply channel which is not shown in the figure. The cartridge 1012 shown in FIG. 6 is designed so that the ink jet recording head 100 and the liquid tank 1001 are integrally formed to allow liquid to be supplied to the liquid tank 1001 according to need, but it is also possible to adopt a structure in which a liquid tank 1001 is interchangeably connected to the liquid ejection head 100.",
        "Hereinafter, detailed explanation will be made by means of Examples and Comparative Examples, but the present invention is not limited to the following Examples as long as there is no departure from the subject of the present invention. In the following description, “part(s)” and “%” are based on mass unless otherwise noted.",
        "(Preparation of Ink)",
        "Components were mixed according to the following Table 1, sufficiently stirred, and the mixture was then filtered under pressure through a membrane filter having a pore size of 0.2 μm to prepare inks 1 to 10, comparative inks 1 to 4 and reference ink 1. The reference ink 1 contains only a water-soluble organic compound 1. Table 2 shows the data of X and Y, and X+Y and Y/X.",
        "TABLE 1\n\n\n\n\n\n\n\n\n\nDifference\n\n\n\n\n\n\n\n\n\n\n\n\nbetween water\nMolecular\n\n\n\n\nretention\nweight\nInk\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nabilities\nMw\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n\n\n\n\n\nCompound 1\nPolyethylene glycol 200\n36.0%\n200.0\n5.0\n7.0\n6.0\n7.0\n7.0\n10.0\n10.0\n10.0\n7.0\n7.0\n\n\n\nTrimethylolpropane\n18.0%\n134.2\n5.0\n10.0\n7.0\n10.0\n8.0\n\n5.0\n\n8.0\n8.0\n\n\n\nN,N′-bis-(2-\n27.4%\n148.2\n\n\n\n\n\n5.0\n\n\n\nhydroxyethyl)-urea\n\n\n\nBishydroxyethyl sulfone\n26.0%\n154.2\n\n\n\n\n\n\n\n5.0\n\n\nCompound 2\nGlycerol\n49.2%\n92.1\n5.0\n15.0\n2.0\n13.0\n13.0\n13.0\n13.0\n13.0\n5.0\n10.0\n\n\nColor\nC.I. acid yellow 23\n—\n—\n3.0\n3.0\n3.0\n3.0\n3.0\n3.0\n3.0\n3.0\n3.0\n3.0\n\n\nmaterial\n\n\nAdditive\nAcetylenol EH (*)\n—\n—\n1.0\n1.0\n1.0\n1.0\n1.0\n1.0\n1:0\n1.0\n1.0\n1.0\n\n\nWater\nIon-exchanged water\n—\n—\n81.0\n64.0\n81.0\n66.0\n68.0\n68.0\n68.0\n68.0\n76.0\n71.0\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDifference\n\n\n\n\n\n\n\nbetween water\nMolecular\n\n\nReference\n\n\n\nretention\nweight\n\nComparative ink\nink\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nabilities\nMw\n1\n2\n3\n4\n1\n\n\n\n\n\nCompound 1\nPolyethylene glycol 200\n36.0%\n200.0\n5.0\n4.5\n4.5\n5.0\n10.0\n\n\n\nTrimethylolpropane\n18.0%\n134.2\n5.0\n4.5\n4.5\n5.0\n10.0\n\n\n\nN,N′-bis-(2-\n27.4%\n148.2\n\n\n\nhydroxyethyl)-urea\n\n\n\nBishydroxyethyl sulfone\n26.0%\n154.2\n\n\nCompound 2\nGlycerol\n49.2%\n92.1\n10.0\n5.0\n8.0\n2.0\n\n\nColor\nC.I. acid yellow 23\n—\n—\n3.0\n3.0\n3.0\n3.0\n3.0\n\n\nmaterial\n\n\nAdditive\nAcetylenol EH (*)\n—\n—\n1.0\n1.0\n1.0\n1.0\n1.0\n\n\nWater\nIon-exchanged water\n—\n—\n76.0\n82.0\n79.0\n84.0\n76.0\n\n\n\n\n\n(*) Acetylene glycol-ethylene oxide adduct available from Kawaken Fine Chemicals Co., Ltd.",
        "TABLE 2\n\n\n\n\n\n\n\n\nX\nY\nX + Y\n\nWater\n\n\n\nInk\n[mass %]\n[mass %]\n[mass %]\nY/X\n[mass %]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample\n1\nInk 1\n10.0\n5.0\n15.0\n0.50\n81.0\n\n\n\n2\nInk 2\n17.0\n15.0\n32.0\n0.88\n64.0\n\n\n\n3\nInk 3\n13.0\n2.0\n15.0\n0.15\n81.0\n\n\n\n4\nInk 4\n17.0\n13.0\n30.0\n0.76\n66.0\n\n\n\n5\nInk 5\n15.0\n13.0\n28.0\n0.87\n68.0\n\n\n\n6\nInk 6\n15.0\n13.0\n28.0\n0.87\n68.0\n\n\n\n7\nInk 7\n15.0\n13.0\n28.0\n0.87\n68.0\n\n\n\n8\nInk 8\n15.0\n13.0\n28.0\n0.87\n68.0\n\n\n\n9\nInk 9\n15.0\n5.0\n20.0\n0.33\n76.0\n\n\n\n10\nInk 10\n15.0\n10.0\n25.0\n0.67\n71.0\n\n\nComparative\n1\nComparative ink 1\n10.0\n10.0\n20.0\n1.00\n76.0\n\n\nExample\n2\nComparative ink 2\n9.0\n5.0\n14.0\n0.56\n82.0\n\n\n\n3\nComparative ink 3\n9.0\n8.0\n17.0\n0.89\n79.0\n\n\n\n4\nComparative ink 4\n10.0\n2.0\n12.0\n0.20\n84.0\n\n\nReference\n1\nReference ink 1\n20.0\n0.0\n20.0\n0.00\n76.0\n\n\nExample\n\n\n\n\n\n\n\n\n\n(Evaluation of Curling Phenomenon)",
        "The obtained ink was applied to a recording method using an ink jet recording apparatus having an on-demand multi-recording head which ejects ink by applying thermal energy corresponding to a recording signal to the ink. The ink jet recording apparatus used had a structure shown in FIG. 3, and had an amount of ejection of 2.8 pL per dot, a recording density of 2400×1200 dpi. Referring to the driving condition, an apparatus having a drive frequency of 10 kHz was used and printing was conducted at a printing duty of 100%. For printing, 2-pass printing in which scanning in the printing region is conducted twice was employed. The recording media used were A4 size PPC paper (available from Canon Inc.). The recording conditions are the same in Examples, Comparative Examples and Reference Example.\n\n    \n    \n        Method of Evaluating Curling Phenomenon",
        "The printed matter was left in an environment of a temperature of 24° C. and a humidity of 50% for 1 hour, 1 day, 4 days and 7 days and the extent of curling phenomenon over time was measured. Paper curled in the concave direction of paper was rated as + (positive curling phenomenon) and those curled in the convex direction as − (negative curling phenomenon). The distance from the top of the curled paper to the bottom plane of the paper was measured by a ruler. The criteria for evaluating curling phenomenon are as follow. The evaluation results are shown in Table 3. The criteria for evaluating curling phenomenon are as follow.\n\n    AA: within ±10 mm\n    A: greater than ±10 mm, within ±25 mm\n    B: greater than ±25 mm, within ±40 mm\n    C: side of paper warped inwardly\n    D: side of paper curled up inwardly\n\n(Evaluation of Ejection Stability)",
        "The obtained ink was applied to a recording medium using an ink-jet recording apparatus having an on-demand multi-recording head which ejects ink by applying thermal energy corresponding to a recording signal to the ink. The ink jet recording apparatus used had a structure shown in FIG. 3, and had an amount of ejection of 2.8 pL per dot, a recording density of 2400×1200 dpi. Referring to the driving condition, an apparatus having a drive frequency of 100 kHz was used and printing was conducted at a printing duty of 100%. For printing, 2-pass printing in which scanning in the printing region is conducted twice was employed. The recording media used were A4 size PPC paper (available from Canon Inc.). These recording conditions are the same throughout Examples, Comparative Examples and Reference Example.\n\n    \n    \n        Method of Evaluating Ejection Stability 1 (Ejection Stability after Leaving Head)",
        "For evaluating ejection stability of ink, occurrence of problems such as nozzle clogging was observed by confirming whether unstable printing or blurring of images occurred when printed after the above-mentioned ink was set to the head and left for 1 month. The criteria for evaluating ejection stability 1 (ejection stability after leaving head) are as follows. The evaluation results are shown in Table 3.\n\n    A: no blurring\n    B: little blurring observed, but practically no problem\n    C: blurring observed, images have problems\n    D: no ejection sometimes observed\n\n[Method of Evaluating Ejection Stability 2 (Start-Up Characteristic)]",
        "For evaluating ejection stability of ink, occurrence of unstable or blurred printing of initial portions at the beginning of printing was observed in environment 1: normal temperature, normal humidity and environment 2: temperature 15° C., humidity 10%. The criteria for evaluating ejection stability 2 (start-up characteristic) are as follows. The evaluation results are shown in Table 3.\n\n    A: no blurring\n    B: no blurring, images slightly unstable, but practically no problem\n    C: initial portion blurred, images have problems\n    D: initial portion greatly blurred",
        "TABLE 3\n\n\n\n\n\n\n\n\n\nCurling phenomenon\nEjection\nEjection stability 2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInk\n1 hour\n1 day\n4 days\n7 days\nstability 1\nEnvironment 1\nEnvironment 2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample\n1\nInk 1\nA\nA\nB\nC\nB\nB\nD\n\n\n\n2\nInk 2\nAA\nAA\nB\nC\nB\nB\nD\n\n\n\n3\nInk 3\nA\nA\nA\nA\nB\nB\nD\n\n\n\n4\nInk 4\nAA\nAA\nA\nB\nB\nB\nD\n\n\n\n5\nInk 5\nAA\nAA\nA\nB\nB\nB\nD\n\n\n\n6\nInk 6\nAA\nAA\nA\nB\nB\nB\nC\n\n\n\n7\nInk 7\nAA\nAA\nA\nB\nB\nB\nD\n\n\n\n8\nInk 8\nAA\nAA\nA\nB\nB\nB\nC\n\n\n\n9\nInk 9\nA\nA\nA\nA\nB\nB\nC\n\n\n\n10\nInk 10\nAA\nAA\nA\nB\nB\nB\nD\n\n\nComparative\n1\nComparative ink 1\nB\nC\nC\nD\nB\nB\nD\n\n\nExample\n2\nComparative ink 2\nB\nB\nC\nC\nB\nB\nD\n\n\n\n3\nComparative ink 3\nB\nB\nC\nD\nB\nB\nD\n\n\n\n4\nComparative ink 4\nB\nB\nB\nB\nB\nB\nD\n\n\nReference\n1\nReference ink 1\nAA\nAA\nA\nA\nD\nB\nD\n\n\nExample",
        "(Preparation of Ink)",
        "Components were mixed according to the following Table 4, sufficiently stirred, and the mixture was then filtered under pressure through a membrane filter having a pore size of 0.2 μm to prepare inks 11 to 19 and comparative inks 5 and 6. Table 5 shows the data of X1, X2, Y1, and X1+X2, X2+Y1, X1+X2+Y1, Y1/(X1+X2) and (X2+Y1)/X1.",
        "TABLE 4\n\n\n\n\n\n\n\n\n\nDifference\n\n\n\n\nbetween\n\n\n\n\n\n\n\n\n\n\n\nwater\n\nComparative\n\n\n\n\n\n\n\n\n\n\n\n\nretention\nMolecular\nInk\nink\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nabilities\nweight\n11\n12\n13\n14\n15\n16\n17\n18\n19\n5\n6\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCompound\nPolyethylene glycol\n36.0%\n200.0\n\n\n7.0\n6.0\n6.0\n3.0\n3.0\n3.0\n5.0\n2.5\n6.0\n\n\n1-1\n200\n\n\n\nTrimethylolpropane\n18.0%\n134.2\n\n\n7.0\n6.0\n6.0\n7.0\n3.0\n3.0\n3.0\n2.5\n6.0\n\n\n\n1,2,6-hexanetriol\n26.3%\n134.2\n\n\n3.0\n\n\n\nPolyethylene glycol\n32.2%\n300.0\n4.5\n4.5\n\n\n\n300\n\n\n\nN,N′-bis-(2-hydroxyethyl)-urea\n27.4%\n148.2\n\n\n\n\n\n\n4.0\n\n\n\nBishydroxyethyl\n26.0%\n154.2\n\n\n\n\n\n\n\n4.0\n\n\n\nsulfone\n\n\nCompound\n1,5-pentanediol\n19.2%\n104.2\n\n1.0\n1.0\n\n\n1-2\n1,6-hexanediol\n 9.6%\n118.2\n5.5\n6.0\n\n5.0\n5.0\n7.0\n7.0\n7.0\n9.0\n30\n\n\nCompound\nEthylene glycol\n60.6%\n62.1\n\n\n\n4.0\n2.0\n\n\n2-1\nGlycerol\n49.2%\n92.1\n5.0\n4.0\n2.0\n5.0\n5.0\n3.0\n3.0\n3.0\n3.0\n10.0\n1.0\n\n\n\nEthylene urea\n52.4%\n86.1\n\n\n\n6.0\n6.0\n\n\n\n5.0\n\n\nColor\nC.I. direct blue 199\n—\n—\n5.0\n5.0\n5.0\n5.0\n5.0\n5.0\n5.0\n5.0\n\n5.0\n5.0\n\n\nmaterial\nC.I. acid yellow 23\n—\n—\n\n\n\n\n\n\n\n\n3.0\n\n\nAdditive\nAcetylenol EH (*)\n—\n—\n1.0\n1.0\n1.0\n1.0\n1.0\n1.0\n1.0\n1.0\n1.0\n1.0\n1.0\n\n\nWater\nIon-exchanged water\n—\n—\n79.0\n78.5\n74.0\n62.0\n64.0\n74.0\n74.0\n74.0\n71.0\n76.0\n81.0\n\n\n\n\n\n(*) Acetylene glycol-ethylene oxide adduct available from Kawaken Fine Chemicals Co., Ltd.",
        "TABLE 5\n\n\n\n\n\n\n\n\nX1\nX2\nX1 + X2\nY1\nX2 + Y1\nX1 + X2 + Y1\nWater\nY1/\n(X2 + Y1)/\n\n\n\nInk\n[mass %]\n[mass %]\n[mass %]\n[mass %]\n[mass %]\n[mass %]\n[mass %]\n(X1 + X2)\nX1\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample\n11\nInk 11\n4.5\n5.5\n10.0\n5.0\n10.5\n15.0\n79.0\n0.50\n2.33\n\n\n\n12\nInk 12\n4.5\n7.0\n11.5\n4.0\n11.0\n15.5\n78.5\n0.35\n2.44\n\n\n\n13\nInk 13\n17.0\n1.0\n18.0\n2.0\n3.0\n20.0\n74.0\n0.11\n0.18\n\n\n\n14\nInk 14\n12.0\n5.0\n17.0\n15.0\n20.0\n32.0\n62.0\n0.88\n1.67\n\n\n\n15\nInk 15\n12.0\n5.0\n17.0\n13.0\n18.0\n30.0\n64.0\n0.76\n1.50\n\n\n\n16\nInk 16\n10.0\n7.0\n17.0\n3.0\n10.0\n20.0\n74.0\n0.18\n1.00\n\n\n\n17\nInk 17\n10.0\n7.0\n17.0\n3.0\n10.0\n20.0\n74.0\n0.18\n1.00\n\n\n\n18\nInk 18\n10.0\n7.0\n17.0\n3.0\n10.0\n20.0\n74.0\n0.18\n1.00\n\n\n\n19\nInk 19\n8.0\n9.0\n17.0\n8.0\n17.0\n25.0\n71.0\n0.47\n2.13\n\n\nComparative\n5\nComparative\n5.0\n3.0\n8.0\n10.0\n13.0\n18.0\n76.0\n1.25\n2.60\n\n\nExample\n\nink 5\n\n\n\n6\nComparative\n12.0\n0.0\n12.0\n1.0\n1.0\n13.0\n81.0\n0.08\n0.08\n\n\n\n\nink 6\n\n\n\n\n\n\n\n\n\n(Evaluation of Curling Phenomenon)",
        "The method of evaluating curling phenomenon is as described above. The evaluation results are shown in Table 6.",
        "(Evaluation of Ejection Stability)",
        "The method of evaluating ejection stability 1 (ejection stability after leaving head) and the method of evaluating ejection stability 2 (start-up characteristic) are as described above. The evaluation results are shown in Table 6.",
        "TABLE 6\n\n\n\n\n\n\n\n\n\nCurling phenomenon\nEjection\nEjection stability 2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInk\n1 hour\n1 day\n4 days\n7 days\nstability 1\nEnvironment 1\nEnvironment 2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample\n11\nInk 11\nAA\nA\nB\nC\nA\nA\nB\n\n\n\n12\nInk 12\nAA\nA\nB\nC\nA\nA\nB\n\n\n\n13\nink 13\nAA\nA\nA\nA\nB\nB\nC\n\n\n\n14\nInk 14\nAA\nAA\nA\nC\nA\nB\nC\n\n\n\n15\nInk 15\nAA\nAA\nA\nB\nA\nA\nB\n\n\n\n16\nInk 16\nAA\nA\nA\nA\nB\nA\nB\n\n\n\n17\nInk 17\nAA\nA\nA\nA\nA\nA\nA\n\n\n\n18\nInk 18\nAA\nA\nA\nA\nA\nA\nA\n\n\n\n19\nInk 19\nAA\nAA\nA\nB\nA\nA\nB\n\n\nComparative\n5\nComparative ink 5\nB\nB\nC\nD\nA\nB\nC\n\n\nExample\n6\nComparative ink 6\nB\nB\nB\nB\nC\nB\nD",
        "This application claims priority from Japanese Patent Application No. 2004-075391 filed on Mar. 16, 2004, Japanese Patent Application No. 2004-075392 filed on Mar. 16, 2004, Japanese Patent Application No. 2004-289652 filed on Oct. 1, 2004 and Japanese Patent Application No. 2005-072040 filed on Mar. 14, 2005, which are hereby incorporated by reference herein."
    ],
    "citations": [
        "4804411",
        "4864324",
        "5059246",
        "5074914",
        "5081470",
        "5110356",
        "5118351",
        "5123960",
        "5124201",
        "5135570",
        "5135571",
        "5137778",
        "5139573",
        "5141558",
        "5151128",
        "5171626",
        "5190581",
        "5216437",
        "5220347",
        "5221333",
        "5231417",
        "5246774",
        "5248991",
        "5250121",
        "5254157",
        "5258066",
        "5277962",
        "5296022",
        "5329305",
        "5356464",
        "5358558",
        "5362558",
        "5415686",
        "5427611",
        "5439515",
        "5500023",
        "5515093",
        "5526031",
        "5540764",
        "5549740",
        "5580373",
        "5593757",
        "5606356",
        "5614007",
        "5618338",
        "5621447",
        "5623294",
        "5624484",
        "5640187",
        "5651814",
        "5656071",
        "5658376",
        "5680165",
        "5696182",
        "5698478",
        "5700314",
        "5734403",
        "5764261",
        "5781216",
        "5782967",
        "5792249",
        "5835116",
        "5849815",
        "5902387",
        "5922625",
        "5985975",
        "6027210",
        "6036307",
        "6084006",
        "6114020",
        "6139939",
        "6162510",
        "6203604",
        "6214963",
        "6238045",
        "6248482",
        "6322209",
        "6341855",
        "6342096",
        "6367921",
        "6391440",
        "6391947",
        "6394597",
        "6398355",
        "6399674",
        "6412936",
        "6426766",
        "6460987",
        "6460989",
        "6471757",
        "6474803",
        "6517199",
        "6521323",
        "6536890",
        "6540344",
        "6552156",
        "6619791",
        "6659601",
        "6670000",
        "6695443",
        "6719420",
        "6723137",
        "6729718",
        "6730375",
        "6746114",
        "6780901",
        "6783299",
        "6790878",
        "6794427",
        "6811839",
        "6821328",
        "6860593",
        "6874881",
        "6899753",
        "6966944",
        "7029109",
        "7055943",
        "2003/0089272",
        "2003/0109600",
        "2003/0199611",
        "2005/0284332",
        "2005/0288384",
        "2006/0000386",
        "2006/0004116",
        "2006/0007280",
        "2006/0011097",
        "2006/0065157",
        "2006/0137570",
        "2006/0194056",
        "2006/0194897",
        "4-332775",
        "6-157955",
        "6-240189",
        "9-165539",
        "9-176538",
        "10-130550",
        "2000-198267",
        "2003-96343",
        "2003-160751",
        "2004-209762",
        "2004-210906",
        "WO 03/076532"
    ],
    "us_classification": "106 3127",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "09",
            "subclass": "D",
            "main_group": "11",
            "subgroup": "02"
        }
    ]
}