{
    "title": "Process for the production of phenylalkanes that use a zeolitic catalyst that is based on silica-alumina",
    "abstract": "An alkylating process for the production of at least one of 2-, 3-, 4-, 5-, and 6-phenylalkanes by alkylation of an aromatic compound with a feedstock containing at least one olefin comprising at least 9 carbon atoms per molecule, in the presence of a catalyst comprising at least one substrate based on at least a zeolite and a non-zeolitic silica-alumina matrix with a low content of macropores, whereby said matrix contains an amount of more than 5% by weight and less than or equal to 95% by weight of silica (SiO",
    "inventors": [
        "Euzen",
        "Guillon"
    ],
    "document_number": "07297828",
    "publication_date": "20071120",
    "assignees": [
        "Institut Francais du Petrole"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A catalytic process for the production of at least one compound selected from the group consisting of 2-, 3-, 4-, 5-, and 6-phenylalkanes, said process comprising alkylation of an aromatic compound with a feedstock containing at least one olefin having at least 9 carbon atoms per molecule, wherein the process is conducted in the presence of a catalyst that comprises at least one substrate comprising an intimate mixture of (A) at least one zeolite or a mixture of zeolites and (B) a non-zeolitic silica-alumina matrix, said matrix containing an amount of more than 5% by weight and less than or equal to 95% by weight of silica (SiO",
            "components": [
                {
                    "component": "a mean pore diameter, measured by mercury porosimetry, encompassed between 20 and 140 Å,",
                    "subcomponents": []
                },
                {
                    "component": "a total pore volume, measured by mercury porosimetry, encompassed between 0.1 ml/g and 0.6 ml/g,",
                    "subcomponents": []
                },
                {
                    "component": "a total pore volume, measured by nitrogen porosimetry, encompassed between 0.1 ml/g and 0.6 ml/g,",
                    "subcomponents": []
                },
                {
                    "component": "a BET specific surface area encompassed between 100 and 850 m",
                    "subcomponents": []
                },
                {
                    "component": "a packing density after calcination of more than 0.65 g/cm",
                    "subcomponents": []
                },
                {
                    "component": "a pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å, of less than 0.1 ml/g,",
                    "subcomponents": []
                },
                {
                    "component": "a pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å, of less than 0.1 ml/g,",
                    "subcomponents": []
                },
                {
                    "component": "a pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å, of less than 0.1 ml/g,",
                    "subcomponents": []
                },
                {
                    "component": "a pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å, of less than 0.1 ml/g,",
                    "subcomponents": []
                },
                {
                    "component": "an X-ray diffraction diagram that contains at least the main lines that are characteristic of at least one of the transition aluminas contained in the group of alpha-, rho-, chi-, eta-, gamma-, kappa-, theta- and delta-aluminas,",
                    "subcomponents": []
                },
                {
                    "component": "a pore distribution such that the ratio between volume V2, measured by mercury porosimetry, encompassed between D",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A process according to claim 1 , wherein the aromatic compound is benzene.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A process according to claim 1 , wherein the pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is less than 0.05 ml/g.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A process according to claim 1 , wherein at least one zeolite is selected from the FAU-structural-type zeolites.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A process according to claim 4 , wherein at least one zeolite is selected from the group consisting of Y zeolite and Y zeolites that have undergone a secondary treatment.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A process according to claim 1 , wherein at least one zeolite is selected from the group consisting of mordenite, beta, NU-87 and EU-1.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A process according to claim 1 , wherein the catalyst contains at least one hydro-dehydrogenating element that is selected from the group consisting of the noble elements of group VIII and the elements of group VIB of the periodic table.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A process according to claim 7 , wherein the catalyst comprises at least one noble element of group VIII that is selected from the group consisting of platinum, palladium and ruthenium.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A process according to claim 8 , wherein the catalyst comprises platinum and palladium.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A process according to claim 7 , wherein the content by mass of metals of group VIII or group VIB in metallic form or in oxide form is encompassed between 0.005 and 5% by weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A process according to claim 1 , wherein the catalyst comprises at least one halogen.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A process according to claim 11 , wherein the halogen is chlorine or fluorine.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A process according to claim 12 , wherein the halogen is fluorine.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A process according to claim 11 , wherein the content by mass of the halogen is encompassed between 0.5 and 10% by weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A process according to claim 1 , wherein the catalyst exhibits a bed crushing value of more than 0.5 MPa.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A process according to claim 1 , wherein the catalyst substrate exhibits an acidity that is measured by infrared tracking of the thermodesorption of the pyridine such that the B/L ratio (number of Bronsted sites/number of Lewis sites) of the silica-alumina matrix is encompassed between 0.05 and 1.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. A process according to claim 1 , wherein the non-zeolitic silica-alumina matrix comprises a single silico-aluminum zone that has an Si/Al ratio that is equal to the overall Si/Al ratio that is determined by X-ray fluorescence and is less than 2.3.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. A process according to claim 1 , wherein the non-zeolitic silica-alumina matrix comprises at least two silico-aluminum zones that have Si/Al ratios that are less than or more than the overall Si/Al ratio determined by X-ray fluorescence.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. A process according to claim 1 , wherein the reactions of alkylation and transalkylation take place in a combined reaction zone.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. A process according to claim 19 comprising the following successive stages in the combined alkylation and transalkylation zone:",
            "components": [
                {
                    "component": "Reaction of the aromatic compound with a feedstock that contains at least one olefin (olefinic feedstock) upon contact with the catalyst that is based on silica-alumina (alkylation reaction),",
                    "subcomponents": []
                },
                {
                    "component": "Fractionation of the resultant product so as to collect separately a first fraction containing unconverted aromatic compound, a second fraction containing at least one olefin that is initially present in the feedstock (unconverted), a third fraction that contains 2-, 3-, 4-, 5- and 6-phenylalkanes, and a fourth fraction that contains at least one poly-alkylaromatic compound (or poly-alkylaromatic fraction), whereby the latter is then at least partially recycled to said reaction zone where it reacts with the aromatic compound upon contact with the catalyst, so as to be at least partially transalkylated (transalkylation reaction), and",
                    "subcomponents": []
                },
                {
                    "component": "Collection of a mixture of 2-, 3-, 4-, 5- and 6-phenylalkanes.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. A process according to claim 20 , wherein the first fraction that contains the unconverted aromatic compound is at least partially recycled to the joint reaction zone.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. A process according to claim 20 , wherein the second fraction that contains at least one unconverted olefin is at least partially recycled in the reaction zone.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. A process according to claim 20 , wherein heavy alkylaromatic compounds are removed from the recycled portion of the fourth fraction by fractionation.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. A process according to claim 1 , wherein the alkylation reaction is carried out in the presence of hydrogen.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. A process according to claim 1 , wherein the feedstock that contains at least one olefin for comprises the most part of paraffins.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. A process according to claim 5 , where the ziolite is USY, VUSY, SDUSY, HMUSY or DAY.",
            "components": []
        }
    ],
    "description": [
        "Application PCT/FR04/03.270 relates to the substrates and/or catalysts described in this application.",
        "This invention relates to the field of the processes of production of phenylalkanes by alkylation of aromatic compounds by means of at least one olefin that comprises at least 9 carbon atoms per molecule. More particularly, for example, a hydrocarbon fraction that comprises at least one olefin that has 9 to 16 carbon atoms or 10 to 14 carbon atoms per molecule or, for example, a hydrocarbon fraction that comprises at least one olefin that has 14 to 20 carbon atoms, in the presence of at least one catalyst that is supported on a substrate that comprises a particular silica-alumina matrix and at least one zeolite, will be used.",
        "The phenylalkanes that are obtained according to the invention constitute compounds for the formulation, after sulfonation, of biodegradable detergents.",
        "Currently, the bases for biodegradable detergents rely extensively on linear alkylbenzenes. The production of this type of compound is growing steadily. One of the primary properties sought for these compounds, after the sulfonation stage, is, in addition to their detergent power, their biodegradability. To ensure maximum biodegradability, the alkyl group should be linear and long, and the distance between the sulfonate group and the terminal carbon of the linear chain should be as great as possible. The most advantageous agents for alkylation of benzene consist of C9-C16 linear olefins, and preferably C10-C14 linear olefins.",
        "The linear alkylbenzenes that are obtained by alkylation of aromatic compounds, preferably by alkylation of benzene by means of (a) linear olefin(s), are prepared today by two major processes. During the stage for alkylation of benzene or aromatic compounds, the first process uses hydrofluoric acid as an acid catalyst. The second uses a Friedel-Craft-type catalyst, in particular with an AlCl3 base. These two processes lead to the formation of 2-, 3-, 4-, 5- and 6-phenylalkanes. The primary drawback of these processes is linked to environmental constraints. The first process that is based on the use of hydrofluoric acid poses severe safety problems, on the one hand, and waste treatment problems, on the other hand. The second process poses the standard problem of processes that use Friedel-Craft catalysts, in this case the problem of wastes. Actually, for this type of process, it is necessary to neutralize the effluents by a basic solution at the outlet of the reactor. Added to these various drawbacks for the two processes are the difficulties that are linked to the separation of the catalyst from the products of the reaction.",
        "These various constraints explain the advantage of developing a process for alkylation of aromatic compounds by olefins, in particular the linear olefins, in the presence of a solid catalyst.",
        "The prior art notes the use of various types of catalysts such as crystallized catalysts that have geometric selectivity properties such as the zeolites (U.S. Pat. No. 4,301,317), clays, amorphous catalysts such as the silica-aluminas or the catalysts that are based on supported heteropolyanions.",
        "U.S. Pat. No. 5,344,997, U.S. Pat. No. 5,245,094 and U.S. Pat. No. 5,302,732 describe the use of amorphous silica-aluminas, with or without the presence of fluorine and/or with very low sodium contents with SiO2—Al2O3 compositions in the range of 1:1 to 9:1, and preferably in the range of 65:35 to 85:15 and in particular 75:25. The solids that are disclosed are therefore for the most part silicic. The selectivity of the products of the reaction is described as increasing with the silica content.",
        "We discovered that the use of catalysts that comprise a substrate that is based on at least one zeolite and that is based on a particular non-zeolitic silica-alumina matrix, by alkylation of aromatic compounds by means of olefin(s) as defined above, made it possible to obtain higher catalytic performance levels than those of the catalysts that are described in the prior art. In particular, these new catalysts are at the same time very active, very selective and very resistant to deactivation. Hereinafter, any reference to a silica- or silico- alumina is meant to define a non-zeolitic silica- or silico- alumina.",
        "The invention relates to a process for the production of at least one compound that is selected from among the 2-, 3-, 4-, 5-, and 6-phenylalkanes by alkylation of an aromatic compound, preferably by alkylation of benzene, by means of at least one olefin that contains at least 9 carbon atoms per molecule, in the presence of a catalyst that comprises at least one substrate that is based on at least one zeolite and that is based on a particular silica-alumina, whereby said alkylation reaction is carried out under a pressure of about 0.1 to 10 MPa, a temperature of about 30 to 400° C., an hourly volumetric flow rate of about 0.5 to 200 h−1, and a molar ratio of the aromatic compound to all the olefin(s) contained in the feedstock of about 1:1 to 50:1. The invention relates most particularly to the alkylation of an aromatic compound by means of a linear olefin for the purpose of producing linear phenylalkanes.",
        "Within the framework of this invention, the hydrocarbon feedstock that is used to carry out the alkylation of the benzene core can contain, in addition to at least one olefin as defined above, one or more paraffins, one or more other aromatic compound(s), one or more polyolefinic compound(s) (for example diolefinic compound(s)), one or more mono- and/or poly-unsaturated non-linear olefin(s) and optionally hydrogen. These fractions can also contain one or more alpha-olefin(s) in a very variable amount from the trace state up to very large amounts, and even in the majority for the most part relative to said feedstock. The olefins can be linear or branched olefins. The hydrocarbon feedstock preferably comprises a majority of paraffins.",
        "The process according to this invention makes it possible to produce, preferably simultaneously, at least one compound that is selected from among the 2-, 3-, 4-, 5-, and 6-phenylalkanes. In the case where the feedstock comprises linear olefins, the process according to the invention makes it possible to produce linear phenylalkanes for the most part. In the case where the feedstock comprises branched olefins, the process according to the invention makes it possible to produce branched phenylalkanes for the most part.",
        "The catalyst that is used in this invention comprises at least one silica-alumina that has particular characteristics.",
        "The catalyst that is used in this invention also comprises at least one zeolite. Thus, the substrate of the catalyst comprises an intimate mixture comprising (A) at least one zeolite and (B) a non-zeolitic silica-alumina matrix.",
        "The applicant discovered in particular that, preferably and in a surprising way, the interaction between the zeolite and the silica-alumina creates an effect of synergy with respect to BET surface that makes it possible to obtain very good catalytic properties in terms of alkylation of aromatic compounds.",
        "In addition, this catalyst that is shaped in, for example, the form of balls or extrudates, exhibits good mechanical resistance.",
        "Characterization Techniques",
        "In the following specification of the invention, specific surface area is defined as the B.E.T. specific surface area that is determined by nitrogen adsorption according to the ASTM D 3663-78 standard established from the BRUNAUER-EMMETT-TELLER method that is described in the periodical “The Journal of American Society,” 60, 309, (1938).",
        "In the following specification of the invention, “mercury volume” of the substrates and catalysts is defined as the volume that is measured by mercury porosimeter intrusion according to the ASTM D4284-83 standard at a maximum pressure of 4000 bar, using a surface tension of 484 dyne/cm and a contact angle for the amorphous silica-alumina substrates of 140°. The mean mercury diameter is defined as being a diameter such that all the pores of a size smaller than this diameter constitute 50% of the pore volume (VHg) in an interval encompassed between 36 Å and 1000 Å. One of the reasons for which it is preferable to use the substrate as a base to define the pore distribution resides in the fact that the contact angle of the mercury varies after impregnation of the metals based on the nature and the type of metals. The wetting angle was assumed to be equal to 140° by following the recommendations of the work “Techniques de l'ingénieur, traité, analyse et caractérisation [Engineering Techniques, Treatise, Analysis, and Characterization],” pp. 1050-5, J. Charpin and B. Rasneur.",
        "To obtain better precision, the value of the mercury volume in ml/g provided in the following text corresponds to the value of the total mercury volume in ml/g that is measured in the sample less the value of the mercury volume in ml/g measured in the same sample for a pressure that corresponds to 30 psi (about 2 bar). The mean mercury diameter is also defined as being a diameter such that all the pores of a size less than this diameter constitute 50% of the total mercury pore volume.",
        "So as to better characterize the pore distribution, the following pore distribution criteria in terms of mercury are finally defined: volume V1 corresponds to the volume that is contained in the pores whose diameter is less than the mean diameter minus 30 Å. Volume V2 corresponds to the volume that is contained in the pores with a diameter that is greater than or equal to the mean diameter minus 30 Å and less than the mean diameter plus 30 Å. Volume V3 corresponds to the volume that is contained in the pores with a diameter that is greater than or equal to the mean diameter plus 30 Å. Volume V4 corresponds to the volume that is contained in the pores whose diameter is less than the mean diameter minus 15 Å. Volume V5 corresponds to the volume that is contained in the pores with a diameter that is greater than or equal to the mean diameter minus 15 Å and less than the mean diameter plus 15 Å. Volume V6 corresponds to the volume that is contained in the pores with a diameter that is greater than or equal to the mean diameter plus 15 Å.",
        "The pore distribution that is measured by nitrogen adsorption was determined by the Barrett-Joyner-Halenda (BJH) model. The nitrogen adsorption-desorption isotherm according to the BJH model is described in the periodical “The Journal of American Society,” 73,373, (1951) written by E. P. Barrett, L. G. Joyner and P. P. Halenda. In the following specification of the invention, nitrogen adsorption volume is defined as the volume that is measured for P/PO=0.99, pressure for which it is assumed that nitrogen filled all the pores. The mean nitrogen desorption diameter is defined as being a diameter such that all of the pores that are smaller than this diameter constitute 50% of the pore volume (Vp) measured on the desorption branch of the nitrogen isotherm.",
        "Adsorption surface area is defined as the surface area that is measured on the branch of the adsorption isotherm. Reference will be made to, for example, the article by A. Lecloux “Mémoires Société Royale des Sciences de Liège,” 6ème série [6th Series], Tome I [Volume 1], fasc. 4 [Section 4], pp. 169-209 (1971).",
        "The sodium content was measured by atomic absorption spectrometry.",
        "X diffraction is a technique that can be used to characterize the substrates and catalysts according to the invention. In the following specification, the analysis of x rays is carried out on powder with a Philips PW 1830 diffractometer that operates in reflection and is equipped with a rear monochromator by using CoKalpha radiation (λKα1=1.7890 Å, λKα2=1.793 Å, intensity ratio Kα1/Kα2=0.5). For the X diffraction diagram of the gamma-alumina, reference will be made to the ICDD data base, form 10-0425. In particular, the two most intense peaks are located at a position that corresponds to one d encompassed between 1.39 and 1.40 Å and one d encompassed between 1.97 Å to 2.00 Å. d is called the inter-reticular distance that is derived from the angular position by using Bragg's equation:\n\n(2d(hk1)*sin(θ)=η*λ).",
        "Gamma-alumina is defined in the text below, i.a., as, for example, an alumina contained in the group that consists of cubic gamma-aluminas, pseudo-cubic gamma-aluminas, tetragonal gamma-aluminas, poorly or slightly crystallized gamma-aluminas, large-surface gamma-aluminas, small-surface gamma-aluminas, gamma-aluminas that are obtained from coarse boehmite, gamma-aluminas that are obtained from crystallized boehmite, gamma-aluminas that are obtained from boehmite that is slightly or poorly crystallized, gamma-aluminas that are obtained from a mixture of crystallized boehmite and an amorphous gel, gamma-aluminas that are obtained from an amorphous gel, and gamma-aluminas evolving toward delta. For the positions of diffraction peaks of eta-, delta- and theta-aluminas, it is possible to refer to the article by B. C. Lippens and J. J. Steggerda in “Physical and Chemical Aspects of Adsorbents and Catalysts,” E. G. Linsen (Ed.), Academic Press, London. 1970, pp. 171-211.",
        "For the substrates and catalysts according to the invention, the X diffraction diagram demonstrates a wide peak that is characteristic of the presence of amorphous silica. Furthermore, in the entire text that follows, the alumina compound can contain an amorphous fraction that is difficult to detect by the DRX techniques. It will therefore be understood below that the alumina compounds that are used or described in the text can contain an amorphous or poorly crystallized fraction.",
        "A method of characterization of the substrates and catalysts according to the invention that can be used is transmission electronic microscopy (TEM). For this purpose, an electronic microscope (such as Jeol 2010 or Philips Tecnai 20F, optionally with scanning) that is equipped with an energy dispersion spectrometer (EDS) for x-ray analysis (for example a Tracor or an Edax) is used. The EDS detector should make possible the detection of light elements. The combination of these two tools, TEM and EDS, makes it possible to combine the imagery and the local chemical analysis with good spatial resolution.",
        "For this type of analysis, the samples are finely ground in the dry state in a mortar; the powder is then included in the resin to produce ultrafine fractions with a thickness of about 70 nm. These fractions are collected on copper grids that are covered by an amorphous carbon film with holes used as a substrate. They are then introduced into the microscope for observation and analysis under secondary vacuum. By imagery, the sample zones are then easily distinguished from the resin zones. A certain number of analyses, 10 at a minimum, preferably between 15 and 30, are then initiated on different zones of the industrial sample. The size of the electronic beam for the analysis of the zones (approximately determining the size of the analyzed zones) is 50 nm of diameter at a maximum, preferably 20 nm, even more preferably 10, 5, 2 or 1 nm of diameter. In the scanned mode, the analyzed zone will be based on the size of the scanned zone and no longer on the size of the beam, which is generally small.",
        "The zeolites that are used for the preparation of catalysts that can be used in the process according to the invention are characterized by several values such as their SiO2/Al2O3 framework molar ratio, their crystalline parameter, their pore distribution, their specific surface area, their sodium ion uptake capacity, or else their water vapor adsorption capacity.",
        "The peak rate and the crystalline fraction are important parameters to consider. The peak rates and the crystalline fractions are determined by x-ray diffraction relative to a reference zeolite, by using a procedure derived from the ASTM D3906-97 method “Determination of Relative X-Ray Diffraction Intensities of Faujasite-Type-Containing Materials.” It will be possible to refer to this method for the general conditions of application of the procedure, and, in particular, for the preparation of samples and references.",
        "A diffractogram consists of the characteristic lines of the crystallized fraction of the sample and of a background, created essentially by the diffusion of the amorphous or microcrystalline fraction of the sample (a weak diffusion signal is related to the equipment, air, sampling device, etc.). The peak rate of a zeolite is the ratio, in a predefined angular zone (typically 8 to 40° 2θ when copper radiation Kα, 1=0.154 nm, is used), of the area of the lines of the zeolite (peaks) to the overall area of the diffractogram (peaks+background). This peaks/(peaks+background) ratio is proportional to the amount of zeolite that is crystallized in the material. To estimate the crystalline fraction of a Y zeolite sample, the peak rate of the sample will be compared to that of a reference considered to be 100% crystallized (NaY, for example). The peak rate of a completely crystallized NaY zeolite is on the order of 0.55 to 0.60.",
        "The semi-quantitative treatment of X spectra collected with the aid of the EDS spectrometer makes it possible to obtain the relative concentration of Al and Si (in % atomic) and the Si/Al ratio for each of the analyzed zones. It is then possible to calculate the Si/Alm mean and the standard deviation σ of this set of measurements. In the non-limiting examples of the following specification of the invention, the 50 nm probe is the probe that is used to characterize the substrates and catalysts according to the invention, unless otherwise indicated.",
        "The packing density (DRT) is measured in the manner that is described in the work “Applied Heterogeneous Catalysis” by J. F. Le Page, J. Cosyns, P. Courty, E. Freund, J.-P. Franck, Y. Jacquin, B. Juguin, C. Marcilly, G. Martino, J. Miguel, R. Montamal, A. Sugier, H. Van Landeghem, Technip, Paris, 1987. A graduated cylinder with acceptable dimensions is filled by successive additions, and between each addition, the catalyst is packed by shaking the cylinder until a constant volume is achieved. This measurement is generally carried out on 1000 cm3 of catalyst packed into a cylinder whose height to diameter ratio is close to 5:1. This measurement can preferably be carried out on automated devices such as Autotap® that is marketed by Quantachrome.",
        "The acidity of the matrix is measured by infra-red (IR) spectrometry. The IR spectra are recorded on a Nicolet interferometer such as Nexus-670 under a resolution of 4 cm−1 with a Happ-Genzel-type apodization. The sample (20 mg) is pressed into the form of a self-supported pellet and placed in an in-situ analysis cell (25° C. to 550° C., furnace offset from the IR beam, secondary vacuum of 10−6 mbar). The diameter of the pellet is 16 mm.",
        "The sample is pretreated in the following way to eliminate the physisorbed water and to dehydroxylate partially the surface of the catalyst in order to have a representative image of the acidity of the catalyst in use:\n\n    \n    \n        Increase in temperature from 25° C. to 300° C. in 3 hours,\n        Stage of 10 hours at 300° C., and\n        Drop in temperature from 300° C. to 25° C. in 3 hours.",
        "The basic probe (pyridine) is then adsorbed with saturating pressure at 25° C. and then thermo-desorbed according to the following stages:\n\n    \n    \n        25° C. for 2 hours under secondary vacuum,\n        100° C. for 1 hour under secondary vacuum,\n        200° C. for 1 hour under secondary vacuum, and\n        300° C. for 1 hour under secondary vacuum.",
        "A spectrum is recorded at 25° C. at the end of the pretreatment and at each desorption stage in transmission mode with an accumulation time of 100 s. The spectra are set to iso-mass (therefore assumed to be at iso-thickness) (20 mg exactly). The number of Lewis sites is proportional to the surface area of the peak whose maximum lies around 1450 cm−1, including any shoulder. The number of Bronsted sites is proportional to the surface area of the peak whose maximum is located toward 1545 cm−1. The ratio of the number of Bronsted sites/number of Lewis sites (B/L) is estimated to be equal to the ratio of the surface areas of two peaks described above. The surface area of peaks at 25° C. is generally used. This B/L ratio is generally calculated starting from the spectrum that is recorded at 25° C. at the end of the pretreatment.",
        "Description of the Process",
        "More specifically, the invention relates to a process for the production of at least one compound that is selected from among the 2, 3-, 4-, 5-, and 6-phenylalkanes by alkylation of an aromatic compound (preferably benzene) by means of at least one olefin that comprises at least 9 carbon atoms per molecule, in the presence of a catalyst that comprises at least one substrate that is based on at least one zeolite and that is based on a silica-alumina matrix, whereby said matrix contains an amount that is more than 5% by weight and less than or equal to 95% by weight of silica (SiO2), whereby said catalyst exhibits the following characteristics:\n\n    \n    \n        A mean pore diameter, measured by mercury porosimetry, encompassed between 20 and 140 Å,\n        A total pore volume, measured by mercury porosimetry, encompassed between 0.1 ml/g and 0.6 ml/g,\n        A total pore volume, measured by nitrogen porosimetry, encompassed between 0.1 ml/g and 0.6 ml/g,\n        A BET specific surface area encompassed between 100 and 850 m2/g,\n        A packing density after calcination of more than 0.65 g/cm3,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å, of less than 0.1 ml/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å, of less than 0.1 ml/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å, of less than 0.1 ml/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å, of less than 0.1 ml/g, preferably less than 0.05 ml/g, and even more preferably less than 0.02 ml/g,\n        An X diffraction diagram that contains at least the main lines that are characteristic of at least one of the transition aluminas contained in the group that consists of the alpha-, rho-, chi-, eta-, gamma-, kappa-, theta- and delta-aluminas,\n        Preferably a pore distribution such that the ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å, to the total mercury volume is more than 0.6, such that volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å, is less than 0.1 ml/g, and such that volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å, is less than 0.2 ml/g,\n\nwhereby said process is conducted at a temperature of between 30 and 400° C., a pressure of between 0.1 and 10 MPa, an hourly volumetric flow rate of 0.05 to 200 h−1, and an aromatic compound/olefin molar ratio of between 1:1 and 50:1.\n\nCharacteristics of the Catalyst",
        "The catalyst that is used in the process according to this invention comprises a substrate that is based on at least one zeolite and that is based on a silica-alumina matrix, and it exhibits the following characteristics:\n\n    \n    \n        A content by mass of silica (SiO2) that is more than 5% by weight and less than or equal to 95% by weight, preferably encompassed between 10 and 80% by weight, more preferably a silica content of more than 20% by weight and less than 50% by weight, and even more preferably more than 20% by weight and less than 40% by weight,\n        A mean pore diameter, measured by mercury porosimetry, encompassed between 20 and 140 Å, preferably between 40 and 120 Å, and even more preferably between 50 and 100 Å,\n        Preferably a ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å, to the total pore volume that is also measured by mercury porosimetry of more than 0.6, more preferably more than 0.7, and even more preferably more than 0.8,\n        Preferably a volume V3 that is encompassed in the pores with diameters of more than Dmean+30 Å, measured by mercury porosimetry, of less than 0.1 ml/g, more preferably less than 0.06 ml/g, and even more preferably less than 0.04 ml/g,\n        Preferably a ratio between volume V5 that is generally encompassed between Dmean−15 Å and Dmean+15 Å, measured by mercury porosimetry, and volume V2 that is encompassed between Dmean−30 Å and Dmean+30 Å, measured by mercury porosimetry, of more than 0.6, more preferably more than 0.7, and even more preferably more than 0.8,\n        Preferably a volume V6 that is encompassed in the pores with diameters of more than Dmean+15 Å, measured by mercury porosimetry, of less than 0.2 ml/g, more preferably less than 0.1 ml/g and even more preferably less than 0.05 ml/g,\n        A total pore volume, measured by mercury porosimetry, encompassed between 0.1 ml/g and 0.6 ml/g, preferably between 0.1 and 0.5 ml/g and even more preferably between 0.1 and 0.4 ml/g,\n        A total pore volume, measured by nitrogen porosimetry, encompassed between 0.1 ml/g and 0.6 ml/g, preferably encompassed between 0.1 and 0.5 ml/g, and even more preferably between 0.1 and 0.4 ml/g,\n        A BET specific surface area encompassed between 100 and 850 m2/g, preferably encompassed between 150 and 650 m2/g, and more preferably between 200 and 600 m2/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å, of less than 0.1 ml/g, preferably less than 0.05 ml/g and even more preferably less than 0.03 ml/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å, of less than 0.1 ml/g, preferably less than 0.05 ml/g, and even more preferably less than 0.025 ml/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å, of less than 0.1 ml/g, preferably less than 0.05 ml/g, and even more preferably less than 0.025 ml/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å, of less than 0.1 ml/g, preferably less than 0.05 ml/g, and more preferably less than 0.02 ml/g,\n        A packing density of more than 0.65 g/cm3, preferably more than 0.80 g/cm3, very preferably more than 0.95 cm3/g, and even more preferably more than 1.05 g/cm3,\n        An X diffraction diagram, characterized in that it contains at least the main lines that are characteristic of at least one of the transition aluminas contained in the group that consists of the rho-, chi-, kappa-, eta-, gamma-, theta- and delta-aluminas, and preferably characterized in that it contains at least the main lines that are characteristic of at least one of the transition aluminas contained in the group that consists of the gamma-, eta-, theta- and delta-alumina, and more preferably characterized in that it contains at least the main lines that are characteristic of the gamma-alumina and eta-alumina, and even more preferably characterized in that it contains the peaks at one d encompassed between 1.39 to 1.40 Å and at one d encompassed between 1.97 Å to 2.00 Å.",
        "The catalyst also contains:\n\n    \n    \n        Optionally at least one hydro-dehydrogenating element that is selected from the group that is formed by the noble elements of group VIII or of group VIB of the periodic table. The catalyst preferably contains at least one noble element of group VIII that is selected from the group that is formed by platinum, palladium and ruthenium. The platinum-palladium combination is even more preferred. The content by mass of noble metals of group VIII or metals of group VIB, in metallic form or in oxide form, is generally encompassed between 0.005 and 5% by weight, preferably between 0.01 and 3% by weight and even more preferably between 0.05 and 1% by weight; and\n        Optionally at least one halogenated element, preferably selected from the group that is formed by chlorine and fluorine. More preferably, the halogen that is introduced into the catalyst is fluorine. The contents by mass of halogen are encompassed between 0.5 and 10%, preferably between 1 and 5%. According to an embodiment of the invention, the zeolite that is included in the substrate, used by itself or in a mixture with other zeolites, is selected from the FAU group, in particular from the group that is formed by the Y zeolite and the Y zeolites that have undergone a secondary treatment such as, in particular: USY, VUSY, SDUSY, HMUSY and DAY.",
        "The Y zeolite that is used in the catalysts according to the invention is at least in part in hydrogen form or acid form (H+) or ammonium form (NH4+) or cationic form, whereby said cation is selected from the group that is formed by the groups IA, IB, IIA, IIB, IIIA, IIIB (including the rare earths), Sn, Pb and Si; it is preferably at least in part in H+ form or it can also be used at least in part in cationic form (as defined above).",
        "According to another embodiment of the invention, the zeolite is a zeolite that is selected from the group that is formed by the mordenite, beta, NU-87, and EU-1 zeolites, preferably the MOR zeolite, used by itself or in a mixture with other zeolites.",
        "In an embodiment of the invention, the catalyst contains a matrix that comprises at least two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or greater than the overall Si/Al ratio that is determined by X fluorescence. Thus, a matrix that has an Si/Al ratio that is equal to 0.5 comprises, for example, two silico-aluminum zones; one of the zones has an Si/Al ratio that is determined by TEM to be less than 0.5, and the other zone has an Si/Al ratio that is determined by TEM to be between 0.5 and 2.5.",
        "In another embodiment of the invention, the catalyst contains a matrix that comprises a single silico-aluminum zone, whereby said zone has an Si/Al ratio that is equal to the overall Si/Al ratio that is determined by X fluorescence and is less than 2.3.",
        "The catalyst that can be used in the process according to the invention preferably exhibits a bed crushing value, determined according to the SHELL method (SMS 1471-74) and characterizing its mechanical resistance, of more than 0.5 MPa.",
        "The acidity of the matrix of the catalyst that can be used in the process according to the invention can advantageously be measured, without this restricting the scope of the invention, by IR tracking of the thermodesorption of the pyridine. Generally, the B/L ratio, as described above, of the matrix is encompassed between 0.05 and 1, preferably between 0.05 and 0.7, and very preferably between 0.06 and 0.5.",
        "Characteristics of the Substrate",
        "The catalyst that can be used in the process according to the invention that is thus obtained is prepared by any technique that is known to one skilled in the art, starting from a substrate:",
        "1. That comprises a silica-alumina matrix whose characteristics are as follows:",
        "The content by mass of silica (SiO2) is more than 5% by weight and less than or equal to 95% by weight, preferably encompassed between 10 and 80% by weight, preferably a silica content of more than 20% by weight and less than 50% by weight, and even more preferably more than 20% by weight and less than 40% by weight,\n        The cationic impurity content is generally less than 0.1% by weight, preferably less than 0.05% by weight, and even more preferably less than 0.025% by weight. Cationic impurity content is defined as the total alkaline content,\n        The anionic impurity content is generally less than 1% by weight, preferably less than 0.5% by weight, and even more preferably less than 0.1% by weight.",
        "The silica-alumina that is used in the process according to the invention is preferably a silica-alumina that is homogeneous on the micrometer scale and in which the content of cationic impurities (for example, Na+) is generally less than 0.1% by weight, preferably less than 0.05% by weight and even more preferably less than 0.025% by weight, and the content of anionic impurities (for example SO42−, Cl−) is generally less than 1% by weight, preferably less than 0.5% by weight, and even more preferably less than 0.1% by weight.",
        "Thus, any process of synthesis of silica-alumina that is known to one skilled in the art that leads to a silica-alumina that is homogeneous on the micrometer scale and in which the cationic impurities (for example Na+) can be brought to less than 0.1%, preferably to a content of less than 0.05% by weight, and even more preferably less than 0.025% by weight, and in which the anionic impurities (for example, SO42−, Cl−) can be brought to less than 1% and more preferably less than 0.05% by weight is suitable for preparing substrates that can be used in the process according to the invention.\n\n    \n    \n        The mean pore diameter, measured by mercury porosimetry, is encompassed between 20 and 140 Å, preferably between 40 and 120 Å, and even more preferably between 50 and 100 Å,\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å, to the total pore volume that is also measured by mercury porosimetry is generally more than 0.6, preferably more than 0.7, and even more preferably more than 0.8,\n        Volume V3 that is encompassed in the pores with diameters of more than Dmean+30 Å, measured by mercury porosimetry, is generally less than 0.1 ml/g, preferably less than 0.06 ml/g, and even more preferably less than 0.04 ml/g,\n        The ratio between volume V5, measured by mercury porosimetry, encompassed between Dmean−15 Å and Dmean+15 Å, to volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å, is generally more than 0.6, preferably more than 0.7, and even more preferably more than 0.8,\n        Volume V6, encompassed in the pores with diameters of more than Dmean+15 Å and measured by mercury porosimetry, is generally less than 0.2 ml/g, preferably less than 0.1 ml/g and even more preferably less than 0.05 ml/g,\n        The total pore volume, measured by mercury porosimetry, is encompassed between 0.1 ml/g and 0.6 ml/g, preferably encompassed between 0.1 and 0.5 ml/g, and even more preferably encompassed between 0.1 and 0.4,\n        The total pore volume, measured by nitrogen adsorption, is encompassed between 0.1 ml/g and 0.6 ml/g, preferably encompassed between 0.1 and 0.5 ml/g, and even more preferably encompassed between 0.1 and 0.4,\n        The BET specific surface area is encompassed between 100 and 850 m2/g, preferably encompassed between 150 and 650 m2/g, and more preferably between 200 and 600 m2/g,\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å, is less than 0.1 ml/g, preferably less than 0.05 ml/g, and even more preferably less than 0.03 ml/g,\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å, is less than 0.1 ml/g, preferably less than 0.05 ml/g, and even more preferably less than 0.025 ml/g,\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å, is less than 0.1 ml/g, preferably less than 0.05 ml/g, and even more preferably less than 0.025 ml/g,\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å, is less than 0.1, preferably less than 0.05 ml/g, and more preferably less than 0.02 ml/g,\n        The X diffraction diagram is characterized in that it contains at least the main lines that are characteristic of at least one of the transition aluminas contained in the group that consists of the alpha-, rho-, chi-, kappa-, eta-, gamma-, theta- and delta-aluminas, and preferably characterized in that it contains at least the main lines that are characteristic of at least one of the transition aluminas contained in the group that consists of the gamma-, eta-, theta- and delta-alumina, and more preferably characterized in that it contains at least the main lines that are characteristic of the gamma-alumina and eta-alumina, and even more preferably characterized in that it contains the peaks at one d encompassed between 1.39 and 1.40 Å and the peaks at one d encompassed between 1.97 Å and 2.00 Å.",
        "2. And that contains at least one zeolite and at least one mixture of zeolites.",
        "According to an embodiment of the invention, the zeolite is selected from the FAU group and/or from the group that is formed by the Y zeolite and the Y zeolites that have undergone a secondary treatment such as, in particular: USY, VUSY, SDUSY, HMUSY and DAY.",
        "The Y zeolite that is used in the catalysts according to the invention is at least in part in hydrogen form or acid form (H+) or ammonium form (NH4+) or cationic form, whereby said cation is selected from the group that is formed by the groups IA, IB, IIA, IIB, IIIA, IIIB (including the rare earths), Sn, Pb and Si; it is preferably at least in part in H+ form or it can also be used at least in part in cationic form (as defined above).",
        "According to another embodiment of the invention, the zeolite is a zeolite that is selected from the group that is formed by the mordenite, beta, NU-87, and EU-1 zeolites, preferably the MOR zeolite, used by itself or in a mixture with other zeolites.",
        "In an embodiment of the invention, the matrix comprises at least two silico-aluminum zones that have Si/Al ratios that are less than or greater than the overall Si/Al ratio that is determined by X fluorescence. A matrix according to this invention that has an overall Si/Al ratio that is equal to 0.5 comprises, for example, two silico-aluminum zones; one of the zones has an Si/Al ratio that is determined by TEM to be less than 0.5, and the other zone has an Si/Al ratio that is determined by TEM to be between 0.5 and 2.5.",
        "In another embodiment of the invention, the matrix comprises a single silico-aluminum zone that has an Si/Al ratio that is equal to the overall Si/Al ratio that is determined by X fluorescence and is less than 2.3.",
        "The packing density of the substrates, after calcination, is more than 0.6 g/cm3, preferably more than 0.72 g/cm3, and very preferably more than 0.8 g/cm3, and even more preferably more than 0.95 g/cm3.",
        "The acidity of the matrix according to the invention can advantageously be measured, without this restricting the scope of the invention, by IR tracking of the thermodesorption of the pyridine. Generally, the B/L ratio, as described above, of the matrix according to the invention is encompassed between 0.05 and 1, preferably between 0.05 and 0.7, and very preferably between 0.06 and 0.5.",
        "Processes of Preparation",
        "The catalysts that can be used in the process according to the invention can be prepared according to all the methods that are well known to one skilled in the art, starting from the substrate that is based on a silico-aluminum matrix and that is based on at least one zeolite.",
        "Matrix",
        "The applicant discovered that the zeolite substrates that are based on silico-aluminum matrices obtained starting from a mixture at any arbitrary stage of an alumina compound that is partially soluble in acid medium with a totally soluble silica compound or with a totally soluble combination of hydrated alumina and silica, shaping followed by a hydrothermal or heat treatment so as to homogenize on the micrometer scale, and even on the nanometer scale, made it possible to obtain a particularly active catalyst in the hydrocracking processes. The applicant defines partially soluble in acid medium as bringing the alumina compound into contact before any addition of totally soluble silica compound or combination with an acid solution, for example, nitric acid or sulfuric acid, causes partial dissolution thereof.",
        "Silica Sources",
        "The silica compounds that are used according to the invention may have been selected from the group that is formed by silicic acid, silicic acid sols, water-soluble alkaline silicates, cationic silicon salts, for example the hydrated sodium metasilicate, Ludox® in ammonia form or in alkaline form, and quaternary ammonium silicates. The silica sol can be prepared according to one of the methods known to one skilled in the art. A decationized orthosilicic acid solution is preferably prepared starting from a water-soluble alkaline silicate by ion exchange on a resin.",
        "Totally Soluble Silica-Alumina Sources",
        "The totally soluble hydrated silica-aluminas that are used according to the invention can be prepared by true coprecipitation under controlled stationary operating conditions (pH, concentration, temperature, average dwell time) by reaction of a basic solution that contains silicon, for example in the form of sodium silicate, optionally of aluminum, for example, in sodium aluminate form with an acid solution that contains at least one aluminum salt, for example aluminum sulfate. At least one carbonate or else CO2 optionally can be added to the reaction medium.",
        "The applicant defines true coprecipitation as a process by which at least one aluminum compound that is totally soluble in basic medium or acid medium as described below, and at least one silicon compound as described below are brought into contact, simultaneously or sequentially, in the presence of at least one precipitating and/or coprecipitating compound so as to obtain a mixed phase that essentially consists of hydrated silica-alumina that is optionally homogenized by intense stirring, shearing, colloidal grinding or else by a combination of these unitary operations. For example, these hydrated silica-aluminas may have been prepared according to the teachings of U.S. Pat. No. 2,908,635, U.S. Pat. No. 3,423,332, U.S. Pat. No. 3,433,747, U.S. Pat. No. 3,451,947, U.S. Pat. No. 3,629,152, and U.S. Pat. No. 3,650,988.",
        "The total dissolution of the silica compound or the combination was evaluated approximately according to the following method. A fixed amount (15 g) of the silica compound or the hydrated combination is introduced into a medium of preset pH. The concentration of solid converted per liter of suspension is preferably 0.2 mol per liter. The pH of the dispersion solution is at least 12, and it can be obtained by use of an alkaline source. It is preferably advantageous to use NaOH. The mixture is then stirred mechanically by a deflocculant-type turbine stirring mechanism for 30 minutes at 800 rpm. Once the stirring is ended, the mixture is centrifuged for 10 minutes at 3000 rpm. The cake is separated from the supernatant liquid. The solution was filtered on a filter with a porosity of 4 and a diameter of 19 cm. Next, the drying and then the calcination of the two fractions are initiated at 1000° C. Then, an equal ratio R is defined by dividing the decanted mass by the mass of the solid in suspension. Totally soluble is defined as a ratio R that is at least more than 0.9.",
        "Alumina Sources",
        "The alumina compounds that are used according to the invention are partially soluble in acid medium. They are selected completely or partially from the group of alumina compounds of general formula Al2O3, nH2O. It is possible in particular to use hydrated alumina compounds such as: hydrargillite, gibbsite, bayerite, boehmite, pseudo-boehmite, and amorphous or essentially amorphous alumina gels. It is also possible to use the dehydrated forms of these compounds that consist of transition aluminas and that comprise at least one of the phases included in the group: rho, chi, eta, gamma, kappa, theta, and delta, which differ essentially by the organization of their crystalline structure. The alpha-alumina that is commonly called corundum can be incorporated in a small proportion in the substrate according to the invention.",
        "This partial dissolution property is a desired property of the invention; it applies to hydrated alumina powders, to sprayed hydrated alumina powders, to dispersions or suspensions of hydrated alumina or to any combination thereof, before any addition of a compound that contains some or all of the silicon.",
        "The partial dissolution of the alumina compound was evaluated approximately according to the following method. A specific amount of the alumina compound in powder or suspension form is introduced into a medium of preset pH. The mixture is then stirred mechanically. Once the stirring is ended, the mixture is left without stirring for 24 hours. Preferably, the Al2O3 solid concentration that is added per liter of suspension is 0.5 mol per liter. The pH of the dispersion solution is 2 and is obtained by use of HNO3, HCl, or HClO4. Preferably, it is advantageous to use HNO3. The distribution of sedimented and dissolved fractions was followed by metering of aluminum by UV absorption. The supernatants were ultrafiltered (polyether sulfone membrane, Millipore NMWL: 30,000) and digested in concentrated acid. The amount of aluminum in the supernatant corresponds to the non-sedimented alumina compound and the dissolved aluminum and the fraction that is ultrafiltered with dissolved aluminum only. The amount of sedimented particles is derived from the theoretical concentration of aluminum in the dispersion (by considering that all of the solid that is introduced is dispersed) and amounts of boehmite actually dispersed and aluminum in solution. The alumina precursors that are used according to this invention are therefore distinguished from those that are used in the case of true co-precipitations that are entirely soluble in acid medium: cationic alumina salts, for example aluminum nitrate. The methods that are part of the invention are distinguished from true co-precipitations because one of the elements, in this case the aluminum compound, is partially soluble.",
        "To use the alumina, any alumina compound of general formula Al2O3, nH2O can be used. Its specific surface area is between 150 and 600 m2/g. It is possible in particular to use hydrated alumina compounds, such as: hydrargillite, gibbsite, bayerite, boehmite, pseudo-boehmite and amorphous or essentially amorphous alumina gels. It is also possible to use the dehydrated forms of these compounds that consist of transition aluminas and that comprise at least one of the phases included in the group: rho, chi, eta, gamma, kappa, theta, delta and alpha, which differ essentially by the organization of their crystalline structure. During heat treatments, these different forms are liable to evolve among themselves, according to a complex relationship that depends on the treatment operating conditions. It is also possible to use the alpha-alumina that is commonly called corundum in measured proportions.",
        "The aluminum hydrate Al2O3, nH2O that is more preferably used is boehmite, pseudo-boehmite and the amorphous or essentially amorphous alumina gels. A mixture of these products under any arbitrary combination can also be used.",
        "Boehmite is generally described as an aluminum monohydrate of formula Al2O3, nH2O that in reality includes a broad continuum of materials with variable degrees of hydration and organization with more or less well-defined boundaries: the most hydrated gelatinous boehmite, with n able to be more than 2, the pseudo-boehmite or the microcrystalline boehmite with n encompassed between 1 and 2, then crystalline boehmite, and finally boehmite that is well crystallized with large crystals with n close to",
        "1. The morphology of aluminum monohydrate can vary within broad limits between these two acicular or prismatic end forms. An entire set of variable forms can be used between these two forms: chain, boats, interlaced platelets.",
        "The preparation and/or the shaping of the aluminum hydrate thus can constitute the first stage of the preparation of these catalysts. Many patents relate to the preparation and/or the shaping of transition-alumina-based substrates that are obtained from aluminum monohydrate: U.S. Pat. No. 3,520,654; U.S. Pat. No. 3,630,670; U.S. Pat. No. 3,864,461; U.S. Pat. No. 4,154,812; U.S. Pat. No. 4,313,923; U.S. Pat. No. 3,243,193; and U.S. Pat. No. 4,371,513.",
        "Relatively pure aluminum hydrates can be used in the form of amorphous powder or crystallized powder or crystallized powder that contains an amorphous portion. The aluminum hydrate can also be introduced in the form of aqueous suspensions or dispersions. The aqueous suspensions or dispersions of aluminum hydrate that are used according to the invention may have the ability to gel or solidify. The aqueous dispersions or suspensions can also be obtained, as is well known to one skilled in the art, by peptization in water or water that is acidified with aluminum hydrates.",
        "The dispersion of aluminum hydrate can be carried out by any process that is known to one skilled in the art: in a “batch” reactor, a continuous mixer, a mixing machine, or a colloidal mill. Such mixing can be also be carried out in a piston flow reactor and, in particular, in a static mixer. The Lightnin reactors can be cited.",
        "In addition, it is also possible to use as an alumina source an alumina that has been subjected in advance to a treatment that can improve its degree of dispersion. By way of example, it will be possible to improve the dispersion of the alumina source by a preliminary homogenization treatment. For homogenization, it is possible to use at least one of the homogenization treatments described in the following text.",
        "The aqueous dispersions or suspensions of alumina that can be used are, in particular, the aqueous suspensions or dispersions of fine or ultra-fine boehmites that consist of particles that have dimensions in the colloidal range.",
        "Fine or ultra-fine boehmites that are used according to this invention may have been obtained in particular according to French Patents FR-B-1 261 182 and FR-B-1 381 282 or in European Patent Application EP-A-15 196.",
        "It is also possible to use the aqueous suspensions or dispersions that are obtained from pseudo-boehmite, amorphous alumina gels, aluminum hydroxide gels or ultra-fine hydrargillite gels.",
        "Aluminum monohydrate can be purchased from among a variety of commercial sources of alumina, such as, in particular, PURAL®, CATAPAL®, DISPERAL®, and DISPAL®, that are marketed by the SASOL Company or else HIQ® that is marketed by ALCOA, or according to the methods that are known to one skilled in the art: it can be prepared by partial dehydration of aluminum trihydrate by conventional methods or it can be prepared by precipitation. When these aluminas are presented in the form of a gel, they are peptized by water or an acidified solution. In the precipitation, the acid source can be selected, for example, from among at least one of the following compounds: aluminum chloride, aluminum sulfate, or aluminum nitrate. The basic aluminum source can be selected from among the basic aluminum salts such as sodium aluminate and potassium aluminate.",
        "As precipitating agents, sodium hydroxide, sodium carbonate, potassium and ammonia can be used. The precipitating agents are selected such that the alumina source according to this invention and these agents are precipitated together.",
        "According to the acidic or basic nature of the aluminum-based starting compound, the aluminum hydrate is precipitated with the aid of a base or an acid that is selected from among, for example, hydrochloric acid, sulfuric acid, sodium or a basic or acidic compound of the aluminum such as those cited above. The two reagents can be aluminum sulfate and sodium aluminate. For an example of a preparation of aluminum alpha-monohydrate that uses aluminum sulfate and sodium aluminate, it is possible to refer in particular to U.S. Pat. No. 4,154,812.",
        "In particular, pseudo-boehmite may have been prepared according to the process that is described in U.S. Pat. No. 3,630,670 by reaction of an alkaline aluminate solution with a mineral acid solution. The pseudo-boehmite may have been prepared in particular according to the process that is described in U.S. Pat. No. 3,630,670 by reaction of an alkaline aluminate solution with a solution of a mineral acid. It may also have been prepared as described in French Patent FR-B-1 357 830.",
        "In particular, the amorphous alumina gels may have been prepared according to the processes that are described in the article “Alcoa Paper No. 19 (1972), pages 9 to 12” and in particular by reaction of acid aluminate or an aluminum salt or by hydrolysis of aluminum alcoholates or by hydrolysis of basic aluminum salts.",
        "The aluminum hydroxide gels can be in particular those that have been prepared according to the processes that are described in U.S. Pat. No. 3,268,295 and U.S. Pat. No. 3,245,919.",
        "In particular, the aluminum hydroxide gels may be those that are prepared according to the processes that are described in Patent Application WO-A-00/01 617 by mixing an aluminum acid source and a base or an aluminum basic source and an acid so as to precipitate an alumina monohydrate, whereby the following stages are:",
        "2. Development",
        "3. Filtration",
        "4. Washing, and",
        "5. Drying, processes that are characterized in that the mixing of stage one is carried out without retromixing.",
        "The ultrafine hydrargillite may have been prepared in particular according to the process that is described in U.S. Pat. No. 1,371,808 by evolving toward a temperature encompassed between ambient temperature and 60° C. for alumina gels in cake form and that contain 0.1 monovalent acid ion relative to the alumina that is counted by Al2O3 molecules.",
        "It is also possible to use ultra-pure aqueous suspensions or dispersions of boehmite or pseudo-boehmite that are prepared according to a process in which the reaction of an alkaline aluminate is carried out with the carbonic anhydride to form an amorphous aluminum hydroxycarbonate precipitate, the precipitate that is obtained by filtration is separated, and then the latter is washed (the process is described in particular in U.S. Pat. No. 3,268,295).",
        "Then,\n\n    \n    \n        a) In a first stage, the precipitate that is washed with amorphous aluminum hydroxycarbonate is mixed with an acid solution, a base or a salt or mixtures thereof; this mixing is carried out by pouring the solution over the hydroxycarbonate, whereby the pH of the thus constituted medium is less than 11,\n        b) In a second stage, the thus constituted reaction medium is heated to a temperature of less than 90° C. for a period of at least 5 minutes, and\n        c) In a third stage, the medium that results from the second stage is heated to a temperature of between 90° C. and 250° C.",
        "The boehmite and pseudo-boehmite dispersions or suspensions that are obtained according to this process exhibit an alkaline content of less than 0.005% that is expressed in the form of a ratio by weight of alkaline metal oxide/Al2O3.",
        "When it is desired to produce very pure catalyst substrates, ultra-pure boehmite or pseudo-boehmite suspensions or dispersions that have been obtained according to the process that was described above, or the aluminum hydroxide gels that were prepared starting from the hydrolysis of aluminum alcoholates according to a process of the type that is described in U.S. Pat. No. 2,892,858 are preferably used.",
        "In summary, the production process that leads to such boehmite-type aluminum hydroxide gels obtained as a by-product in the production of alcohol by hydrolysis of an alcoholate or alkoxide of aluminum (Ziegler synthesis) is described. The Ziegler alcohol synthesis reactions are described in particular in U.S. Pat. No. 8,928,58. According to this process, first triethyl aluminum is prepared starting from aluminum, hydrogen and ethylene, whereby the reaction is carried out in two stages with partial recycling of triethyl aluminum.",
        "Ethylene is added into the polymerization stage, and the product that is obtained is then oxidized into aluminum alcoholate, whereby the alcohols are obtained by hydrolysis.",
        "The aluminum hydroxide gels can also be those that were prepared according to the processes described in U.S. Pat. No. 4,676,928 and U.S. Pat. No. 6,030,599.",
        "The hydrated alumina that is obtained as a by-product of the Ziegler reaction is described in particular in a report of the CONOCO Company dated Jan. 19, 1971.",
        "The size of the alumina particles that constitute the alumina source can vary within broad limits. It is generally between 1 and 100 microns.",
        "Methods for Preparation of the Matrix",
        "The matrix can advantageously be prepared by one of the methods described below.",
        "By way of example, a method of preparation of a silica-alumina that is part of the invention consists in preparing, starting from a water-soluble alkaline silicate, an orthosilicic acid solution (H2SiO4, H2O) that is decationized by ion exchange, then in simultaneously adding it to a cationic aluminum salt in solution, for example, nitrate, and to ammonia under controlled operating conditions; or else adding the orthosilicic acid solution to the cationic aluminum salt in solution and coprecipitating the solution that is obtained by ammonia under controlled operating conditions leading to a homogeneous product. This silica-alumina hydrogel is mixed with an aluminum hydrate powder or suspension. After filtering and washing, drying with shaping then calcination, preferably in air, in a rotary kiln, at a high temperature and for an adequate period to promote interactions between the alumina and the silica, generally at least two hours, a matrix that fulfills the characteristics of the invention is obtained.",
        "Another method for preparation of silica-alumina according to the invention consists in precipitating the alumina hydrate as described above, in filtering it and washing it, then in mixing it with aqueous orthosilicic acid so as to obtain a suspension, which is thoroughly homogenized by vigorous stirring and shearing. An ULTRATURRAX® turbine or else a STARO® turbine can be used, or else a colloidal mill, for example a STARO® colloidal mill. The homogeneous suspension is then dried by spraying as described above, then calcined between 500 and 1200° C. for at least three hours: a silica-alumina matrix that can be used in the process according to the invention is obtained.",
        "Another method that is part of the invention consists in preparing, as described above, a decationized solution of orthosilicic acid then in adding it simultaneously or consecutively to an alumina compound, for example an aluminum hydrate in powder form or in acidified suspension form. To increase the diameter of the pores of the final silica-alumina substrate, at least one basic compound can optionally be added to the reaction medium. After an intense homogenization of the suspension by stirring, optional adjustment by filtration of the content of dry material then optionally rehomogenization, the product is dried with simultaneous or consecutive shaping, then calcined as described above.",
        "Another method that is also part of the invention consists in preparing an aqueous alumina suspension or dispersion, for example an aluminum monohydrate, then in adding it simultaneously or consecutively to a silica compound, for example a sodium silicate. To increase the diameter of the pores of the final silica-alumina matrix, at least one basic compound can optionally be added to the reaction medium. The matrix is obtained by filtration and washing, optionally washing by an ammonia solution to extract the residual sodium by ion exchange, drying with simultaneous or consecutive shaping. After drying with shaping, then calcination as described above, a substrate that fulfills the characteristics of the invention is obtained. The size of the alumina particles used is preferably between 1 and 100 microns to obtain good homogenization of the silica-alumina substrate according to the invention.",
        "To increase the diameter of the mesopores of the silica-alumina matrix, it may be particularly advantageous, as U.S. Pat. No. 4,066,574 teaches it, to prepare an aqueous alumina suspension or dispersion, for example, an aluminum monohydrate, and then to neutralize by a basic solution, for example ammonia, then to add it simultaneously or consecutively to a silica compound, for example a decationized orthosilicic acid solution. After an intensive homogenization of the suspension by intense stirring, optional adjustment by filtration of the dry material content then rehomogenization, the product is dried with simultaneous or consecutive shaping, then calcined as described above. This method is also part of the methods that are used according to the invention.",
        "In the specification of the above-mentioned methods, homogenization is used to describe putting back into solution a product that contains a solid fraction, for example a suspension, a powder, a filtered precipitate, then its dispersion under intense stirring. The homogenization of a dispersion is a process that is well known to one skilled in the art. Said homogenization can be carried out by any process that is known to one skilled in the art: by way of example in a batch reactor, a continuous mixer, or a mixing machine. Such a mixing can be carried out in a piston flow reactor and in particular in a static reactor. The Lightnin reactors can be cited. An ULTRATURRAX® turbine or else a STARO® turbine can be used, or else a colloidal mill, for example a STARO® colloidal mill. The commercial colloidal mills IKA® can also be used.",
        "In all of the above-mentioned methods, it may optionally be desirable to add, during any arbitrary stage of the preparation, a minor proportion of at least one stabilizing element that is selected from the group that is formed by zirconia and titanium. The stabilizing element is preferably added in the form of a soluble salt.",
        "The acidity of the matrix according to the invention can advantageously be measured, without this restricting the scope of the invention, by IR tracking of the thermodesorption of the pyridine. Generally, the B/L ratio of the matrix according to the invention is encompassed between 0.05 and 1, preferably between 0.05 and 0.7, and very preferably between 0.06 and 0.5.",
        "Zeolite",
        "According to an embodiment of the invention, but without thereby restricting the scope of the invention, the Y zeolites with faujasite structure (“Zeolite Molecular Sieves Structure Chemistry and Uses,” D. W. Breck, J. Wiley and Sons, 1973) that can be in hydrogen form or partially exchanged with metallic cations, for example with the aid of cations of alkaline-earth metals and/or rare earths of atomic numbers 57 to 71 inclusive, are used. The Y zeolites that have undergone a secondary treatment are also part of the invention. Secondary treatment is defined as in particular the treatments described in: “Hydrocracking, Science and Technology,” J. Scherzer, A. J. Gruia, 1996 or in R. J. Beyerlein. The Y zeolites, for example, are prepared according to the techniques that are generally used by the dealuminification.",
        "The Y zeolites that are used in general in the catalysts are produced by modification of the Na—Y zeolite that is available commercially. This modification makes it possible to end in zeolites that are said to be stabilized, ultra-stabilized (USY), very ultrastabilized (VUSY) or else dealuminified (SDUSY). This designation is common in the literature, but it does not thereby restrict the characteristics of the zeolites of this invention with such a name. This modification is carried out by the combination of three types of operations that are known to one skilled in the art: hydrothermal treatment, ion exchange and acid attack. The hydrothermal treatment is perfectly defined by the conjonction of operating variables that are temperature, duration, total pressure and partial pressure of water vapor. The purpose of this treatment is to extract aluminum atoms from the silico-aluminum framework of the zeolite. The consequence of this treatment is an increase of the SiO2/Al2O3 framework molar ratio and a reduction of the parameter of the crystalline mesh.",
        "The ion exchange generally takes place by the immersion of the zeolite into an aqueous solution that contains ions that can be fixed to the cationic exchange sites of the zeolite. The sodium cations that are present in the zeolite are thus removed after crystallization.",
        "The acid attack operation consists in bringing the zeolite into contact with an aqueous solution of a mineral acid. The severity of the acid attack is adjusted by the acid concentration, the duration and the temperature. Carried out on a hydrothermally-treated zeolite, this treatment has the effect of eliminating the aluminum radicals that are extracted from the framework and that clog the micropores of the solid.",
        "Furthermore, a particular hydrothermal treatment as described in U.S. Pat. No. 5,601,798 has the effect of increasing the mesopores of the Y, USY, VUSY and SDUSY zeolites, which zeolites are particularly advantageous in combination with the amorphous matrix that is described above.",
        "Various Y zeolites can advantageously be used.",
        "According to a preferred embodiment of the invention, a particularly advantageous H—Y acid zeolite is characterized by various specifications: an overall SiO2/Al2O3 molar ratio of between about 6 and 140 and preferably between about 12 and 100: a sodium content of less than 0.15% by weight determined on the zeolite that is calcined at 1100° C.; a crystalline parameter with elementary mesh encompassed between 24.58×10−10 m and 24.15×10−10 m and preferably between 24.38×10−10 m and 24.20×10−10 m; a CNa capacity for sodium ion uptake, expressed by gram of Na per 100 grams of modified zeolite that is neutralized, then calcined, more than about 0.85; a specific surface area that is determined by the B.E.T. method of more than about 400 m2/g and preferably more than 550 m2/g, a water vapor adsorption capacity at 25° C. for a partial pressure of 2.6 torrs (or 34.6 MPa), more than about 6%, and advantageously, the zeolite exhibits a pore distribution, determined by nitrogen physisorption, comprising between 5 and 45% and preferably between 5 and 40% of the total pore volume of the zeolite that is contained in pores with diameters of between 20×10−10 m and 80×10−10 m, and between 5 and 45% and preferably between 5 and 40% of the total pore volume of the zeolite that is contained in pores with diameters of more than 80×10−10 m and generally less than 1000×10−10 m, whereby the remainder of the pore volume is contained in the pores with diameters of less than 20×10−10 m.",
        "A preferred catalyst that uses this type of zeolite contains a silico-aluminum matrix, at least one Y zeolite that is dealuminified and that has a crystalline paramter encompassed between 2.415 nm and 2.455 nm, preferably between 2.420 and 2.438 nm, an overall SiO2/Al2O3 molar ratio of more than 8, a content of cations of alkaline-earth metals or alkalines and/or cations of rare earths, such that the (n×Mn+)/Al atomic ratio is less than 0.8, preferably less than 0.5 or else 0.1, a specific surface area that is determined by the B.E.T. method of more than 400 m2/g, preferably more than 550 m2/g, and a water adsorption capacity at 25° C. for a P/Po value of 0.2, more than 6% by weight, whereby said catalyst also comprises at least one hydro-dehydrogenating metal, and silicon that is deposited on the catalyst.",
        "In an advantageous embodiment according to the invention, a partially amorphous Y zeolite is used.",
        "Partially amorphous Y zeolite is defined as a solid that exhibits:\n\n    \n    \n        i) A peak rate that is less than 0.40, preferably less than about 0.30, and\n        ii) A crystalline fraction that is expressed relative to a reference Y zeolite in sodic form (Na) that is less than about 60%, preferably less than about 50%, and determined by x-ray diffraction.",
        "The partially amorphous, solid Y zeolites that fall within the composition of the catalyst according to the invention preferably exhibit at least one (or preferably all) of the other characteristics below:\n\n    \n    \n        iii) An overall Si/Al ratio of more than 15, preferably more than 20 and less than 150,\n        iv) An Si/AlIV framework ratio that is more than or equal to the overall Si/Al ratio,\n        v) A pore volume that is at least equal to 0.20 ml/g of solid of which a fraction, encompassed between 8% and 50%, consists of pores that have diameters of at least 5 nm (nanometer), or 50 Å and\n        vi) a specific surface area of 210-800 m2/g, preferably 250-750 m2/g, and advantageously 300-600 m2/g.",
        "The peak rate of a standard USY zeolite is 0.45 to 0.55; its crystalline fraction relative to a perfectly crystallized NaY is 80 to 95%. The peak rate of the solid that is the object of this description is less than 0.4 and preferably less than 0.35. Its crystalline fracion is therefore less than 70%, preferably less than 60%.",
        "The partially amorphous zeolites are prepared according to the techniques that are generally used for dealuminification, starting from Y zeolites that are available commercially, i.e., that generally exhibit high crystallinities (at least 80%). More generally, it will be possible to start from zeolites that have a crystalline fraction of at least 60%, or at least 70%.",
        "The Y zeolites that are generally used in the catalysts are produced by modification of Na—Y zeolites that are available commercially. This modification makes it possible to end in so-called stabilized, ultra-stabilized or else dealuminified zeolites. This modification is carried out by at least one of the dealuminification techniques, and, for example, the hydrothermal treatment, the acid attack. This modification is preferably carried out by combination of three types of operations that are known to one skilled in the art: the hydrothermal treatment, the ion exchange and the acid attack.",
        "Another particularly advantageous zeolite for the catalyst that can be used in the process according to this invention is a globally non-dealuminified and very acidic zeolite.",
        "Globally non-dealuminified zeolite is defined as a Y zeolite (FAU structural type, faujasite) according to the nomenclature developed in “Atlas of Zeolite Structure Types,” W. M. Meier, D. H. Olson and Ch. Baerlocher, 4th Revised Edition, 1996, Elsevier. The crystalline parameter of this zeolite may have reduced by extraction aluminums of the structure or framework during the preparation, but the overall SiO2/Al2O3 ratio has not changed because the aluminums have not been extracted chemically. Such a globally non-dealuminified zeolite therefore has a silicon and aluminum composition that is expressed by the overall SiO2/Al2O3 ratio that is equivalent to the starting non-dealuminified Y zeolite. The values of the parameters (SiO2/Al2O3 ratio and crystalline parameter) are provided below. This globally non-dealuminified Y zeolite can be either in hydrogen form or at least partially exchanged with metallic cations, for example with the aid of alkaline-earth metal cations and/or rare earth metal cations of atomic numbers 57 to 71 inclusive. A zeolite that is lacking in rare earths and alkaline earths, likewise for the catalyst, will be preferred.",
        "The nonglobally dealuminified Y zeolite generally exhibits a crystalline parameter of more than 2.438 nm, an overall SiO2/Al2O3 ratio of less than 8, an SiO2/Al2O3 framework molar ratio of less than 21 and more than the overall SiO2/Al2O3 ratio. An advantageous catalyst combines this zeolite with a phosphorus-doped matrix.",
        "The globally non-dealuminified zeolite can be obtained by any treatment that does not extract aluminum from the sample, such as, for example, treatment with water vapor, treatment by SiCl4.",
        "In another preferred embodiment of the invention, the substrate comprises a zeolite as described in U.S. Pat. No. 5,601,978. These zeolites are described in particular in column 30, lines 48-64. Their mesopore volume is in particular more than 0.202 cm3/g for a mesh parameter encompassed between 24.5 Å and 24.6 Å and more than 0.313 cm3/g for a mesh parameter encompassed between 24.3 and 24.5 Å.",
        "According to another embodiment of the invention, the zeolite is a zeolite that is selected from the group that is formed by the mordenite, beta, NU-87 and EU-1 zeolites, preferably the MOR zeolite, used by itself or in a mixture with other zeolites.",
        "The preparation and the treatment or treatments as well as the shaping of the zeolite can thus constitute one stage of the preparation of these catalysts.",
        "The introduction of the zeolite can be done by any technique that is known to one skilled in the art during the preparation of the matrix or during the shaping of the substrate.",
        "The total content by weight of zeolite in the substrate is encompassed between 0.1% and 99%, advantageously between 1% and 90%, preferably between 20% and 80%, even more preferably between 30 and 60%.",
        "Preparation of the Catalyst",
        "The catalysts according to the invention can be prepared according to all of the methods that are well known to one skilled in the art starting from substrates that are prepared as described above.",
        "The zeolite can be introduced according to any method that is known to one skilled in the art at any stage of the preparation of the substrate or catalyst.",
        "A preferred process for the preparation of the catalyst according to this invention comprises the following stages:",
        "According to a preferred method of preparation, the zeolite can be introduced during the synthesis of the precursors of the matrix. The zeolite can be, for example, without this being limiting, in the form of powder, ground powder, suspension, or suspension that has undergone a deagglomeration treatment. Thus, for example, the zeolite can be put into a suspension that may or may not be acidified at a concentration that is adjusted to the final content of zeolite targeted in the substrate. This suspension that is commonly called a slip is then mixed with the precursors of the matrix at any stage of its synthesis as described above.",
        "According to another preferred method of preparation, the zeolite can also be introduced during the shaping of the substrate with the elements that constitute the matrix with optionally at least one binder. The zeolite can be, without this being limiting, in the form of powder, ground powder, suspension or suspension that has undergone a deagglomeration treatment.",
        "The preparation and the treatment or treatments as well as the shaping of the zeolite thus can constitute one stage of the preparation of these catalysts.",
        "The possible hydro-dehydrogenating element can be introduced at any stage of the preparation, preferably during the mixing, or very preferably after shaping. The shaping is followed by a calcination, the hydrogenating element can also be introduced before or after this calcination. The preparation generally ends by a calcination at a temperature of 250 to 600° C. Another of the preferred methods according to this invention consists in shaping the substrate after the latter is mixed, then passage of the thus obtained paste through a die to form extrudates with diameters of between 0.4 and 4 mm. The hydrogenating function can then be introduced in part only or in full at the time of mixing. It can also be introduced by one or more ion exchange operations on the calcined substrate that consists of at least one silica-alumina that is optionally shaped with a binder and at least one zeolite with the aid of solutions that contain the precursor salts of the selected metals.",
        "The substrate is preferably impregnated by an aqueous solution. The impregnation of the substrate is preferably carried out by the so-called “dry” impregnation method that is well known to one skilled in the art. The impregnation can be carried out in a single stage by a solution that contains all the constituent elements of the final catalyst.",
        "The catalyst that can be used in the process of this invention can therefore contain at least one noble element of group VIII such as ruthenium, rhodium, palladium, osmium, iridium or platinum. Among the noble metals of group VIII, it is preferred to use a metal that is selected from the group that is formed by platinum, palladium and ruthenium. A preferred combination of noble elements of group VIII for the catalyst that can be used in the process of this invention is the platinum-palladium combination.",
        "The halogenated elements can be introduced into the catalyst at any level of the preparation and according to any technique that is known to one skilled in the art. The halogenated compounds are preferably added with the aid of an aqueous solution that is prepared from corresponding mineral acids, for example HF or HCl (dry impregnation, by excess or co-mixing). The use of ammonium fluoride/ammonium chloride (NH4F, NH4HF2 or NH4Cl) can also be considered, whereby the dry impregnation of the substrates by this type of compound is furthermore the most used method in the scientific literature in the field.",
        "The breakdown of the organofluorine compounds and/or organochlorine compounds in the catalyst is a method that may also be suitable in the invention. This makes it possible to prevent the use of hydrofluoric acid solutions, now regulated.",
        "The noble metals of group VIII of the catalyst of this invention can be present in full or partially in metallic form and/or oxide and/or sulfide form.",
        "The sources of noble elements of group VIII that can be used are well known to one skilled in the art. The halides, for example the chlorides, the nitrates, the acids such as chloroplatinic acid, the oxychlorides such as the ammoniacal ruthenium oxychloride, or the amines, will be used.",
        "Shaping of the Substrates and Catalysts",
        "The substrate can be shaped by any technique that is known to one skilled in the art. The shaping can be carried out, for example, by extrusion, by pelletizing, by the drop (“oil-drop”) coagulation method, by turntable granulation or by any other method that is well known to one skilled in the art.",
        "The shaping can also be carried out in the presence of various components of the catalyst and extrusion of the mineral paste that is obtained, by pelletizing, shaping in the form of balls with a rotating groove or with a drum, drop coagulation, “oil-drop,” “oil-up” or any other known process for agglomeration of a powder that contains alumina and optionally other ingredients that are selected from among those that are mentioned above.",
        "The catalysts that are used according to the invention have the shape of spheres or extrudates. It is advantageous, however, that the catalyst comes in the form of extrudates with a diameter of between 0.5 and 5 mm and more particularly between 0.7 and 2.5 mm. The shapes are cylindrical (which may or may not be hollow), twisted cylindrical, multilobar (2, 3, 4 or 5 lobes, for example), and rings. The cylindrical shape is preferably used, but any other shape may be used.",
        "The packing density of substrates, after calcination, is more than 0.6 g/cm3, preferably more than 0.72 g/cm3, very preferably more than 0.8 g/cm3, and even more preferably more than 0.95 g/cm3.",
        "The packing density of the catalysts is more than 0.65 g/cm3, preferably more than 0.8 g/cm3, very preferably more than 0.95 g/cm3 and even more preferably more than 1.05 g/cm3.",
        "Furthermore, these substrates that are used according to this invention may have been treated, as is well known to one skilled in the art, by additives to facilitate the shaping and/or to improve the final mechanical properties of the silico-aluminum matrix-based substrates. By way of example of additives, it is possible to cite in particular cellulose, carboxymethyl-cellulose, carboxy-ethyl-cellulose, tall oil, xanthan gums, surfactants, flocculent agents such as polyacrylamides, carbon black, starches, stearic acid, polyacrylic alcohol, polyvinyl alcohol, biopolymers, glucose, polyethylene glycols, etc.",
        "The adjustment of the porosity that is characteristic of the substrates of the invention is carried out partially during this shaping stage of the substrate particles.",
        "The shaping can be carried out by using techniques for shaping the catalysts, known to one skilled in the art, such as, for example: extrusion, sugar-coating, spray-drying or else pelletizing.",
        "It is possible to add or to remove water to adjust the viscosity of the paste that is to be extruded. This stage can be carried out at any stage of the mixing stage.",
        "To adjust the content of solid material of the paste that is to be extruded so as to make it extrudable, it is also possible to add a compound that is solid for the most part and preferably an oxide or a hydrate. A hydrate will preferably be used, and even more preferably, an aluminum hydrate will be used. The fire loss of this hydrate will be more than 15%.",
        "The acid content added in the mixing before the shaping is less than 30%, preferably between 0.5 and 20% by weight of the anhydrous silica and alumina mass that is engaged in the synthesis.",
        "The extrusion can be carried out by any conventional tool, available commercially. The paste that is obtained from mixing is extruded through a dye, for example with the aid of a piston or a single- or double-extrusion screw. This extrusion stage can be carried out by any method that is known to one skilled in the art.",
        "The substrate extrudates of the invention generally have a resistance to crushing of at least 70 N/cm and preferably of greater than or equal to 100 N/cm.",
        "Calcination of the Substrate",
        "The drying is carried out by any technique that is known to one skilled in the art.",
        "To obtain the substrate of this invention, it is preferable to calcinate preferably in the presence of molecular oxygen, for example by carrying out a flushing with air, at a temperature that is less than or equal to 1100° C. At least one calcination can be carried out after any arbitrary stage of the preparation. This treatment can be performed, for example, in a flushed bed, in a swept bed or in static atmosphere. For example, the furnace that is used can be a rotary kiln or a vertical furnace with radial flushed layers. The calcination conditions: the temperature and duration depend mainly on the maximum temperature of use of the catalyst. The preferred conditions of calcination are between more than one hour at 200° C. to less than one hour at 1100° C. The calcination can be performed in the presence of water vapor. The final calcination optionally can be carried out in the presence of an acidic or basic vapor. For example, the calcination can be carried out under partial pressure of ammonia.",
        "Post-Synthesis Treatments",
        "Post-synthesis treatments can be carried out so as to improve the properties of the substrate, in particular its homogeneity as defined above.",
        "According to the invention, the substrate thus can optionally be subjected to a hydrothermal treatment in a confined atmosphere. Hydrothermal treatment in a confined atmosphere is defined as a treatment by passage with an autoclave in the presence of water under a temperature that is higher than the ambient temperature.",
        "During this hydrothermal treatment, it is possible to treat the shaped silica-alumina or the substrate (matrix+zeolite) in different ways. Thus, it is possible to impregnate the silica-alumina or the substrate with acid, prior to its passage to the autoclave, whereby autoclaving of the silica-alumina is done either in vapor phase or in liquid phase, whereby this vapor phase or liquid phase of the autoclave may or may not be acid. This impregnation, prior to the autoclaving, may or may not be acid. This impregnation, prior to the autoclaving, can be carried out in the dry state or by immersion of the silica-alumina in an acidic aqueous solution. Dry impregnation is defined as bringing the alumina into contact with a solution volume that is less than or equal to the total pore volume of the treated alumina. The impregnation is preferably carried out in the dry state.",
        "The autoclave is preferably a rotary-basket autoclave such as the one that is defined in Patent Application EP-A-0 387 109.",
        "The temperature during the autoclaving can be between 100 and 250° C. for a period of time of between 30 minutes and 3 hours.",
        "Process for the Production of Phenylalkanes and Embodiments",
        "The invention relates to a process for the production of at least one compound that is selected from among the 2-, 3-, 4-, 5-, and 6-phenylalkanes by alkylation of an aromatic compound (preferably benzene) by means of a feedstock that contains at least one olefin that comprises at least 9 carbon atoms per molecule, in the presence of a catalyst that comprises at least one substrate that is based on at least one zeolite or zeolite mixture and that is based on a silica-alumina base, whereby said matrix contains an amount of more than 5% by weight and less than or equal to 95% by weight of silica (SiO2) and that exhibits the following characteristics:\n\n    \n    \n        A mean pore diameter, measured by mercury porosimetry, encompassed between 20 and 140 Å,\n        A total pore volume, measured by mercury porosimetry, encompassed between 0.1 ml/g and 0.6 ml/g,\n        A total pore volume, measured by nitrogen porosimetry, encompassed between 0.1 ml/g and 0.6 ml/g,\n        A BET specific surface area encompassed between 100 and 850 m2/g,\n        A packing density after calcination of more than 0.65 g/cm3,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å, of less than 0.1 ml/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å, of less than 0.1 ml/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å, of less than 0.1 ml/g,\n        A pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å, of less than 0.1 ml/g, preferably less than 0.05 ml/g, and very preferably less than 0.02 ml/g,\n        An X diffraction diagram that contains at least the main lines that are characteristic of at least one of the transition aluminas contained in the group that consists of the alpha-, rho-, chi-, eta-, gamma-, kappa-, theta- and delta-aluminas,\n        Preferably a pore distribution, such that the ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å, to the total mercury volume is more than 0.6, such that volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å, is less than 0.1 ml/g, and such that volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å, is less than 0.2 ml/g,\n\nwhereby said process is carried out at a temperature of between 30 and 400° C., a pressure of between 0.1 and 10 MPa, an hourly volumetric flow rate of 0.50 to 200 h−1, and an aromatic compound/olefin molar ratio of between 1:1 and 50:1.",
        "The feedstock that contains at least one olefin (olefinic feedstock) preferably consists of for the most part paraffins.",
        "In an embodiment of the process of the invention, the reactions of alkylation and transalkylation take place together in the same reaction zone (i.e., in the same reactor in the presence of the same catalyst).",
        "In this variant of the process according to the invention, in a reaction zone, the aromatic compound is preferably reacted with a feedstock that contains at least one olefin (olefinic feedstock), for example a linear olefin, upon contact with a catalyst that comprises a silica-alumina that has the characteristics defined previously (alkylation reaction), then the product that is obtained is fractionated so as to collect separately a first fraction that contains unconverted aromatic compound, a second fraction that contains at least one olefin, for example linear, initially present in the feedstock (unconverted), a third fraction that contains the 2-, 3-, 4-, 5- and 6-phenylalkanes, and a fourth fraction that contains at least one poly-alkylaromatic compound (or poly-alkylaromatic fraction), whereby the latter is then most often at least partially recycled to said reaction zone where it reacts with the aromatic compound upon contact with said catalyst, so as to be at least partially transalkylated (transalkylation reaction), and a mixture of 2-, 3-, 4-, 5- and 6-phenylalkanes is collected.",
        "The first fraction that contains the unconverted aromatic compound is preferably at least partially recycled to said reaction zone. Likewise, the second fraction that contains at least one unconverted, preferably linear, olefin is preferably at least partially recycled to said reaction zone.",
        "The recycled portion of the fourth fraction that for the most part contains in general at least one dialkylaromatic compound is preferably essentially free of heavy alkylaromatic compounds, which can be eliminated by fractionation.",
        "The aromatic compound that is used in this variant of the process according to the invention is preferably benzene.",
        "The alkylation reaction of the process according to this invention can be conducted in the presence of hydrogen, in particular in the case where the catalyst contains a noble element of group VIII.",
        "The process according to this invention can be carried out, for the alkylation stage, at a temperature of between 30 and 400° C., under a pressure of 0.1 to 10 MPa, with a liquid hydrocarbon flow rate (hourly volumetric flow rate) of about 0.5 to 200 volumes per volume of catalyst and per hour and with an aromatic compound/olefin molar ratio of between 1:1 and 50:1.",
        "In the implementation of the invention that comprises a second separate transalkylation stage, the second stage can be carried out at a temperature of between about 100 and 500° C., preferably between 150 and 400° C., under a pressure of between about 1.5 and 10 MPa (preferably 2 to 7 MPa), with a liquid hydrocarbon flow rate (volumetric flow rate) of about 0.5 to 5 volumes per volume of catalyst and per hour, and with an aromatic compound/polyalkylaromatic compound molar ratio of about 2:1 to 50:1.",
        "The following examples illustrate this invention without, however, limiting its scope.",
        "A precursor of matrix SU1 is prepared in the following way: in a first step, a 30% sulfuric acid solution is added to a sodium silicate solution. The amount of H2SO4 is defined so as to work at a set neutralization rate. The addition is done in two minutes while being stirred at 600 rpm. The synthesis temperature is 60° C. The development period was set at 30 minutes. The stirring is maintained at 600 rpm, and the temperature is that of the preceding stage. Then, Al2(SO4)3 (500 ml) is added, and the concentration is set by the desired alumina content. The pH is not regulated and is set by the desired alumina content. The addition is done in 10 minutes. The stirring is still set at 600 rpm, and the temperature is the same as that of the preceding stages. Then, ammonia is added. The gel that is obtained is filtered by displacement. The washing is done with water at 60° C., 3 kg of water per kg of solid that is contained in the gel. Then, an exchange with ammonium nitrate NH4NO3 (138.5 g/l) at 60° C. and 1.5 l per kg of solid that is contained in the gel is carried out. Finally, a supplemental washing with water at 60° C. is done by displacement, 3 kg of water per kg of solid that is contained in the gel. The gel that is obtained from this stage is mixed with Pural boehmite powder such that the final composition of the anhydrous product is, at this stage of the synthesis, equal to 50% Al2O3-50% SiO2.",
        "The mixing is done in a Z-arm mixing machine. The extrusion is carried out by passing the paste through a die that is equipped with orifices with a 1.4 mm diameter. The thus obtained extrudates are dried at 150° C., calcined at 550° C., then calcined at 700° C. in the presence of water vapor.",
        "The characteristics of the substrate are as follows:\n\n    \n    \n        The composition of substrate SU1 is 50.12% Al2O3-49.88% SiO2.\n        The BET surface area of the substrate is 254 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.43 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 65 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.91.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.03 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.047 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.015 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.013 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.011 ml/g.\n        The pore volume, measured by mercury porosimetry and encompassed in the pores with diameters of more than 500 Å, is 0.001 ml/g.\n        The X diffraction diagram contains the main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 and 1.40 Å and the peaks at one d encompassed between 1.97 Å and 2.00 Å.\n        The atomic sodium content is 310+/−20 ppm. The atomic sulfur content is 1500 ppm.",
        "The substrate contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or greater than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.7, and the other zone has an Si/Al ratio that is determined by TEM to be 0.98.",
        "An alumina hydrate is prepared according to the teachings of U.S. Pat. No. 3,124,418. After filtration, the freshly prepared SU2 precipitate is mixed with a silicic acid solution that is prepared by decationizing resin exchange. The proportions of the two solutions are adjusted so as to reach a composition of 70% Al2O3-30% SiO2 on the final substrate. This mixture is quickly homogenized in a commercial colloidal mill in the presence of nitric acid such that the nitric acid content of the suspension at the mill outlet is 8% relative to the silica-alumina mixed solid. Then, the suspension is conventionally dried in a sprayer in a conventional way from 300° C. to 60° C. The thus prepared powder is shaped in a Z-arm in the presence of 8% nitric acid relative to the anhydrous product. The extrusion is carried out by passing the paste through a die that is equipped with orifices with a 1.4 mm diameter. The thus obtained extrudates are dried at 150° C., then calcined at 550° C., then calcined at 750° C. in the presence of water vapor.",
        "The Characteristics of substrate SU2 are as follows:\n\n    \n    \n        The silica-alumina composition is 69.5% Al2O3 and 30.5% SiO2.\n        The BET surface area is 250 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.45 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 70 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.021 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å, is 0.035 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.015 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.01 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.007 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains the main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å.\n        The atomic sodium content is 250+/−20 ppm. The atomic sulfur content is 2000 ppm.",
        "The substrate contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.37.",
        "The aluminum hydroxide powder was prepared according to the process described in Patent WO 00/01617. The mean particle size of the aluminum hydroxide particles measured by laser granulometry is 40 microns. This powder is mixed with a silica sol that is prepared by decationizing resin exchange, then filtered on resin with a pore size of 2. The concentrations of silica sol and aluminum hydroxide powder are adjusted so as to obtain a final composition of 60% Al2O3 and 40% SiO2. The shaping is carried out in the presence of 15% nitric acid relative to the anhydrous product. The mixing is done in a Z-arm mixing machine. The extrusion is carried out by passing the paste through a die that is equipped with orifices with a 1.4 mm diameter. The thus obtained extrudates are dried at 150° C., then calcined at 550° C., then calcined at 750° C. in the presence of water vapor.",
        "The characteristics of substrate SU3 are as follows:\n\n    \n    \n        The composition of the silica-alumina substrate is 59.7% Al2O3 and 40.3% SiO2.\n        The BET surface area is 248 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.46 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 69 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.022 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.031 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.0105 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.0065 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains the main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 and 1.40 Å and the peaks at one d encompassed between 1.97 Å and 2.00 Å.\n        The atomic sodium content is 200+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The substrate contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or greater than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.22, and the other zone has an Si/Al ratio that is determined by TEM to be 0.85.",
        "Substrate SU4 is obtained in the following manner:",
        "The silica-alumina gels are prepared by mixing the sodium silicate and water by sending this mixture over an ion exchange resin. A solution of aluminum chloride hexahydrate in water is added to the decationized silica sol. So as to obtain a gel, ammonia is added, then the precipitate is filtered, and washing with a concentrated water and ammonia solution is carried out until the conductivity of the washing water is constant. The gel that is obtained from this stage is mixed with Pural boehmite powder so that the final composition of the mixed substrate of anhydrous product is, in this stage of the synthesis, equal to 60% Al2O3-40% SiO2. This suspension is passed into a colloidal mill in the presence of nitric acid. The added nitric acid content is adjusted so that the percentage at the outlet of the nitric acid mill is 8% relative to the mixed solid oxide mass. This mixture is then filtered so as to reduce the amount of water in the mixed cake. Then, the cake is mixed in the presence of 10% nitric acid and then extruded. The mixing is done in a Z-arm mixing machine. The extrusion is carried out by passing the paste through a die that is equipped with orifices with a 1.4 mm diameter. The extrudates that are thus obtained are dried at 150° C., then calcined at 550° C., then calcined at 700° C. in the presence of water vapor.",
        "The characteristics of substrate SU4 are as follows:\n\n    \n    \n        The composition of the silica-alumina substrate is 60.7% Al2O3 and 39.3% SiO2.\n        The BET surface area is 258 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.47 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 69 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å, to the total mercury volume is 0.89.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.032 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.041 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.0082 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.0063 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains the main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 and 1.40 Å and the peaks at one d encompassed between 1.97 Å and 2.00 Å.\n        The atomic sodium content is 200+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The substrate contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.63.",
        "A zeolite Z1 with an Si/Al ratio measured by FX of 14.7, an Si/Al framework ratio measured by NMR of 19, sodium content of 260 ppm, mesh parameter a=24.29 {hacek over (A)}, crystallinity rate of 88%, and BET surface area equal to 838 m2/g is used.",
        "5 g of zeolite Z1 that is described above and 95 g of precursors of matrices SU1 to SU4 converted to solid as described above are then mixed. This mixing is done before the introduction into the extruder. The zeolite powder is wetted in advance and added to the matrix suspension in the presence of nitric acid at 66% (7% by weight of acid per gram of dry gel) then mixed for 15 minutes. At the end of this mixing, the paste that is obtained is passed through a die that has cylindrical orifices with a diameter that is equal to 1.4 mm. The extrudates are then dried for one night at 120° C. in air then calcined at 550° C. in air, then calcined at 700° C. in the presence of water vapor.",
        "Substrates SU5 to SU8 that contain 5% of zeolite Z1 converted into anhydrous mass are thus obtained.",
        "The characteristics of the substrates according to the invention are:",
        "For substrate SU5,\n\n    \n    \n        The composition of the matrix of the substrate is 50.1% Al2O3-49.9% SiO2.\n        The BET surface area of the substrate is 280 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.418 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 64 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.91.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.03 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.047 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.014 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.010 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The lines that are characteristic of zeolite Z1 that was introduced.\n        \n        \n        The atomic sodium content is 290+/−20 ppm. The atomic sulfur content is 1500 ppm.",
        "The matrix of the substrate contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or more than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.7, and the other zone has an Si/Al ratio that is determined by TEM to be 0.98.",
        "For substrate SU6,\n\n    \n    \n        The silica-alumina composition of the matrix of the substrate is 69.5% Al2O3 and 30.5% SiO2.\n        The BET surface area is 279 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.437 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 69 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.020 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.034 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.015 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.01 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.068 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The lines that are characteristic of zeolite Z2.\n        \n        \n        The atomic sodium content is 240+/−20 ppm.\n        The atomic sulfur content is 1900 ppm.",
        "The matrix of the substrate contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.37.",
        "The characteristics of substrate SU7 are as follows:\n\n    \n    \n        The composition of the silica-alumina matrix is 59.7% Al2O3 and 40.3% SiO2.\n        The BET surface area is 283 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.45 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 68 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.021 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.030 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.010 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.063 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z1.\n        \n        \n        The atomic sodium content is 190+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The matrix contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or more than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.22, and the other zone has an Si/Al ratio that is determined by TEM to be 0.85.",
        "The characteristics of substrate SU8 are as follows:\n\n    \n    \n        The composition of the matrix of the silica-alumina substrate is 60.7% Al2O3 and 39.3% SiO2.\n        The BET surface area is 287 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.46 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 68 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.89.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.031 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.040 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.008 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z1.\n        \n        \n        The atomic sodium content is 200+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The catalyst contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.63.",
        "A zeolite Z2 with an Si/Al ratio measured by FX of 73, sodium content of 102 ppm, mesh parameter a=24.15 {hacek over (A)}, crystallinity rate of 44%, and BET surface area equal to 783 m2/g is used.",
        "5 g of zeolite Z2 that is described above and 10 g of precursors of substrates SU1 to SU4 that are described above are then mixed. This mixing is done before the introduction into the extruder. The zeolite powder is wetted in advance and added to the matrix suspension in the presence of nitric acid at 66% (7% by weight of acid per gram of dry gel) then mixed for 15 minutes. At the end of this mixing, the paste that is obtained is passed through a die that has cylindrical orifices with a diameter that is equal to 1.4 mm. The extrudates are then dried for one night at 120° C. in air then calcined at 550° C. in air, then calcined at 700° C. in the presence of water vapor.",
        "Substrates SU9 to SU12 with 33% of zeolite Z2 are thus obtained.",
        "The characteristics of the substrates according to the invention are:",
        "For substrate SU9,\n\n    \n    \n        The composition of the matrix of the substrate is 50.1% Al2O3-49.9% SiO2.\n        The BET surface area of the substrate is 283 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.418 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 64 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.91.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.03 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.047 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.014 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.010 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The lines that are characteristic of zeolite Z2 that was introduced.\n        \n        \n        The atomic sodium content is 290+/−20 ppm. The atomic sulfur content is 1500 ppm.",
        "The matrix of the substrate contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or more than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.7, and the other zone has an Si/Al ratio that is determined by TEM to be 0.98.",
        "For substrate SU10, the characteristics are as follows:\n\n    \n    \n        The silica-alumina composition of the matrix of the substrate is 69.5% Al2O3 and 30.5% SiO2.\n        The BET surface area is 279 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.438 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 69 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.020 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.034 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.015 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.013 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.0068 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The B/L ratio of the matrix is 0.12.\n        The packing density of the substrate is 0.79 g/cm3.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The lines that are characteristic of zeolite Z2.\n        \n        \n        The atomic sodium content is 240+/−20 ppm. The atomic sulfur content is 1900 ppm.",
        "The matrix of the substrate contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.37.",
        "The characteristics of substrate SU11 are as follows:\n\n    \n    \n        The composition of the silica-alumina matrix is 59.7% Al2O3 and 40.3% SiO2.\n        The BET surface area is 275 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.45 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 68 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.021 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.030 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.010 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z2.\n        \n        \n        The atomic sodium content is 190+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The B/L ratio of the matrix is 0.12.",
        "The packing density of the substrate is 0.795 g/cm3.",
        "The NMR MAS 27Al spectra of the matrix of the catalysts show two clusters of separate peaks. A first type of aluminum whose maximum resonates toward 10 ppm extends between −100 and 20 ppm. The position of the maximum suggests that these radicals are essentially of AlVI type (octahedral). A second type of minority aluminum whose maximum resonates toward 60 ppm extends between 20 and 100 ppm. This cluster can be decomposed into at least two radicals. The predominant radical of this cluster would correspond to AlIV atoms (tetrahedral). The proportion of octahedral AlVI is 70%.",
        "The matrix contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or more than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.22, and the other zone has an Si/Al ratio that is determined by TEM to be 0.85.",
        "The characteristics of substrate SU12 are as follows:\n\n    \n    \n        The composition of the matrix of the silica-alumina substrate is 60.7% Al2O3 and 39.3% SiO2.\n        The BET surface area is 284 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.46 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 68 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.89.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.031 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.040 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.008 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z2.\n        \n        \n        The atomic sodium content is 200+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The matrix contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.63.",
        "A zeolite Z3 as described in U.S. Pat. No. 5,601,798 is used. This zeolite is prepared according to the method that is described in Example 52, Table 16. The mesopore volume that is obtained is 0.36 cm3/g. The mesh parameter a is 24.34 {hacek over (A)}, and the crystallinity rate is 75%. 5 g of zeolite Z3 that is described above and 95 g of precursor matrices of substrates SU1 to SU4 converted to solid as described above are then mixed. This mixing is done before the introduction into the extruder. The zeolite powder is wetted in advance and added to the matrix suspension in the presence of nitric acid at 66% (7% by weight of acid per gram of dry gel) then mixed for 15 minutes. At the end of this mixing, the paste that is obtained is passed through a die that has cylindrical orifices with a diameter that is equal to 1.4 mm. The extrudates are then dried for one night at 120° C. in air then calcined at 550° C. in air, then calcined at 700° C. in the presence of water vapor.",
        "Substrates SU13 to SU16 with 5% of zeolite Z3 are thus obtained.",
        "The characteristics of the substrates according to the invention are:",
        "For substrate SU13,\n\n    \n    \n        The composition of the matrix of the substrate is 50.1% Al2O3-49.9% SiO2.\n        The BET surface area of the substrate is 280 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.425 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 64 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.91.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.03 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.047 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.015 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.013 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.011 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z3.\n        \n        \n        The atomic sodium content is 290+/−20 ppm. The atomic sulfur content is 1500 ppm.",
        "The matrix of the substrate contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or more than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.7, and the other zone has an Si/Al ratio that is determined by TEM to be 0.98.",
        "For substrate SU14, the characteristics of the substrates are as follows:\n\n    \n    \n        The silica-alumina composition of the matrix of the substrate is 69.5% Al2O3 and 30.5% SiO2.\n        The BET surface area is 276 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.438 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 69 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.020 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.034 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.010 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The lines that are characteristic of zeolite Z3.\n        \n        \n        The atomic sodium content is 240+/−20 ppm. The atomic sulfur content is 1900 ppm.",
        "The matrix of the substrate contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.37.",
        "The characteristics of substrate SU15 are as follows:\n\n    \n    \n        The composition of the silica-alumina matrix is 59.7% Al2O3 and 40.3% SiO2.\n        The BET surface area is 275 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.455 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 68 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.021 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.030 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.010 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z3.\n        \n        \n        The atomic sodium content is 190+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The matrix contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or more than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.22, and the other zone has an Si/Al ratio that is determined by TEM to be 0.85.",
        "The characteristics of substrate SU16 are as follows:\n\n    \n    \n        The composition of the matrix of the silica-alumina substrate is 60.7% Al2O3 and 39.3% SiO2.\n        The BET surface area is 284 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.46 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 68 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.89.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.031 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.040 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.008 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z3.\n        \n        \n        The atomic sodium content is 200+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The catalyst contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.63.",
        "A zeolite Z4 that has an Si/Al(FX) ratio of 50, a sodium content of 154 ppm, a crystallinity of 60%, and an SBET of 777 m2/g is used.",
        "60 g of zeolite Z4 that is described above and 40 g of precursors of substrates SU1 to SU4 converted to solid that are described above are then mixed. This mixing is done before the introduction into the extruder. The zeolite powder is wetted in advance and added to the matrix suspension in the presence of nitric acid at 66% (7% by weight of acid per gram of dry gel) then mixed for 15 minutes. At the end of this mixing, the paste that is obtained is passed through a die that has cylindrical orifices with a diameter that is equal to 1.4 mm. The extrudates are then dried for one night at 120° C. in air then calcined at 550° C. in air, then calcined at 700° C. in the presence of water vapor.",
        "Substrates SU17 to SU20 with 60% of zeolite Z4 are thus obtained.",
        "The characteristics of the substrates according to the invention are:",
        "For substrate SU17,\n\n    \n    \n        The composition of the matrix of the substrate is 50.1% Al2O3-49.9% SiO2.\n        The BET surface area of the substrate is 380 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.485 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 34 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.91.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.03 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.047 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.015 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.012 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.010 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z4.\n        \n        \n        The atomic sodium content is 290+/−20 ppm. The atomic sulfur content is 1500 ppm.",
        "The matrix of the substrate contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or more than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.7, and the other zone has an Si/Al ratio that is determined by TEM to be 0.98.",
        "For Substrate SU18, the Characteristics of the Substrates are as Follows:\n\n    \n    \n        The silica-alumina composition of the matrix of the substrate is 69.5% Al2O3 and 30.5% SiO2.\n        The BET surface area is 376 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.48 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 39 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.020 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.034 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.011 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.010 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The lines that are characteristic of zeolite Z4.\n        \n        \n        The atomic sodium content is 230+/−20 ppm. The atomic sulfur content is 1900 ppm.",
        "The matrix of the substrate contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.37.",
        "The characteristics of substrate SU19 are as follows:\n\n    \n    \n        The composition of the silica-alumina matrix is 59.7% Al2O3 and 40.3% SiO2.\n        The BET surface area is 375 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.485 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 38 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.9.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.021 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.030 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.011 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.010 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z4.\n        \n        \n        The atomic sodium content is 190+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The matrix contains two silico-aluminum zones, whereby said zones have Si/Al ratios that are less than or more than the overall Si/Al ratio that is determined by X fluorescence. One of the zones has an Si/Al ratio that is determined by TEM to be 0.22, and the other zone has an Si/Al ratio that is determined by TEM to be 0.85.",
        "The characteristics of substrate SU20 are as follows:\n\n    \n    \n        The composition of the matrix of the silica-alumina substrate is 60.7% Al2O3 and 39.3% SiO2.\n        The BET surface area is 384 m2/g.\n        The total pore volume, measured by nitrogen adsorption, is 0.485 ml/g.\n        The mean pore diameter, measured by mercury porosimetry, is 38 Å.\n        The ratio between volume V2, measured by mercury porosimetry, encompassed between Dmean−30 Å and Dmean+30 Å to the total mercury volume is 0.89.\n        Volume V3, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+30 Å is 0.031 ml/g.\n        Volume V6, measured by mercury porosimetry, encompassed in the pores with diameters of more than Dmean+15 Å is 0.040 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 140 Å is 0.011 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 160 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 200 Å is 0.006 ml/g.\n        The pore volume, measured by mercury porosimetry, encompassed in the pores with diameters of more than 500 Å is 0.001 ml/g.\n        The X diffraction diagram contains:\n        \n            The main lines that are characteristic of the gamma-alumina, and in particular it contains the peaks at one d encompassed between 1.39 to 1.40 Å and the peaks at one d encompassed between 1.97 Å to 2.00 Å, and\n            The main lines that are characteristic of zeolite Z4.\n        \n        \n        The atomic sodium content is 190+/−20 ppm. The atomic sulfur content is 800 ppm.",
        "The matrix contains a single silico-aluminum zone with an Si/Al ratio that is determined by TEM microprobe to be 0.63.",
        "Catalysts C1 to C20 are obtained starting from substrates SUx in the form of extrudates. They are obtained by dry impregnation of an aqueous solution that contains platinum salts (chloroplatinic acid or tetramine platinum chloride) and/or fluorine salts (ammonium bifluoride NH4HF2) of, respectively, substrates SUx, in the form of extrudates and whose preparations have been described respectively in Examples 1, 2, 3, 4, 5, 6, 7 and 8. After maturation at ambient temperature in a water-saturated atmosphere, the impregnated extrudates are dried at 120° C. for one night, then calcined at 400° C. under dry air.",
        "TABLE 1\n\n\n\n\n\nContents By Weight of F, Cl, Pt of Catalysts C1 to C20\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC1\nC2\nC3\nC4\nC5\nC6\nC7\nC8\n\n\n\n\n\nSubstrate\nSU1\nSU2\nSU3\nSU4\nSU5\nSU6\nSU7\nSU8\n\n\n% Al2O3/\n50/50\n70/30\n60/40\n60/40\n50/50\n70/30\n60/40\n60/40\n\n\n% SiO2\n\n\n% Zeolite\n0\n0\n0\n0\n5\n5\n5\n5\n\n\nF (% by\n0\n0\n0\n0\n0\n1.5\n3.1\n4.8\n\n\nWeight)/\n\n\nCatalyst\n\n\nCl (% by\n0\n0\n0\n0\n0.81\n0.82\n0.79\n0.80\n\n\nWeight)\n\n\nPt (% by\n0\n0\n0.3\n0.3\n0\n0.3\n0.3\n0.3\n\n\nWeight)\n\n\n\n\n\n\nC9\nC10\nC11\nC12\nC13\nC14\nC15\nC16\n\n\n\n\n\nSubstrate\nSU9\nSU10\nSU11\nSU12\nSU13\nSU14\nSU15\nSU16\n\n\n% Al2O3/\n50/50\n70/30\n60/40\n60/40\n50/50\n70/30\n60/40\n60/40\n\n\n% SiO2\n\n\n% Zeolite\n33\n33\n33\n33\n5\n5\n5\n5\n\n\nF (% by\n0\n1.6\n0\n1.5\n0\n1.5\n3.1\n4.8\n\n\nWeight)/\n\n\nCatalyst\n\n\nCl (% by\n0\n0\n0\n0\n0.81\n0.82\n0.79\n0.80\n\n\nWeight)\n\n\nPt (% by\n0\n0\n0.3\n0.3\n0.3\n0.3\n0.3\n0.3\n\n\nWeight)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC17\nC18\nC19\nC20\n\n\n\n\n\n\n\nSubstrate\nSU17\nSU18\nSU19\nSU20\n\n\n\n% Al2O3/\n50/50\n70/30\n60/40\n60/40\n\n\n\n% SiO2\n\n\n\n% Zeolite\n60\n60\n60\n60\n\n\n\nF (% by\n0\n1.6\n0\n1.5\n\n\n\nWeight)/\n\n\n\nCatalyst\n\n\n\nCl (% by\n0\n0\n0\n0\n\n\n\nWeight)\n\n\n\nPt (% by\n0\n0\n0.3\n0.3\n\n\n\nWeight)",
        "A catalytic reactor that comprises a reaction zone that contains 50 cm3 of prepared catalyst according to Example 9 is used.",
        "The operating conditions for the alkylation of the benzene by dodecene-1 are as follows:\n\n    \n    \n        Temperature: 135° C.\n        Pressure: 4 MPa\n        VVH=1 h−1 (cm3 of benzene+dodecene-1 per cm3 of catalyst and per hour)\n        Benzene/dodecene−1 molar ratio 1:30",
        "A feedstock that contains 72% by weight of benzene and 28% by weight of dodecene-1 is prepared. This feedstock is introduced at the inlet of the catalytic reactor where the alkylation reaction takes place.",
        "The catalytic performance levels are recorded in Table 2 by expressing the number of hours of operation with a conversion of >95% and the linearity of the alkyl-benzenes that are formed.",
        "TABLE 2\n\n\n\n\n\nCatalytic Performance Levels of Catalysts C1 to C20 in Terms of\n\n\nAlkylation of Benzene\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC1\nC2\nC3\nC4\nC5\nC6\nC7\nC8\n\n\n\n\n\nNumber of\n35\n36\n35.5\n36.2\n45\n45\n47\n47\n\n\nHours/\n\n\nConversion\n\n\n>95%\n\n\nLinearity of the\n91.8\n91.9\n91.9\n92.1\n91.9\n92.1\n92.5\n93.1\n\n\nAlkyl-benzenes\n\n\n(%)\n\n\n\n\n\n\nC9\nC10\nC11\nC12\nC13\nC14\nC15\nC16\n\n\n\n\n\nNumber of\n45\n48\n47\n50\n46\n49\n47\n51\n\n\nHours/\n\n\nConversion\n\n\n>95%\n\n\nLinearity of the\n92.5\n92.9\n92.3\n93.2\n93.2\n93.5\n92.9\n93.6\n\n\nAlkyl-benzenes\n\n\n(%)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC17\nC18\nC19\nC20\n\n\n\n\n\n\n\nNumber of\n46\n47\n46\n48\n\n\n\nHours/\n\n\n\nConversion\n\n\n\n>95%\n\n\n\nLinearity of\n91.5\n91.7\n91.5\n91.8\n\n\n\nAlkyl-benzenes\n\n\n\n(%)",
        "It appears that the catalysts according to the invention make it possible to increase the operating time with a conversion of more than 95% while maintaining a high percentage of linearity of the alkyl-benzenes that are formed.",
        "The entire disclosures of all applications, patents and publications, cited herein and of corresponding French application No. 04/03.614, filed Apr. 5, 2004 are incorporated by reference herein.",
        "The preceding examples can be repeated with similar success by substituting the generically or specifically described reactants and/or operating conditions of this invention for those used in the preceding examples.",
        "From the foregoing description, one skilled in the art can easily ascertain the essential characteristics of this invention and, without departing from the spirit and scope thereof, can make various changes and modifications of the invention to adapt it to various usages and conditions."
    ],
    "citations": [
        "4301317",
        "4798816",
        "0466558",
        "0469940",
        "2697246"
    ],
    "us_classification": "585467",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "07",
            "subclass": "C",
            "main_group": "2",
            "subgroup": "68"
        }
    ]
}