{
    "title": "Curable pressure sensitive adhesive compositions",
    "abstract": "Curable pressure sensitive adhesive compositions comprising an acrylate copolymer, a mono-acrylate oligomer, a multi-acrylate oligomer having from 2 to 5 acrylate functional groups per molecule, and a photoinitiator, the adhesive exhibiting pressure sensitive adhesive characteristics and forms at least a semi-interpenetrating polymer network when cured; wherein the semi-IPN has an average molecular weight between crosslinks (M",
    "inventors": [
        "Yang",
        "Johnson",
        "Kausch",
        "Lu",
        "McMan"
    ],
    "document_number": "07297400",
    "publication_date": "20071120",
    "assignees": [
        "3M Innovative Properties Company"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An optical construction comprising",
            "components": [
                {
                    "component": "an optical film having a major surface;",
                    "subcomponents": []
                },
                {
                    "component": "an adhesive applied to at least a portion of said major surface, wherein said adhesive comprises an acrylate copolymer;",
                    "subcomponents": [
                        "a mono-acrylate oligomer;",
                        "a multi-acrylate oligomer having 2 to 5 acrylate functionalities; and",
                        "a photoinitiator that initiates free radical polymerization;"
                    ]
                },
                {
                    "component": "a mono-acrylate oligomer;",
                    "subcomponents": []
                },
                {
                    "component": "a multi-acrylate oligomer having 2 to 5 acrylate functionalities; and",
                    "subcomponents": []
                },
                {
                    "component": "a photoinitiator that initiates free radical polymerization;",
                    "subcomponents": []
                },
                {
                    "component": "wherein said mono-acrylate oligomer is present in an amount greater than the amount of said multi-acrylate oligomer, and wherein said mono-acrylate oligomer, multi-acrylate oligomer and photoinitiator, when blended with said acrylate copolymer, forms a pressure sensitive adhesive, and when cured, forms a cured adhesive comprising at least a semi-interpenetrating polymer network having an average molecular weight between crosslinks (M",
                    "subcomponents": []
                },
                {
                    "component": "a substrate bonded to said optical film, having said adhesive cured therebetween.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The construction of claim 1 , wherein said optical film is capable of reflecting infra-red light.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The construction of claim 1 , wherein at least one of said optical film and said substrate is an outgassing material.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The construction of claim 1 , wherein said substrate comprises a material selected from a group consisting of glass, polycarbonate, polyethylene, polyurethane and polyacrylates, and combinations thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The construction of claim 1 , wherein said optical film is selected from a group consisting of multi-layer optical film, polycarbonate, polyester, polyurethane, polyacrylate, polyvinyl alcohol, polyethylene, polyvinyl chloride, cellulose triacetate and combinations thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The construction of claim 1 , wherein said adhesive composition further comprises a UV absorber.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A method of making an optical construction comprising",
            "components": [
                {
                    "component": "a) providing an optical substrate;",
                    "subcomponents": []
                },
                {
                    "component": "b) applying onto a major surface of said optical substrate, an adhesive composition comprising",
                    "subcomponents": []
                },
                {
                    "component": "an acrylate copolymer;",
                    "subcomponents": [
                        "a mono-acrylate oligomer;",
                        "a multi-acrylate oligomer having from 2 to 5 acrylate functionalities; and",
                        "a photoinitiator that initiates free radical polymerization;"
                    ]
                },
                {
                    "component": "a mono-acrylate oligomer;",
                    "subcomponents": []
                },
                {
                    "component": "a multi-acrylate oligomer having from 2 to 5 acrylate functionalities; and",
                    "subcomponents": []
                },
                {
                    "component": "a photoinitiator that initiates free radical polymerization;",
                    "subcomponents": []
                },
                {
                    "component": "wherein said mono-acrylate oligomer is present in an amount greater than the amount of said multi-acrylate oligomer, and wherein said mono-acrylate oligomer, multi-acrylate oligomer and photoinitiator, when blended with said acrylate copolymer, forms a pressure sensitive adhesive, and when cured, forms a cured adhesive comprising at least a semi-interpenetrating polymer network having an average molecular weight between crosslinks (M",
                    "subcomponents": []
                },
                {
                    "component": "c) positioning a major surface of a second substrate adjacent said major surface of said optical substrate, with said adhesive therebetween; and",
                    "subcomponents": []
                },
                {
                    "component": "d) actinically curing said adhesive.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method according to claim 7 , wherein said steps a) thru d) are performed sequentially.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method according to claim 7 , wherein said actinically curing said adhesive is conducted using UV irradiation.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method according to claim 7 , wherein said adhesive composition is applied onto said major surface of said optical substrate as a tape.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method according to claim 7 , wherein said optical substrate is a film selected from a group consisting of multi-layer optical film, polycarbonate, polyester, polyurethane, polyacrylate, polyvinyl alcohol, polyethylene, polyvinyl chloride, cellulose triacetate and combinations thereof.",
            "components": []
        }
    ],
    "description": [
        "This application is a divisional of U.S. Ser. No. 10/331,374, filed Dec. 30, 2002 now U.S. Pat. No. 6,887,917, now allowed, the disclosure of which is herein incorporated by reference.",
        "This invention relates to adhesive compositions, and more particularly to adhesive compositions that can be both pressure sensitive and curable.",
        "Pressure sensitive adhesives (PSA) have been used in a variety of applications, as they provide many desirable characteristics such as removability and ease of application. For a more permanent and highly smooth bond, some conventional PSAs may not necessarily have sufficient strength to hold and maintain its adherence on certain substrates. Furthermore, a conventional PSA when applied to certain materials, may not be able to withstand exposure to elevated temperatures or high humidity. For example, application of a PSA on acrylic sheets and polycarbonate sheets that are known to be “out-gassing materials” and difficult to bond, can result in bubbling and delamination.",
        "Curable adhesives (e.g. heat or light cured) have been used in applications where substrates require substantial permanency and high strength adherence. Conventional curable adhesives, however, are typically not provided as a PSA nor in the form that is easy to apply, such as a tape. For optical product applications (e.g. glazings), curable adhesives have been desirable, as they can provide optically clear, strongly adhered laminates (e.g. layered substrates).",
        "To achieve both strength and ease of application, hybrid compositions have been developed that can be used in optical applications. For example, a light curable, polyester based adhesive has been used for plastic glazing applications. In digital video disc (DVD or optical discs) bonding and CRT applications, a liquid adhesive formulation has been used. For bead bonding in making retroreflective articles, a curable polymeric network has been suggested.",
        "Strength and application, however, are not the only criteria that many optical substrates/laminates require. Certain optical products are exposed to harsh environmental conditions, such as heat, UV (solar) light, water, etc. For example, vehicle windshields generally exist in outdoor conditions that submit them to all types of weather. These windshields typically include substrates such as acrylic or polycarbonate, adhered to a solar or infra-red (IR) reflecting film made from a multi-layer optical film (MLOF) (3M Co; St. Paul, Minn.). The materials may become optically obstructed if the adhesion between the layers is damaged or compromised.",
        "What is desired is an adhesive composition that can be used in applications where optical clarity is needed, as well as ease of application for efficient manufacturing. An adhesive composition whose integrity is maintained even when exposed to extreme temperature and moisture conditions is also desired.",
        "The invention provides adhesive compositions that can be optically clear and environmentally stable. In certain embodiments, the adhesive compositions can be applied as a pressure sensitive adhesive (and therefore removable if desired), and subsequently cured to provide a more permanent bond by forming a secure structural adhesive bond. As a PSA, the composition comprises, among other things, components having curable functional groups that can be activated by ultra-violet radiation and other energy sources. Curing can be accomplished via free radical polymerization, where an interpenetrating polymeric network is formed. Advantageously, UV absorbers can also be present in certain adhesive compositions.",
        "Embodiments of the invention can be optically transmissive in both the cured and uncured state. The compositions can therefore be particularly useful in bonding applications that require optical clarity as well as sufficient bond strength. Compositions of the invention can also be used in bonding substrates that are exposed to elevated temperatures and moisture. Thus, exemplary compositions can be used to laminate out-gassing substrates such as acrylic or polycarbonate sheets, where resultant laminates can exhibit resistance to bubbles, delamination, haze and whitening.",
        "In one aspect, an adhesive composition includes an acrylate copolymer; acrylated oligomers and an initiator that initiates free radical polymerization. The acrylated oligomers component can comprise a mono-acrylate oligomer, and a multi-acrylate oligomer having 2 to 5 acrylate functionalities per molecule. The blend of all components provide a pressure sensitive adhesive that can be cured, such as by UV irradiation, to form at least a semi-interpenetrating polymer network (IPN) having an average molecular weight between crosslinks (Mc) greater than about 3000. The cured adhesive can exhibit a peel strength greater than about 40 N/dm, as tested according to test methods described herein.",
        "In another aspect, an adhesive composition is provided that includes an acrylate copolymer; acrylated oligomers; a photoinitiator that initiates free radical polymerization; a UV absorber.",
        "In certain aspects, the adhesive is optically transmissive and therefore useful in optical element applications. Thus, in another aspect, the invention provides an optical element that includes at least one optical substrate having a curable pressure sensitive adhesive composition applied thereon and another substrate positioned adjacent to the adhesive. Either one or both of the substrates can be an outgassing material.",
        "In a further aspect, a method of using a curable pressure sensitive adhesive is provided, where the method includes: providing an optical substrate; applying onto a major surface of said optical substrate, an adhesive composition comprising a blended composition of an acrylate copolymer; a mono-acrylate oligomer; a multi-acrylate oligomer having 2 to 5 acrylate functionalities per molecule; and a photoinitiator, the composition having pressure sensitive adhesive characteristics; positioning a second substrate adjacent the optical substrate with the adhesive therebetween; and curing the adhesive using actinic energy to form an interpenetrating polymeric network.",
        "The details of one or more embodiments of the invention are set forth in the accompanying drawings and the description below. Other features, objects, and advantages of the invention will be apparent from the description and drawings, and from the claims.",
        "In embodiments of the invention, a composition is provided that includes an acrylate copolymer, a mono-acrylate oligomer, a multi-acrylate oligomer, and an initiator, such as a photoinitiator. The components, when blended, provide an adhesive that can be applied as a pressure sensitive film or tape. Upon exposure to actinic radiation, the applied blend can then cure to harden to provide a secure, structural bond. The bond can be optically clear, therefore making the adhesive composition useful in optical products (e.g. glazings, laminates, elements, and the like).",
        "The acrylate copolymer is generally a prepolymerized component, that in certain embodiments, exhibits PSA characteristics. A wide variety of acrylate copolymers can be used and are known in the polymer and adhesive arts, as are methods of preparing the monomers and polymers. Acrylate copolymers are generally prepared by polymerizing (meth)acrylate monomers, e.g., polymers prepared from one or more (meth)acrylate monomers, optionally with any one or more of a variety of other useful monomers; where “(meth)acrylate” monomer is used to refer collectively to acrylate and methacrylate monomers. The copolymers can be present in combination with other, non-(meth)acrylate, e.g., vinyl-unsaturated, monomers. Suitable acrylate copolymers include, but are not limited to, isooctyl acrylate/methyl acrylate/acrylic acid (IOA/MA/AA) and isooctyl acrylate/acrylic acid (IOA/AA). The acrylate copolymers can include optional crosslinkers such as, for example, bis-aziridine or multi-functional isocyanates. Specific examples of acrylate copolymers useful according to the invention include those prepared from free radically polymerizable acrylate monomers or oligomers such as described in U.S. Pat. No. 5,252,694 at col. 5, lines 35-68.",
        "Examples of useful monomers for the acrylate copolymer include, but not exclusively, the following classes:",
        "Class A—acrylic acid esters of an alkyl alcohol (preferably a non-tertiary alcohol), the alcohol containing from 1 to 14 (preferably from 4 to 14) carbon atoms and include, for example, methyl acrylate, ethyl acrylate, n-butyl acrylate, t-butyl acrylate, hexyl acrylate, isooctyl acrylate, 2-ethylhexyl acrylate, isononyl acrylate, isobornyl acrylate, phenoxyethyl acrylate, decyl acrylate, and dodecyl acrylate;",
        "Class B—methacrylic acid esters of an alkyl alcohol (preferably a non-tertiary alcohol), the alcohol containing from 1 to 14 (preferably from 4 to 14) carbon atoms and include, for example, methyl methacrylate, ethyl methacrylate, n-propyl methacrylate, n-butyl methacrylate, isobutyl methacrylate and t-butyl methacrylate;",
        "Class C—(meth)acrylic acid monoesters of polyhydroxy alkyl alcohols such as 1,2-ethanediol, 1,2-propanediol, 1,3-propane diol, the various butyl diols, the various hexanediols, glycerol, such that the resulting esters are referred to as hydroxyalkyl (meth)acrylates;",
        "Class D—multifunctional (meth)acrylate esters such as 1,4-butanediol diacrylate, 1,6-hexanediol diacrylate, glycerol diacrylate, glycerol triacrylate, and neopentyl glycol diacrylate although these monomers are generally not preferred for reactive extrusion or melt blending;",
        "Class E—macromeric (meth)acrylates such as (meth)acrylate-terminated styrene oligomers and (meth)acrylate-terminated polyethers, such as are described in PCT Patent Application WO 84/03837 and European Patent Application EP 140941;",
        "Class F—(meth)acrylic acids and their salts with alkali metals, including, for example, lithium, sodium, and potassium, and their salts with alkaline earth metals, including, for example, magnesium, calcium, strontium, and barium.",
        "As used herein and in the claims, a “mono-acrylate oligomer” is defined as an oligomer having only one acrylate functional group. The mono-acrylate can provide the backbone for the polymer which forms upon blending it with an acrylate copolymer and a multi-acrylate oligomer as described herein. A “multi-acrylate oligomer,” as used herein and in the claims, is intended to signify an oligomer having at least two acrylate functional groups. The acrylate functionalities can be terminal groups, or they can be grafted onto a site within the oligomer chain. Upon blending with the other components of the composition, the multi-acrylate oligomer provides the crosslinks or branches needed to form a network with the mono-acrylate oligomer backbone.",
        "The mono-acrylate and multi-acrylate oligomers are chosen and provided in amounts such that the adhesive composition can have a desirable balance of cohesive and adhesion strength. In some embodiments, the oligomers are present in amounts to balance such characteristics with optical clarity and heat/humidity stability as well. The oligomers can be present in sufficient amounts relative to each other so that the composition can achieve and maintain that balance. Insufficient amounts of multi-acrylate oligomer, for example, can result in a lack of cohesive strength. If an excessive amount of multi-acrylate oligomer is used relative to the mono-acrylate concentration, a resultant composition may have too much crosslinking, (e.g. an average molecular weight between crosslinks, Mc, that is too low), which can consequently have detrimental effects on the adhesion strength of the composition. Exemplary adhesive compositions according to the invention can have a Mc value greater than about 3000. Depending on the ratio of the amounts of oligomers, and the number of acrylate functionalities in the multi-acrylate oligomer (and thereby the molecular weights of the components), certain adhesive compositions can form a semi-IPN having an Mc value greater than about 5000.",
        "Compositions according to the invention can have greater amounts of mono-acrylate oligomer than multi-acrylate oligomer. This aids in providing an optically clear and stable cured adhesive. In certain compositions, the ratio of the amounts of mono-acrylate oligomer to multi-acrylate oligomer is about 1:1. It is contemplated that the ratio of mono- to multi-acrylate oligomer can be 3:1, and can also be up to about 6:1. This ratio can, of course, be adjusted depending on the molecular weight (and extent of acrylate functionalities) of the acrylated oligomers.",
        "Selection of the acrylate-functionalized oligomers can be based on desired performance criteria or characteristics of a resulting adhesive composition. In one aspect, it can be desired that the composition have pressure sensitive adhesive characteristics for ease of application onto substrates, as well as removability when necessary. In another aspect, however, heat and humidity stability can be particularly desirable characteristics for the adhesive when it is applied to substrates ultimately used for laminates intended for outdoor use or in other environments having elevated temperatures and/or high humidity. Cohesive and adhesive strength of a cured adhesive composition can therefore be modified, depending on the resulting interpenetrating polymeric network that is achieved by selection of the oligomers.",
        "Suitable mono- and multi-acrylate oligomers for compositions of the invention can have a glass transition temperature (Tg) of less than about 20° C. The acrylate functionalized oligomers useful in the adhesive composition can be represented by structure (I) below:",
        "where R1 is H or CH3;",
        "R2 is (CH2)m, where m is 0-6;",
        "X is an n-valent radical group such as a polyol linkage or an alkyl group; and\n\nn is greater than or equal to 1.",
        "For structure (I), wherein n is equal to 1, a mono-acrylate oligomer is provided. When n is greater than 1, a multi-acrylate oligomer is provided. In certain embodiments of the invention, oligomers are utilized having n being from 1 to 6. Exemplary compositions include a multi-acrylate oligomer comprising from 2 to about 5 acrylate functionalities per molecule. In an aspect of the invention, the adhesive composition has a mono-acrylate oligomer (n=1) in combination with a diacrylate oligomer (n=2).",
        "In an exemplary composition, the acrylate functionalized oligomers can be urethane diacrylate oligomers (where Z in structure (I) is —COO, and n=2), represented by structure (II) below:",
        "These oligomers can have a polyol linkage in structure (II) (or “X” as indicated in structure (I) above) that includes, for example, a methane moiety, a carbonate moiety, an ester moiety, or an ether moiety. A polyester polyol can be formed by reacting a polybasic acid (e.g., terephthalic acid or maleic acid) with a polyhydric alcohol (e.g., ethylene glycol or 1,6-hexanediol). A polyether polyol useful for making the acrylate functionalized urethane oligomer can be chosen from, for example, polyethylene glycol, polypropylene glycol, poly(tetrahydrofuran), poly(2-methyl-tetrahydrofuran), poly(3-methyltetrahydrofuran) and the like. Alternatively, the polyol linkage of an acrylated urethane oligomer (structure (II)) can be a polycarbonate polyol.",
        "Acrylate functionalized urethane oligomers can be synthesized, for example, by reacting a diisocyanate or other polyvalent isocyanate compound with a polyvalent radical polyol to yield an isocyanate terminated urethane prepolymer. Subsequently, acrylates or methacrylates having a hydroxyl group can then be reacted with the terminal isocyanate groups of the prepolymer. Both aromatic and aliphatic isocyanates can be used to react with the urethane to obtain the oligomer. Examples of diisocyanates useful for making the acrylated oligomers are 2,4-tolylene diisocyanate, 2,6-tolylene diiscyanate, 1,3-xylylene diisocyanate, 1,4-xylylene diisocyanate, 1,6-hexane diisocyanate, isophorone diisocyanate and the like. Examples of hydroxy terminated acrylates useful for making the acrylated oligomers include, but are not limited to, 2-hydroxyethyl (meth)acrylate, 2-hydroxypropyl (meth)acrylate, 4-hydroxybutyl acrylate, polyethylene glycol (meth)acrylate and the like. A urethane mono-acrylate oligomer comprises one acrylate group and at least one urethane group. Mono-acrylate oligomers can be provided using commercially available urethane-acrylate oligomers, including, for example, GENOMER 1122 (Rahn USA Corp.; Aurora, Ill.) and EBECRYL CL 1039 (UCB Chemicals; Smyrna, Ga.). A urethane multi-acrylate oligomer can be, for example, any urethane oligomer having at least two acrylate functionalities, and in an aspect, less than about six functionalities. Suitable urethane multi-acrylate oligomers are also commercially available such as, for example, CN962, CN964, CN965, CN934, and CN 972 from Sartomer Co. (Exton, Pa.) and ACTILANE 130, 170, 270, and 290 from Akzo Nobel Resins (Baxley, Ga.) and GENOMER 4269 from Rahn USA Corp. (Aurora, Ill.) and EBECRYL 230, 270, 8803, 4827, and 6700 from UCB Chemicals (Smyrna, Ga.).",
        "Alternatively, the acrylate functionalized oligomers can be polyester acrylate oligomers, acrylated acrylic oligomers, or polyether acrylate oligomers. Suitable acrylate oligomers include, for example, commercially available products such as CN131, an aromatic monoacrylate, and CN132, and aliphatic diacrylate, both of which are available from Sartomer Co. (Exton, Pa.). Useful polyester acrylated oligomers include CN292, CN2200, and CN2255 from Sartomer Co. (Exton, Pa.) and EBECRYL 81, 83, 450, and 2047 from UCB Chemicals (Smyrna, Ga.). Suitable polyether acrylated oligomers include GENOMER 3497, commercially available from Rahn USA Corp. (Aurora, Ill.) and CN550 from Sartomer Co. (Exton, Pa.).",
        "The acrylate copolymers and the acrylated oligomers can be included in an adhesive composition according to the invention in any relative amounts that, in combination with the free radical initiator and other optional components if present, can result in a useful balance of adhesive properties (e.g., clarity, optionally, PSA characteristics, peel strength, heat & humidity stability) in both the uncured and cured states. Particularly useful characteristics are, among others, the optical clarity and heat/humidity stability the adhesive can exhibit. For the acrylate copolymer, an amount can be included that provides the functional properties of a pressure sensitive adhesive, as described herein and understood in the art.",
        "In embodiments of the invention, the mono-acrylate and multi-acrylate oligomers are present in amounts relative to that of the acrylate copolymer and the total weight of the composition, that provides a desired combination of pressure sensitive adhesive properties, structural bond properties, optical clarity, and stability of these properties over time. In accordance with certain embodiments of the invention, the acrylated oligomers can be present in the adhesive composition at about 20 to about 60 wt. percent of the total adhesive composition.",
        "At least one free radical initiator is included in the adhesive composition of the invention to initiate the polymerization, and thereby form a structural bond. Free radical initiators, such as photoinitiators that are useful for reacting or polymerizing acrylate materials are well understood, as are their use and the amounts to be included in an adhesive as described herein. Exemplary free radical photoinitiators useful for polymerizing the acrylated oligomers include the benzoin ethers, such as benzoin methyl ether or benzoin isopropyl ether, substituted benzoin ethers, such as anisoin methyl ether, substituted acetophenones, such as 2,2-diethoxyacetophenone and 2,2-dimethoxy-2-phenylacetophenone, substituted alpha-ketols, such as 2-methyl-2-hydroxyproplophenone, aromatic sulfonyl chlorides, such as 2-naphthalene-sulfonyl chloride, and photoactive oximes, such as 1-phenyl-1,2-propanedione-2(O-ethoxycarbonyl)oxime. Suitable free radical photoinitiators for use in the compositions of the invention, include, but are not limited to, commercially available compounds such as Irgacure 651 and 819 (CIBA Specialty Chemicals Corp.; Tarrytown, N.J.).",
        "The amount of free radical initiator can be sufficient to cause polymerization of the adhesive composition and form a semi-interpenetrating polymer network. In an aspect, the amount of initiator can be in the range from a number about 0.01 to about 15 parts by weight free radical initiator for one hundred parts by weight total adhesive composition, with the range from about 0.1 to about 5 parts by weight being preferred.",
        "Optional components that can be included in adhesive compositions of the invention include, for example, photosensitizers, grafting agents, crosslinkers, tackifiers, reinforcing agents, and other modifiers (e.g. plasticizers). Photosensitizers can be used to alter the wavelength sensitivity of a photoinitiator. A grafting agent can be used to cause inter-reaction of the acrylate copolymer and the acrylated oligomers. For example, a grafting agent such as 4-Acryloxy Benzophenone (ABP) can generate free radicals on the acrylate copolymer, which can then react with (meth)acrylate groups.",
        "A crosslinker can be included in the adhesive in a useful amount that may improve properties of the adhesive, such as by crosslinking the acrylate copolymer. Such amounts are generally known in the art and will be understood by skilled artisans. Exemplary amounts of crosslinker can be in the range from about 0 to about 10 percent by weight, with preferred amounts being in the range from about 0.1 to about 5 percent by weight Amounts outside of this range can also be useful, with a particular amount of crosslinker for any adhesive composition depending on a number of various factors including the chemistry of the crosslinker, the chemistry of the acrylate copolymer and acrylated oligomers, and the desired properties of the cured and uncured adhesive. Exemplary classes of useful crosslinkers are bis-aziridines and multi-functional isocyanates.",
        "Optionally, and advantageously, embodiments of the invention can include a hindered amine light stabilizer (HALS). Adding such a stabilizer advantageously does not detract from the adhesive's ability to be both pressure sensitive and curable, nor does it detrimentally affect the optical clarity. Suitable hindered amine stabilizer compounds have been described in U.S. Pat. Nos. 5,668,198; 5,668,199; 5,679,794; 6,166,212; and 6,465,645. A commercially available compound, TINUVIN 123 (CIBA Specialty Chemicals Corp; Tarrytown, N.J.).",
        "A UV absorbing component can optionally be included in the adhesive composition of the invention. Such a component can aid the adhesive, and thereby any product made using the adhesive, to provide UV-resistance, particularly radiation in the UV-A range, of less than about 410 nm. Suitable UV absorbers include, but are not limited to a benzotriazole, such as TINUVIN 928 (CIBA Specialty Chemicals Corp; Tarrytown, N.J.), a triazine, such as TINUVIN 1577 (CIBA Specialty Chemicals Corp; Tarrytown, N.J. ), a benzophenone, such as UVINUL 3039 (BASF; Ludwigshafen, Germany), a benzoxazinone, such as UV-3638 (Cytec; Charlotte, N.C.), and/or an oxalanilide. Embodiments according to the invention exhibit properties that are characteristic of pressure sensitive adhesive compositions upon application, but before final cure into an IPN. Pressure sensitive adhesive (PSA) compositions are well known to those skilled in the art to possess properties that include: (a) aggressive and permanent tack; (b) adherence with no more than finger pressure; (c) sufficient ability to hold onto an adherend; and (d) sufficient cohesive strength. Certain PSAs can also be removed cleanly from its original target substrate. Materials that have been found to function well as PSAs include polymers designed and formulated to exhibit the requisite viscoelastic properties resulting in a desired balance of tack, peel adhesion and shear holding power. In accordance with embodiments of the invention, blending the acrylate copolymer, the monoacrylate oligomer, and the multi-acrylate oligomer can provide an adhesive composition that exhibits pressure sensitive characteristics.",
        "Upon curing a composition according to the invention with any actinic or other radiation, a semi-interpenetrating polymer network (IPN) can be formed. A semi-IPN is a network having only one crosslinked network; whereas a full IPN can have at least two crosslinked networks. In aspects according to the invention, the semi-IPN comprises a network of crosslinked oligomers. Optionally, but only to the extent that performance characteristics are not compromised, a second network of crosslinked acrylate copolymers can be present. This second network, therefore characterizes the cured adhesive as a full-IPN.",
        "Certain adhesive compositions according to the invention can be optically transmissive, (e.g., optically clear) in one or both of its uncured and cured state. Optical clarity allows the adhesive to be used in preparing optical elements, such as glazings (e.g. windows, windshields), computer monitor displays, CRTs, anti-reflective films, polarizers and the like. In embodiments of the invention, an adhesive composition can maintain its optical transmissivity (e.g. clarity) for a useful period of time under generally normal use conditions as well as in prolonged exposure to normal and extreme conditions. A balance of desired characteristics such as clarity, stability, bond strength, and integrity, can be achieved in an adhesive composition of the invention by modifying the selection of components or ingredients included in the adhesive, including, for example, the multi-acrylate oligomer (and its consitutent monomers), the mono-acrylate oligomer, the acrylate copolymer and the free radical initiator. Additional but optional components can be included to balance the performance characteristics, as will be appreciated, including, for example, crosslinkers, grafting agents, photosensitizers, etc., in amounts that will balance and improve properties of the adhesive.",
        "The adhesive compositions can exhibit desirable levels of optical clarity. Optical clarity can be measured in various ways, including a test described in ASTM D 1003-95. Exemplary adhesive compositions of the invention, when tested uncured using such test can exhibit a luminous transmission greater than about 90%, haze of less than about 2%, and opacity of less than about 1%. Upon curing, the optical clarity of certain cured adhesives, tested under similar conditions, exhibit similar optical clarity.",
        "When an exemplary adhesive according to the invention is used to produce optical laminates, products can be stable at 90° C. when tested dry, and stable at 60° C. with 90% relative humidity (RH) for at least one week. Certain formulations can be stable at 80° C. with 90% RH for at least one week. As used herein “stable” is indicative of an uncompromised bond established by the secure structural bond formed by the cured adhesive.",
        "Cured adhesive compositions according to the invention can exhibit “permanent” adhesion to a substrate. In embodiments of the invention, a cured adhesive exhibits a peel strength of greater than about 40 N/dm, when measured using tests described in the test methods below. Greater strengths can also be achieved by modifying components and their respective concentrations, for example, peel strengths greater than about 50 N/dm or peel strengths greater than about 60 N/dm.",
        "The adhesives of the invention can be used, for example, to bond a variety of substrate materials, including, but not limited to, polymeric materials (e.g. polyesters), substantially rigid materials (e.g., some polycarbonates and acrylics), polymethyl methacrylate, flexible films (e.g. IR reflecting films, MLOFs), brightness-enhancing films, glass, and polarizer films. Many of these materials, particularly those that exhibit optical clarity or light transmissivity are often used to make optical products, such as glazings, photosensors, mirrors, polarizers, security films etc. (hereinafter, materials used for making optical products are referred to as “optical substrates”). Advantageously, because embodiments of the invention can exhibit good optical clarity, the adhesive compositions are particularly useful in bonding a variety of optical components, optical elements, and optical products.",
        "Optical elements include articles and products that have an optical effect or optical application, such as screens for computers or other displays; components of such screens such as polarizing layers, reflective layers, and anti-reflective layers, selectively reflective layers such as infra-red reflecting optically clear layers; coatings or films for windows which may polarize or reflect; other partially or fully reflective optically transmissive products, etc. Often, optical elements include one or more different layers of optical substrates typically layers or films that are at least partially optically transmissive, reflective, polarizing, or optically clear. An adhesive is used to bond the layers together. Optical substrates can include a variety of different materials, including, for example, polymer, glass, metal or metallized polymer, or combinations thereof. Representative examples of polymers include polycarbonate, polyester, polyurethane, polyacrylate, polyvinyl alcohol, polyethylene, polyvinyl chloride, cellulose triacetate and combinations thereof. Any one or more of these materials may also provide an intended physical property including flexibility, rigidity, strength, or support, reflectivity, antireflectivity, polarization, transmissivity (e.g. selective with respect to different wavelengths), etc.",
        "Characteristic of certain optical substrates, however, is a phenomenon referred to in the art as “outgassing” or “out-gas releasing.” For example, rigid layers such as polycarbonates, polyacrylates, polyesters, etc. tend to be outgassing, particularly when they are provided as relatively thick components (e.g., in the range of millimeters or centimeters, as opposed to smaller dimensions). Examples of outgassing materials include polycarbonates and polyacrylates such as polymethyl methacrylate, having a thickness in the range from about one or three millimeters. Outgassing materials can adversely affect the stability, clarity, bond strength, or other performance properties of an adhesive. Bonding layers that include at least one outgassing substrate to produce, for example, optical laminates, can pose challenges in finding a compatible yet stable and strong adhesive. Applying an incompatible adhesive to an outgassing material can result in defects such as bubbles or partial to full delamination at the adhesive bond between the outgassing material and another layer. This can occur particularly when the opposing or adjacent layer (to the outgassing material) exhibits low vapor transmissivity, such that any released gas is inhibited or prohibited from passing through. The low vapor transmissive material can act as a barrier to the gas, resulting in the gas collecting at the adhesive interface and causing bubbling, delamination, reduced bond strength, or loss of clarity. Advantageously, adhesive compositions of the invention can be used in these and other applications. Embodiments of the invention offer improved bond strength and stability and can therefore reduce or eliminate such bubbling or delamination even where the adhesive is used to bond an outgassing layer to a low moisture vapor transmissive layer.",
        "The threshold level of moisture vapor transmissivity that can cause adhesive bonds to be compromised can depend on various factors such as the composition of the outgassing material, the amount of gas it produces, conditions of use, and the composition and overall strength, integrity, and stability of an adhesive. In an aspect, films that have a moisture vapor transmission rate of about 30 grams per (meter squared×24 hours) or less can be considered a low moisture vapor transmissive material (as measured by ASTM E96-80). However, determining whether or not such a material will cause an unstable adhesive bond, bubbling, delamination, or loss of clarity, will depend on factors such as the adhesive composition and the adjacent substrate to which it is bonded. Examples of low moisture vapor transmission rate films include metallized films used for their antireflective or conductive properties (for example for EMI shielding) in optical elements. Metallized films include films such as polyethylene terephthalate (PET) or other polymeric materials that include a surface that is partially or fully coated with a metal or metallic material. One such polyethylene terephthalate film, is ICI 617, a 127 μm thick film from Imperial Chemical Industries Films (Hopewell, Va.). Other examples of metallized films include multilayer AR (antireflective) film such as described in U.S. Pat. No. 6,277,485 columns 13 and 14; and microlayer films such as those described in U.S. Pat. No. 6,049,419.",
        "Polarizers, generally known to be heat and humidity sensitive materials, can also be bonded using an adhesive composition of the invention. These materials, such as one often referred to industry as a “KE polarizer” are often provided as very thin films. Due to their thinness, these films can shrink when exposed to a certain minimum temperature and humidity. By applying and curing an adhesive composition of the invention, a resultant IPN is thereby provided to offer strength to the film.",
        "The invention further relates to methods of using the curable PSA adhesives. The curable adhesive compositions may be applied by any conventional application method, including but not limited to gravure coating, curtain coating, slot coating, spin coating, screen coating, transfer coating, brush or roller coating, and the like. The thickness of a coated adhesive layer, (sometimes provided in liquid form), prior to curing, can be any thickness that results in the desired properties, as is well understood in the art. Exemplary thicknesses of an uncured, curable adhesive layer may be in the range from about 0.05 to about 125 micrometers.",
        "The amount of cure time to harden or cure the adhesive can vary, depending on a variety of factors, such as the components present in the adhesive composition, the substrates used, as well as the thickness of the applied layer. Use of a UV irradiation source can significantly lower the cure time necessary to cure adhesives of the invention, compared to, for example, thermal (heat) curing techniques. Thus, practicing a method according to the invention can provide faster manufacturing processes, and can lead to decreased operating costs.",
        "In an aspect, an adhesive composition can be applied onto a surface of a substrate, contacting the curable adhesive with another material, and then curing the adhesive composition. Lamination can be used to contact the two materials, having the adhesive therebetween. Optionally, methods can also include applying the adhesive onto a release liner; drying any solvent in the adhesive; laminating; polymerizing or curing the acrylate oligomers and optionally acrylate copolymers; and any other steps, techniques, or methods known to be used in the preparation of multi-layer articles.",
        "In some optical applications, optical films are laminated onto other optical substrates, and subsequently, portions of the optical films need to be cut and then cleanly removed to make special patterns. Adhesives of the invention can be quite useful in these types of applications, as the adhesives as well as unwanted film portions (e.g. weed) can be cleanly removed in the first stage prior to energy beam cure (e.g. UV irradiation). Once the optical film patterns and designs are set, then energy can subsequently be applied to cure and harden the adhesive, to provide a secure and stable bond.",
        "Preparing the adhesive compositions can be conducted using any of the numerous conventional methods for combining, blending, and optionally reacting (meth)acrylate materials, acrylate copolymers, acrylated oligomers, initiators, and any adjuvants. See for example, U.S. Pat. Nos. 5,252,694, 5,897,727, and 6,180,200. Generally, acrylate copolymer materials such as those described above can be directly combined with the described acrylated oligomers and other components of a curable adhesive composition, including crosslinkers, initiators, etc., in amounts as useful and as described herein. While solventless embodiments are visualized within the scope of this invention, it is contemplated that solvents can be used to prepare embodiments of the adhesive compositions. Representative solvents can be organic, and include acetone, methyl-ethyl-ketone, ethyl acetate, heptane, toluene, cyclopentanone, methyl cellosolve acetate, methylene chloride, nitromethane, methyl formate, gamma-butyrolactone, propylene carbonate, and 1,2-dimethoxyethane (glyme).",
        "If a photoinitiator is used, irradiation sources that provide energy (e.g., light) in the region from 200 to 800 nm can be used to cure embodiments of the adhesive composition. In an aspect, a useful region of light is about 250 to about 700 nm. Suitable sources of radiation to initiate actinic curing include mercury vapor discharge lamps, carbon arcs, quartz halogen lamps, tungsten lamps, xenon lamps, fluorescent lamps, lasers, sunlight, etc. The amount of radiation exposure to effect polymerization can depend on factors such as the identity and concentrations of particular free radically polymerizable oligomers, the thickness of the exposed material, the type of substrate(s), the intensity of the radiation source and the amount of heat associated with the radiation. Alternatively, other sources of energy such as e-beam and gamma ray can be used for curing the adhesive, with or without an added initiator.",
        "These examples are merely for illustrative purposes only and are not meant to be limiting on the scope of the invention. All parts, percentages, ratios, etc. in the examples are by weight unless indicated otherwise.",
        "Table of Abbreviations\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAA\nAcrylic Acid\n\n\nBA\nn-Butyl Acrylate\n\n\nCGL 139\nBenzotriazole UV absorber (CIBA\n\n\n\nSpecialty Chemicals Corp; Tarrytown,\n\n\n\nNJ)\n\n\nCN131\nMono-acrylate oligomer from Sartomer\n\n\n\nwith a Tg of 4° C.\n\n\nCN135\nMono-acrylate oligomer from Sartomer\n\n\n\nwith a Tg of 20° C.\n\n\nCN137\nMono-acrylate oligomer from Sartomer\n\n\n\nwith a Tg of 40° C.\n\n\nCN964\nUrethane diacrylate oligomer from\n\n\n\nSartomer, used as a 33% solution in ethyl\n\n\n\nacetate\n\n\nEBECRYL CL 1039\nUrethane mono-acrylate oligomer (UCB\n\n\n\nChemicals; Smyrna, GA)\n\n\nEtOAc\nEthyl Acetate\n\n\nGlass Microscope Slides\n75 millimeter × 50 millimeter × 1\n\n\n\nmillimeter Corning No. 2947 Microslides\n\n\n\n(Corning Glass Works; Corning, NY)\n\n\nIOA\nIsooctyl acrylate\n\n\nIR Film\nMultilayer IR reflecting film comprises\n\n\n\nalternating layers of PET (A-layer) and\n\n\n\nco-PMMA (B-layer). These layers are\n\n\n\narranged in 6 layer optical repeat units:\n\n\n\n7A, 1B, 1A, 7B, 1A, 1B with 96 such\n\n\n\noptical repeat units for a total of 576\n\n\n\nlayers. This film reflects light in the\n\n\n\ninfrared wave-length region between\n\n\n\nabout 900–1300 nm while allowing light\n\n\n\ntransmission in the visible region between\n\n\n\n380–770 nm.\n\n\nIRGACURE 819\nPhoto curing agent, (CIBA)\n\n\nMA\nMethyl Acrylate\n\n\nMELAK\nMelamine crosslinked polyacrylate primer\n\n\nPF Film\nMulti-layer optical photosensor film of\n\n\n\n96.5 micrometer thickness (3M Co.; St.\n\n\n\nPaul, MN)\n\n\nPC\nSheets of polycarbonate of 3 mm\n\n\n\nthickness (Bayer-Sheffield Plastics Inc.;\n\n\n\nSheffield, MA)\n\n\nPET\nPolyethylene terephthalate\n\n\nPET Film\nICI 617 127 micrometer thick PET film\n\n\n\n(Imperial Chemical Industries Films;\n\n\n\nHopewell, VA)\n\n\nPMMA\nSheets of polymethylmethacrylate of 3 mm\n\n\n\nthickness\n\n\nPSA-l\nA solvent based PSA prepared according\n\n\n\nto conventional radical thermal\n\n\n\npolymerization procedure using the\n\n\n\nmonomers IOA/MA/AA in the ratio\n\n\n\n57.5/35/7.5, used as a 26% solids solution\n\n\n\nin ethyl acetate/toluene.\n\n\nPSA-2\nA solvent based PSA prepared according\n\n\n\nto conventional radical thermal\n\n\n\npolymerization procedure using the\n\n\n\nmonomers IOA/AA in the ratio 81/19,\n\n\n\nused as a 19% solids solution in ethyl\n\n\n\nacetate/toluene.\n\n\nRH\nRelative Humidity\n\n\nT-10 Release Liner\nCP Film T-10 silicone release coating on\n\n\n\n51 micrometer PET film (CP Film;\n\n\n\nMartinsville, VA)\n\n\nT-30 Release Liner\nCP Film T-30 silicone release coating on\n\n\n\n51 micrometer PET film (CP Film;\n\n\n\nMartinsville, VA)\n\n\nTINUVIN 123\nHindered Amine Light Stabilizer (CIBA\n\n\n\nSpecialty Chemicals Corp.; Tarrytown,\n\n\n\nNJ)\n\n\nXlinker\nBis-aziridine crosslinker in 5 wt %\n\n\n\nsolution, described in US Patents Nos.\n\n\n\n5,874,143 column 4, line 49.\n\n\n\n\n\n\n\n\n\nTest Methods\n\nAccelerated Aging Test",
        "Accelerated aging tests were conducted at three different conditions: 90° C.; 60° C./90% RH and 80° C./90% RH. The aging test results are determined by visual observation and reported as either “Pass” if the sample retains its optical clarity and no other defects formed during the aging test, or “Fail” if bubbles are present in the adhesive bond line or if delamination occurred at the adhesive bond line.",
        "Optical Property Measurements",
        "Luminous Transmittance and Haze",
        "The luminous transmittance and haze of all samples were measured by using a TCS Plus Spectrophotometer from BYK-Gardner Inc.; Silver Springs, Md. Haze and opacity values are given for both illuminant C with CIE 2° standard observer (C2°) and illuminant A with CIE 2° standard observer (A2°). Sample preparation details are described in the text.",
        "Opacity Measurement",
        "The same samples used for haze and luminous transmittance measurements were used for opacity measurement. The BYK Gardner TCS Plus Spectrophotometer was used for opacity measurement, with the standard size reflectance port (25 mm) installed, and diffuse reflectance (specular excluded) was measured.",
        "180° Peel Adhesion",
        "This peel adhesion test is similar to the test method described in ASTM D 3330-90. Adhesive laminates with dimensions of 2.54 centimeters by 15 centimeters were adhered to a IMASS slip/peel tester (Model 3M90 or SP-2000, commercially available from Instrumentors Inc., Strongsville, Ohio). The bonded assembly dwelled at room temperature for about one minute and was tested for 180° peel adhesion at a rate of 0.30 meters/minute (12 inches/minute) over a five second data collection time. Two samples were tested; the reported peel adhesion value is an average of the peel adhesion value from each of the two samples.",
        "90° Peel Adhesion",
        "The peel force was measured using an INSTRON tensile tester (commercially available from Instron Corp.; Canton, Mass.) at a peel angle of 90 degrees and a peel rate of 0.30 meters/minute (12 inches/minute).",
        "Adhesive Preparation",
        "In a brown glass reaction vessel was placed IRGACURE 819 and EtOAc in the amounts shown in Table 1. Once dissolved, the remaining components shown in Table 1 were added and the resulting mixture was mixed well to yield an adhesive mixture with 30 weight % acrylated oligomer content.",
        "TABLE 1\n\n\n\n\n\nEx-\n\n\nIRGACURE\n\nEBECRYL\nXlinker\n\n\nam-\nCN964\nEtOAc\n819\nPSA-1\nCL 1039\n(mg,\n\n\nple\n(gram)\n(gram)\n(mg)\n(gram)\n(gram)\nwt %)\n\n\n\n\n\n\n\n1\n1.75\n5\n172\n20\n1.733\n104\n\n\n\n\n\n\n\n\n0.1%\n\n\n2\n1.75\n5\n172\n20\n1.733\n208\n\n\n\n\n\n\n\n\n0.2%\n\n\n3\n1.75\n5\n172\n20\n1.733\n312\n\n\n\n\n\n\n\n\n0.3%\n\n\n4\n1.75\n5\n172\n20\n1.733\n416\n\n\n\n\n\n\n\n\n0.4%\n\n\n\n\n\n\n\n\n\nLaminate Preparation",
        "The adhesive solutions described above were coated onto the MELAK primed side of an IR Film, dried at 70° C. for 10 minutes to yield a 37.5 μm thick dry PSA tape. Samples of this PSA tape were laminated onto Polycarbonate Sheets and PMMA Sheets. After 24 hour dwell, these laminates were irradiated (through the IR Film) with a Fusion UV Curing System at the following conditions for a total UVA (320-390 mn) dose of about 2 J/cm2: Fusion “D” bulb, 300 Watts/Inch, 25 feet/minute, 2 passes. After irradiation, these samples were stored at ambient temperature for at least 24 hours before any aging test was carried out.",
        "Aging Test",
        "The above prepared laminates of IR Film/Adhesive/PC Sheet and IR Film/Adhesive/PMMA Sheet were tested at 90° C. and 60° C./90% RH conditions using the test method described above. Aging tests conducted for 1 week at each of the test conditions resulted in a “PASS” score for all samples of Examples 1-4.",
        "Peel Adhesion",
        "180° peel adhesion testing was carried out using the test method described above on the above prepared laminates. The results are shown in Table 2.",
        "TABLE 2\n\n\n\n\n\n\nAverage 180° Peel of\nAverage 180° Peel of\n\n\n\nIR Film/Adhesive/PMMA\nIR Film/Adhesive/PC\n\n\n\ncured laminate\ncured laminate\n\n\nExample Adhesive\n(N/dm)\nN/dm)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\n80.8\n129.8\n\n\n2\n76.7\n87.6\n\n\n3\n79.6\n81.8\n\n\n4\n120.6\n109.6",
        "The adhesive solution prepared in Example 1 was coated onto the MELAK primed side of an IR Film, dried at 70° C. for 10 minutes to yield a 37.5 μm thick dry PSA tape. This PSA tape was then UV cured (Fusion “D” bulb, 300 Watts/Inch, 25 feet/minute, 2 passes), and heat laminated onto PMMA Sheets using the following procedure: place both PSA tape and PMMA Sheets in a 85° C. oven for two minutes, and then hand laminate PSA tape onto PMMA sheets with a rubber roller. After 24 hours dwell, these laminates passed 1-week aging test at 90° C. and 60° C./90% RH conditions.",
        "Adhesive Preparation",
        "In a brown glass reaction vessel were placed the components shown in Table 3 and the resulting mixture was mixed well.",
        "TABLE 3\n\n\n\n\n\n\nWt %\n\n\n\n\n\n\n\nEx-\nacrylate\n\nIRGACURE\nCGL\n\nEBECRYL\n\n\nam-\noligomers\nCN964\n819\n139\nPSA-2\nCL 1039\n\n\nple\n(%)\n(gram)\n(mg)\n(mg)\n(gram)\n(gram)\n\n\n\n\n\n\n\n6\n35\n2.12\n172\n160\n27.37\n2.1\n\n\n7\n40\n2.62\n172\n173\n27.37\n2.6\n\n\n8\n45\n3.22\n172\n189\n27.37\n3.2\n\n\n9\n50\n3.94\n172\n208\n27.37\n3.9\n\n\n\n\n\n\n\n\n\nLaminate Preparation",
        "Laminates were prepared as described for Examples 1-4.",
        "Aging Test",
        "The above prepared laminates of IR Film/Adhesive/PC Sheet and IR Film/Adhesive/PMMA Sheet were tested at 90° C. and 60° C./90% RH conditions using the test method described above. Aging tests conducted for 42 days at each of the test conditions resulted in a “PASS” score for all samples of Example Adhesives 6-9.",
        "Adhesive Preparation",
        "In a brown glass reaction vessel were placed the components shown in Table 4 and the resulting mixture was mixed well.",
        "TABLE 4\n\n\n\n\n\n\n\n\nCGL\n\n\n\n\n\n\n\n\n139\n\n\n\n\n\nEx-\n\nIRGACURE\n(mg)\n\nEBECRYL\nTINUVIN\n\n\nam-\nCN964\n819\n(wt\nPSA-2\nCL 1039\n123\n\n\nple\n(gram)\n(mg)\n%)\n(gram)\n(gram)\n(mg)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10\n2.63\n172\n173\n27.37\n2.6\n0\n\n\n\n\n\n2%\n\n\n11\n2.63\n172\n346\n27.37\n2.6\n0\n\n\n\n\n\n4%\n\n\n12\n2.63\n172\n519\n27.37\n2.6\n0\n\n\n\n\n\n6%\n\n\n13\n2.63\n172\n173\n27.37\n2.6\n430\n\n\n\n\n\n2%\n\n\n14\n2.63\n172\n346\n27.37\n2.6\n430\n\n\n\n\n\n4%\n\n\n15\n2.63\n172\n519\n27.37\n2.6\n430\n\n\n\n\n\n6%\n\n\n\n\n\n\n\n\n\nLaminate Preparation",
        "Laminates were prepared as described for Examples 1-4.",
        "Aging Test",
        "The above prepared IR Film/Adhesive/PC Sheet and IR Film/Adhesive/PMMA Sheet were tested at 90° C. and 60° C./90% RH conditions using the test method described above. Aging tests conducted for 30 days at each of the test conditions resulted in a “PASS” score for all samples of Examples 10-15.",
        "Adhesive Preparation",
        "In a brown glass reaction vessel were placed the components shown in Table 5 and the resulting mixture was mixed well.",
        "TABLE 5\n\n\n\n\n\n\nWt %\n\nIRGACURE\n\nEBECRYL\n\n\n\nAcrylated\nCN964\n819\nPSA-2\nCL 1039\n\n\nExample\nOligomers\n(gram)\n(mg)\n(gram)\n(gram)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC1\n0\n0\n0\n27.37\n0\n\n\nC2\n10\n0.44\n172\n27.37\n0.43\n\n\nC3\n15\n0.70\n172\n27.37\n0.69\n\n\n16\n20\n0.98\n172\n27.37\n0.98\n\n\n17\n25\n1.31\n172\n27.37\n1.3\n\n\n18\n35\n2.12\n172\n27.37\n2.1\n\n\n19\n40\n2.63\n172\n27.37\n2.6\n\n\n20\n45\n3.22\n172\n27.37\n3.2\n\n\n21\n50\n3.94\n172\n27.37\n3.9\n\n\n\n\n\n\n\n\n\nLaminate Preparation",
        "Laminates were prepared as described for Examples 1-4.",
        "Aging Test",
        "The above prepared IR Film/Adhesive/PC Sheet and IR Film/Adhesive/PMMA Sheet were tested at 90° C. and 60° C./90% RH conditions using the test method described above. The results are presented in Tables 6-8.",
        "TABLE 6\n\n\n\n\n\n\n\nExample Adhesive in IR\nAging Test Conditions\n\n\n\nFilm/Adhesive/PMMA Laminate\n(90° C. for 54 days)\n\n\n\n\n\n\n\n\n\nC2\nFail\n\n\n\nC3\nFail\n\n\n\n16\nPass\n\n\n\n17\nPass",
        "TABLE 7\n\n\n\n\n\nExample Adhesive in IR\nAging Test\nAging Test\n\n\nFilm/Adhesive/PMMA\nConditions (90° C.\nConditions (60° C./\n\n\nLaminate\nfor 34 days)\n90% RH for 34 days)\n\n\n\n\n\n\n\nC1\nFail\nFail\n\n\n18\nPass\nPass\n\n\n19\nPass\nPass\n\n\n20\nPass\nPass\n\n\n21\nPass\nPass",
        "TABLE 8\n\n\n\n\n\nExample Adhesive\nAging Test\nAging Test\n\n\nin IR Film/\nConditions (90° C.\nConditions (60° C./90%\n\n\nAdhesive/PC Laminate\nfor 34 days)\nRH for 34 days)\n\n\n\n\n\n\n\nC1\nFail\nFail\n\n\n18\nPass\nPass\n\n\n19\nPass\nPass\n\n\n20\nPass\nPass\n\n\n21\nPass\nPass",
        "Adhesive Preparation",
        "The components shown in Table 9 were placed in a brown glass reaction vessel and the resulting mixture was mixed well.",
        "TABLE 9\n\n\n\n\n\n\nWt %\n\nIRGACURE\n\nEBECRYL\n\n\n\nacrylated\nCN964\n819\nPSA-2\nCL 1039\n\n\nExample\noligomers\n(gram)\n(mg)\n(gram)\n(gram)\n\n\n\n\n\n\n\n22\n30\n1.75\n172\n27.37\n1.73\n\n\n\n\n\n\n\n\n\nOptical Measurements",
        "Laminates of the adhesive prepared above were prepared as described in Examples 1-4 except Glass Microscope Slides were used instead of PMMA or PC. The optical properties were measured using the test methods described above. The results are shown in Table 10. Reference information for the Glass Microscope Slides, IR Film with MELAK Primer are also included.",
        "TABLE 10\n\n\n\n\n\n\n\nHaze %\nOpacity %\n\n\nSample\nT %\nC2°/A2°\nC2°/A2°\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGlass Microscope Slides\n92.3\n0.5/0.5\n0.3/0.3\n\n\nIR Film/MELAK Primer\n89.5\n0.7/0.7\n0.7/0.7\n\n\nIR Film/Adhesive Example 22/Glass;\n86.1\n1.1/1.1\n0.5/0.5\n\n\nbefore UV treatment\n\n\nIR Film/Adhesive Example 22/Glass;\n88.68\n1.0/1.0\n0.5/0.5\n\n\nafter UV treatment\n\n\n*IR Film/Adhesive Example 22/Glass;\n93.2\nN/A\nN/A\n\n\nbefore UV treatment\n\n\n*IR Film/Adhesive Example 22/Glass;\n96.0\nN/A\nN/A\n\n\nafter UV treatment\n\n\n\n\n\n*samples were measured using glass to calibrate, i.e. T % of glass = 100%.\n\n\n\n\n\n\nLaminate Preparation",
        "Laminates of PF/adhesive/PF were prepared using the procedure described for Examples 1-4 except that PF substrates were used in place of IR Film and PC or PMMA.",
        "Aging Test",
        "The above prepared PF/Adhesive/PF Sheet was tested at 90° C., 60° C./90% RH, and 80° C./90% RH conditions using the test method described above. Aging tests conducted for 30 days at each of the test conditions resulted in a “PASS” score for the Adhesive Example 22.",
        "Peel Adhesion",
        "90° peel adhesion samples were prepared by coating the adhesive onto T-30 Release Liner, drying at 70° C. for 10 minutes, and further laminated with another T-10 Release Liner to yield a transfer PSA of 114 micrometer in PSA thickness. This transfer PSA was laminated onto anodized Aluminum foil backing film, and further laminated onto a glass substrate. The 90° peel testing was carried out using the test method described above. When the laminate was made with zero dwell time prior to light activation, the peel strength was determined to be 70.0 N/dm. When the laminate had been allowed to dwell overnight before light activation, the peel strength as determined to be 105.0 N/dm.",
        "Adhesive Preparation",
        "In a brown glass reaction vessel were placed the components shown in Table 11 and the resulting mixture was mixed well.",
        "TABLE 11\n\n\n\n\n\n\nWt %\n\nIRGACURE\n\n\n\n\n\nacrylated\nCN964\n819\nPSA-2\nCN131\n\n\nExample\noligomers\n(gram)\n(mg)\n(gram)\n(gram)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC4\n10\n0.44\n172\n27.37\n0.43\n\n\n23\n20\n0.98\n172\n27.37\n0.98\n\n\n24\n30\n1.75\n172\n27.37\n1.7\n\n\n25\n40\n2.62\n172\n27.37\n2.6\n\n\n26\n50\n3.94\n172\n27.37\n3.9\n\n\n\n\n\n\n\n\n\nLaminate Preparation",
        "Laminates were prepared as described for Examples 1-4.",
        "Aging Test",
        "The above prepared IR Film/Adhesive/PC Sheet and IR Film/Adhesive/PMMA Sheet were tested at 90° C., 60° C./90% RH, and 80° C./90% RH conditions using the test method described above. The results are presented in Tables 12-13.",
        "TABLE 12\n\n\n\n\n\nExample Adhesive\nAging Test\nAging Test\nAging Test\n\n\nin IR Film/\nConditions\nConditions\nConditions\n\n\nAdhesive/PMMA\n(90° C.\n(60° C./90%\n(80° C./90%\n\n\nLaminate\nfor 30 days)\nRH for 30 days)\nRH for 7 days)\n\n\n\n\n\n\n\nC4\nFail\nFail\nFail\n\n\n23\nPass\nPass\nPass\n\n\n24\nPass\nPass\nPass\n\n\n25\nPass\nPass\nPass\n\n\n26\nPass\nPass\nPass",
        "TABLE 13\n\n\n\n\n\nExample Adhesive\nAging Test\nAging Test\nAging Test\n\n\nin IR Film/\nConditions\nConditions\nConditions\n\n\nAdhesive/PC\n(90° C.\n(60° C./90%\n(80° C./90%\n\n\nLaminate\nfor 30 days)\nRH for 30 days)\nRH for 7 days)\n\n\n\n\n\n\n\nC4\nFail\nFail\nFail\n\n\n23\nPass\nPass\nPass\n\n\n24\nPass\nPass\nPass\n\n\n25\nPass\nPass\nPass\n\n\n26\nPass\nPass\nPass\n\n\n\n\n\n\n\n\n\nOptical Measurements\n\nOptical properties of the laminates of the IR Film/adhesive/PC prepared above were measured using the test methods described above. The results are shown in Table 14.",
        "TABLE 14\n\n\n\n\n\n\nWeight %\n\n\n\n\n\n\nAcrylated\n\nHaze %\nOpacity %\n\n\nExample\nOligomers\nT %*\nC2°/A2°\nC2°/A2°\n\n\n\n\n\n\n\nC4\n10\n97.04\n1.4/1.4\n1.0/1.0\n\n\n23\n20\n97.19\n1.4/1.4\n1.0/1.0\n\n\n24\n30\n95.58\n1.6/1.5\n1.0/1.0\n\n\n25\n40\n91.52\n3.7/3.3\n1.8/1.7\n\n\n26\n50\n87.14\n15.5/14.2\n3.8/3.6\n\n\n\n\n\n*samples were measured using PC to calibrate, i.e. T % of PC = 100%.",
        "Adhesive Preparation",
        "In a brown glass reaction vessel were placed the components shown in Table 15 and the resulting mixture was mixed well.",
        "TABLE 15\n\n\n\n\n\n\nWt %\n\n\n\n\n\n\n\nacrylated\nCN964\nIRGACURE\nPSA-2\nCN135\n\n\nExample\noligomers\n(gram)\n819 (mg)\n(gram)\n(gram)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC5\n10\n0.44\n172\n27.37\n0.43\n\n\nC6\n20\n0.98\n172\n27.37\n0.98\n\n\nC7\n30\n1.75\n172\n27.37\n1.7\n\n\nC8\n40\n2.62\n172\n27.37\n2.6\n\n\nC9\n50\n3.94\n172\n27.37\n3.9\n\n\n\n\n\n\n\n\n\nLaminate Preparation",
        "Laminates were prepared as described for Examples 1-4.",
        "Aging Test",
        "The above prepared IR Film/Adhesive/PC Sheet and IR Film/Adhesive/PMMA Sheet were tested at 90° C., 60° C./90% RH, and 80° C./90% RH conditions using the test method described above. The results are presented in Tables 16-17.",
        "TABLE 16\n\n\n\n\n\nExample Adhesive\nAging Test\nAging Test\nAging Test\n\n\nin IR Film/\nConditions\nConditions\nConditions\n\n\nAdhesive/PMMA\n(90° C.\n(60° C./90%\n(80° C./90%\n\n\nLaminate\nfor 7 days)\nRH for 7 days)\nRH for 7 days)\n\n\n\n\n\n\n\nC5\nFail\nFail\nFail\n\n\nC6\nFail\nFail\nFail\n\n\nC7\nPass\nPass\nFail\n\n\nC8\nPass\nPass\nFail\n\n\nC9\nFail\nPass\nFail",
        "TABLE 17\n\n\n\n\n\nExample Adhesive\nAging Test\nAging Test\nAging Test\n\n\nin IR Film/\nConditions\nConditions\nConditions\n\n\nAdhesive/PC\n(90° C.\n(60° C./90%\n(80° C./90 %\n\n\nLaminate\nfor 7 days)\nRH for 7 days)\nRH for 7 days)\n\n\n\n\n\n\n\nC5\nFail\nFail\nFail\n\n\nC6\nFail\nFail\nFail\n\n\nC7\nFail\nFail\nFail\n\n\nC8\nFail\nFail\nFail\n\n\nC9\nFail\nFail\nFail\n\n\n\n\n\n\n\n\n\nOptical Measurements",
        "Optical properties of the laminates of the IR Film/adhesive/PMMA prepared above were measured using the test methods described above. The results are shown in Table 18.",
        "TABLE 18\n\n\n\n\n\n\nWeight %\n\n\n\n\n\n\nAcrylated\n\nHaze %\nOpacity %\n\n\nExample\noligomers\nT %*\nC2°/A2°\nC2°/A2°\n\n\n\n\n\n\n\nC5\n10\n91.9\n5.4/5.2\n1.8/1.7\n\n\nC6\n20\n88.5\n16.2/15.2\n2.7/2.6\n\n\nC7\n30\n88.9\n38.0/36.1\n4.1/3.9\n\n\nC8\n40\n87.4\n45.8/43.3\n4.5/4.4\n\n\nC9\n50\n78.7\n47.8/46.5\n5.2/5.0\n\n\n\n\n\n*samples were measured using PMMA to calibrate, i.e. T % of PMMA = 100%.",
        "Adhesive Preparation",
        "In a brown glass reaction vessel were placed the components shown in Table 19 and the resulting mixture was mixed well.",
        "TABLE 19\n\n\n\n\n\n\nWt %\n\nIRGACURE\n\n\n\n\n\nAcrylated\nCN964\n819\nPSA-2\nCN137\n\n\nExample\noligomers\n(gram)\n(mg)\n(gram)\n(gram)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nC10\n10\n0.44\n172\n27.37\n0.43\n\n\nC11\n20\n0.98\n172\n27.37\n0.98\n\n\nC12\n30\n1.75\n172\n27.37\n1.7\n\n\nC13\n40\n2.62\n172\n27.37\n2.6\n\n\nC14\n50\n3.94\n172\n27.37\n3.9\n\n\n\n\n\n\n\n\n\nLaminate Preparation",
        "Laminates were prepared as described for Examples 1-4.",
        "Aging Test",
        "The above prepared IR Film/Adhesive/PC Sheet and IR Film/Adhesive/PMMA Sheet were tested at 90° C., 60° C./90% RH, and 80° C./90% RH conditions using the test method described above. The results are presented in Tables 20-21.",
        "TABLE 20\n\n\n\n\n\nExample Adhesive\nAging Test\nAging Test\nAging Test\n\n\nin IR Film/\nConditions\nConditions\nConditions\n\n\nAdhesive/PMMA\n(90° C.\n(60° C./90%\n(80° C./90%\n\n\nLaminate\nfor 7 days)\nRH for 7 days)\nRH for 7 days)\n\n\n\n\n\n\n\nC10\nFail\nFail\nFail\n\n\nC11\nPass\nFail\nFail\n\n\nC12\nPass\nFail\nFail\n\n\nC13\nFail\nFail\nFail\n\n\nC14\nFail\nFail\nFail",
        "TABLE 21\n\n\n\n\n\nExample Adhesive\nAging Test\nAging Test\nAging Test\n\n\nin IR Film/\nConditions\nConditions\nConditions\n\n\nAdhesive/PC\n(90° C.\n(60° C./90%\n(80° C./90%\n\n\nLaminate\nfor 7 days)\nRH for 7 days)\nRH for 7 days)\n\n\n\n\n\n\n\nC10\nFail\nFail\nFail\n\n\nC11\nFail\nFail\nFail\n\n\nC12\nFail\nFail\nFail\n\n\nC13\nFail\nFail\nFail\n\n\nC14\nFail\nFail\nFail\n\n\n\n\n\n\n\n\n\nOptical Measurements",
        "Optical properties of the laminates of the IR Film/adhesive/PMMA prepared above were measured using the test methods described above. The results are shown in Table 22.",
        "TABLE 22\n\n\n\n\n\n\nWeight %\n\n\n\n\n\n\nAcrylated\n\nHaze %\nOpacity %\n\n\nExample\nOligomers\nT %*\nC2°/A2°\nC2°/A2°\n\n\n\n\n\n\n\nC10\n10\n91.6\n10.4/9.7 \n2.3/2.3\n\n\nC11\n20\n90.9\n19.1/18.1\n2.5/2.4\n\n\nC12\n30\n91.5\n29.6/28.1\n3.0/3.0\n\n\nC13\n40\n90.8\n41.4/39.4\n3.7/3.6\n\n\nC14\n50\n88.4\n44.3/42.6\n4.3/4.3\n\n\n\n\n\n*samples were measured using PMMA to calibrate, i.e. T % of PMMA = 100%.",
        "A number of embodiments of the invention have been described. Nevertheless, it will be understood that various modifications may be made without departing from the spirit and scope of the invention. Accordingly, other embodiments are within the scope of the following claims."
    ],
    "citations": [
        "3776805",
        "4152189",
        "4243500",
        "4261649",
        "4488919",
        "5011560",
        "5137055",
        "5151454",
        "5187007",
        "5252694",
        "5360873",
        "5432797",
        "5462797",
        "5475038",
        "5578657",
        "5593759",
        "5612136",
        "5668198",
        "5668199",
        "5679794",
        "5747551",
        "5883148",
        "5895801",
        "5897727",
        "5905099",
        "5955512",
        "5959775",
        "5989778",
        "6017603",
        "6042943",
        "6049419",
        "6166212",
        "6180200",
        "6194317",
        "6277485",
        "6423392",
        "6465645",
        "6523962",
        "6589623",
        "6645617",
        "6764804",
        "2001/0025083",
        "2003/0192638",
        "2004/0105078",
        "2004/0202879",
        "44 29 791",
        "0 777 468",
        "1 142 912",
        "1 375 617",
        "1 375 618",
        "1 550 382",
        "2-178380",
        "6-89462",
        "6-140090",
        "10-1659",
        "10-25453",
        "10-46109",
        "10-140090",
        "WO 84/03837",
        "WO 95/13328",
        "WO 98/36325",
        "WO 99/42536",
        "WO 00/32710",
        "WO 02/06413",
        "WO 02/086623",
        "WO 03/040250",
        "WO 2004/094549"
    ],
    "us_classification": "428345",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "08",
            "subclass": "F",
            "main_group": "2",
            "subgroup": "46"
        }
    ]
}