{
    "title": "Optical beam scanning device and image forming apparatus",
    "abstract": "It is an object of the present invention to provide an optical beam scanning device and an image forming apparatus which suppress displacement of plural images formed by a different photoconductor in a sub-scanning direction by means of a simple structure even if temperature changes. The optical beam scanning device of the present invention has a single light deflecting device, a pre-deflection optical system that allows light beams from a plurality of light sources to enter the light deflecting device, and a post-deflection optical system including a first optical element for imaging reflected light beams from the light deflecting device on surfaces to be scanned for respective light beams. A second optical element, which has a positive or negative power opposite to a power of the first optical element in a sub-scanning direction, is provided in a position of the pre-deflection optical system where the light beams passes commonly and the light beams enter with distance in the sub-scanning direction.",
    "inventors": [
        "Shiraishi"
    ],
    "document_number": "07297936",
    "publication_date": "20071120",
    "assignees": [
        "Kabushiki Kaisha Toshiba",
        "Toshiba Tec Kabushiki Kaisha"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An optical beam scanning device, comprising:",
            "components": [
                {
                    "component": "a single light deflecting device;",
                    "subcomponents": []
                },
                {
                    "component": "a pre-deflection optical system that allows light beams from a plurality of light sources to enter the light deflecting device;",
                    "subcomponents": []
                },
                {
                    "component": "a post-deflection optical system including a first optical element for imaging the reflected light beams from the light deflecting device on a plurality of surfaces to be scanned for the respective light beams; and",
                    "subcomponents": []
                },
                {
                    "component": "a second optical element having a negative power opposite to a power of the first optical element in a sub-scanning direction, the second optical element disposed in the pre-deflection optical system which allows the light beams from the light sources to pass therethrough, and the second optical element configured to separately enter the light beams imaged on the plurality of scanned surfaces from the light sources to enter in the sub-scanning direction at predetermined intervals.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The optical beam scanning device according to claim 1 , further comprising a plurality of third optical elements corresponding to the light sources which are provided between the light sources and the second optical element and give predetermined characteristics to the light beams from the light sources.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The optical beam scanning device according to claim 1 , wherein the second optical element is a lens.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The optical beam scanning device according to claim 1 , wherein the second optical element is a transmitting diffraction grating with non-uniform pitch.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. An optical beam scanning device, comprising:",
            "components": [
                {
                    "component": "a single light deflecting device;",
                    "subcomponents": []
                },
                {
                    "component": "a pre-deflection optical system that allows light beams from a plurality of light sources to enter the light deflecting device; and",
                    "subcomponents": []
                },
                {
                    "component": "a post-deflection optical system including a first optical element for imaging reflecting light beams from the light deflecting device on surfaces to be scanned for respective light beams,",
                    "subcomponents": []
                },
                {
                    "component": "wherein characteristics of components including the light deflecting device, the pre-deflection optical system and the post-deflection optical system are designed so that intervals of the light beams from the light sources on the surfaces to be scanned at the time of developing an optical path reflection by mirrors from a deflecting surface to the surfaces to be scanned become smaller as temperature rises.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The optical beam scanning device according to claim 5 , wherein the pre-deflection optical system has a second optical element having a positive or negative power opposite to a power of the first optical element in the sub-scanning direction in a position where the light beams from the light sources pass commonly and the light beams from the light sources enter the second optical element in the sub-scanning direction at predetermined intervals.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. An image forming apparatus, comprising:",
            "components": [
                {
                    "component": "an optical beam scanning device having a single light deflecting device, a pre-deflection optical system that allows light beams from a plurality of light sources to enter the light deflecting device, and a post-deflection optical system including a first optical element for imaging reflected light beams from the light deflecting device on surfaces to be scanned for respective light beams;",
                    "subcomponents": []
                },
                {
                    "component": "a photoconductor having a surface to be scanned on which a latent image is formed based on the light beams from the light beam scanning device; and",
                    "subcomponents": []
                },
                {
                    "component": "a second optical element disposed in the pre-deflection optical system, where the light beams from the light sources pass commonly and the light beams from the light sources enter the second optical element in a sub-scannning direction at predetermined intervals, and has a negative power opposite to a power of the first optical element in the sub-scanning direction.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. An image forming apparatus, comprising:",
            "components": [
                {
                    "component": "an optical beam scanning device which has a single light deflecting device, a pre-deflection optical system that allows light beams from a plurality of light sources to enter the light deflecting device, and a post-deflection optical system including a first optical element for imaging reflected light beams from the light deflecting device on surfaces to be scanned for respective light beams, and in which characteristics of components of the light deflecting device, the pre-deflection optical system and the post-deflection optical system are designed so that intervals between the light beams from the light sources on the surfaces to be scanned at the time of developing optical path reflection from a deflecting surface to the surfaces to be scanned become smaller as temperature rises; and",
                    "subcomponents": []
                },
                {
                    "component": "a photoconductor having a surface to be scanned on which a latent image is formed based on the light beams from the optical beam scanning device.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "The invention relates to an image forming apparatus such as a laser printer and a digital copying machine, and an optical beam scanning device that can be used in the image forming apparatus.",
        "For example, a color image forming apparatus of plural drum type is constituted so that a plurality of images are created on photoconductor drums, the images are overlapped with one another on a recording medium, and one image is formed. The apparatus utilizes a plurality of image forming sections corresponding to separated color components, and an optical beam scanning device (laser exposing device). The optical beam scanning device provides image data corresponding to the color components, namely, a plurality of laser beams to the image forming sections.",
        "In such a color image forming apparatus, it is necessary to suitably establish a positional relationship of the images on the photoconductor drums, particularly the positional relationship in a sub-scanning direction in order to realize a color image without color shift (color registration error). A lot of optical elements, however, intervene between light sources and the photoconductor drums, and the optical elements are influenced by ambient temperature and humidity, thereby occasionally causing color shift.",
        "In order to suppress the color shift in the sub-scanning direction (displacement between the color component images), the method disclosed in U.S. Pat. No. 6,337,757 is proposed.",
        "In this method, pre-deflection optical systems for respective color components, which are provided between light sources for the color components and a deflector shared by the color components, are provided with a hybrid cylinder lens. The hybrid cylinder lens is composed of a glass cylinder lens having a positive power in the sub-scanning direction through which light beams transmit with eccentricity and tilt, and a plastic cylinder lens having a negative power in the sub-scanning direction. As a result, displacement in the sub-scanning direction due to a change in the ambient temperature is suppressed for each color component.",
        "In the above conventional method, however, the plastic cylinder lens should be provided for each color component (when the color components are yellow, magenta, cyan and black, four plastic cylinder lenses), thereby making the apparatus complicated and expensive.",
        "When the hybrid cylinder lens is moved to an optical axial direction for focus adjustment that focuses the beams on image surfaces (surfaces of the photoconductor drums), the hybrid cylinder lens allows the light beams to transmit with eccentricity and tilt. For this reason, emitting positions on the image surfaces (beam positions) are changed.",
        "It is an object of the present invention to provide an optical beam scanning device and an image forming apparatus that are capable of compensating a shift of beam positions of images in a sub-scanning direction caused by a change in use environment by simple structure and suppressing the displacement between the images.",
        "A first aspect of the invention is an optical beam scanning device including: a single light deflecting device; a pre-deflection optical system that allows light beams from a plurality of light sources to enter the light deflecting device; and a post-deflection optical system including a first optical element for imaging the reflected light beams from the light deflecting device on surfaces to be scanned for the respective light beams, characterized in that a second optical element having a positive or negative power opposite to a power of the first optical element in a sub-scanning direction is provided in a position of the pre-deflection optical system which allows the light beams from the light sources to pass therethrough and allows the light beams from the light sources to enter in the sub-scanning direction with distance.",
        "A second aspect of the invention is an optical beam scanning device characterized by including a plurality of optical elements that are arranged on a housing and give a plurality of scanning lines to a plurality of photoconductor with an internal L, wherein linear expansion coefficients of the housing, a frame for locating the photoconductor and a shaft for driving a belt on which images developed on the photoconductor drums are overlapped are designated by αH, αF and αS, respectively, and when an interval between the beams positions on surfaces to be scanned in a sub-scanning direction at the time of developing an optical path reflection from a deflecting surface to the surfaces to be scanned is designated by BP, characteristics of components are selected so that positions of the beams in the sub-scanning direction are shifted only by −(αH−2×αF+αS)×L+αH×BP per unit temperature.",
        "A third aspect of the invention is an optical beam scanning device characterized by including: a single light deflecting device; a pre-deflection optical system that allows light beams from a plurality of light sources to enter the light deflecting device; and a post-deflection optical system including a first optical element for imaging reflecting light beams from the light deflecting device on surfaces to be scanned for respective light beams, wherein characteristics of components including the light deflecting device, the pre-deflection optical system and the post-deflection optical system are selected so that intervals of the light beams from the light sources on the surfaces to be scanned at the time of developing an optical path reflection from a deflecting surface to the surfaces to be scanned become small when temperature rises.",
        "According to the optical beam scanning device and the image forming apparatus of the present invention, even when ambient environment such as temperature changes, displacement of the images formed by different photoconductor drums in the sub-scanning direction can be suppressed by a simple structure.",
        "FIG. 1 is a schematic sectional view illustrating an image forming apparatus that uses a multi-beam optical scanning device according to an embodiment;",
        "FIG. 2 is a schematic plan view illustrating an arrangement of optical members in the optical beam scanning device incorporated into the image forming apparatus of FIG. 1;",
        "FIG. 3 is a schematic sectional view explaining a state that a reflecting point of a light deflecting device and a center of a post-deflection optical system in a scanning direction are cut in the optical beam scanning device of FIG. 2;",
        "FIGS. 4A and 4B are explanatory diagrams illustrating functions of an environment change compensating optical element 15;",
        "FIG. 5 is an explanatory diagram illustrating a normal state of various parameters influenced by temperature change;",
        "FIG. 6 is an explanatory diagram illustrating an influence of a fluctuation in scanning line positions (laser beam emitting positions);",
        "FIG. 7 is an explanatory diagram illustrating an influence of a fluctuation in positions of photoconductor drums;",
        "FIG. 8 is a chart illustrating curvature, interval, refractive index of respective optical elements, and the like on an optical axis on each surface of the optical elements according to a first concrete example of the embodiment;",
        "FIG. 9 is a chart illustrating eccentricity and tilt amount of the optical elements according to the first concrete example of the embodiment;",
        "FIGS. 10A to 10F are charts illustrating curved surface polynomial coefficient of each surface of each optical element according to the first concrete example of the embodiment;",
        "FIG. 11 is a chart illustrating a paraxial power characteristic of the environment change compensating optical element 15 according to the first concrete example of the embodiment;",
        "FIG. 12 is a chart illustrating a change of the positions when temperature rises by 15° C. according to the first concrete example of the embodiment;",
        "FIG. 13 is a chart illustrating curvature, interval, refractive index of the respective optical elements on the optical axis on the surfaces of the optical elements according to a second concrete example of the embodiment;",
        "FIG. 14 is a chart illustrating eccentricity and tilt amount of the optical elements according to the second concrete example of the embodiment;",
        "FIGS. 15A and 15B are charts illustrating curved surface polynomial coefficient of each surface of each optical element according to the second concrete example of the embodiment;",
        "FIG. 16 is a chart illustrating a paraxial power characteristic of the environment change compensating optical element 15 according to the second concrete example of the embodiment;",
        "FIG. 17 is a chart illustrating a change of the positions when temperature rises by 15° C. according to the second concrete example of the embodiment;",
        "FIG. 18 is a chart illustrating curvature, interval, refractive index of the respective optical elements on the optical axis on the surfaces of the optical elements according to a comparative example of the embodiment;",
        "FIG. 19 is a chart illustrating eccentricity and tilt amount of the optical elements according to the comparative example of the embodiment;",
        "FIG. 20 is a chart illustrating a paraxial power characteristic of the environment change compensating optical element 15 according to the comparative example of the embodiment; and",
        "FIG. 21 is a chart illustrating a change of the positions when temperature rises by 15° C. according to the comparative example of the embodiment.",
        "An optical beam scanning device and an image forming apparatus according to preferable embodiments of the present invention are explained below with reference to the drawings.",
        "The optical beam scanning device and the image forming apparatus according to one embodiment of the present invention will be explained. The optical beam scanning device according to the embodiment is a multi-beam optical scanning device.",
        "FIG. 1 illustrates a color image forming apparatus that uses the multi-beam optical scanning device according to the embodiment. In this kinds of the color image forming apparatus, four sets of four image data in which a color is separated into respective components of yellow (Y), magenta (M), cyan (C) and black (B) (black is for inking), and various devices which form images for the respective color components correspondingly to Y, M, C and B are normally used. For this reason, in the following explanation and the drawings, Y, M, C and B are added to the reference numerals, so that the image data for the respective color components and the devices corresponding to them are identified.",
        "In FIG. 1, an image forming apparatus 100 has first through fourth image forming sections 50Y, 50M, 50C and 50B that form images for separated colors: yellow; magenta; cyan; and black.",
        "The image forming sections 50Y, 50M, 50C and 50B are arranged in series in this order below the optical beam scanning device 1 correspondingly to positions from which laser beams L (Y, M, C and B) corresponding to the images of the color components are emitted via third reflecting mirrors 37Y, 37M and 37C, and first reflecting mirror 33B of a multi-beam optical scanning device 1, mentioned later, with reference to FIGS. 2 and 3.",
        "A transport belt 52, which transports a transfer material (recording medium) to which images formed by the image forming sections 50 (Y, M, C and B) are transferred, is arranged below the respective image forming sections 50 (Y, M, C and B).",
        "The transport belt 52 is bridged between a belt driving roller 56 and a tension roller 54 which rotate to a direction of an arrow by a motor, not shown. The transport belt 52 is rotated at a predetermined speed to a direction where the belt driving roller 56 rotates, and moves straight below the image forming sections 50 (Y, M, C and B).",
        "The image forming sections 50 (Y, M, C and B) have photoconductor drums 58Y, 58M, 58C and 58B having a cylindrical drum shape and are formed rotatively to a clockwise direction in FIG. 1. Electrostatic latent images corresponding to the images are formed on the photoconductor drums 58Y, 58M, 58C and 58B, respectively.",
        "Charging devices 60Y, 60M, 60C and 60B, developing devices 62Y, 62M, 62C and 62B, transfer devices 64Y, 64M, 64C and 64B, cleaners 66Y, 66M, 66C and 66B, and discharging devices 68Y, 68M, 68C and 68B are arranged around the photoconductor drums 58 (Y, M, C and B), respectively, in this order along the rotational direction of the photoconductor drums 58 (Y, M, C and B). The charging devices 60 (Y, M, C and B) apply a predetermined electric potential to the surfaces of the photoconductor drums 58 (Y, M, C and B). The developing devices 62 (Y, M, C and B) supply toner with colors corresponding to the electrostatic latent images formed on the surfaces of the photoconductor drums 58 (Y, M, C and B) so as to develop the images. The transfer devices 64 (Y, M, C and B) are opposed to the photoconductor drums 58 (Y, M, C and B) with the transport belt 52 intervening between the transfer devices 64 and the photoconductor drums 58 (Y, M, C and B), and transfer the toner images on the photoconductor drums 58 (Y, M, C and B) onto the transport belt 52 or a recording medium, namely, a recording paper P transported by means of the transport belt 52. The cleaners 66 (Y, M, C and B) remove residual toner on the photoconductor drums 58 (Y, M, C and B) after the toner images are transferred by the transfer devices 64 (Y, M, C and B). The discharging devices 68 (Y, M, C and B) eliminate residual potential on the photoconductor drums 58 (Y, M, C and B) after the toner images are transferred by the transfer devices 64 (Y, M, C and B).",
        "Beams for writing the latent images onto the photoconductor drums 58 (Y, M, C and B) are one or a plurality of beams in a sub-scanning direction on the photoconductor drums 58 which is (are) guided by mirrors 37Y, 37M, 37C and 33B of the optical beam scanning device 1.",
        "Laser beams LY, LM, LC and LB for the color components (possibly a synthesized beam of plural beams) are emitted onto the surfaces of the photoconductor drums 58 (Y, M, C and B) between the charging devices 60 (Y, M, C and B) and the developing devices 62 (Y, M, C and B) related with the respective color components.",
        "A paper cassette 70, which houses recording media, namely, the paper P onto which the images formed by the image forming sections 50 (Y, M, C and B) are transferred, is arranged below the transport belt 52.",
        "A feed roller 72 is arranged at one end of the paper cassette 70 in a vicinity of the tension roller 54. The feed roller 72 is formed into an approximately half-moon shape, and feeds the paper P housed in the paper cassette 70 one by one from the top.",
        "A resist roller 74 is arranged between the feed roller 72 and the tension roller 54. The resist roller 74 matches a forward end of one piece of paper P taken out from the cassette 70 with a forward end of the toner image formed on the photoconductor drum 58B of the image forming section 50B (black).",
        "An adsorption roller 76 is arranged substantially on an outer periphery of the tension roller 54 via the transport belt 52 between the resist roller 74 and the first image forming section 50Y in a paper running direction in a vicinity of the tension roller 54. The adsorption roller 76 provides predetermined electrostatic adsorptive power to one piece of paper P transported by the resist roller 74 at predetermined timing. An axial line of the adsorption roller 76 is parallel with an axial line of the tension roller 54.",
        "Resist sensors 78 and 80 (since FIG. 1 is a front sectional view, only the backward sensor 80 is shown) are arranged substantially on an outer periphery of the belt driving roller 56 via the transport belt 52 at one end of the transport belt 52 in a vicinity of the belt driving roller 56. The resist sensors 78 and 80 detect a position of the image formed on the transport belt 52 or the paper P transported by the transport belt 52.",
        "A transport belt cleaner 82 is arranged on the transport belt 52 corresponding to the outer periphery of the belt driving roller 56. The transport belt cleaner 82 removes toner or waste of the paper P adhered to the transport belt 52.",
        "A fixing device 84 is arranged in a direction where the paper P transported by the transport belt 52 is separated from the belt driving roller 56 and is further transported. The fixing device 84 fixes the toner image transferred onto the paper P to the paper P.",
        "FIGS. 2 and 3 illustrates detailed structure of the multi-beam optical scanning device to be used in the color image forming apparatus shown in FIG. 1. In FIG. 1, a pre-deflection optical system of the multi-beam optical scanning device is omitted, but FIG. 2 shows the pre-deflection optical system. FIG. 2 illustrates developed reflection by means of reflecting mirrors, mentioned later, that separate the deflected light beams into laser beams for the respective color components.",
        "As shown in FIG. 2, the multi-beam optical scanning device 1 has only one light deflecting device 5 as a deflecting unit that deflects the laser beams emitted from laser elements as light sources towards image surfaces arranged in predetermined positions, namely, predetermined positions of the photoconductive drums 58Y, 58M, 58C and 58B of the four image forming sections 50Y, 50M, 50C and 50B shown in FIG. 1 at a predetermined linear speed. In this specification, a direction where the laser beam is deflected by the light deflecting device 5 is called as a main scanning direction.",
        "The light deflecting device 5 has a polygon mirror 5a where a flat mirror with a plurality of surfaces (for example, eight surfaces) is arranged into a regular polygon shape, and a motor 5b which rotates the polygon mirror 5a at a predetermined speed. The polygon mirror 5a is formed of aluminum, for example. Respective reflecting surfaces of the polygon mirror 5a are realized in such a manner that the polygon mirror 5a is cut along the sub-scanning direction as a surface including the direction where the polygon mirror 5a rotates, namely, the surface perpendicular to the main scanning direction, and a surface protective layer such as SiO2 is deposited on a cut surface.",
        "A post-deflection optical system 30 is provided between the light deflecting device 5 and the image surfaces. The post-deflection optical system 30 has first and second imaging lenses (so-called fθ lenses) 30a and 30b that give a predetermined optical property to the laser beam deflected to the predetermined direction by the reflecting surface of the light deflecting device 5. The first and the second imaging lenses 30a and 30b are designed cooperatively with each other so that the image surfaces and the reflecting points on the polygon mirror surfaces establish a schematically conjugate relationship in sub-scanning direction. As a result, the first and the second imaging lenses 30a and 30b prevent a fluctuation in the sub-scanning position on the image surfaces due to an influence of tilt of the reflecting surfaces in the polygon mirror 5a (tilt between angles and axial lines of the center axis of the reflecting surface). For this reason, a positive power is provided in the sub-scanning direction.",
        "The first and the second imaging lenses 30a and 30b are cooperative with each other so that the image surfaces and the reflecting points on the reflecting surfaces establish the schematically conjugate relationship in order to prevent the fluctuation in the sub-scanning direction on the image surfaces due to the influence of the tilt of the reflecting surfaces of the polygon mirror 5a (tilt between the angles and the axial lines of the reflecting surfaces). For this reason, the first and the second imaging lenses 30a and 30b have the positive power in the sub-scanning direction.",
        "Further, as shown in FIG. 3, the post-deflection optical system 30 has first reflecting mirrors 33Y, 33M, 33C and 33B, second reflecting mirrors 35Y, 35M and 35C, and third reflecting mirrors 37Y, 37M and 37C. The laser beam LB for black component emitted from the second imaging lens 30b of the post-deflection optical system 30 is reflected by the first reflecting mirror 33B so as to be emitted to the photoconductor drum 58B. Laser beams LY, LM and LC for the other color components emitted from the second imaging lens 30b are reflected by the first reflecting mirrors 33Y, 33M and 33C, the second reflecting mirrors 35Y, 35M and 35C, and the third reflecting mirrors 37Y, 37M and 37C, sequentially so as to be emitted to the photoconductor drums 58Y, 58M and 58C.",
        "The optical beam scanning device 1 has four light sources 3Y, 3M, 3C and 3B including one or a plurality of laser elements that emit light beams to be led to the photoconductor drums 58 (Y, M, C and B), respectively. Even when the light sources 3 (Y, M, C and B) emit a plurality of laser beams including the laser elements, the laser beams from the light sources are combined with an interval such that paired laser beams from the laser elements generally become one beam.",
        "Pre-deflection optical systems 7 (Y, M, C and B), which adjust sectional beam spot shapes of the laser beams L (Y, M, C and B) from the light sources 3 (Y, M, C and B) into predetermined shapes, are arranged between the light sources 3 (Y, M, C and B) and the light deflecting device 5.",
        "After predetermined convergence is given to the emanative laser beams L (Y, M, C and B) emitted from the light sources 3 (Y, M, C and B) by finite focal lenses 9 (Y, M, C and B), the sectional beam shapes are adjusted into the predetermined shapes by stops (not shown in FIG. 2). Predetermined convergence is further given to the laser beams L (Y, M, C and B) which pass through the stops only in the sub-scanning direction by glass cylinder lenses 11 (Y, M, C and B). The glass cylinder lenses 11 (Y, M, C and B) are composed of, for example, BK7. The laser beams L (Y, M, C and B), thereafter, are synthesized into approximately one optical path (one in the main scanning direction, but incident angles to the reflecting surface of the light deflecting device 5 or positions are slightly different in the sub-scanning direction) by optical path synthesizing units 13a, 13b, 13c and 13d such as reflecting mirrors or beam splitters. The laser beams L (Y, M, C and B) are guided to the one reflecting surface of the light deflecting unit 5.",
        "The finite focal lenses 9 (Y, M, C and B) are composed of a single lens in which, for example, an UV curing plastic aspherical lens, not shown, is laminated with a spherical glass lens or an aspherical glass lens.",
        "This embodiment is characterized in that an environment change compensating optical element 15 having the function for compensating displacement of the sub-scanning direction due to an environment change (for example, temperature change) is provided onto the common optical path (approximately combined one optical path) for the laser beams L (Y, M, C and B) before reaching the light deflecting device 5. A free-form surface lens formed by plastic such as COP (cycloolefin polymer) or PMMA (polymethyl methacryl) is applied to the environment change compensating optical element 15. The environment change compensating optical element 15 has a negative power at least in a sub-scanning direction.",
        "FIGS. 4A and 4B are conceptual explanatory diagrams of the environment change compensating optical element 15, FIG. 4A is a diagram in the case where the environment change compensating optical element 15 is not provided, and FIG. 4B is a diagram in the case where the environment change compensating optical element 15 is provided. Further, FIGS. 4A and 4B illustrate the optical path in the sub-scanning direction where the reflection on the reflecting surface 5R of the light deflecting device 5 is replaced by transmission surface. In FIGS. 4A and 4B, only the two of four laser beams for the color components (in this case, they are tentatively the laser beams LY and LB) are shown, and the first and the second imaging lenses (fθ lenses) 30a and 30b in the post-deflection optical system 30 are regarded as one lens having the function equivalent to the function in the case where two lenses are synthesized.",
        "When the temperature change is taken into consideration, a glass lens is more preferable than a plastic lens as the lenses applied to the device. The first and the second imaging lenses (fθ lenses) 30a and 30b, however, need to secure sufficient length in the main scanning direction, and thus the plastic lenses are adopted after their weight and cost are taken into consideration.",
        "In the case where the environment change compensating optical element 15 is not provided, the glass cylinder lenses 11Y and 11B are hardly influenced by the temperature change. For this reason, the laser beams LY and LB which pass through the glass cylinder lenses 11Y and 11B are hardly influenced by the temperature change, so as to advance the similar path. When temperature rises, however, the first and the second imaging lenses (fθ lenses) 30a and 30B composed of the plastic lenses are influenced by the state that as the dimension of the members become larger and the refractive index become smaller. As a result, the positive power is reduced, and when the laser beams reach the imaging surfaces (photoconductor drums 58Y and 58B), great displacement occurs in the sub-scanning direction. The paths shown by alternate long and short dash lines in FIG. 4A represent this case.",
        "On the contrary, when the environment change compensating optical element 15 is provided, the laser beams LY and LB which pass through the glass cylinder lenses 11Y and 11B pass through the environment change compensating optical element 15 before they reach the first and the second imaging lenses (fθ lenses) 30a and 30b composed of the plastic lenses. When the plastic lenses having the negative power are adopted as the environment change compensating optical element 15, the environment change compensating optical element 15 functions so as to narrow the intervals between the laser beams on the reflecting surface 5R of the light deflecting device 5 when the temperature rises. That is to say, the environment change compensating optical element 15 functions to an opposite direction to the direction where the first and the second imaging lenses (fθ lenses) 30a and 30b composed of the plastic lenses function when the temperature rises. As a result, it functions so as to narrow emitting positions of the imaging surfaces (photoconductor drums 58Y and 58B) of the laser beams LY and LB. When the power and the incident angle of the environment change compensating optical element 15 are set, an emitting position change amount can be set freely and can be set to be approximately equal before and after the rise of the temperature.",
        "A study is conducted on how to set the necessary compensating function (lens characteristic of the environment change compensating optical element 15) of the environment change compensating optical element 15. It is necessary to understand image shift and color shift due to the environment change (temperature change) of the entire device in order to set the necessary compensating function.",
        "The study is conducted on the case of the two photoconductor drums shown in FIG. 5 (the two photoconductor drums for the yellow and black components are tentatively explained).",
        "The interval between the laser beams LY and LB to the two photoconductor drums 58Y and 58B is designated by L, a radius of the photoconductor drums 58Y and 58B is designated by rd, an angle between an exposing point and a transfer point on the photoconductor drums 58Y and 58B is designated by α, a rotating speed of the photoconductor drums 58Y and 58B is designated by ωd, a shaft radius of the belt driving roller 56 is designated by rs, and an angular velocity of the belt driving roller 56 is designated by ωs. The equation (1) is established at the time of standard, and in order to overlap the images on one place of paper, exposure needs to be carried out with time difference T expressed by the equation (2) being provided between the timing of the writing with the laser beam LY and the timing of the writing with the laser beam LB.\n\nrd×ωd≈rs×ωs=v  (1)\n\nT=L/v  (2)\n\n(a) Influence of fluctuation in the emitting positions of the laser beams",
        "When the standard sate shown in FIG. 5 is changed into a state shown in FIG. 6 that the interval of the laser beams LY and LB shifts only by ΔLH, the time at which the image written by the laser beam LB reaches the transfer point is delayed only by time ΔTH expressed by the equation (3). This means that the image by the laser beam LB shifts to the rear side (the sub-scanning direction: the right side in FIG. 6) only by a distance expressed by the equation (4).\n\nΔTH≈ΔLH/v  (3)\n\nv×ΔTH≈ΔLH  (4)\n\n(b) Influence of fluctuation in the positions of the photoconductor drums",
        "When the standard state shown in FIG. 5 is changed into a state shown in FIG. 7 that the distance between the two photoconductor drums 58Y and 58B is shifted only by ΔLF, the time at which the image written by the laser beam LB reaches the transfer point is delayed only by time ΔTF expressed by the equation (5). This means that the image by the laser beam LB is shifted to the front side (the sub-scanning direction: the left side in FIG. 7) only by a distance expressed by the equation (6). When the distance between the two photoconductor drums 58Y and 58B is changed only by ΔLF, the transfer point of the image with the laser beam LB changes only by ΔLF. Totally, the image by the laser beam LB is shifted to the front side (the sub-scanning direction: the left side in FIG. 7) only by an absolute value expressed by the equation (7). “−” in the equation (7) designates a shift direction, and the shift to the right side is designated by “+”.\n\nΔTF≈−ΔLF/v  (5)\n\nv×ΔTF≈−ΔLF  (6)\n\n−2×ΔLF  (7)\n\n(c) Influence of fluctuation in the shaft radius",
        "When the shaft radius of the belt driving roller 56 becomes large only by Δrs, a linear moving speed (v) of the belt driving roller 56 becomes faster only by Δrs×ωs. For this reason, the advancing distance of the belt (the medium on the belt) for time T becomes large by a value obtained by the equation (8). This means that the image by the laser beamLB is shifted to the rear side (the sub-scanning direction: the right side in FIGS. 6 and 7) only by the value obtained by the equation (8).\n\nΔrs×ωs×T=L×Δrs/rs  (8)",
        "The causes that bring the image shift in the sub-scanning direction are three kinds of fluctuations described in (a) to (c), and when there are two or three of fluctuations at the same time, the image by the laser beam LB is shifted from the standard state by a value obtained by the equation (9) according to the equations (4), (7) and (8).\n\nΔLH−2×ΔLF+L×Δrs/rs  (9)",
        "A synthesized linear expansion coefficient (synthesized thermal expansion coefficient) of a member that houses the optical system such as the optical beam scanning device 1 of the embodiment (hereinafter called housing) is designated by αH, a synthesized linear expansion coefficient (synthesized thermal expansion coefficient) of a member that supports the photoconductor drums 58Y and 58B (hereinafter called a frame) is designated by αF, a synthesized linear expansion coefficient (synthesized thermal expansion coefficient) of the belt driving roller (shaft) 56 is designated by αS, and temperature rise is designated by t. At this time, the three fluctuations ΔLH, ΔLF and Δrs can be expressed by the equations (10) to (12) respectively.\n\nΔLH=αH×L×t  (10)\n\nΔLH=αF×L×t  (11)\n\nΔrs=αS×rs×t  (12)",
        "When the equations (10) and (12) are applied to the equation (9), the equation (13) is obtained. The equation (13) expresses that when the temperature rises by t, the image by the laser beam LB is influenced by the synthesized linear expansion coefficients (synthesized thermal expansion coefficients) of the respective sections so as to be shifted to the rear side (the sub-scanning direction: the right side in FIG. 5) only by the value obtained by the equation (13) from the standard state shown in FIG. 5.\n\nαH×L×t−2×αF×L×t+L×αS×rs×t/rs=(αH−2×αF+αS)×(L×t)=Δ  (13)",
        "According to the equation (13), it is found that when the temperature rises by t, the emitting position of the laser beam LB may be moved from the position before the rise to an opposite direction only by the same amount as the absolute amount Δ expressed by the equation (13) (−Δ). The above explanation is given assuming that only the image by the laser beam LB changes, but both the emitting positions of the laser beams LB and LY change. The equation (13), therefore, expresses that when the temperature rises by t, the pitch between the laser beams LB and LY is changed only by −Δ. That is to say, the emitting positions of the photoconductor drums for the laser beams LB and LY are not fixed but the pitch between the emitting positions of the laser beams LB and LY is relatively moved only by −Δ which is opposite to the amount expressed by the equation (13). As a result, even if the ambient environment changes (particularly the temperature change), a plurality of images are not displaced (precise color registration is maintained).",
        "For simplification of the explanation, the case of the two laser beams LB an LY is explained, but like the above embodiment, the similar function is applied to the case of the four laser beams LY, ML, LC and LB.",
        "Only when the pitch between the beams in the sub-scanning direction expands only by αH×BP×t (here, BP is the gap between the beam positions in the sub-scanning direction on the image surfaces at the time of developing the optical path reflection from the deflecting surface to the image surfaces), the expansion of the optical system housing is just the same as the fluctuation in the gap of the laser beams from the housing.",
        "For this reason, the beam positions of the surfaces to be scanned (corresponding to the surfaces of the photoconductor drums) at the time of developing the reflecting mirrors are shifted only by Δ′ expressed by the equation (13′), occurrence of a shift of color overlapping due to temperature change can be prevented. As a result, an amount of the color shift without registration control can be suppressed, or the time interval of the registration control can be enlarged.\n\n−(αH−2×αF+αS)×(L×t)+αH×BP×t=Δ′  (13′)",
        "The environment change compensating optical element 15, as explained with reference to FIG. 4B, suppresses the displacement in the sub-scanning direction on the surface to be scanned at the time of temperature change, but cannot completely suppress the shift of color overlapping by only setting the displacement of the beams to 0. For this reason, when the temperature rises by t, the characteristic and the shape of the environment change compensating optical element 15 are selected so that the beam positions on the surface to be scanned at the time of developing the reflecting mirrors shift only by −(αH−2×αF+αS)×(L×t)+αH×BP×t. As a result, the occurrence of the shift of color overlapping (error of color registration) due to temperature change can be prevented, and the amount of the color shift (error of color registration) without the registration control is suppressed or the time interval of the registration control can be increased.",
        "In general, since the frame and the shaft are formed by iron materials, and the housing is formed of aluminum or plastic, αH>αF≈αS is established. For this reason, −(αH−2αF+αS)×L<0 is obtained. As a result, when the temperature rises, it is desirable that the increase in the interval in the sub-scanning direction is smaller than αH×BP×t as the optical system.",
        "The optimal optical power arrangement including the environment change compensating optical element 15 is carried out, so that the optical system, which suppress the fluctuation in the beam positions in the sub-scanning direction and reduces temperature dependency of the imaging surfaces in the sub-scanning direction, can be provided.",
        "(A-1) First Concrete Example of the Embodiment",
        "The optical beam scanning device and the image forming apparatus of the above-mentioned embodiment are explained according to the first concrete example.",
        "In the first concrete example, the material of the optical system housing is an aluminum die cast with linear expansion coefficient of αH=2.1×10−5, and the material of the frame for defining the intervals between the photoconductor drums is an aluminum die cast with linear expansion coefficient of αF=2.1×10−5. The material of the transfer belt driving shaft is free-cutting steel with linear expansion coefficient of αS=1.15×10−5, and the interval L between the photoconductor drums (for black and yellow) on both ends is 225 mm.",
        "In the case where temperature rises by 15° C. (t=15), the ideal value Δ′ as a change amount of the distance between the beams on both ends in the sub-scanning direction can obtain 0.032 according to the equation (13′) (this means that when the emitting positions in the sub-scanning direction do not shift at all even if temperature changes, the shift of the color overlapping of 32 μm occurs).",
        "FIGS. 8 to 11 are explanatory diagrams of data about the optical beam scanning device 1 which can realize approximately 32 μm as the change mount Δ′ of the distance between the beams on both the ends in the sub-scanning direction when the temperature rises by 15° C.",
        "FIGS. 8 to 11 illustrate the case where when a diameter of an inscribed circle of the polygon mirror 5a is 40.0 mm, the main scanning direction is a y direction, the sub-scanning direction is a z direction, and the optical axis direction is an x direction (light propagates to “+” in pre-deflection optical system, and propagates to “−” in post-deflection optical system), the rotating center position of the polygon mirror 5a is such that the y direction is 17.2 mm and the z direction is 10.1 mm on a local coordinate system of the reflecting surfaces of the polygon mirror 5a. An definitional equation of the lens surfaces in these drawings is the equation (14), and in this concrete example, ay is 1 and az is 1.",
        "x\n        =\n        \n          \n            \n              \n                cuy\n                ×\n                \n                  y\n                  2\n                \n              \n              +\n              \n                cuz\n                ×\n                \n                  z\n                  2\n                \n              \n            \n            \n              1\n              +\n              \n                \n                  \n                    1\n                    -\n                    ay\n                  \n                \n                ×\n                \n                  cuy\n                  2\n                \n                ×\n                \n                  y\n                  2\n                \n              \n              -\n              \n                az\n                ×\n                \n                  cuz\n                  2\n                \n                ×\n                \n                  z\n                  2\n                \n              \n            \n          \n          +\n          \n            ∑\n            \n              \n            \n            ⁢\n            \n              \n                a\n                lm\n              \n              ×\n              \n                y\n                1\n              \n              ×\n              \n                z\n                m\n              \n            \n          \n        \n      \n    \n    \n      \n        (\n        14\n        )",
        "FIG. 8 illustrates curvature and the interval (TH) on the optical axes on the surfaces of the optical elements, and refractive index of the optical elements. The distances between the adjacent surfaces of the optical elements are common among the laser beams LY (in the drawing, RAY 1, and the same is applied to the other ones), LM (RAY2), LC (RAY3) and LB (RAY4) when the number is written in common row, and are different among the laser beams LY (RAY1), LM (RAY2), LC (RAY3), and LB (RAY4) when the number is written in ray1˜ray4 row. FIG. 8 describes data about the emitting surfaces and thereafter of the finite focal lenses 9Y, 9M, 9C and 9B, and the distances between the finite focal lenses 9Y, 9M, 9C and 9B and the imaging positions are 1159.4 mm, 1106.0 mm, 1136.0 mm and 1202.3 mm, respectively.",
        "FIG. 9 shows eccentricity (shift, de-center) and tilt of the optical elements on the local coordinate system, and the optical elements are arranged with eccentricity and the tilt shown in FIG. 9. In FIGS. 8 and 9, the surface Nos. are the same.",
        "In FIGS. 8 and 9, the surface No. “2” shows a curved surface side of the glass cylinder lenses 11 (Y, M, C and B), and the surface No. “3” shows a plane side. The distance in the surface No. “4” represents a common distance up to the incident surface of the optical elements in the surface No. “5” among the laser beams LY (RAY1), LM (RAY2), LC (RAY3), and LB (RAY4). The distance described on the surface No. “3” represents a difference between the common distance and the actual distance for each laser beam. The surface Nos. “5” and “6” show the incident surface and the emission surface of the beam splitter as the optical path synthesizing unit (13d), respectively.",
        "The surface Nos. “7” and “8” show the incident surface and the emission surface of the plastic lens as the environment change compensating optical element 15. A curved surface polynomial coefficient of the incident surfaces is shown in FIG. 10A, and a curved surface polynomial coefficient of the emission surfaces is shown in FIG. 10B. As is clear from FIGS. 8, 10A and 10B, the environment change compensating optical element 15 has a curved surface in the main scanning direction, and has a negative power in order to compensate temperature characteristic of the post-deflection optical system having the positive power in the main scanning direction. The emitting position shift of the image surfaces due to temperature change which is smaller than that in the sub-scanning direction occurs also in the main scanning direction, and the curved surface in the main direction compensates this shift. FIG. 11 shows a paraxial power of the environment change compensating optical element 15 (plastic lens), and it has a negative power in the sub-scanning direction (and the main scanning direction).",
        "The surface Nos. “9” and “10” show the incident surface and the emission surface of a cover glass (not shown in FIG. 2) which covers the polygon mirror 5a on the pre-deflection side. The surface No. “11” shows the deflection surface, and the surface Nos. “12” and “13” show the incident surface and the emission surface of the cover glass on the post-deflection side.",
        "The surface Nos. “14” and “15” show the incident surface and the emission surface of the plastic lens as the first imaging lens 30a, a curved surface polynomial coefficient of the incident surface is shown in FIG. 10C, and a curved surface polynomial coefficient of the emission surface is shown in FIG. 10D. The surface Nos. “16” and “17” show the incident surface and the emission surface of the plastic lens as the second imaging lens 30b, a curved surface polynomial coefficient of the incident surface is shown in FIG. 10E, and a curved surface polynomial coefficient of the emission surface is shown in FIG. 10F.",
        "The surface No. “18” shows the incident surface of the cover glass (not shown in FIG. 2) with respect to the entire optical beam scanning device 1, and the surface No. “19” shows the emission surface. The distance described in the surface No. “20” shows the common distance up to the image surfaces (the surfaces of the photoconductor drums) among the laser beams LY (RAY1), LM (RAY2), LC (RAY3), and LB (RAY4), and the distance described in the surface No. “19” shows a difference between the common distance and the actual distances for each laser beam.",
        "When the optical beam scanning device 1 of the concrete example is applied, as shown in FIG. 12, the laser beam LY (RAY1; yellow) and the laser beam LB (RAY4; black) move to a direction where they spread 25 μm wider than the housing expansion due to the temperature rise of 15° C. That is to say, the laser beams move to the direction where the registration shift amount of 32 μm when the emitting positions of the laser beams do not move is canceled. For this reason, even if the temperature rises by 15° C., the yellow and black overlapping shifts only by 7 μm.",
        "Similarly, the relationship between the laser beams LM (RAY2; magenta) and LB (RAY4; black) is such that L=75×2=150, and the registration shift amount when the light beams do not move is 22 μm. Since the relative distance between both the laser beams, however, moves 16 μm to the canceling direction, even if temperature rises by 15° C., the magenta and black overlapping shifts only by 6 μm. The relationship between the laser beams LC (RAY3; cyan) and LB (RAY4; black) is such that L=75, and the registration shift amount when the beams do not move is 11 μm. Since the relative distance of both the laser beams, however, moves by 14μ to the canceling direction, even if temperature rises by 15° C., the cyan and black overlapping shifts only by 3 μm.",
        "Further, a defocus change amount in the main scanning direction and the sub-scanning direction is suppressed to not more than 0.3.",
        "(A-2) Second Concrete Example of the Embodiment",
        "The second concrete example of the optical beam scanning device and the image forming apparatus according to the embodiment are explained below.",
        "In the second concrete example, the material of the optical system housing is carbon fiber reinforced polycarbonate resin with linear expansion coefficient of αH=2.25×10−5, and the material of the frame which defines the intervals between the photoconductor drums is cold-rolled steel plate with linear expansion coefficient of αF=1.2×10−5. The material of the transfer belt driving shaft is stainless steel with linear expansion coefficient of αS=1.04×10−5, and the interval L between the photoconductor drums on both ends (for black and yellow) is 225 mm.",
        "In the case where temperature rises by 15° C. (t=15), the ideal value Δ′ as a change amount of the distance between the beams on both ends in the sub-scanning direction can obtain −0.030 according to the equation (13′) (this means that when the emitting positions in the sub-scanning direction do not shift at all even if temperature changes, the shift of the color overlapping of 30 μm occurs).",
        "In the second concrete example, a member which defines heights of the light source (LD), the limited focal lenses and the glass cylinder lenses of the pre-deflection optical system is separated from the housing that holds all the entire optical parts. Concretely, this member is made of a metal matrix composite (ceramic reinforcement is used as a filler so as to be combined with metal matrix). The metal matrix composites with different thickness are sandwiched between the optical housing, the light sources (LD), the limited focal lenses and the glass cylinder lenses, so that the positions in the sub-scanning directions are made to be different.",
        "The post-deflection optical system of the second concrete example is the same as the post-deflection optical system of the first concrete example.",
        "FIGS. 13 to 16 are diagrams corresponding to FIGS. 8 to 11 according to the first concrete example, and show only the pre-deflection optical system.",
        "In the second concrete example, as shown in FIG. 17, when the temperature rises by 15° C., the laser beams LY (RAY1; yellow) and LB (RAY4; black) move to a direction where they become 5 μm smaller than the direction in the case of the housing expansion. That is to say, the beams LY and LB move to the direction where the registration shift amount of 30 μm in the case where the laser beam emitting positions do not move is canceled. For this reason, even when temperature rises by 15° C., the yellow and black overlapping shifts only by 25 μm (this value is large, but when the plastic lens with negative power is not provided to the pre-deflection optical system, as mentioned later, the shift is 114 μm, and thus 25 μm is very smaller than 114 μm).",
        "In the second concrete example, the defocus change amount in the main scanning direction and the sub-scanning direction is suppressed to not more than 0.3.",
        "In the second concrete example, when temperature rises, the intervals of the beams on the surfaces to be scanned can be small.",
        "FIGS. 18 to 20 illustrate data about the optical systems in a comparative example. In the comparative example, the plastic lens is not provided as the environment change compensating optical element 15. The post-deflection optical system in the comparative example is similar to that in the second concrete example.",
        "FIG. 18 is a diagram corresponding to FIG. 13 in the second concrete example, FIG. 19 is a diagram corresponding to FIG. 14 in the second concrete example, and FIG. 20 is a diagram corresponding to FIG. 16 in the second concrete example.",
        "In the comparative example, as shown in FIG. 21, the laser beams LY (RAY1; yellow) and the laser beam LB (RAY4; black) move to the direction where they spread 84 μm when temperature rises by 15° C.",
        "In the combination example of the materials of the housing, the frame member that defines the intervals between the photoconductor drums and the transfer belt driving shaft in the first concrete example, the registration shifts 84 μm with respect to the shift of 32 μm in the case where the laser beam emitting positions do not move. For this reason, when temperature rises by 15° C., the yellow and black overlapping shifts by 52 μm.",
        "In the combination example of the materials of the housing, the frame member that defines the intervals between the photoconductor drums and the transfer belt driving shaft in the second concrete example, the registration shifts by 84 μm to the opposite direction in addition to the registration shift amount of 30 μm in the case where the beams do not move. For this reason, when temperature rises by 15° C., the yellow and black overlapping shifts by 114 μm.",
        "It is clear that the provision of the environment change compensating optical element 15 (plastic lens) can suppress the color overlapping due to the temperature change.",
        "Further, from the comparison between FIGS. 21 and 12 and the comparison between FIGS. 21 and 17, the defocus change amount in the main scanning direction and the sub-scanning direction in the comparative example is larger than that in the first and the second concrete examples.",
        "Even when the beam waist positions in the sub-scanning direction changes due to temperature change in the post-deflection optical system, the environment change compensating optical element 15 (plastic lens) is provided to the pre-deflection optical system, so that the imaging surfaces are shift to the opposite direction to the direction where the shift occurs in the post-deflection optical system and correction can be made. As a result, the shift of the color overlapping in the sub-scanning direction can be suppressed, and the color shift amount without the registration control can be suppressed, or the time intervals of the registration control can be increased.",
        "Not only in the sub-scanning direction but also in the main scanning direction, the environment change compensating optical element 15 (plastic lens) is provided to the pre-deflection optical system, so that the similar effect can be produced in order to prevent defocus due to environment change.",
        "The above embodiment explains the image forming apparatus where maximally four images are overlapped with one another, but the present invention can be applied to an image forming apparatus where the maximum number of images to be overlapped is smaller or larger than four. Further, the color components of the images to be overlapped are not limited to different color components.",
        "The above embodiment explains that all the laser beams are guided onto the one surface of the polygon mirror, but the present invention can be suitably applied to an apparatus which uses the two surfaces of the polygon mirror.",
        "The above embodiment explains the environment change compensating optical element 15 which is the lens (plastic lens as one example) having the negative power, but another kind of optical element having similar incident and emission characteristics may be used. For example, transmitting or reflecting diffraction grating with non-uniform pitch can be used.",
        "Further, the above embodiment explains that the compensating function of the environment change compensating optical element 15 is determined according to the equation (13′), but the equation (13′) does not have to be considered for the compensating function. For example, when the temperature rise in the scanning optical unit is larger than the outside of the unit, as explained with reference to FIG. 4B, the compensating function may be determined so as to have temperature dependency opposite to that of the imaging lenses (first and second imaging lenses). That is to say, the compensating function does not have to be determined taking the linear expansion coefficient of the materials of the optical housing, the frame which defines the intervals between the photoconductor drums, and the transfer belt driving shaft into consideration.",
        "The above embodiment explains the member which compensates the image shift according to the equation (13) is mainly composed of the environment change compensating optical element 15 provided to the position common among the plural laser beams in the pre-deflection optical system. The member, which compensates the image shift obtained by the equation (13) by means of movement of opposite positive or negative amount, may be provided on the optical paths of some of the plural laser beams. For example, the environment change compensating optical element 15 may be provided to positions obtained by synthesizing the two optical paths.",
        "The above embodiment explains that the linear expansion coefficients of three materials of the optical housing, the frame which defines the intervals between the photoconductor drums and the transfer belt driving shaft are taken into consideration, but a number of the materials to be considered may be smaller or larger than three."
    ],
    "citations": [
        "5751462",
        "5774249",
        "5963354",
        "5995268",
        "6055084",
        "6061162",
        "6084699",
        "6104519",
        "6125994",
        "6201625",
        "6219167",
        "6337757",
        "6347003",
        "6392772",
        "6392773",
        "6452709",
        "6683708",
        "6778202",
        "6791729",
        "6903856",
        "6965466",
        "6977762",
        "7002759",
        "2002/0196514",
        "2004/0223048",
        "2005/0024479",
        "2005/0173625",
        "2006/0232660",
        "2007/0030550",
        "2001-201705"
    ],
    "us_classification": "250234",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "J",
            "main_group": "3",
            "subgroup": "14"
        }
    ]
}