{
    "title": "System and method for storing, assembling and transporting a canopy",
    "abstract": "A method for disassembling and packaging the canopy in a container, wherein the length of the container is 25% shorter than the length of each of the upright assemblies. To accommodate the shortened length, the width and/or the height of the container may be increased as necessary to still house all of the components of the canopy. Preferably, the length of the container is sufficiently short to accommodate placing the container in a traditional sedan automobile trunk.",
    "inventors": [
        "Goldwitz"
    ],
    "document_number": "07296584",
    "publication_date": "20071120",
    "assignees": [
        "ShelterLogic LLC"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A canopy kit for storage, transport and assembly, the canopy kit comprising:",
            "components": [
                {
                    "component": "four vertical posts, each vertical post including a first portion operatively connectable to a second portion for erecting such that a length of the four vertical posts can be selectively changed to a reduced length;",
                    "subcomponents": []
                },
                {
                    "component": "three horizontal cross rails, each horizontal cross rail including a first portion removably connectable to a second portion;",
                    "subcomponents": []
                },
                {
                    "component": "four arch cross rails, each arch cross rail including a first portion removably connectable to a second portion;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of frame connectors for connecting the horizontal and arch cross rails to form a frame for a peaked roof, and mounting the frame on the four vertical posts;",
                    "subcomponents": []
                },
                {
                    "component": "a tarp for covering the frame of the peaked roof;",
                    "subcomponents": []
                },
                {
                    "component": "means for attaching the tarp to the frame of the peaked roof; and",
                    "subcomponents": []
                },
                {
                    "component": "an elongated box having a length, a width and a height,",
                    "subcomponents": [
                        "the elongated box length based on the reduced length to be sufficient to house the first and second portions of the vertical posts, horizontal cross rails and arch cross rails, wherein the elongated box length is approximately equal to the reduced length for transport in a car trunk and",
                        "the width and the height being sufficient to house the plurality of frame connectors, the tarp and the means for attaching."
                    ]
                },
                {
                    "component": "the elongated box length based on the reduced length to be sufficient to house the first and second portions of the vertical posts, horizontal cross rails and arch cross rails, wherein the elongated box length is approximately equal to the reduced length for transport in a car trunk and",
                    "subcomponents": []
                },
                {
                    "component": "the width and the height being sufficient to house the plurality of frame connectors, the tarp and the means for attaching.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A canopy kit as recited in claim 1 , wherein the first and second portions of the vertical posts, horizontal cross rails and arch cross rails are approximately 41 inches and the length of the elongated box is approximately 42 inches.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A canopy kit as recited in claim 2 , further comprising a third portion of each of the three horizontal cross rails, the third portion for extending a length of the three horizontal cross rails and removably connectable to the second portion thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A canopy kit as recited in claim 1 , further comprising four base feet connectable to the first portion of the four vertical posts for stabilizing each vertical post and a strip below the tarp for protecting the tarp from the posts, rails, connectors, and means for attaching underneath the strip, wherein the tarp is solely between the strip and the elongated box.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A canopy kit as recited in claim 4 , wherein a canopy assembled from the canopy kit is at least 9 feet wide by at least 9 feet long, wherein the horizontal cross rails are at least 6 feet above the base feet.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A canopy kit as recited in claim 1 , wherein the means for attaching is a ball bungee cord.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A canopy kit as recited in claim 1 , wherein the first portions of the vertical posts, horizontal cross rails and arch cross rails have a smaller neck for insertion with the corresponding second portions of the vertical posts, horizontal cross rails and arch cross rails.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A canopy kit as recited in claim 7 , further comprising means on the second portions of the vertical posts, horizontal cross rails and arch cross rails for engaging a hole formed in the smaller neck of the corresponding first portions of the vertical posts, horizontal cross rails and arch cross rails.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A canopy kit as recited in claim 8 , wherein the means is a push button device.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A canopy kit as recited in claim 1 , wherein the frame connectors include three-way connectors and four-way connectors.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A canopy kit as recited in claim 1 , wherein the length of the elongated box is approximately no more than 75% of a length of the four vertical posts when the vertical posts are assembled.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A canopy kit as recited in claim 1 , wherein the length of the elongated box is approximately no more than 50% of a length of the four vertical posts.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A canopy kit as recited in claim 1 , wherein wherein the vertical posts, horizontal cross rails, arch cross rails, and frame connectors are fabricated from steel.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A canopy kit for storage, the canopy kit comprising:",
            "components": [
                {
                    "component": "six vertical posts, each vertical post including a first portion removably connectable to a second portion;",
                    "subcomponents": []
                },
                {
                    "component": "six horizontal cross rails, each horizontal cross rail including a first portion removably connectable to a second portion;",
                    "subcomponents": []
                },
                {
                    "component": "six arch cross rails, each arch cross rail including a first portion removably connectable to a second portion;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of frame connectors for connecting the horizontal and arch cross rails to form a frame for a peaked roof, and mounting the frame on the six vertical posts;",
                    "subcomponents": []
                },
                {
                    "component": "a tarp for covering the frame of the peaked roof;",
                    "subcomponents": []
                },
                {
                    "component": "means for attaching the tarp to the frame of the peaked roof; and",
                    "subcomponents": []
                },
                {
                    "component": "an elongated box having a length, a width and a height,",
                    "subcomponents": [
                        "the length being at least 25% shorter than a full length of the vertical posts and",
                        "the width and the height being sufficient to house the plurality of frame connectors, the tarp, the horizontal cross rails, the arch cross rails, and the means for attaching."
                    ]
                },
                {
                    "component": "the length being at least 25% shorter than a full length of the vertical posts and",
                    "subcomponents": []
                },
                {
                    "component": "the width and the height being sufficient to house the plurality of frame connectors, the tarp, the horizontal cross rails, the arch cross rails, and the means for attaching.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A canopy kit as recited in claim 14 , wherein a canopy assembled from the canopy kit is approximately 10 feet wide by approximately 20 feet long by approximately 9.5 feet high.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A canopy kit as recited in claim 15 , wherein the length of the elongated box is approximately 60 inches.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. A canopy kit as recited in claim 15 , wherein the length of the elongated box is approximately 42 inches.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. A canopy kit for storage, the canopy kit comprising:",
            "components": [
                {
                    "component": "eight vertical posts, each vertical post including means for reducing a length thereof by at least 20%;",
                    "subcomponents": []
                },
                {
                    "component": "eight horizontal cross rails, each horizontal cross rail including means for reducing a length thereof;",
                    "subcomponents": []
                },
                {
                    "component": "six arch cross rails, each arch cross rail including means for reducing a length thereof;",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of frame connectors for connecting the horizontal and arch cross rails to form a frame for a peaked roof, and mounting the frame on the eight vertical posts;",
                    "subcomponents": []
                },
                {
                    "component": "a tarp for covering the frame of the peaked roof;",
                    "subcomponents": []
                },
                {
                    "component": "bungee cords for attaching the tarp to the frame of the peaked roof; and",
                    "subcomponents": []
                },
                {
                    "component": "an elongated box having a length, a width and a height,",
                    "subcomponents": [
                        "the length being sufficient to house the reduced vertical posts and horizontal cross rails, and",
                        "the width and the height being sufficient to house the plurality of frame connectors, the tarp, the arch cross rails and the bungee cords."
                    ]
                },
                {
                    "component": "the length being sufficient to house the reduced vertical posts and horizontal cross rails, and",
                    "subcomponents": []
                },
                {
                    "component": "the width and the height being sufficient to house the plurality of frame connectors, the tarp, the arch cross rails and the bungee cords.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. A canopy kit as recited in claim 18 , wherein the means for reducing a length thereof is a plurality of first portions removably connectable to a plurality of corresponding second portions.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. A canopy kit as recited in claim 18 , wherein the plurality of frame connectors are nested in a line for reducing a length of the line and covered by at least a portion of the eight vertical posts, the eight horizontal cross rails and the six arch cross rails.",
            "components": []
        }
    ],
    "description": [
        "This application relates to U.S. patent application Ser. No. 10/282,283, filed Oct. 28, 2002 and published as US 2003/0084934 A1, which is incorporated herein by reference.",
        "1. Field of the Invention",
        "The subject disclosure relates to systems and methods for assembling and packing canopies, and more particularly to improved systems and methods for reducing the size of a container required to store, display and transport one or more canopies.",
        "2. Background of the Related Art",
        "Use of canopies to protect a variety of items from the elements has been widely used and well understood in the art. Typical items include cars, boats, recreational vehicles, and picnic tables just to name a few. Some examples of packages for canopies are illustrated in U.S. Pat. Nos. 5,730,281; 6,141,902; and 6,679,009 each of which is incorporated herein by reference in its entirety. The prior art illustrates a canopies, greenhouses and shelters being packed in container. Packaged, the containers vary in size from 11 inches×6.5 inches×70 inches to 10 inches×11 inches×86 inches to 84 inches×96 inches×48 inches. None of the prior art containers for such buildings can be efficiently packaged for transport by the manufacturer, attractively displayed in a variety of locations by the retailer or transported in the trunk of a traditional sedan automobile by the purchaser. For instance, a 70 inch container cannot be easily displayed at the end of an aisle by the retailer. With a 70 inch container, a portion of the 70 inch container extends out of the trunk of a sedan automobile for transport.",
        "There is a need, therefore, for an improved storage and assembly system and method which permits compact storage and transport while still allowing easy assembly, and aids in assuring adequate structural integrity when assembled.",
        "In a preferred embodiment, a canopy kit stores, transports and assembles such that the canopy kit can be easily manufactured, displayed and purchased. The canopy kit includes four vertical posts, each vertical post including a first portion removably connectable to a second portion, three horizontal cross rails, each horizontal cross rail including a first portion removably connectable to a second portion, and four arch cross rails, each arch cross rail including a first portion removably connectable to a second portion. The canopy kit also includes a plurality of frame connectors for connect the horizontal and arch cross rails to form a frame for a peaked roof, and mounting the frame on the four vertical posts. A tarp of the canopy kit is for covering the frame of the peaked roof. The canopy kit also includes means for attaching the tarp to the frame of the peaked roof and an elongated box having a length, a width and a height. The length being sufficient to house the first and second portions of the vertical posts, horizontal cross rails and arch cross rails, and the width and the height being sufficient to house the plurality of frame connectors, the tarp and the means for attaching.",
        "In another preferred embodiment, a canopy kit includes six vertical posts, each vertical post including a first portion removably connectable to a second portion, six horizontal cross rails, each horizontal cross rail including a first portion removably connectable to a second portion, and six arch cross rails, each arch cross rail including a first portion removably connectable to a second portion. The canopy kit also includes a plurality of frame connectors for connecting the horizontal and arch cross rails to form a frame for a peaked roof, and mounting the frame on the six vertical posts as well as a tarp for covering the frame of the peaked roof. Means for attaching the tarp to the frame of the peaked roof and an elongated box having a length, a width and a height are also included in the canopy kit. The length of the elongated box is at least 25% shorter than a full length of the vertical posts, and the width and the height are sufficient to house the plurality of frame connectors, the tarp, the horizontal cross rails, the arch cross rails, and the means for attaching.",
        "It is an aspect of the subject disclosure to provide a method for boxing a canopy so that the box can be easily transported, stored and displayed while reducing the likelihood of damage to the components of the canopy.",
        "In one embodiment, the first and second portions of the vertical posts, horizontal cross rails and arch cross rails are approximately 41 inches and the length of the elongated box is approximately 42 inches. Preferably, the assembled canopy is about 9 feet wide by about 9 feet deep, wherein the horizontal cross rails are about 6 feet above the base feet.",
        "It should be appreciated that the present invention can be implemented and utilized in numerous ways. These and other unique features of the system disclosed herein will become more readily apparent from the following description and the accompanying drawings.",
        "So that those having ordinary skill in the art to which the disclosed system appertains will more readily understand how to make and use the same, reference may be had to the drawings wherein:",
        "FIG. 1 is a perspective view of an assembled canopy constructed in accordance with the subject disclosure.",
        "FIG. 2 is an exploded view of the roof frame portion of the canopy of FIG. 1.",
        "FIG. 3 is an exploded view of an upright assembly of the canopy of FIG. 1.",
        "FIG. 3A is an exploded view of an upright assembly of another canopy constructed in accordance with the subject disclosure.",
        "FIGS. 4-12 are a sequence of perspective views illustrating a method for packing the canopy of FIG. 1 in a container.",
        "FIG. 13 is a cross-sectional view of a container filled by the sequence of FIGS. 4-12.",
        "FIG. 14 is an exploded view of a roof frame portion of an eight legged canopy constructed in accordance with the subject disclosure.",
        "FIG. 14A is a detailed view of two interconnection portions of the roof frame of FIG. 14.",
        "The present invention overcomes many of the prior art problems associated with kits for housing canopies. The advantages, and other features of the system disclosed herein, will become more readily apparent to those having ordinary skill in the art from the following detailed description of certain preferred embodiments taken in conjunction with the drawings which set forth representative embodiments of the present invention and wherein like reference numerals identify similar structural elements.",
        "Referring to FIG. 1, an assembled canopy is referred to generally by the reference numeral 100. The canopy 100 provides shelter from the elements yet can be easily assembled and deconstructed for easy storage, transport and display. In a preferred embodiment, the canopy 100 is 10 feet wide by 20 feet long by 9.5 feet high. The canopy 100 includes a roof frame portion 102 covered by a resilient tarp 104. In a preferred embodiment, the tarp 104 is attached to the roof frame portion 102 by ball bungee cords 124 as shown in U.S. patent application Ser. No. 10/282,283 filed Oct. 28, 2002 and published as U.S. Patent Application No. 2003/0084934 A1 on May 8, 2003, which is incorporated herein by reference in its entirety. The roof frame portion 102 is supported by six upright assemblies 106.",
        "Referring to FIG. 2, roof frame portion 102 includes a plurality of 3-way connectors 108 and 4-way connectors 110 for interconnecting horizontal rail assemblies 112 and arch rail assemblies 114. Preferably, the connectors 108, 110 are sized to receive the rail assemblies 112, 114 and define holes for receiving push button devices mounted on the rail assemblies 112, 114. The horizontal rail assemblies 112 include three portions 116a-c. Portions 116b and 116c have smaller necks with push button devices to facilitate insertion and coupling. The arch rail assemblies 114 include two portions 118a and 118b. Similar to the horizontal rail assemblies 112, the two portions 118a and 118b of the arch rail assemblies 114 have smaller necks with push buttons. For simplicity and clarity, only enough reference numerals with tag lines that are sufficient for understanding have been shown.",
        "Referring now to FIG. 3, an upright assembly 106 has two tubular portions 120a and 120b that interconnect by insertion. To accomplish the insertion, tubular portion 120a has a smaller neck with a push button device 121 for engaging a hole defined by the tubular portion 120b. A base foot 122 is sized and configured to receive the tubular portion 120b when assembled. Referring now to FIG. 3A, an alternative upright assembly 306 has two tubular portions 320a and 320b that interconnect by insertion. To accomplish a friction fit when inserted, tubular portion 320a has a smaller neck and a plurality of protrusions 321 on portion 320b create sufficient friction to selectively hold portions 320a and portion 320b together. It is also envisioned that screws, telescoping portions, threads and other like fastening means known to those of ordinary skill in the pertinent art may be utilized to secure components.",
        "Referring now to FIGS. 4-12, a method for disassembling and packaging the canopy 100 in a container 200 is shown. The method includes reducing the length of each of the upright assemblies 106, horizontal rail assemblies 112 and arch rail assemblies 114 by approximately half or thirds. As a result, the length A of the container 200 can be shortened commensurately as compared with prior art containers. To accommodate the shortened length A, the width B and/or the height C of the container 200 may be increased as necessary to still house all of the components of the canopy 100. Preferably, the length is 42 inches or less to accommodate placing the container 200 in a traditional sedan automobile trunk.",
        "Referring now to FIGS. 4 and 5, an empty container 200 receives several rows of tubular pipes. These tubular pipes may be tubular portions 120a and 120b of the upright assemblies 106, portions 116a-c of the horizontal rail assemblies 112, portions 118a and 118b of the arch rail assemblies 114, and combinations thereof. In a preferred embodiment, the bottom of the container 200 has four layers of pipes thereon, wherein each layer has fewer pipes than the preceding to form a roughly triangular cross-sectional shape 131 as outlined in FIG. 13.",
        "Referring to FIGS. 6 and 7, two strips 202 are placed onto the pipes in order to help maintain the roughly triangular cross-sectional shape. Preferably, the strips 202 are cardboard. Next, the plurality of 3-way connectors 108 and 4-way connectors 110 are placed into the container 200 along with the base feet 122 and ball bungee cords 124. In a preferred embodiment, the plurality of frame connectors 108, 110 are nested in a line for reducing a length of the line and covered by at least a portion of the eight vertical posts, the eight horizontal cross rails and the six arch cross rails. As shown in FIG. 7, in order to nest the frame connectors 108, 110, the axis of each connector 110 is offset along the length of the container 200 with respect to the adjacent connector 108, 110. For adjacent, three-way connectors 108, the axis may be offset or the three-way connectors may be arranged back to back. As a result, shifting that may damage the tarp or other components is prevented.",
        "Referring now to FIGS. 8 and 9, the remainder of the pipes required for the canopy 100 are placed on top of the connectors 108 and 110. The remainder of the pipes also form roughly triangular shapes 133 as outlined in FIG. 13. At this point, the components within the container 200 form a roughly rectangular cross-sectional shape. The remainder of the pipes also provide protection for the tarp 104 by separating the tarp 104 from the edges of the connectors 108, 110 that may cut or otherwise damage the tarp 104 during shifting and jostling of the components. Referring to FIGS. 10, 11 and 12, a large strip 208 is placed into the container 200. Preferably,.the large strip 208 is cardboard for.protecting the tarp 104 from damage. The tarp 104 is placed onto the large strip 208 and the container 200 can be sealed for storage, transport and display. The various components such as the tarp 104, ball bungee cords 124 and any required loose hardware may be bagged and also placed in the container 200.",
        "In a preferred embodiment, the container 200 when packaged is 42 inches by 16.5 inches by 10 when holding a 10×20×9.5 foot canopy 100. The two portions 118a and 118b of the arch rail assemblies 114 are 41 inch and 25.75 inch tubes, respectively. The three portions 116a-c of the horizontal rail assemblies 112 are 41 inch tubes. The tubular portions 120a and 120b of the upright assemblies 106 are 41 inch and 40 inch tubes, respectively. It is envisioned that the components of the canopy may be fabricated from steel, aluminum, plastic, polyvinyl chloride or PVC, polyethylene and combinations thereof.",
        "Referring now to FIG. 14, as will be appreciated by those of ordinary skill in the pertinent art, the roof frame portion 402 utilizes the same principles of the roof frame portion 102 described above. Accordingly, like reference numerals preceded by the numeral “4” instead of the numeral “1”, are used to indicate like elements. The horizontal rail assemblies 412 include two portions 416a and 416b. In a preferred embodiment, a length of the horizontal rail assemblies 412 is 10 feet and each portion 416a and 416b is approximately 60 inches long. Consequently, a container for storing the portions 416a and 416b is approximately 60 inches in length. As a result, if a preferred upright assembly is approximately 80 inches, the length of the container for storage is approximately 75% of the upright assembly. Circle A of FIG. 14A shows another preferred method for interconnecting portions of the roof frame portion 402 or upright assemblies 120a, 120b. Each portion 418a and 418b of the arch rail assemblies 414 include two portions 118a and 118b, each portion having a crimped section 415 to provide an interference fit between the portions 118a and 118b when engaged.",
        "While the invention has been described with respect to preferred embodiments, those skilled in the art will readily appreciate that various changes and/or modifications can be made to the invention without departing from the spirit or scope of the invention as defined by the appended claims."
    ],
    "citations": [
        "1262564",
        "1291758",
        "1650323",
        "1958296",
        "2022211",
        "2044659",
        "2151908",
        "2182283",
        "2440449",
        "2448895",
        "2493749",
        "2513729",
        "2523195",
        "2640999",
        "2690185",
        "2730259",
        "2764107",
        "2835406",
        "2837153",
        "2856941",
        "2860772",
        "2865386",
        "2905281",
        "2908121",
        "2986150",
        "3004542",
        "3055380",
        "3199518",
        "3222841",
        "3332551",
        "3375831",
        "3453786",
        "3708199",
        "3952463",
        "3957069",
        "3996706",
        "D246096",
        "4051626",
        "4051638",
        "4070846",
        "4074682",
        "4102307",
        "4462612",
        "D277228",
        "4557311",
        "4561227",
        "4566729",
        "4588227",
        "4607656",
        "4630627",
        "4640061",
        "4641676",
        "4779635",
        "4793371",
        "4817655",
        "4924896",
        "4947884",
        "5035253",
        "5224306",
        "5244001",
        "5245802",
        "5275188",
        "5421356",
        "5450889",
        "5485863",
        "5490532",
        "5490533",
        "5509713",
        "5511572",
        "5520236",
        "5555681",
        "5598668",
        "5617681",
        "5632292",
        "5632293",
        "5634483",
        "5634638",
        "5638853",
        "5660002",
        "5701923",
        "5730281",
        "D397445",
        "5794640",
        "5797412",
        "5802647",
        "5813425",
        "5819474",
        "5845423",
        "D409310",
        "5901522",
        "5918615",
        "5921260",
        "5934301",
        "5944085",
        "D414564",
        "D415571",
        "D415572",
        "6041800",
        "6062243",
        "6070604",
        "6076312",
        "D430306",
        "6098335",
        "6129102",
        "6141902",
        "6155280",
        "6170503",
        "6173726",
        "6192643",
        "6196245",
        "6367495",
        "6505638",
        "6508262",
        "6666223",
        "6684584",
        "6988505",
        "7055538",
        "2758583",
        "2849668"
    ],
    "us_classification": "135121",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "E",
            "classification_class": "04",
            "subclass": "H",
            "main_group": "15",
            "subgroup": "34"
        }
    ]
}