{
    "title": "Coupling mechanism",
    "abstract": "A coupling mechanism mainly includes a coupling member and two bucking blades. The coupling member has two anchor ends on two sides to anchor a plugging main board on the coupling member, and a groove on an upper side and a lower side, to hold the bucking blades. The bucking blades are squeezed and deformed when the coupling member is moved and latched on a coupling interface of an electronic device to fill the tolerance between the two, thus can prevent electromagnetic waves from leaking out. The two anchor ends are made of metal and can also prevent the electromagnetic waves from leaking out from two sides. The coupling mechanism solves the interference problem during assembly occurring to conventional coupling mechanisms that use annular conductive-foamed plastics. The cost of the coupling mechanism also decreases.",
    "inventors": [
        "Chen"
    ],
    "document_number": "07298630",
    "publication_date": "20071120",
    "assignees": [
        "Inventec Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A coupling mechanism for anchoring a plugging mainboard on a coupling interface of an electronic device to prevent electromagnetic wave generated by the plugging mainboard when connected electrically to the electronic device from leaking outwards, comprising:",
            "components": [
                {
                    "component": "a coupling member which has a coupling portion and two anchor ends, the coupling portion having respectively a groove on a upper side and a lower side, the anchor ends being vertically located on two sides of the coupling portion in parallel with each other to latch and anchor the plugging mainboard on the coupling mechanism and prevent the electromagnetic wave from leaking outwards through the two sides of the coupling portion; and",
                    "subcomponents": []
                },
                {
                    "component": "two bucking blades wedged in the grooves;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the bucking blades are squeezed and deformed by the coupling member and the coupling interface when the coupling member receives a force to maintain a latch position with the coupling interface to fill a tolerance between the coupling member and the coupling interface to prevent the electromagnetic wave from leaking out.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The coupling mechanism of claim 1 , wherein the anchor ends are located on two sides of the coupling member by integrated forming, stamping, soldering or riveting.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The coupling mechanism of claim 1 , wherein the anchor ends are made of metal which shields electromagnetic wave.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The coupling mechanism of claim 1 , wherein the plugging mainboard is electrically connected to the electronic device at the latch position.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The coupling mechanism of claim 1 , wherein the anchor ends have respectively a latch portion to maintain the coupling member at the latch position.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The coupling mechanism of claim 1 , wherein one of the anchor ends has a latch section to couple with an anchor hole formed on the plugging mainboard to anchor the plugging mainboard on the coupling mechanism.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The coupling mechanism of claim 1 , wherein one of the anchor ends has an aperture to fasten the plugging mainboard on the coupling mechanism.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The coupling mechanism of claim 7 , wherein the aperture is coupled with an anchor hole formed on the plugging mainboard through a fastening element to fasten the plugging mainboard on the coupling mechanism.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The coupling mechanism of claim 8 , wherein the fastening element is a screw.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The coupling mechanism of claim 8 , wherein the fastening element is a tenon.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The coupling mechanism of claim 1 , wherein the bucking blades are conductive foamed plastics that prevent the electromagnetic wave from penetrating.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The coupling mechanism of claim 1 , wherein the bucking blades are bonded to the grooves through an adhesive means.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The coupling mechanism of claim 12 , wherein the adhesive means is a double-sided adhesive tape.",
            "components": []
        }
    ],
    "description": [
        "The present invention relates to a coupling mechanism and particularly to a coupling mechanism to reduce leaking of electromagnetic waves.",
        "The design of conventional electronic devices often involves reducing unstable electric current leakage and generation and leaking of electromagnetic waves, to comply with the requirements of international safety certifications, and prevent users from being hurt by the leaking current and electromagnetic waves.",
        "The general approach to meet this objective is to channel the leaking current to the ground or use a shielding means to prevent the leaking current and electromagnetic wave from infiltrating through the tolerance of a coupling mechanism (assembly interface) which bridges a coupling interface and a plugging mainboard (such as the mainboard of a blade server, a graphic card, or the like).",
        "Refer to FIGS. 1A, 1B and 1C for the conventional coupling mechanisms to prevent electromagnetic waves from leaking. FIG. 1A shows a first coupling mechanism. FIG. 1B shows a second coupling mechanism. FIG. 1C illustrates assembly of the second coupling mechanism.",
        "Referring to FIG. 1A, the first coupling mechanism uses metal to provide a shielding effect, to prevent leaking of electromagnetic waves. On the outside (which is coupled with a coupling interface of an electronic device) of the coupling mechanism 10, an annular spacer 12 made of metal is provided to be wedged between a gap, formed between the coupling interface (not shown in the drawing) of the electronic device and the coupling mechanism 10, to reduce leaking of electromagnetic waves.",
        "As there is a tolerance in the product design, a gap is formed between the annular spacer 12 and the coupling interface. Hence leaking of electromagnetic waves cannot be totally prevented.",
        "To remedy the aforesaid problem, the second coupling mechanism is developed, including a conductive foamed plastic, capable of shielding electromagnetic waves, to prevent leaking of electromagnetic waves as shown in FIG. 1B. The coupling mechanism 20 has an annular conductive foamed plastic 24 located between an annular spacer 22 and a latch side of the coupling interface, to fill the tolerance mentioned above.",
        "Referring to FIG. 1C, for assembly, the coupling mechanism 20 is moved and latched on a coupling interface 30 of an electronic device (not shown in the drawing), and the conductive foamed plastic 24 is squeezed by the coupling interface 30 and the annular spacer 22 and deformed, so that a tight coupling is formed between the coupling mechanism 20 and the coupling interface 30, and the gap of tolerance is filled to shield the electromagnetic waves.",
        "However, the second coupling mechanism mentioned above still has drawbacks. Because the coupling mechanism 20 that attaches to the annular conductive foamed plastics 24 should be formed in a size slightly larger than the coupling interface 30 to enable the annular conductive foamed plastic 24 to be squeezed, to achieve a compensation effect, when the coupling mechanism 20 is moved and latched on the coupling interface 30 (for assembly), the periphery of the annular conductive foamed plastic 24 is extended outside the coupling interface 30. Hence it is difficult to squeeze the annular conductive foamed plastic 24 into the coupling interface 30. As a result, interference occurs, and assembly cannot be done smoothly.",
        "Moreover, adding the annular spacer and the annular conductive foamed plastic increases the cost of the coupling mechanism. Hence how to reduce the interference of the annular conductive foamed plastic during assembly and reduce the cost of the coupling mechanism are issues pending to be overcome.",
        "In view of the aforesaid problems, the present invention aims to provide a coupling mechanism adopted for use on a mainboard to reduce interference during assembly and prevent leaking of electromagnetic waves.",
        "The coupling mechanism according to the invention mainly includes a coupling member and two bucking blades. The coupling member has a coupling portion and two anchor ends. The coupling portion has an upper side and a lower side, each having a groove. The two anchor ends are vertically located on two sides of the coupling portion in a parallel manner to enable the plugging main board to be anchored on the coupling mechanism. Further, electromagnetic waves are prevented from leaking from the two sides of the coupling portion. The two bucking blades are wedged respectively in the upper and the lower grooves.",
        "The foregoing, as well as additional objects, features and advantages of the invention will be more readily apparent from the following detailed description, which proceeds with reference to the accompanying drawings.",
        "FIG. 1A is a perspective view of a first conventional coupling mechanism;",
        "FIG. 1B is an exploded view of a second conventional coupling mechanism;",
        "FIG. 1C is a schematic view of the second conventional coupling mechanism in an assembly condition;",
        "FIG. 2 is a schematic view of the invention in an assembly condition;",
        "FIG. 3 is an exploded view of an embodiment of the invention;",
        "FIG. 4A is a schematic view of an embodiment of the latch section; and",
        "FIG. 4B is a schematic view of an embodiment of the aperture.",
        "Refer to FIG. 2 for the invention in an assembly condition. The coupling mechanism 100 aims to anchor a plugging main board 200 on a coupling interface 300 of an electronic device (not shown in the drawing).",
        "The general plugging main board 200 has at least one anchor hole 202 to couple with a fastening element from the coupling mechanism 100, to anchor the plugging main board 200 firmly on the coupling mechanism 100.",
        "The coupling interface 300 may be located on the host frame of the electronic device. Hence when the coupling mechanism 100 is latched on the coupling interface 300, it is held on the host frame of the electronic device.",
        "The plugging main board 200 generally is used on the blade main board of razor servers, graphic cards, sound cards, and the like. The coupling interface 300 has a size slightly larger than the coupling mechanism 100, for holding the coupling mechanism 100.",
        "Referring to FIG. 3, the coupling mechanism 100 mainly includes a coupling member 110 and two bucking blades 150 and 150′. Details of the structure are elaborated as follows:",
        "The coupling member 110 includes a coupling portion 112 and anchor ends, 114 and 114′. The coupling portion 112 has an upper side and a lower side that have respectively a groove 116 and 116′. The anchor ends 114 and 114′ are located vertically on two sides of the coupling portion 112 in a parallel manner, to anchor the plugging main board 200 (not shown in the drawing) on the coupling mechanism 100, and prevent electromagnetic waves from leaking through the two sides of the coupling portion 112.",
        "In practice, the anchor ends 114 and 114′ are formed in an L-shape, and may be fabricated integrally, or formed by stamping, soldering, riveting or the like on two sides of the coupling member 110.",
        "Moreover, the anchor ends 114 and 114′ may have respectively a latch section or aperture to enable the plugging main board 200 to be anchored on the coupling mechanism 100. Refer to FIG. 4A for an embodiment that uses the latch section, and FIG. 4B for another embodiment that uses the aperture, for anchoring the plugging main board 200 on the coupling mechanism 100.",
        "Referring to FIG. 4B, a latch section 120 is provided that has a retaining section 122 and a cavity 124. When the plugging mainboard 200 (not shown in the drawing) is subject to a force and the anchor hole 202 passes through the retaining section 122 to the cavity 124, the retaining section 122 confines the anchor hole 202 to prevent the plugging mainboard 200 from escaping and anchor the plugging mainboard 200 on the coupling mechanism.",
        "Referring to FIG. 4A, an aperture 130 is provided on the anchor ends 114 or 114′ to couple with the anchor hole 202 of the plugging main board 200 through a fastening element 132, to anchor the plugging main board 200 on the coupling mechanism 100.",
        "In practice, the fastening element 132 may be a screw or a tenon. When the fastening element 132 is a screw, the aperture 130 and the anchor hole 202 of the plugging main board 200 have respectively internal screw threads to engage with the external screw threads of the screw, to enhance the fastening effect.",
        "For assembly, move the coupling mechanism 100 close to the coupling interface 300 of the electronic device until the coupling interface 300 is engaged with the bottom of a latch portion 140 of the anchor end 114 or 114′ so that the coupling mechanism 100 is maintained at a latch position. At the latch position the plugging main board 200 is electrically connected to the electronic device.",
        "The two bucking blades 150 and 150′ are located respectively in the grooves 116 and 116′ of the coupling member 110 and bonded by an adhesive means such as a double-sided adhesive tape or the like.",
        "In practice, the bucking blades 150 and 150′ may be conductive foamed plastics that can prevent penetration of electromagnetic waves, or any material that can be squeezed and deformed when the coupling member 110 is compressed by the coupling interface 300, to fill the tolerance there between and block the electromagnetic waves.",
        "In the embodiments of the invention, the latch sections 120, apertures 130 and fastening elements 132 are not limited. However, at least one must be provided to anchor the plugging main board 200 on the coupling mechanism 100.",
        "While the preferred embodiments of the invention have been set forth for the purpose of disclosure, modifications of the disclosed embodiments of the invention as well as other embodiments thereof may occur to those skilled in the art. Accordingly, the appended claims are intended to cover all embodiments, which do not depart from the spirit and scope of the invention."
    ],
    "citations": [
        "5696669",
        "D415116",
        "6008994",
        "6195266",
        "6428330",
        "6661676",
        "6850409",
        "2002/0093807"
    ],
    "us_classification": "361818",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "05",
            "subclass": "K",
            "main_group": "9",
            "subgroup": "00"
        }
    ]
}