{
    "title": "Thio-substituted arylmethanesulfinyl derivatives",
    "abstract": "The present invention is related to chemical compositions, processes for the preparation thereof and uses of the composition. Particularly, the present invention relates to compositions of compounds of Formula (A):",
    "inventors": [
        "Lesur",
        "Louvet",
        "Tripathy"
    ],
    "document_number": "07297817",
    "publication_date": "20071120",
    "assignees": [
        "Cephalon France",
        "Cephalon, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A compound of formula (A):",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The compound according to claim 1 , wherein:",
            "components": [
                {
                    "component": "Y is C",
                    "subcomponents": []
                },
                {
                    "component": "(C",
                    "subcomponents": []
                },
                {
                    "component": "C",
                    "subcomponents": []
                },
                {
                    "component": "wherein said alkylene groups are optionally substituted with one to three R",
                    "subcomponents": []
                },
                {
                    "component": "Z",
                    "subcomponents": []
                },
                {
                    "component": "C",
                    "subcomponents": []
                },
                {
                    "component": "Z",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The compound according to claim 1 wherein q is 1.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The compound according to claim 1 wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The compound according to claim 1 wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The compound according to claim 5 wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The compound according to claim 6 wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The compound according to claim 4 wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The compound according to claim 1 wherein X is O, S(O)",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The compound according to claim 1 wherein X is OC(R",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The compound according to claim 10 wherein X is OC(r",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The compound according to claim 1 wherein Y is C",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The compound according to claim 12 wherein Y is CH",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The compound according to claim 2 wherein Y is (C",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The compound according to claim 14 wherein Z",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The compound according to claim 15 wherein Z",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The compound according to claim 14 wherein Z",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The compound according to claim 2 wherein Y is C",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The compound according to claim 18 wherein Z",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The compound according to claim 1 with the structure:",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The compound according to claim 20 wherein: Y is C",
            "components": [
                {
                    "component": "",
                    "subcomponents": [
                        "Z",
                        "Z"
                    ]
                },
                {
                    "component": "Z",
                    "subcomponents": []
                },
                {
                    "component": "Z",
                    "subcomponents": []
                },
                {
                    "component": "X is O, S(O)",
                    "subcomponents": []
                },
                {
                    "component": "R",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The compound according to claim 21 wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The compound according to claim 22 having the structure of formula (Ib):",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The compound according to claim 23 wherein X is O, S(O)",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The compound according to claim 24 wherein X is O, S(O)",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The compound according to claim 24 wherein X is OCH",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The compound according to claim 24 wherein X is NH, O—CH",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The compound according to any of claims 1 , 20 , or",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The compound according to claim 23 wherein Y is C",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The compound according to claim 29 wherein Y is CH",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The compound according to claim 23 wherein Y is (C",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. A compound selected in accordance with the following table, wherein:",
            "components": []
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. A method of treating a disease or a disorder selected from the group consisting of sleepiness associated with narcolepsy; obstructive sleep apnea; shift work disorder, attention deficit disorder; attention deficit; hyperactivity disorder; depression; and fatigue, comprising administering to a patient in need thereof a compound of claim 1 or a stereoisomeric form, mixture of stereoisomeric forms, or a pharmaceutically acceptable salts form thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The method according to claim 33 wherein the disease or disorder is sleepiness associated with narcolepsy.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. A method for the treatment of a sleep-affecting disease, or disorder in order to promote wakefulness comprising administering to a patient in need thereof a compound according to claim 1 or a stereoisomeric form, mixture of stereoisomeric forms, or a pharmaceutically acceptable salt form thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. A pharmaceutical composition comprising a compound of claim 1 and the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof, in admixture with one or more pharmaceutically acceptable excipients.",
            "components": []
        },
        {
            "claim_number": "CLM-00037",
            "preamble": "37. A method for preparing a compound of claim 1 , comprising the steps of:",
            "components": [
                {
                    "component": "i.) reacting a thiouronium compound (E) with a reactant of structure LG-YR",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00038",
            "preamble": "38. The method of claim 37 , wherein step i) comprises:",
            "components": [
                {
                    "component": "a) converting the compound of formula (E) into the corresponding thiol compound; and",
                    "subcomponents": []
                },
                {
                    "component": "b) reacting the obtained thiol compound with the reactant LG-Y-R",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00039",
            "preamble": "39. The method of claim 38 , wherein the compound (E) is formed by reacting the compound (D) with thiourea and a suitable acid HA:",
            "components": []
        },
        {
            "claim_number": "CLM-00040",
            "preamble": "40. The method of claim 39 , wherein the compound (D) is formed by reacting a compound (C) with a suitable reducing agent:",
            "components": []
        },
        {
            "claim_number": "CLM-00041",
            "preamble": "41. The method according to claim 40 , wherein compound (C) is formed by reacting a compound (A) with a compound (B):",
            "components": []
        },
        {
            "claim_number": "CLM-00042",
            "preamble": "42. The method according to claim 41 , wherein the compound formed at step i) is a compound of formula (I) wherein q is 0, R",
            "components": []
        },
        {
            "claim_number": "CLM-00043",
            "preamble": "43. The method according to claim 42 further comprising: claim 1 ; and optionally b1) isolating the obtained compound of formula (I) wherein R",
            "components": [
                {
                    "component": "a1) reacting the carboxylic acid or ester of formula (I) with an appropriate amine of general structure NHR",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00044",
            "preamble": "44. The method of claim 42 or 43 further comprising:",
            "components": [
                {
                    "component": "a2) oxidizing the compound of formula (I) wherein q is 0; and optionally b2) isolating the obtained compound of formula (I) wherein q is 1 or 2.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00045",
            "preamble": "45. A compound according to claim 1 ,",
            "components": []
        },
        {
            "claim_number": "CLM-00046",
            "preamble": "46. The compound according to claim 32 selected in accordance with the following table, wherein:",
            "components": []
        }
    ],
    "description": [
        "This application claims priority of pending U.S. Provisional Application Ser. No. 60/568,991, filed May 7, 2004 and European Patent Application Number 04290983.8, filed Apr. 13, 2004. The disclosures of these prior applications is incorporated herein by reference in their entireties for all purposes.",
        "The present invention is related to chemical compositions, processes for the preparation thereof and uses of the composition. Particularly, the present invention relates to compositions of compounds of Formula (A):",
        "and their use in the treatment of diseases, including treatment of sleepiness, promotion and/or improvement of wakefulness, preferably improvement of wakefulness in patients with excessive sleepiness associated with narcolepsy, sleep apnea, preferably obstructive sleep apnea/hypopnea, and shift work disorder; treatment of Parkinson's disease; Alzheimer's disease; cerebral ischemia; stroke; eating disorders; attention deficit disorder (“ADD”), attention deficit hyperactivity disorder (“ADHD”); depression; schizophrenia; fatigue, preferably fatigue associated with cancer or neurological diseases, such as multiple sclerosis and chronic fatigue syndrome; stimulation of appetite and weight gain and improvement of cognitive dysfunction.",
        "The compounds disclosed herein are related to the biological and chemical analogs of modafinil. Modafinil, C15H15NO2S, also known as 2-(benzhydrylsulfinyl) acetamide, or 2-[(diphenylmethyl) sulfinyl] acetamide, a synthetic acetamide derivative with wake-promoting activity, has been described in French Patent No. 78 05 510 and in U.S. Pat. No. 4,177,290 (“the '290 patent”). It has been approved by the United States Food and Drug Administration for use in the treatment of excessive daytime sleepiness associated with narcolepsy. Methods for preparing modafinil and several derivatives are described in the '290 patent. The levorotatory isomer of modafinil, along with additional modafinil derivatives are described in U.S. Pat. No. 4,927,855, and are reported to be useful for treatment of hypersomnia, depression, Alzheimer's disease and to have activity towards the symptoms of dementia and loss of memory, especially in the elderly.",
        "Modafinil has also been described as a useful agent in the treatment of Parkinson's disease (U.S. Pat. No. 5,180,745); in the protection of cerebral tissue from ischemia (U.S. Pat. No. 5,391,576); in the treatment of urinary and fecal incontinence (U.S. Pat. No. 5,401,776); and in the treatment of sleep apneas and disorders of central origin (U.S. Pat. No. 5,612,379). In addition, modafinil may be used in the treatment of eating disorders, or to promote weight gain or stimulate appetite in humans or animals (U.S. Pat. No. 6,455,588), or in the treatment of attention deficit hyperactivity disorder (U.S. Pat. No. 6,346,548), or fatigue, especially fatigue associated with multiple sclerosis (U.S. Pat. No. 6,488,164). U.S. Pat. No. 4,066,686 describes various benzhydrylsulphinyl derivatives as being useful in therapy for treating disturbances of the central nervous system.",
        "Several published patent applications describe derivative forms of modafinil and the use of modafinil derivatives in the treatment of various disorders. For example, PCT publication WO 99/25329 describes various substituted phenyl analogs of modafinil as being useful for treating drug-induced sleepiness, especially sleepiness associated with administration of morphine to cancer patients. U.S. Pat No. 5,719,168 and PCT Publication No. 95/01171 describe modafinil derivatives that are useful for modifying feeding behavior. PCT Publication No. 02/10125 describes several modafinil derivatives of modafinil, along with various polymorphic forms of modafinil.",
        "Additional publications describing modafinil derivatives include U.S. Pat. No. 6,492,396, and PCT Publication No. WO 02/10125.",
        "Terauchi, H, et al. described nicotinamide derivatives useful as ATP-ase inhibitors (Terauchi, H, et al, J. Med. Chem., 1997, 40, 313-321). In particular, several N-alkyl substituted 2-(Benzhydrylsulfinyl) nicotinamides are described.",
        "U.S. Pat. Nos. 4,980,372 and 4,935,240 describe benzoylaminophenoxybutanoic acid derivatives. In particular, sulfide derivatives of modafinil containing a phenyl and substituted phenyl linker between the sulfide and carbonyl, and a substituted aryl in the terminal amide position, are disclosed.",
        "Other modafinil derivatives have been disclosed wherein the terminal phenyl groups are constrained by a linking group. For example, in U.S. Pat. No. 5,563,169, certain xanthenyl and thiaxanthenyl derivatives having a substituted aryl in the terminal amide position are reported.",
        "Other xanthenyl and thiaxanthenyl derivatives are disclosed in Annis, I; Barany, G. Pept. Proc. Am. Pept. Symp. 15th (Meeting Date 1997) 343-344, 1999 (preparation of a xanthenyl derivative of Ellman's Reagent, useful as a reagent in peptide synthesis); Han, Y.; Barany, G. J. Org. Chem., 1997, 62, 3841-3848 (preparation of S-xanthenyl protected cysteine derivatives, useful as a reagent in peptide synthesis); and El-Sakka, I. A., et al. Arch. Pharm. (Weinheim), 1994, 327, 133-135 (thiaxanthenol derivatives of thioglycolic acid).",
        "Thus, there is a need for novel classes of compounds that possess the beneficial properties. It has been discovered that a class of compounds, referred to herein as substituted thioacetamides, are useful as agents for treating or preventing various diseases or disorders disclosed herein.",
        "The present invention in one aspect is directed to various novel compounds of formula (A):",
        "and its stereoisomeric forms, mixtures of stereoisomeric forms, or pharmaceutically acceptable salt forms thereof, wherein the constituent members are defined infra.",
        "Another object of the present invention is to provide pharmaceutical compositions comprising the compounds of the present invention wherein the compositions comprise one or more pharmaceutically acceptable excipients and a therapeutically effective amount of at least one of the compounds of the present invention, or a pharmaceutically acceptable salt or ester form thereof.",
        "Another object of the present invention is to provide methods of treating or preventing diseases or disorders, including treatment of sleepiness, promotion and/or improvement of wakefulness, preferably improvement of wakefulness in patients with excessive sleepiness associated with narcolepsy, sleep apnea, preferably obstructive sleep apnea/hypopnea, and shift work disorder; treatment of Parkinson's disease; Alzheimer's disease; cerebral ischemia; stroke; eating disorders; attention deficit disorder (“ADD”), attention deficit hyperactivity disorder (“ADHD”); depression; schizophrenia; fatigue, preferably fatigue associated with cancer or neurological diseases, such as multiple sclerosis and chronic fatigue syndrome; stimulation of appetite and weight gain and improvement of cognitive dysfunction.",
        "These and other objects, features and advantages of compounds of formula (A) will be disclosed in the following detailed description of the patent disclosure.",
        "In a first embodiment, the present invention provides novel compounds of formula (A):",
        "wherein:\n\n    Ar is independantly selected from C6-C10 aryl and 5 to 10-membered heteroaryl wherein:\n    \n        C6-C10 aryl and heteroaryl are optionally substituted with one to three groups selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22)2, C(R22)2O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2NR22, NR22S(O)2, C(R22)2C(R22)2, CR21═CR21, C≡C;\n    Y is C1-C6 alkylene; or\n    \n        (C1-C4 alkylene)m—Z—(C1-C4 alkylene)n;\n        wherein said alkylene groups are optionally substituted with one to three R20 groups;\n    \n    \n    Z is O, NR10A, S(O)y, CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroaryle, C3-C6 cycloalkylene, or 3-6 membered heterocycloalkylene; wherein said arylene, heteroarylene, cycloalkylene, and heterocycloalkylene groups are optionally substituted with one to three R20 groups;\n    R1 is selected from H, C6-C10 aryl, NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13; wherein said aryl groups are optionally substituted with one to three R20 groups;\n    R2 and R3 are each independently selected from H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R10 and R10A are each independently selected from H, C1-C6 alkyl, C6-C10 aryl, C(═O)R14, and S(O)yR14; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R11 at each occurrence is independently selected from H, C1-C6 alkyl, preferably C3-C7 alkyl, and C6-C10 aryl; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R12 and R13 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R12 and R13, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    \n        wherein said alkyl and aryl groups and heterocyclic ring are optionally substituted with one to three R20 groups;\n    \n    \n    R14 at each occurrence is independently selected from C1-C6 alkyl, C6-C10 aryl, and arylalkyl;\n    \n        wherein said alkyl, aryl and arylalkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R20 at each occurrence is independently selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl optionally substituted by one to three OH, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, ═O, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, and S(O)yR22;\n    R21 at each occurrence is independently selected from H and C1-C6 alkyl;\n    R22 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    R23 and R24 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R23 and R24, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    R25 at each occurrence is independently the residue of an amino acid after the hydroxyl group of the carboxyl group is removed;\n    m is 0 or 1;\n    n is 0 or 1;\n    q is 0, 1, or 2;\n    y is 0, 1, or 2;\n    with the exclusion of the compounds wherein:\n    \n        Y is C2 alkylene substituted with one to three C1-C6 alkylene and/or NR23R24 and/or NR21CO2R22; and\n        R1 is C(═O)NR12R13;\n        or\n        Y is C2 alkylene substituted with one to three (C1-C6) alkyl; and\n        R1 is phenyl optionally substituted with one to three groups R20;\n        or\n        Y is CH2—Z—(CH2), wherein n=0 or 1, and Z is cyclopropyl or cyclobutyl optionally substituted; and\n        R1 is H or phenyl optionally substituted with one to three groups R20;\n        or\n        Y is CH2; and\n        R1 is phenyl optionally substituted with one to three groups R20;\n        or\n        Ar is a 5-10 membered heteroaryl group or a phenyl optionally substituted with one to three groups selected from CF3, NR21C(═O)R22, NO2 or CO2H; and/or\n        X is S(O)y; and\n        Y=CH2 or CH2CH2; and\n        R1 is H.\n    \n    \n    and with the exclusion of the compounds:\n    \n        N-[2,6-bis(1-methylethyl)phenyl]-2-[[4-(2-pyridinylmethoxy)phenyl]methyl]thio]-acetamide;\n        tetrahydro-2-[[{4-(phenylthio)phenyl]methyl}thio]acetyl]-2H-1,2-oxazine; and\n        2-chloro-1-[3-[(methylsulfonyl)methyl]-4-nitrophenoxy]-4-(trifluoromethyl)-benzene\n\nand the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof.",
        "In a second embodiment, the present invention provides a compound of formula (I),",
        "wherein:\n\n    Ar is independantly selected from C6-C10 aryl and 5 to 10-membered heteroaryl wherein:\n    \n        C6-C10 aryl and heteroaryl are optionally substituted with one to three groups selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22)2, C(R22)2O, C(R22)2NR21, NR21C(R22)2, C(═)N(R21), NR21C(═O), S(O)2NR22, NR22S(O)2C(R22)2, C(R22)2, CR21═CR21, C≡C;\n    Y is C1-C6 alkylene;\n    \n        (C1-C4 alkylene)m—Z1—(C1-C4 alkylene)n;\n        C1-C4 alkylene-Z2—C1-C4 alkylene;\n        \n            wherein said alkylene groups are optionally substituted with one to three R20 groups;\n        \n        \n    \n    \n    Z1 is CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene,\n    \n        C3-C6 cycloalkylene, or 3-6 membered heterocycloalkylene; wherein said arylene, heteroarylene, cycloalkylene, and heterocycloalkylene groups are optionally substituted with one to three R20 groups;\n    \n    \n    Z2 is O, NR10A, or S(O)y;\n    R1 is selected from H, C6-C10 aryl, NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13;\n    \n        wherein said aryl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R2 and R3 are each independently selected from H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R10 and R10A are each independently selected from H, C1-C6 alkyl, C6-C10 aryl, C(═O)R14, and\n    \n        S(O)yR14; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R11 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    \n        wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R12 and R13 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R12 and R13, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    \n        wherein said alkyl and aryl groups and heterocyclic ring are optionally substituted with one to three R20 groups;\n    \n    \n    R14 at each occurrence is independently selected from C1-C6 alkyl, C6-C10 aryl, and arylalkyl;\n    \n        wherein said alkyl, aryl and arylalkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R20 at each occurrence is independently selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl optionally substituted by one to three OH, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, ═O, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R21 at each occurrence is independently selected from H and C1-C6 alkyl;\n    R22 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    R23 and R24 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R23 and R24, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    R25 at each occurrence is independently the residue of an amino acid after the hydroxyl group of the carboxyl group is removed;\n    m is 0 or 1;\n    n is 0 or 1;\n    q is 0, 1, or 2;\n    y is 0, 1, or 2;\n\nand the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof.",
        "In another preferred embodiment of the invention, there are provided compounds of formula (Ia)",
        "wherein:\n\n    Ar is independantly selected from C6-C10 aryl and 5 to 10-membered heteroaryl, wherein:\n    \n        C6-C10 aryl and heteroaryl are optionally substituted with one to three groups selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, C1-C6 alkyl, phenyl, arylalkyl, and C(═O)R22;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22), C(R22)2O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2NR22, NR22S(O)2;\n    Y is C1-C6alkylene;\n    \n        C1-C4 alkylene-Z1—(C1-C4 alkylene)n; or\n        C1-C4 alkylene-Z2—C1-C4 alkylene;\n        wherein said alkylene groups are optionally substituted with one to three R20 groups;\n    \n    \n    Z1 is CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene,\n    \n        C3-C6 cycloalkylene, or 3-6 membered heterocycloalkylene;\n    \n    \n    Z2 is O, NR10A, or S(O)y;\n    R1 is selected from NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13;\n    R2 and R3 are each independently selected from H, F, cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22;\n    R10 and R10A are each independently selected from H, C1-C6 alkyl, C(═O)R14, and S(O)yR14,\n    \n        wherein said alkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R11 at each occurrence is independently selected from H, and C1-C6 alkyl; wherein said alkyl groups are optionally substituted with one to three R20 groups;\n    R12 and R13 at each occurrence are each independently selected from H, and C1-C6 alkyl, or R12and R13, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    \n        wherein said alkyl and aryl groups and heterocyclic ring are optionally substituted with one to three R20 groups;\n    \n    \n    R14 at each occurrence is independently selected from C1-C6 alkyl, C6-C10 aryl, and arylalkyl;\n    \n        wherein said alkyl, aryl and arylalkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R20 at each occurrence is independently selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, phenyl, benzyl, ═O, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21CO2R22, OC(═O)NR23R24, NR21C(═O)R22, NR21C(═S)R22, and S(O)yR22;\n    R21 at each occurrence is independently selected from H and C1-C6 alkyl;\n    R22 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    R23 and R24 at each occurrence are each independently selected from H, and C1-C6 alkyl, or R23 and R24, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    R25 at each occurrence is independently the residue of an amino acid after the hydroxyl group of the carboxyl group is removed;\n    n is 0 or 1;\n    y is 0, 1, or 2;\n\nand the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof.",
        "An additional aspect of the present invention includes compounds of formula (A) and formulas (I) and (Ia) wherein Y is C1-C6 alkylene, C1-C4 alkylene-Z1—C1-C4 alkylene, or C1-C4 alkylene-Z2—C1-C4 alkylene, wherein said alkylene groups are optionally substituted with one to three C1-C6 alkyl groups; Z1 is CR21═CR21, C≡C, or phenyl; Z2 is O, NR10A, or S(O)y; R1 is selected from NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, and C(═O)NR12R13. In other aspects, Y is C1-C6 alkylene, or C1-C4 alkylene-Z1—C1-C4 alkylene. In additional aspects, Y is C1-C6 alkylene. In further aspects, R1 is C(═O)NR12R13.",
        "In certain aspects of the present invention, there are included compounds of formula (A) and formulas (I) and (Ia) where Ar is phenyl. Other aspects include compounds where Ar is napthyl. Other aspects include compounds where Ar is thienyl. Other aspects include compounds where Ar is furyl.",
        "In additional aspects of the present invention, there are included compounds of formula (A) and formulas (I) and (la) wherein Ar has any of the values of the previous embodiments and q is 1.",
        "In other aspects of the present invention, there are included compounds of formula (A) and formulas (I) and (Ia) where X is O, S(O)y, N(R10), OC(R22)2, C(R22)2NR21, C(═O)N(R21), S(O)2NR22.",
        "In additional aspects of the present invention, there are included compounds of formula (A) and formulas (I) and (Ia) where X is O, S(O)y, N(R10), OC(R22)2, C(R22)2NR21, C(═O)N(R21), S(O)2NR22 and q is 1.",
        "Other aspects of the present invention include compounds of formula (A) and formulas (I) and (Ia) wherein Ar and X and q have any of the values of the previous embodiments, and Y is C1-C6 alkylene, particularly those where Y is CH2 or CH2CH2, and most particularly those where Y is CH2.",
        "Additional aspects of the present invention include compounds of formula (A) and formulas (I) and (Ia) wherein Ar, X and q have any of the values of the previous embodiments, and Y is (C1-C4 alkylene)m—Z1—(C1-C4 alkylene)n wherein Z1 is CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene, C3-C6 cycloalkylene, or 3-6 membered heterocycloalkylene. Other aspects include those compounds where Y is C1-C4 alkylene-Z1. Other aspects include those where Y is Z1—C1-C4 alkylene. Additional aspects include compounds where Y is C1-C4 alkylene-Z1 —C1-C4 alkylene.",
        "Further aspects of the present invention include compounds of formula (A) and formulas (I) and (Ia) wherein Ar, X, Y, and q have any of the values of the previous embodiments, and Z1 is CR21═CR21, or C≡C. Other aspects include compounds where Z1 is C6-C10 arylene, or C3-C6 cycloalkylene, particularly those where Z1 is phenyl. Other aspects include compounds where Z1 is 5-10 membered heteroarylene, or 3-6 membered heterocycloalkylene.",
        "Further aspects of the present invention include compounds of formula (A) and formulas (I) and (Ia) wherein Ar, X and q have any of the values of the previous embodiments, and Y is (C1-C4 alkylene)m—Z2—(C1-C4 alkylene), wherein Z2 is O, NR10A, or S(O)y. Other aspects include those compounds where Y is C1-C4 alkylene-Z2, wherein R1 cannot be H. Other aspects include those compounds where Y is C1-C4 alkylene-Z2—C1-C4 alkylene. Additional aspects include any of the above embodiments of Y wherein Z2 is O. Additional aspects include any of the above embodiments of Y wherein Z2 is NR10A.",
        "Further aspects of the present invention include compounds of formula (A) and formulas (I) and (Ia) wherein Ar, Y, Z1, and Z2, and q have any of the values of the previous embodiments, and R1 can be any value selected from the following 12 enumerated paragraphs:\n\n    \n    \n        1. H.\n        2. NR12R13.\n        3. NR21C(═O)R14.\n        4. C(═O)R14.\n        5. CO2R11.\n        6. OC(═O)R11.\n        7. C(═O)NR12R13.\n        8. C(═NR11)NR12R13.\n        9. OC(═O)NR12R13.\n        10. NR21S(O)2R11.\n        11. NR21C(═O)NR12R13.\n        12. NR21S(O)2NR12R13.",
        "Other additional aspects of the present invention include compounds of formula (A) and formulas (I) and (Ia) wherein Ar, Y, Z1, and Z2, and q have any of the values of the previous embodiments, and R1 can be a combination of the values selected from the previous 12 enumerated paragraphs. The preceding 12 enumerated paragraphs may be combined to further define additional preferred embodiments of compounds of the present invention. For example, one such combination includes NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13.",
        "Another such combination includes NR12R13, wherein R12 and R13 are each independently selected from H and C1-C6 alkyl; NR21C(═O)R14; C(═O)NR12R13; C(═NR11)NR12R13; and NR21C(═O)NR12R13.",
        "A third such combination includes C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, and NR21S(O)2NR12R13.",
        "A fourth such combination includes NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, and C(═O)NR12R13.",
        "A fifth such combination includes NR21C(═O)R14 and C(═O)NR12R13.",
        "In still further aspects of the present invention, there are included compounds of formula (Ib):",
        "wherein Ar, X and Y have any of the values of the previous embodiments.\n\nAdditional aspects of the present invention include compounds of formula (A) and formulas (I), (Ia) and (Ib) wherein Ar, X, Y, Z1, Z2, R1, and q have any of the values of the previous embodiments, and R12 and R13 are each independently selected from H and C1-C6 alkyl.",
        "Other aspects of the present invention include compounds of formula (A) and formulas (I), (Ia) and (Ib) wherein Ar, Y, Z1, Z2, R1, and q have any of the values of the previous embodiments, and R12 and R13 together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring, particularly those where the heterocyclic ring is a heterocycloalkyl group, and more particularly those where the heterocyclic group is pyrrolidine or piperidine. In certain aspects, the heterocyclic ring is substituted with one R20. In other aspects, the heterocyclic ring is unsubstituted.",
        "Other aspects of the present invention include compounds of formula (A) and formulas (I), (Ia) and (Ib), wherein Y is C1-C6 alkylene and/or R1 is selected from NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11) NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13.",
        "In accordance with a preferred embodiment, Ar is a C6-C10 aryl, more preferably phenyl or naphtyl.",
        "In accordance with another preferred embodiment, Ar is a 5-10 membered heteroaryl, notably a 5 or 6 membered heteroaryl such as thienyl or furyl.",
        "Ar is optionally substituted with one to three groups, preferably selected from halogen atoms (F, Cl, Br, I), OR22, or phenyl.",
        "In that context, the following Ar substituents are particularly preferred.",
        "Preferably, halogen atoms are Cl and F.",
        "Preferably, OR22 is O(C1-C6) alkyl such as O-methyl, O-ethyl, O-isopropyl.",
        "In accordance with a preferred embodiment, X is O, S(O)y, N(R10), OC(R22)2, C(R22)2O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2NR22, NR22S(O)2.",
        "Preferably, X is O, S(O)y, NH, OCH2, CH2O, CH2NH, NHCH2, C(═O)NH, NHC(═O), S(O)2NH, NHS(O)2, more preferably O, S, SO, NH, OCH2, CH2NH, C(═O)NH, S(O)2NH.",
        "In accordance with a preferred embodiment Y is (C1-C6) alkylene, preferably unsubstituted (C1-C6) alkylene and more preferably CH2.",
        "In accordance with a preferred embodiment, R1 is selected from H, CO2R11, C(═O)NR12R13, and is more preferably a C(═O)NR12R13.",
        "Preferably, R12 and R13, at each occurrence are each independently selected from H, C1-C6 alkyl, or R12 and R13 together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring.",
        "According to a preferred embodiment R12 and R13 together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring, more preferably a 5-6 membered heterocyclic ring.",
        "Preferably, the heterocyclic ring is a cycloalkyl group in which one or more ring atoms, more preferably one or two, are replaced by —N—.",
        "Preferably, the heterocyclic ring is selected from the group consisting of pyrrolidinyl, piperidyl and piperazinyl.",
        "The heterocyclic ring may be substituted with one to three R20 groups, preferably independently selected from C1-C6 alkyl optionally substituted with one to three OH, C(═O)R22, CO2R22, C(═O)NR23R24.",
        "Examples of R20 representing a C(═O)R22 group are notably the groups wherein R22 represents a C1-C6 alkyl group such as acetyl (C(═O)CH3), or ethylcarbonyl (C(═O)CH2CH3).",
        "Examples of R20 representing a CO2R22 group are notably CO2R22 wherein R22 is H or C1-C6 alkyl such as ter-butoxycarbonyl (Boc) (CO2(tBu)).",
        "Examples of R20 representing a C1-C6 alkyl group optionally substituted with one to three OH are notably hydroxyethyl.",
        "In accordance with another preferred embodiment, R12 and R13, at each occurrence are each independently selected from H or C1-C6 alkyl.",
        "Examples of R12, R13 representing a C1-C6 alkyl group are notably methyl, ethyl, t-butyl, optionally substituted with one to three R20 groups, notably OH or CN.",
        "Examples of C(═O)NR12R13 wherein R12 and R13 are each independently selected from H or C1-C6 alkyl are notably C(═O)NH2 or C(═O)NMe2, C(═O)NH(CH2)2OH, C(═O)NHCMe3.",
        "In a prefered embodiment of the present invention there are provided compounds of formula (A) and formula (I):",
        "wherein Ar, X, R2 and R3, q, Y—R1 are defined in the Table 1 below.",
        "In Table 1, the term “position” refers to the position of the Ar—X lateral side chain as compared to —CH2—S(O)q—Y—R1 group on the central benzyl ring.",
        "In addition, the positions of substituents on the Ar group and on the central core phenyl group are numbered as follows:",
        "TABLE 1\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx. n°\nAr\nX\nPosition*\nR2\nR3\nq\nY—R1\n\n\n\n\n\n 13\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npiperazinyl-N-Boc\n\n\n 14\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-N-piperazinyl\n\n\n 19\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-N-piperazinyl\n\n\n 16\n4-ClPh\nS\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 23\n4-ClPh\nS\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 24\n4-ClPh\nSO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 29\nPh\nO\npara\nH\nH\n1\nCH2CONHCHMe2\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n 31\nPh\nO\nmeta\nH\nH\n1\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CONH2\n\n\n 32\nPh\nO\nmeta\nH\nH\n1\nCH2CONH2\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CONMe2\n\n\n 33\nPh\nO\nmeta\nH\nH\n1\nCH2CONMe2\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CONHCHMe2\n\n\n 34\nPh\nO\nmeta\nH\nH\n1\nCH2CONHCHMe2\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 35\nPh\nO\nmeta\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 36\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 37\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CO-N-piperazinyl\n\n\n 38\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CO-N-piperazinyl\n\n\n\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 39\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n 11\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 22\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 27\n3,4-DiClPh\nO\npara\nH\nH\n2\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 30\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2COOH\n\n\n 15\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 20\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 40\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\ncarboxamide)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 41\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\ncarboxamide)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 42\n4-OCH3Ph\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-ClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 43\n2-ClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n4-OHPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 44\n4-OHPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-ClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 45\n2-ClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-ClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 46\n2-ClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-ClPh\nO\npara\nH\nH\n0\nCH2CO-N-piperazinyl\n\n\n 47\n2-ClPh\nO\npara\nH\nH\n1\nCH2CO-N-piperazinyl\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 48\n4-FPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 95\n4-FPh\nO\npara\nH\nH\n2\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 96\n4-FPh\nO\npara\nH\nH\n1\nCH2COOH\n\n\n\n4-FPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 49\n4-FPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 50\n4-FPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n4-FPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 51\n4-FPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-Naphthyl\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 52\n2-Naphthyl\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-Naphthyl\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 53\n2-Naphthyl\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-Naphthyl\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 54\n2-Naphthyl\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2-BiPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 55\n2-BiPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2-BiPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 56\n2-BiPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-ClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 57\n2-ClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-Naphthyl\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 58\n2-Naphthyl\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-BiPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 59\n2-BiPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-BiPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 60\n2-BiPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-ClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 61\n4-ClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CO-1-(4-methyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 62\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CO-1-(4-methyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 63\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\nHHpiperazinyl\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxyethyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 64\n4-FPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxyethyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxyethyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 65\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxyethyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-methyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 66\n4-FPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-methyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-ClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 67\n4-ClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 68\n4-FPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 69\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-ClPh\nS\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 70\n4-ClPh\nS\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 71\n4-ClPh\nSO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 72\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 97\nPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n 98\nPh\nO\northo\nH\nH\n1\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONMe2\n\n\n 99\nPh\nO\northo\nH\nH\n1\nCH2CONMe2\n\n\n\nPh\nO\npara\nH\nH\n0\nCH2CONMe2\n\n\n100\nPh\nO\npara\nH\nH\n1\nCH2CONMe2\n\n\n\nPh\nO\npara\nH\nH\n0\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n101\nPh\nO\npara\nH\nH\n1\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n\nPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n102\nPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONHCH2CN\n\n\n103\nPh\nO\northo\nH\nH\n1\nCH2CONHCH2CN\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONHCHMe2\n\n\n104\nPh\nO\northo\nH\nH\n1\nCH2CONHCHMe2\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONHCMe3\n\n\n105\nPh\nO\northo\nH\nH\n1\nCH2CONHCMe3\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n106\nPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n 12\nPh\nO\northo\nH\nH\n0\nCH2CONH(CH2)2OH\n\n\n 21\nPh\nO\northo\nH\nH\n1\nCH2CONH(CH2)2OH\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n107\nPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CONH(CH2)2OH\n\n\n108\nPh\nO\nmeta\nH\nH\n1\nCH2CONH(CH2)2OH\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n109\nPh\nO\nmeta\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n110\nPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n111\nPh\nO\npara\nH\nH\n1\nCH2CONH(CH2)2OH\n\n\n112\nPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n113\n4-ClPh\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n114\n3,4-DiOCH3Ph\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n115\n2-Naphthyl\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n116\n4-ClPh\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n117\n3,4DiFPh\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n118\n2,4-DiOCH3Ph\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n119\n3,4,5-\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n\nTriOCH3Ph\n\n\n120\n3,4-DiOCH3Ph\nCONH\nmeta\nH\nH\n1\nCH2CONH2\n\n\n121\n2,4-DiOCH3Ph\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n122\n3,4-DiOCH3Ph\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n123\n4-FPh\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n124\n3,4-DiClPh\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n125\n2,4-DiOCH3Ph\nCONH\nmeta\nH\nH\n1\nCH2CONH2\n\n\n126\n4-FPh\nCONH\nmeta\nH\nH\n1\nCH2CONH2\n\n\n127\n3,4-DiClPh\nCONH\nmeta\nH\nH\n1\nCH2CONH2\n\n\n7\n4-ClPh\nO\npara\nH\nH\n0\nCH3\n\n\n8\n4-ClPh\nO\npara\nH\nH\n1\nCH3\n\n\n9\n4-ClPh\nO\npara\nH\nH\n1\nCH2[4(4-\n\n\n\n\n\n\n\n\n\nClPhenoxy)phenyl]\n\n\n\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH3\n\n\n 10\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH3\n\n\n\n4-ClPh\nS\northo\nH\nH\n0\nCH2CO-N-piperazinyl\n\n\n 73\n4-ClPh\nS\northo\nH\nH\n1\nCH2CO-N-piperazinyl\n\n\n\n2,3-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 74\n2,3-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,5-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 75\n2,5-DiCiPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,5-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 76\n2,5-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2,3-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 77\n2,3-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 78\n2,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,4-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 79\n2,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,4-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 80\n2,4-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2,4-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 81\n2,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n3,5-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 82\n3,5-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,5-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 83\n3,5-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,5-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 84\n3,5-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n3,5-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 85\n3,5-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2,5-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 86\n2,5-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nS\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 87\n3,4-DiClPh\nS\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,5-DiClPh\nS\npara\nH\nH\n0\nCH2CONH2\n\n\n 88\n2,5-DiClPh\nS\npara\nH\nH\n1\nCH2CONH2\n\n\n\n3,4-DiClPh\nS\npara\nH\nH\n0\nCH2CONH2\n\n\n 89\n3,4-DiClPh\nS\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2,3-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 90\n2,3-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,6-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 91\n2,6-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,6-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 92\n2,6-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2,3-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 93\n2,3-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n 94\n2,3-DiClPh\nO\npara\nH\nH\n2\nCH2CONH2\n\n\n135\nPh\nNH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n136\nPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n134\n4-OCH3Ph\nNH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n131\n4-FPh\nSO2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n137\n4-OCH3Ph\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n138\n4-FPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n139\n4-ClPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n140\n4-FPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n128\n3,4-DiClPh\nCONH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n129\n4-FPh\nCONH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n141\n3,4-DiClPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n132\n4-ClPh\nSO2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n147\n4-FPh\nCH2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n133\n3,4-DiClPh\nSO2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n148\n3,4-DiClPh\nCH2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n149\n4-FPh\nCH2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n146\n3,4-DiClPh\nCH2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n130\n3,4-DiClPh\nSO2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n145\n2-Furyl\nCH2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n144\n2-Thienyl\nCH2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n142\n2-Thienyl\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n143\n2-Furyl\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n152\nPh\nOCH2\northo\nH\nH\n0\nCH2CONH2\n\n\n153\nPh\nOCH2\northo\nH\nH\n1\nCH2CONH2\n\n\n 17\n4-ClPh\nO\npara\n2′-Cl\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 18\n4-ClPh\nO\npara\n2′-Cl\nH\n0\nCH2CONH2\n\n\n 25\n4-ClPh\nO\npara\n2′-Cl\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 26\n4-ClPh\nO\npara\n2′-Cl\nH\n1\nCH2CONH2\n\n\n149a\n3,4-DiClPh\nCONH\npara\nH\nH\n1\nCH2CONH2\n\n\n109a\n4-ClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n109b\n3-Cl-4-FPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n109c\n4-Cl-3-FPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n109d\n3-Cl-4-FPh\nO\northo\nH\nH\n2\nCH2CONH2\n\n\n 10a\n4-ClPh\nO\northo\n4′-Cl\nH\n0\nCH2COOH\n\n\n 18a\n4-ClPh\nO\northo\n4′-Cl\nH\n0\nCH2CONH2\n\n\n 27a\n4-ClPh\nO\northo\n4′-Cl\nH\n1\nCH2CONH2\n\n\n 27b\n4-ClPh\nO\northo\n4′-Cl\nH\n2\nCH2CONH2\n\n\n109e\n3,4-DiFPh\nO\northo\n4′-Cl\nH\n1\nCH2CONH2\n\n\n109f\n3,4-DiClPh\nO\northo\nH\nH\n2\nCH2CONH2\n\n\n 30a\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2COOH\n\n\n 30d\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2COOMenthyl\n\n\n\n\n\n\n\n\n\n(1R,2S,5R)\n\n\n 30e\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO0H\n\n\n\n\n\n\n\n\n(−)\n\n\n 30f\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2COOH\n\n\n\n\n\n\n\n\n(+)\n\n\n 20a\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n\n\n\n\n\n(−)\n\n\n 20b\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n\n\n\n\n\n(+)\n\n\n 30b\n3,4-DiClPh\nO\northo\nH\nH\n2\nCH2COOH\n\n\n112a\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONHCH3\n\n\n112b\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CON(C2H5)2\n\n\n 30f\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CON(CH3)2\n\n\n 30g\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CON(CH3)2\n\n\n\n\n\nPh = phenyl, ClPh = chlorophenyl, DiClPh = di-chlorophenyl, FPh = Fluoprophenyl.\n\n\n*Position: Ortho is position 2′, meta is position 3′ and para is position 4′.",
        "In a second embodiment, the present invention provides a method for treatment of diseases comprising administering to a subject in need thereof a therapeutically effective amount of a compound of formula (A) and formula (I), or a pharmaceutically acceptable salt thereof. In a preferred embodiment, the present invention is to provide methods of treating or preventing diseases or disorders, including treatment of sleepiness, promotion and/or improvement of wakefulness, preferably improvement of wakefulness in patients with excessive sleepiness associated with narcolepsy, sleep apnea, preferably obstructive sleep apnea/hypopnea, and shift work disorder; treatment of Parkinson's disease; Alzheimer's disease; cerebral ischemia; stroke; eating disorders; attention deficit disorder (“ADD”), attention deficit hyperactivity disorder (“ADHD”); depression; schizophrenia; fatigue, preferably fatigue associated with cancer or neurological diseases, such as multiple sclerosis and chronic fatigue syndrome; stimulation of appetite and weight gain and improvement of cognitive dysfunction.",
        "In a third embodiment, the present invention provides a pharmaceutical compositions comprising the compounds of formula (A) and formula (I) wherein the compositions comprise one or more pharmaceutically acceptable excipients and a therapeutically effective amount of at least one of the compounds of the present invention, or a pharmaceutically acceptable salt or ester form thereof.",
        "In a fourth embodiment, the present invention provides for the use of compounds of formula (A) and formula (I) or pharmaceutically acceptable salts thereof for the manufacture of a medicament for the treatment of a disease or disorder.",
        "These and other objects, features and advantages of the benzyl-thioalkyl derivatives will be disclosed in the following detailed description of the patent disclosure.",
        "Definitions",
        "The following terms and expressions contained herein are defined as follows:",
        "As used herein, the term “about” refers to a range of values from ±10% of a specified value. For example, the phrase “about 50 mg” includes ±10% of 50, or from 45 to 55 mg.",
        "As used herein, a range of values in the form “x-y” or “x to y”, or “x through y”, include integers x, y, and the integers therebetween. For example, the phrases “1-6”, or “1 to 6” or “1 through 6” are intended to include the integers 1, 2, 3, 4, 5, and 6. Preferred embodiments include each individual integer in the range, as well as any subcombination of integers. For example, preferred integers for “1-6” can include 1, 2, 3, 4, 5, 6, 1-2, 1-3, 1-4, 1-5, 2-3, 2-4, 2-5, 2-6, etc.",
        "As used herein “stable compound” or “stable structure” refers to a compound that is sufficiently robust to survive isolation to a useful degree of purity from a reaction mixture, and preferably capable of formulation into an efficacious therapeutic agent. The present invention is directed only to stable compounds.",
        "As used herein, the term “alkyl” refers to a straight-chain, or branched alkyl group having 1 to 8 carbon atoms, such as methyl, ethyl, propyl, isopropyl, butyl, isobutyl, sec-butyl, tert-butyl, pentyl, isoamyl, neopentyl, 1-ethylpropyl, 3-methylpentyl, 2,2-dimethylbutyl, 2,3-dimethylbutyl, hexyl, octyl, etc. The alkyl moiety of alkyl-containing groups, such as alkoxy, alkoxycarbonyl, and alkylaminocarbonyl groups, has the same meaning as alkyl defined above. Lower alkyl groups, which are preferred, are alkyl groups as defined above which contain 1 to 4 carbons. A designation such as “C1-C4 alkyl” refers to an alkyl radical containing from 1 to 4 carbon atoms.",
        "As used herein, the term “alkenyl” refers to a straight chain, or branched hydrocarbon chains of 2 to 8 carbon atoms having at least one carbon-carbon double bond. A designation “C2-C8 alkenyl” refers to an alkenyl radical containing from 2 to 8 carbon atoms. Examples of alkenyl groups include ethenyl, propenyl, isopropenyl, 2,4-pentadienyl, etc.",
        "As used herein, the term “alkynyl” refers to a straight chain, or branched hydrocarbon chains of 2 to 8 carbon atoms having at least one carbon-carbon triple bond. A designation “C2-C8 alkynyl” refers to an alkynyl radical containing from 2 to 8 carbon atoms. Examples include ethynyl, propynyl, isopropynyl, 3,5-hexadiynyl, etc.",
        "As used herein, the term “alkylene” refers to a substituted or unsubstituted, branched or straight chained hydrocarbon of 1 to 8 carbon atoms, which is formed by the removal of two hydrogen atoms. A designation such as “C1-C4 alkylene” refers to an alkylene radical containing from 1 to 4 carbon atoms. Examples include methylene (—CH2—), propylidene (CH3CH2CH═), 1,2-ethandiyl (—CH2CH2—), etc.",
        "As used herein, the term “phenylene” refers to a phenyl group with an additional hydrogen atom removed, i.e. a moiety with the structure of:",
        "",
        "As used herein, the terms “carbocycle”, “carbocyclic” or “carbocyclyl” refer to a substituted or unsubstituted, stable monocyclic or bicyclic hydrocarbon ring system which is saturated, partially saturated or unsaturated, and contains from 3 to 10 ring carbon atoms. Accordingly the carbocyclic group may be aromatic or non-aromatic, and includes the cycloalkyl and aryl compounds defined herein. The bonds connecting the endocyclic carbon atoms of a carbocyclic group may be single, double, triple, or part of a fused aromatic moiety.",
        "As used herein, the term “cycloalkyl” refers to a saturated or partially saturated mono- or bicyclic alkyl ring system containing 3 to 10 carbon atoms. A designation such as “C5-C7 cycloalkyl” refers to a cycloalkyl radical containing from 5 to 7 ring carbon atoms. Preferred cycloalkyl groups include those containing 5 or 6 ring carbon atoms. Examples of cycloalkyl groups include such groups as cyclopropyl, cyclobutyl, cyclopentyl, cyclohexl, cycloheptyl, cyclooctyl, pinenyl, and adamantanyl.",
        "As used herein, the term “aryl” refers to a substituted or unsubstituted, mono- or bicyclic hydrocarbon aromatic ring system having 6 to 12 ring carbon atoms. Examples include phenyl and naphthyl. Preferred aryl groups include unsubstituted or substituted phenyl and naphthyl groups. Included within the definition of “aryl” are fused ring systems, including, for example, ring systems in which an aromatic ring is fused to a cycloalkyl ring. Examples of such fused ring systems include, for example, indane, indene, and tetrahydronaphthalene.",
        "As used herein, the terms “heterocycle”, “heterocyclic” or “heterocyclyl” refer to a substituted or unsubstituted carbocyclic group in which the ring portion includes at least one heteroatom such as O, N, or S. The nitrogen and sulfur heteroatoms may be optionally oxidized, and the nitrogen may be optionally substituted in non-aromatic rings. Heterocycles are intended to include heteroaryl and heterocycloalkyl groups.",
        "As used herein, the term “heterocycloalkyl” refers to a cycloalkyl group in which one or more ring carbon atoms are replaced by at least one hetero atom such as —O—, —N—, or —S—. Examples of heterocycloalkyl groups include pyrrolidinyl, pyrrolinyl, imidazolidinyl, imidazolinyl, pirazolidinyl, pirazolinyl, pyrazalinyl, piperidyl, piperazinyl, morpholinyl, thiomorpholinyl, tetrahydrofuranyl, dithiolyl, oxathiolyl, dioxazolyl, oxathiazolyl, pyranyl, oxazinyl, oxathiazinyl, and oxadiazinyl.",
        "As used herein, the term “heteroaryl” refers to an aromatic group containing 5 to 10 ring carbon atoms in which one or more ring carbon atoms are replaced by at least one hetero atom such as —O—, —N—, or —S—. Examples of heteroaryl groups include pyrrolyl, furanyl, thienyl, pirazolyl, imidazolyl, thiazolyl, isothiazolyl, isoxazolyl, oxazolyl, oxathiolyl, oxadiazolyl, triazolyl, oxatriazolyl, furazanyl, tetrazolyl, pyridyl, pyrazinyl, pyrimidinyl, pyridazinyl, triazinyl, indolyl, isoindolyl, indazolyl, benzofuranyl, isobenzofuranyl, purinyl, quinazolinyl, quinolyl, isoquinolyl, benzoimidazolyl, benzothiazolyl, benzothiophenyl, thianaphthenyl, benzoxazolyl, benzisoxazolyl, cinnolinyl, phthalazinyl, naphthyridinyl, and quinoxalinyl. Included within the definition of “heteroaryl” are fused ring systems, including, for example, ring systems in which an aromatic ring is fused to a heterocycloalkyl ring. Examples of such fused ring systems include, for example, phthalamide, phthalic anhydride, indoline, isoindoline, tetrahydroisoquinoline, chroman, isochroman, chromene, and isochromene.",
        "As used herein, the term “arylalkyl” refers to an alkyl group that is substituted with an aryl group. Examples of arylalkyl groups include, but are not limited to, benzyl, bromobenzyl, phenethyl, benzhydryl, diphenylmethyl, triphenylmethyl, diphenylethyl, naphthylmethyl, etc.",
        "As used herein, the term “amino acid” refers to a group containing both an amino group and a carboxyl group. Embodiments of amino acids include α-amino, β-amino, γ-amino acids. The α-amino acids have a general formula HOOC—CH(side chain)-NH2. In certain embodiments, substituent groups for the compounds of the present invention include the residue of an amino acid after removal of the hydroxyl moiety of the carboxyl group thereof; i.e., groups of formula —C(═O)CH(NH2)-(side chain). The amino acids can be in their D, L or racemic configurations. Amino acids include naturally-occurring and non-naturally occurring moieties. The naturally-occurring amino acids include the standard 20 α-amino acids found in proteins, such as glycine, serine, tyrosine, proline, histidine, glutamine, etc. Naturally-occurring amino acids can also include non-α-amino acids (such as β-alanine, γ-aminobutyric acid, homocysteine, etc.), rare amino acids (such as 4-hydroxyproline, 5-hydroxylysine, 3-methylhistidine, etc.) and non-protein amino acids (such as citrulline, ornithine, canavanine, etc.). Non-naturally occurring amino acids are well-known in the art, and include analogs of natural amino acids. See Lehninger, A. L. Biochemistry, 2nd ed.; Worth Publishers: New York, 1975; 71-77, the disclosure of which is incorporated herein by reference. Non-naturally occurring amino acids also include α-amino acids wherein the side chains are replaced with synthetic derivatives. Representative side chains of naturally occurring and non-naturally occurring a-amino acids are shown below in Table 2.",
        "TABLE 2\n\n\n\n\n\n\n\nH\nCH3\nCH(CH3)2\n\n\nCH2CH(CH3)2\nCH(CH3)CH2CH3\nCH2OH\n\n\nCH2SH\nCH(OH)CH3\nCH2CH2SCH3\n\n\nCH2C6H5\n(CH2)4NH2\n(CH2)3NHC(═NH)NH2\n\n\nCH2COOH\nCH2CH2COOH\nCH2CONH2\n\n\nCH2CH2CONH2\nCH2CH3\nCH2CH2CH3\n\n\nCH2CH2CH2CH3\nCH2CH2SH\nCH2CH2OH\n\n\nCH2CH2SCH3\n(CH2)3NH2\n(CH2)2CH(OH)CH2NH2\n\n\n(CH2)3NHC(═O)NH2\n(CH2)2ONHC(═NH)NH2\nCH2C(═O)NHCH2COOH",
        "As used herein, the term “subject” refers to a warm blooded animal such as a mammal, preferably a human, or a human child, which is afflicted with, or has the potential to be afflicted with one or more diseases and conditions described herein.",
        "As used herein, a “therapeutically effective amount” refers to an amount of a compound of the present invention effective to prevent or treat the symptoms of particular disorder. Such disorders include, but are not limited to, those pathological and neurological disorders associated with the aberrant activity of the receptors described herein, wherein the treatment or prevention comprises inhibiting, inducing, or enhancing the activity thereof by contacting the receptor with a compound of the present invention.",
        "As used herein, the term “pharmaceutically acceptable” refers to those compounds, materials, compositions, and/or dosage forms which are, within the scope of sound medical judgment, suitable for contact with the tissues of human beings and animals without excessive toxicity, irritation, allergic response, or other problem complications commensurate with a reasonable benefit/risk ratio.",
        "As used herein, the term “unit dose” refers to a single dose which is capable of being administered to a patient, and which can be readily handled and packaged, remaining as a physically and chemically stable unit dose comprising either the active compound itself, or as a pharmaceutically acceptable composition, as described hereinafter.",
        "All other terms used in the description of the present invention have their meanings as is well known in the art.",
        "In another aspect, the present invention is directed to pharmaceutically acceptable salts of the compounds described above. As used herein, “pharmaceutically acceptable salts” includes salts of compounds of the present invention derived from the combination of such compounds with non-toxic acid or base addition salts.",
        "Acid addition salts include inorganic acids such as hydrochloric, hydrobromic, hydroiodic, sulfuric, nitric and phosphoric acid, as well as organic acids such as acetic, citric, propionic, tartaric, glutamic, salicylic, oxalic, methanesulfonic, para-toluenesulfonic, succinic, and benzoic acid, and related inorganic and organic acids.",
        "Base addition salts include those derived from inorganic bases such as ammonium and alkali and alkaline earth metal hydroxides, carbonates, bicarbonates, and the like, as well as salts derived from basic organic amines such as aliphatic and aromatic amines, aliphatic diamines, hydroxy alkamines, and the like. Such bases useful in preparing the salts of this invention thus include ammonium hydroxide, potassium carbonate, sodium bicarbonate, calcium hydroxide, methylamine, diethylamine, ethylenediamine, cyclohexylamine, ethanolamine and the like.",
        "In addition to pharmaceutically-acceptable salts, other salts are included in the invention. They may serve as intermediates in the purification of the compounds, in the preparation of other salts, or in the identification and characterization of the compounds or intermediates.",
        "The pharmaceutically acceptable salts of compounds of the present invention can also exist as various solvates, such as with water, methanol, ethanol, dimethylformamide, ethyl acetate and the like. Mixtures of such solvates can also be prepared. The source of such solvate can be from the solvent of crystallization, inherent in the solvent of preparation or crystallization, or adventitious to such solvent. Such solvates are within the scope of the present invention.",
        "The present invention also encompasses the pharmaceutically acceptable prodrugs of the compounds disclosed herein. As used herein, “prodrug” is intended to include any compounds which are converted by metabolic processes within the body of a subject to an active agent that has a formula within the scope of the present invention. Since prodrugs are known to enhance numerous desirable qualities of pharmaceuticals (e.g., solubility, bioavailability, manufacturing, etc.) the compounds of the present invention may be delivered in prodrug form. Conventional procedures for the selection and preparation of suitable prodrug derivatives are described, for example, in Prodrugs, Sloane, K. B., Ed.; Marcel Dekker: New York, 1992, incorporated by reference herein in its entirety.",
        "It is recognized that compounds of the present invention may exist in various stereoisomeric forms. As such, the compounds of the present invention include both diastereomers and enantiomers. The compounds are normally prepared as racemates and can conveniently be used as such, but individual enantiomers can be isolated or synthesized by conventional techniques if so desired. Such racemates and individual enantiomers and mixtures thereof form part of the present invention.",
        "It is well known in the art how to prepare and isolate such optically active forms. Specific stereoisomers can be prepared by stereospecific synthesis using enantiomerically pure or enantiomerically enriched starting materials. The specific stereoisomers of either starting materials or products can be resolved and recovered by techniques known in the art, such as resolution of racemic forms, normal, reverse-phase, and chiral chromatography, recrystallization, enzymatic resolution, or fractional recrystallization of addition salts formed by reagents used for that purpose. Useful methods of resolving and recovering specific stereoisomers described in Eliel, E. L.; Wilen, S. H. Stereochemistry of Organic Compounds; Wiley: New York, 1994, and Jacques, J., et al. Enantiomers, Racemates, and Resolutions; Wiley: New York, 1981, each incorporated by reference herein in their entireties.",
        "It is further recognized that functional groups present on the compounds of Formula I may contain protecting groups. For example, the amino acid side chain substituents of the compounds of Formula I can be substituted with protecting groups such as benzyloxycarbonyl or t-butoxycarbonyl groups. Protecting groups are known per se as chemical functional groups that can be selectively appended to and removed from functionalities, such as hydroxyl groups and carboxyl groups. These groups are present in a chemical compound to render such functionality inert to chemical reaction conditions to which the compound is exposed. Any of a variety of protecting groups may be employed with the present invention. Preferred protecting groups include the benzyloxycarbonyl (Cbz; Z) group and the tert-butyloxycarbonyl (Boc) group. Other preferred protecting groups according to the invention may be found in Greene, T. W. and Wuts, P. G. M., “Protective Groups in Organic Synthesis” 2d. Ed., Wiley & Sons, 1991.",
        "Synthesis",
        "The compounds of the present invention may be prepared in a number of methods well known to those skilled in the art, including, but not limited to those described below, or through modifications of these methods by applying standard techniques known to those skilled in the art of organic synthesis. All processes disclosed in association with the present invention are contemplated to be practiced on any scale, including milligram, gram, multigram, kilogram, multikilogram or commercial industrial scale.",
        "It will be appreciated that the compounds of the present invention may contain one or more asymmetrically substituted carbon atoms, and may be isolated in optically active or racemic forms. Thus, all chiral, diastereomeric, racemic forms and all geometric isomeric forms of a structure are intended, unless the specific stereochemistry or isomeric form is specifically indicated. It is well known in the art how to prepare such optically active forms. For example, mixtures of stereoisomers may be separated by standard techniques including, but not limited to, resolution of racemic forms, normal, reverse-phase, and chiral chromatography, preferential salt formation, recrystallization, and the like, or by chiral synthesis either from active starting materials or by deliberate chiral synthesis of target centers.",
        "As will be readily understood, functional groups present on the compounds of Formula I may contain protecting groups. For example, the amino acid side chain substituents of the compounds of Formula I can be substituted with protecting groups such as benzyloxycarbonyl or t-butoxycarbonyl groups. Protecting groups are known per se as chemical functional groups that can be selectively appended to and removed from functionalities, such as hydroxyl groups and carboxyl groups. These groups are present in a chemical compound to render such functionality inert to chemical reaction conditions to which the compound is exposed. Any of a variety of protecting groups may be employed with the present invention. Preferred protecting groups include the benzyloxycarbonyl (Cbz; Z) group and the tert-butyloxycarbonyl (Boc) group. Other preferred protecting groups according to the invention may be found in Greene, T. W. and Wuts, P. G. M., Protective Groups in Organic Synthesis, 2d. Ed., Wiley & Sons, 1991.",
        "The general routes to prepare the examples shown in Table 1 of the present invention are shown in the Scheme A, Scheme B, Scheme C and Scheme D. The reagents and starting materials are commercially available, or readily synthesized by well-known techniques by one of ordinary skill in the arts. All substituents in the synthetic Schemes, unless otherwise indicated, are as previously defined.",
        "Compounds of general structure (A) and/or (I) were prepared according to Scheme A.",
        "",
        "Step 1: Synthesis of Compounds of General Structure C:",
        "An appropriate aromatic or heteroaromatic alcohol or thiol of general formula A is reacted with an appropriate halo-aryl or halo-heteroaryl aldehyde or acid of general formula B, in a polar aprotic solvent as DMF and like at reflux temperature to give the corresponding aldehyde or acid compound C wherein Ar, X, R2 and R3 are as defined in the final product and W represents the acid or the aldehyde group. An appropriate aromatic or heteroaromatic alcohol or thiol of general formula A is one where Ar is as defined in the final product and X represents oxygen or sulfure atoms. An appropriate halo-aryl or halo-heteroaryl aromatic aldehyde or acid of general formula B is one where R2 and R3 are as defined in the final product, W is an acid or an aldehyde group and hal is an halogen atom: F, Cl, Br. Upon completion, the reaction mixture is quenched by an appropriate quenching agent and the product, compound C, is isolated by conventional methods commonly employed by those skilled in the art. Compounds of general formula C may also be commercially available.",
        "Step 2: Synthesis of Compounds of General Structure D:",
        "The appropriate compound C of the preceding step, dissolved in a protic polar solvent as isopropanol and like, may be treated with a suitable reducing agent such as metallic hydrides. For example, the compound C may be treated with sodium borohydride (or other standard reductive conditions as LiAlH4, diisobutylaluminium hydride and like) in order to provide the corresponding alcohol of general formula D. When the starting material is a compound C bearing an acidic function (W is COOH), the reduction reaction might be performed after activation of the carboxy moiety with an activating agent as isobutylchloroformate and like, or by conventional methods commonly employed by those skilled in the art.",
        "Step 3: Synthesis of Compounds of General Structure E:",
        "In step 3, the alcohol moiety of compound D is converted to the corresponding thiouronium salt.",
        "In a particular embodiment, the compound E is formed by reacting the compound D with a suitable acid. In certain aspects, the suitable acid is selected from the group consisting of hydrobromic acid, hydrochloric acid or sulfuric acid.",
        "For example, an appropriate amount of thiourea in 48% HBr and water is warmed (preferably to 60-70° C.), followed by addition of compound D. The reaction mixture is refluxed and the stirring is continued for an additional period of time for completion of the reaction. The reaction mixture is cooled to room temperature (in some cases, an ice-bath might be needed) and the precipitated solid is optionally filtered and thoroughly washed with water to generate compound E. Sometimes there is an oil in place of the solid: in that case, the oil is thoroughly washed with water by decantation and used directly in step 4.",
        "Step 4: Synthesis of Compounds of General Structure I Wherein q=0",
        "The thiouronium salt of general structure E is first converted into the corresponding thiol which further undergoes a substitution reaction with an appropriate reactant of generic structure LG-Y—R1 wherein Y is as defined in the final product and LG is a suitable leaving group (for example an halogen atom as Cl, Br) to generate compound I wherein q is 0.",
        "In step 4, the wet solid (or the oil with some remaining water) from the previous step is taken into additional water and treated with an aqueous base, preferably sodium hydroxide solution. The mixture is warmed preferably to 70-80° C., but in some cases a higher temperature might be needed and to it an appropriate amount of LG-Y—R1 in water (or in some cases, an alcoholic solvent) is added. The reaction mixture is refluxed for an appropriate period of time, cooled, taken into water and sometimes washed with an organic solvent (preferably ether). The basic aqueous layer is acidified with an inorganic acid solution (e.g. aqueous HCl solution). The aqueous (acidic) solution is then extracted several times into an organic solvent (e.g. ether or ethyl acetate). The combined organic layer is washed with brine, dried (MgSO4 or Na2SO4) and concentrated to give the crude product that may be used directly in the next step. However, purification could be achieved by employing known purification techniques (e.g. recrystallization or column chromatography) to provide pure compound I wherein q is O, Ar, X, R1, Y, R2 and R3 are as defined in the final product.",
        "In addition, at Step 4, when the obtained compound I is an acid (R1 is COOH), appropriately, it may be converted into the corresponding alkyl ester by conventional methods commonly employed by those skilled in the art.",
        "Step 5: Synthesis of Compounds of General Structure I Wherein q is 1 or 2:",
        "Compounds of structure I wherein q is 0 may optionally be oxidized to generate compounds of structure I wherein q is 1 or 2. Compound I wherein q is 1 is prepared under mild conditions by reacting compound I wherein q is 0 in an appropriate solvent with an appropriate oxidizing agent. An appropriate oxidizing agent is one that oxidizes the sulphide group of compound I (wherein q is 0). The corresponding product is isolated and purified by methods well known in the art.",
        "For example, to solution of compound I (wherein q is 0) in acetic acid, an appropriate oxidizing agent (e.g. 30% wt H2O2, 1 equivalent) in the acetic acid is slowly added. Stirring is continued at low temperature until the disappearance of the starting material, as evidenced by various analytical techniques. The reaction mixture is concentrated. The desired product (compound I wherein q is 1) is purified, if needed, by employing known purification techniques (preferably by column chromatography and/or crystallization). In some cases, the oxidation is performed by employing 50% H2O2 in glacial acetic acid solvent.",
        "Compound of formula I wherein q is 2, may be obtained from the appropriate compound of formula I wherein q is either 0 or 1 under more drastic reaction conditions such as H2O2 (more than 2 equivalents) in acidic medium, under heating, at temperature comprise between room temperature and the boiling temperature of the solvent, preferably between 40 and 60° C., for a time sufficient to obtain the desired product, approximately between 2 and 10 hours, preferably approximately 8 hours.",
        "The following scheme (Scheme B) corresponds to the synthesis of compounds of general structure I wherein R1 is C(═O)NR12R13.",
        "",
        "The different steps 1, 2, 3 and 4 were as described in scheme A.",
        "In addition, at Step 4, when the obtained compound I is an acid (R is H), appropriately, it may be converted into the corresponding alkyl ester by conventional methods commonly employed by those skilled in the art.",
        "Then, two different synthetic routes may optionally be used to generate compounds I wherein R1 is C(═O)NR12R13.",
        "Route A",
        "Step 5: Synthesis of Compounds of General Formula I Wherein q is 0:",
        "In step 5, the appropriate carboxylic acid or ester of general formula I (wherein q is 0) is reacted with an appropriate amine of general structure NHR12R13 and converted into the corresponding amide of general formula I wherein q is 0 and Ar, X, R2, R3, Y, R12 and R13 are as defined in the final product.",
        "Compound I (wherein q is 0 and R1 is COOMe) may be reacted with Ammonium hydroxide (28% aqueous solution as example) or ammonia gas to give the desired compound I (wherein q is 0 and R12 and R13 are H). Alternatively, compound I (wherein q is 0 and R1 is COOH) may be reacted with an appropriate amine of general formula NHR12R13, a coupling reagent such as EDCI or DCCI, or a polymer supported coupling reagent (N-cyclohexyl carbodiimide), and optionally HOBT in an aprotic solvent as methylene chloride and like to provide amide of general formula I wherein q is 0. An appropriate amine is one which correlates to R12 and R13 as defined in the final product. In some cases, when the appropriate amide bears a protecting group as the tert-butyloxycarbonyl (“Boc”) and like on a second nitrogen group, N-boc amine is de-protected in a subsequent step. De-protection may be performed at room temperature by acid treatment such as 4N HCl in 1,4-dioxane or trifluoroacetic acid in CH2Cl2.",
        "Step 6: Synthesis of Compounds of General Structure I Wherein q is 1 or 2:",
        "Compounds of structure I wherein q is 0 may optionally be oxidized to generate compounds of structure I wherein q is 1 or 2 according to the procedure described previously in Scheme A (step 5).",
        "Route B",
        "Route B may alternatively be used to process appropriately compound I wherein R1 is C(═O)NR12R13.",
        "In step 5, the process consisted, in oxidizing an appropriate compound I wherein q is 0 to generate the corresponding sufoxide or sulfone as described above in step 6, which, in turn, is reacted with an appropriate amine of general formula NHR12R13, in the next step, to give raise to the corresponding amide (compound I wherein q is 1 or 2) as described above in step 5.",
        "Scheme C, corresponds to an alternative pathway to generate compounds of general structure I wherein X is different from O or S.",
        "",
        "Step 1: Synthesis of Compounds of General Structure J:",
        "An appropriate aromatic or heteroaromatic halide of general formula H substituted with a nitro group in a suitable position as defined in the final product is reacted with an appropriate thiol-substituted alkylcarboxylic acid or ester of structure HS-Y-R1 (wherein R1 is H or alkyl, and Y is defined as in the final compound) in an aprotic solvent such as acetone and like and in the presence of an inorganic base as potassium carbonate and a catalyst as potassium iodine and like to generate compound J. The reaction is performed at reflux temperature.",
        "Step 2: Synthesis of Compounds of General Structure M:",
        "Route A",
        "i) Oxidation Reaction: Synthesis of Compound of General Formula L",
        "Then, appropriate compounds of general formula J wherein R1, R2 and R3 and Y are as defined in the final product are prepared by reacting compound J in an appropriate solvent with an appropriate oxidizing agent. An appropriate oxidizing agent is one that oxidizes the sulfide group of compound J. The corresponding product is isolated and purified by methods well known in the art.",
        "For example, to solution of compound J in acetic acid, an appropriate oxidizing agent (e.g. 30% bw H2O2, 1 equivalent) in the same solvent is slowly added. Stirring is continued until the disappearance of the starting material, as evidenced by various analytical techniques. The reaction mixture is concentrated. The desired product (compound L wherein q is 1) is purified, if needed, by employing known purification techniques (preferably by column chromatography and/or crystallization). In some cases, the oxidation is performed by employing 50% H2O2 in glacial acetic acid solvent.",
        "Compound of formula L wherein q is 2, may be obtained under more drastic reaction conditions such as H2O2 (more than 2 equivalents) in acidic medium, under heating, preferably at temperature comprise between room temperature and the boiling temperature of the solvent, preferably between 40 and 60° C., for a time sufficient to obtain the desired product, usually approximately between 2 and 10 hours, preferably approximately 8 hours.",
        "ii) Catalytic Hydrogenation",
        "Appropriate amino compound of general formula M may be produced by catalytic hydrogenation from the appropriate nitro compound of formula L. The hydrogenation reaction is performed under pressure in a hydrogen atmosphere and catalytic conditions using a catalyst as palladium on carbon or platinium oxide and like in an alcoholic solvent such as methanol and like.",
        "Route B",
        "i) Synthesis of Compound of General Formula K",
        "Before undergoing oxidation reaction, appropriately, compound J wherein R1 is a carboxylic acid may be reacted with an appropriate amine of structure NHR12R13. The amidation reaction is performed using a coupling such as EDCI or DCCI, or a polymer supported coupling reagent (N-cyclohexyl carbodiimide) and optionally HOBT in an aprotic solvent as methylene chloride and like to give the desired amide of general formula K.",
        "Alternatively, compound J wherein R1 is a carboxylic acid may be converted into the corresponding alkyl ester by conventional methods commonly employed by those skilled in the art. Then, the ester is reacted with an appropriate amine of general structure NHR12R13 in the presence of trimethyl aluminium hydride for instance or with ammonium hydroxide (28% aqueous solution as example) or ammonia gas to give the desired compound K.",
        "ii) Oxidation and Catalytic Hydrogenation of Compound K",
        "Compounds K wherein R1 is an amide are then oxidized according to the process described above for Route A to generate the corresponding compound of formula L which, in turn, is reduced in compound M according to the process described above in Route A.",
        "Route C",
        "The compound of general formula K wherein R1 is the appropriate amide C(═O)NHR12R13, R2 and R3 and Y are as defined in the final product prepared by amidation of compound J is reduced in compound M′ according to the process described above in route A. Then the corresponding compound M wherein q is 1 or 2 is generated as according to the oxidation process described in Route A.",
        "Step 3: Synthesis of Compounds of General Structure I Wherein X is NH, C(R22)2NH, C(═O)NH, S(O)2NH.",
        "Compounds of general formula I, wherein Ar, X, q, R2, R3, Y and R1 are as defined in the final product may be prepared in a one step procedure in suitable experimental conditions as to obtain the target X definition.",
        "For exemple, compound of formula I wherein X is NH may be obtained by coupling an appropriate amine M with an appropriate boronic acid in an aprotic solvent as dichloromethane and the like. The reaction is carried out in the presence of a base such as 2,6-lutidine and like as pyridine, triethylamine, diisopropylethylamine and in catalytic conditions using copper(II) acetate. An appropriate boronic acid is one which correlates to Ar as defined in the final product.",
        "Compounds of general formula I, wherein X is C(R22)2NH may be prepared in a one step procedure by alkylation an appropriate amine M with a suitable alkylating agent in an aprotic solvent as DMF, dichloromethane and the like. A suitable alkylating agent is one which correlates to Ar and R22 as defined in the final product.",
        "Compounds of formula I wherein X is an amide may be obtained by aroylation of an appropriate amine M with an appropriate aromatic or heteroaromatic halide in an aprotic solvent as dichloromethane and the like. The reaction is carried out in the presence of a base such as as pyridine, and the like triethylamine, diisopropylethylamine. An appropriate aromatic or heteroaromatic halide is one which correlates to Ar as defined in the final product.",
        "Compounds of general formula I, wherein X is S(O)2NH may be prepared in a one step procedure by sulfonation of an appropriate amine M with an appropriate aromatic or heteroaromatic sulfonyl chloride in an aprotic solvent. The reaction is carried out in the presence of a base such as pyridine, and like triethylamine, diisopropylethylamine. An appropriate aromatic or heteroaromatic sulfonyl chloride is one which correlates to Ar as defined in the final product.",
        "Compounds of general structure I were also generated according to Scheme D.",
        "Scheme D, Synthesis of Compounds of General Structure I",
        "Step 1: Synthesis of Compounds of General Structure O",
        "An appropriate xylene of general formula N bearing two leaving groups in a suitable position as defined in the final product is reacted with appropriate thiol of structure HS—Y—R1 wherein Y and R1 are as defined in the final product to generate compound of general formula O. The reaction is carried out in an aprotic solvent such as DMF and like and in the presence of an inorganic base as potassium carbonate and at room temperature in an argon atmosphere.",
        "Step 2: Synthesis of Compounds of General Structure I wherein q is 0:",
        "Then compound O is reacted with an appropriate aryl or heteroaryl alcohol, amine or thiol to generate compound of general formula I wherein q is 1 and Ar, X, R1, R2 and R3 are as defined in the final product.",
        "In addition, when R1 is an ester function, compound I may be hydrolysed at solvent reflux temperature and in the presence of an inorganic base before the amidification step.",
        "Step one and step 2 may be processed without isolation of the intermediate O (one pot procedure).",
        "Step 3: Synthesis of Compounds of General Structure I wherein q is 1 or 2",
        "i) Oxidation Reaction",
        "Then, appropriate compounds of general formula I wherein R1, R2, R3, X, q and Y are as defined in the final product are prepared by reacting compound I in an appropriate solvent with an appropriate oxidizing agent. An appropriate oxidizing agent is one that oxidizes the sulfide group of compound I. The corresponding product is isolated and purified by methods well known in the art.",
        "For example, to solution of compound I in acetic acid, an appropriate oxidizing agent (e.g. 30% wt H2O2, 1 equivalent) in the same solvent is slowly added. Stirring is continued until the disappearance of the starting material, as evidenced by various analytical techniques. The reaction mixture is concentrated. The desired product (compound I wherein q is 1) is purified, if needed, by employing known purification techniques (preferably by column chromatography and/or crystallization). In some cases, the oxidation is performed by employing 50% H2O2 in glacial acetic acid solvent.",
        "Compound of formula I wherein q is 2, may be obtained under more drastic reaction conditions such as H2O2 (more than 2 equivalents) in acidic medium, under heating, preferably at temperature comprise between room temperature and the boiling temperature of the solvent, preferably between 40 and 60° C., for a time sufficient to obtain the desired product, usually approximately between 2 and 10 hours, preferably approximately 8 hours.",
        "ii) Synthesis of Compound of General Formula I Wherein R1 is C(═O)NHR12R13",
        "Before undergoing oxidation reaction, appropriately, compound I wherein q is 0 and R1 is an ester or an acid function may be reacted with an appropriate amine of structure NHR12R13. as already described in schema B, route A.",
        "Compounds I wherein R1 is an amide are then oxidized according to the processes described above to generate the corresponding compound of formula I wherein q is 1 or 2.",
        "Other features of the invention will become apparent in the course of the following descriptions of exemplary embodiments. These examples are given for illustration of the invention and are not intended to be limiting thereof.",
        "I-Compounds Prepared According to Schemes A and B.",
        "The following Examples 1 to 112 were synthesized according to Schemes A and B.",
        "A-Preparation of Compounds C",
        "Compound 1",
        "Compound C wherein Ar is 3,4-DiClPhenyl, X is O, Substitution in para Position, W is C(═O)H.",
        "To a stirred solution of A (aldehyde wherein Ar is 3,4-DiClPhenyl, X is O, 39 g, 239 mmol) in DMF (200 mL), parafluorobenzaldehyde (compound B; 26 mL; 242 mmol) and cesium carbonate (80 g; 250 mmol) were added. The mixture was refluxed for 3 hours and then cooled to room temperature. After dilution with brine (800 mL), the resulting precipitate was extracted with Et2O (4×250 mL). The organic layer was washed with brine (3×300 mL), water (2×300 mL), and then dried over MgSO4 and concentrated in vacuo. Trituration of the resulting residue with cold Et2O, filtration and drying under vacuum gave 42 g (157 mmol) of compound 1 as an off-white solid.",
        "Yield=66%.",
        "Rf=0.94 (95:5 methylenechloride/methanol).",
        "According to the procedure as described for compound 1, the following compounds were prepared.",
        "Compound 2",
        "Compound C wherein Ar is 3,4-DiClPhenyl, X is O, Substitution in ortho Position, W is C(═O)H.",
        "Reagents: compound A (wherein Ar is 3,4-DiClPhenyl, X is O, 39 g, 239 mmol) and orthofluorobenzaldehyde (compound B; 26 mL; 242 mmol).",
        "Yield=35% (22.3 g; 83 mmol of compound 2).",
        "Rf=0.73 (eluent: 8:2 cyclohexane/ethylacetate).",
        "Compound 3",
        "Compound C wherein Ar is 4-ClPhenyl, X is S, Substitution in para Position, W is C(═O)H.",
        "Reagents: compound A (wherein Ar is 4-ClPhenyl, X is S, 26.3 g, 182 mmol) and parafluorobenzaldehyde (compound B; 20 mL; 242 mmol).",
        "Yield=88% (40 g; 160 mmol of compound 3 as a yellow powder).",
        "Rf=0.57 (eluent: 8:2 cyclohexane/ethylacetate).",
        "Compound 4",
        "Compound C wherein Ar is 4-ClPhenyl, R2 is 3-Cl, X is O, Substitution in para Position, W is C(═O)H.",
        "To a stirred solution of A (wherein Ar is 4-ClPhenyl, X is O, 23.4 g, 182 mmol) in DMF (150 mL), 2-chloro-4-fluorobenzaldehyde (compound B; 28.8 g; 182 mmol) and cesium carbonate (61 g; 187 mmol) were added. The mixture was refluxed for 4 hours and then cooled to room temperature. After dilution with brine (800 mL), the resulting precipitate was extracted with Et2O (4×250 mL). The organic layer was washed with brine (3×300 mL), water (2×300 mL), and then dried over MgSO4 and concentrated in vacuo. The crude product was purified by flash chromatography (eluent:cyclohexane/ethylacetate 9/1) to afford compound 4 (20.5 g; 77 mmol)",
        "Yield=42%.",
        "Rf=0.75 (9:1 cyclohexane /ethylacetate).",
        "Compound 4a",
        "Compound C wherein Ar is 4-ClPhenyl, X is O, R2 is 4′—Cl, R3 is H, Substitution in ortho Position, W is C(═O)H.",
        "To a stirred solution of 4-chlorophenol (compound A wherein Ar is 4-ClPhenyl, X is O, 20.3 g, 155 mmol) in DMF (150 mL), 4-chloro-2-fluorobenzaldehyde (compound B; 25 g; 158 mmol) and potassium carbonate (30 g; 217 mmol) were added. The mixture was stirred for 15 hours. After dilution with brine (300 mL), the resulting precipitate was extracted with Et2O (4×250 mL). The organic layer was washed with brine (3×300 mL), water (2×300 mL), and then dried over MgSO4 and concentrated in vacuo to give compound 4a as an oil.",
        "Yield=100% (41.4 g; 155 mmol)",
        "Rf=0.61 (8:2 cyclohexane/ethylacetate).",
        "B-Preparation of Compounds D",
        "Compound 5",
        "Compound D wherein Ar is 3,4-DiClPhenyl, X is O, Substitution in ortho Position.",
        "To a stirred solution of compound 2 (22.3 g, 83 mmol) in isopropanol (120 mL), sodium borohydride (3.16 g; 83 mmol) was added. The mixture was stirred at room temperature for one hour, before adding water (350 mL). After stirring for additional 3 hours, the aqueous layer was extracted with Et2O (2×300 mL). The combined organic layer was washed with water (3×300 mL), dried over MgSO4 and concentrated in vacuo to give compound 5 as an orange oil.",
        "Yield=95% (21.3 g; 79 mmol).",
        "Rf=0.35 (eluent:methylenechloride).",
        "The following compound were prepared according to the procedure described for compound 5:",
        "Compound 6",
        "Compound D wherein Ar is 3,4-DiClPhenyl, X is O, Substitution in para Position.",
        "Reagents: compound 1 (38 g; 142 mmol) and sodium borohydride (5.37 g; 142 mmol).",
        "Yield=43% (16.6 g; 62 mmol).",
        "Rf=0.56 (eluent: 95:5 methylenechloride/methanol).",
        "Compound 7",
        "Compound D wherein Ar is 4-ClPhenyl, X is S, substitution in para position;",
        "Reagents: compound 3 (40 g; 161 mmol) and sodium borohydride (6.09 g; 161 mmol). Compound 7 was generated as a yellow powder.",
        "Yield=99% (40 g; 160 mmol).",
        "Rf=0.21 (eluent: methylenechloride).",
        "Compound 8",
        "Compound D wherein Ar is Phenyl, X is O, Substitution in ortho Position.",
        "To an ice cold solution of compound C (wherein Ar is Phenyl, X is O, substitution in ortho position, W is C(═O)OH; 25 g; 117 mmol) and N-methylmorpholine (20 ml; 180 mmol) in THF (100 mL) under N2, isobutylchloroformate (17 ml; 131 mmol) was added. After stirring for 15 minutes, sodium borohydride (12.5 g; 330 mmol) was added, followed by 50 mL of water. The ice bath was removed and stirring was continued overnight. After cooling, the mixture was made acidic with hydrochloric acid and extracted with Et2O (2×200 mL). The combined organic layer was washed with water (2×200 mL), dried (MgSO4) and evaporated to dryness. The crude product was purified by flash column chromatography (eluent:ethyl acetate/cyclohexane (1/9) to produce compound 8 as an colorless oil.",
        "Yield=70% (16.4 g; 82 mmol).",
        "Rf=0.50 (eluent: 7:3 cyclohexane/ethylacetate).",
        "The following compound was prepared according to the procedure as described for compound 8:",
        "Compound 9",
        "Compound D wherein Ar is Phenyl, X is O, Substitution in para Position.",
        "Reagents: compound C (wherein Ar is Phenyl, X is O, substitution in para position, W is C(═O)OH; 38 g; 142 mmol), isobutylchloroformate (13.6 mL; 105 mmol) and sodium borohydride (10 g; 264 mmol).",
        "Yield=46% (8.6 g; 43 mmol).",
        "Rf=0.58 (eluent: 1:1 ethylacetate/cyclohexane).",
        "Compound 10",
        "Compound D (wherein Ar is 4-ClPhenyl, R2 is 3-Cl, X is O, Substitution in para Position)",
        "To a stirred solution of compound 4 (20.5 g, 77 mmol) in isopropanol (100 mL), sodium borohydride (2.9 g; 77 mmol) was added. The mixture was stirred at room temperature for one night, before adding water (350 mL). After stirring for additional 3 hours, the solvent was removed by decantation. The resulting residue was taken into a mixture of water (400 mL) and ether (400 mL). The organic layer was washed with water (2×150 mL), dried over MgSO4 and concentrated in vacuo to furnish an oil that was purified by column chromatography (eluent methylenechloride) to afford compound 10 as a yellow oil after solvent evaporation.",
        "Yield=30% (6.3 g; 23 mmol).",
        "Rf=0.45 (eluent:methylenechloride).",
        "Compound 10a",
        "Compound D wherein Ar is 4-ClPhenyl, X is O, R2 is 4′-Cl, R3 is H, Substitution in ortho Position.",
        "To a stirred solution of compound 4a (41.4 g, 155 mmol) in isopropanol (250 mL), sodium borohydride (6.8 g; 180 mmol) was added. The mixture was stirred at room temperature for one night, before adding water (1.5 L). After stirring for additional 3 hours, the resulting precipitated solid was filtered off, washed with water and dried in vacuo to generate compound 10a as a white powder.",
        "Yield=63% (26.2 g; 97 mmol).",
        "Rf=0.61 (eluent: 98:2 methylenechloride/methanol).",
        "C-Preparation of Compounds E",
        "Compound 11",
        "Compound E wherein Ar is 4-ClPhenyl, X is O, Substitution in para Position.",
        "To a stirred mixture of thiourea (6 g; 79 mmol), 48% HBr (34 mL) and water (6 mL) at 60° C., compound D (Ar is 4-ClPhenyl, X is O, substitution in para position; 14.6 g; 62 mmol) prepared according to scheme A, step 1 and 2, was added portionwise. The reaction mixture was refluxed for one hour, cooled and filtered. The resulting residue was washed with water (3×30 mL) and dried under vacuum to generate 21 g of compound 11 as the major product. It was used in the next step without any further purification.",
        "D-Preparation of Compounds I-Scheme A",
        "Compound I wherein Ar is 3,4-DiClPhenyl, X is O, q is 0, Substitution in para Position, Y—R1 is CH2 COOH.",
        "To a stirred mixture of thiourea (6 g; 79 mmol), 48% HBr (34 mL) and water (6 mL) at 60° C., compound 6 (16.6 g; 62 mmol) was added fractionwise. The reaction mixture was refluxed for one hour, and then cooled to room temperature and filtered. The resulting residue was washed with water (3×30 mL) and then poured into aqueous NaOH (32%, 30 mL). The resulting aqueous mixture was stirred and heated to 70° C. before adding dropwise a solution of chloracetic acid (6.8 g, 72 mmol) in aqueous sodium hydrogenocarbonate (16 mL). The mixture was then refluxed for one hour, cooled to room temperature, diluted with water (150 mL), acidified to pH 2 with 4N aqueous HCl and then extracted into Et2O (250 mL). The dried (MgSO4) organic phase was evaporated to dryness to give a residue. The crude product was purified by flash chromatography (eluent: methylenechloride/methanol (9/1) to afford Example 1 (13.2 g; 38.5 mmol) as an orange oil.",
        "Yield=62%.",
        "Rf=0.47 (eluent: 9:1 methylenechloride/methanol).",
        "According to the process as described above, the following compounds were prepared:",
        "Compound I wherein Ar is 3,4-DiClPhenyl, X is O, q is 0, Substitution in ortho Position; Y—R1 is CH2 COOH.",
        "Reagents: compound 5 (21.3 g; 79 mmol) following the same procedure and chloracetic acid (6.8 g, 72 mmol).",
        "Yield=49% (16.8 g; 49 mmol).",
        "Rf=0.53 (eluent: 9:1 methylenechloride/methanol).",
        "Compound I wherein Ar is 4-ClPhenyl, X is S, q is 0, Substitution in para Position, Y—R1 is CH2 COOH.",
        "Reagents: compound 7 (15.6 g, 62 mmol) and chloracetic acid (4.16 g, 44 mmol).",
        "Yield=82% (16.5 g; 51 mmol of compound 12 obtained as an off-white solid)",
        "Rf=0.44 (eluent: 90:10 methylenechloride/methanol).",
        "Compound I wherein Ar is Phenyl, X is O, q is 0, Substitution in para Position, Y—R1═CH2 COOH.",
        "Reagents: compound 9 (8 g, 40 mmol) and chloracetic acid (4.16 g, 44 mmol).",
        "Yield=90% (9.9 g; 36 mmol).",
        "Rf=0.42 (eluent: 90:10 methylenechloride/methanol).",
        "Compound I wherein Ar is Phenyl, X is O, q is 0, Substitution in ortho Position, Y—R1 is CH2 COOH.",
        "Reagents: compound 8 (8 g, 40 mmol) and chloracetic acid (4.16 g, 44 mmol).",
        "Yield=64% (8.4 g; 31 mmol).",
        "Rf=0.49 (eluent: 90:10 methylenechloride/methanol).",
        "Compound I wherein Ar is 4-ClPhenyl, R2 is 3-Cl, X is O, q is 0, Substitution in para Position, Y—R1═CH2COOH.",
        "To a stirred mixture of thiourea (2.2 g; 29 mmol), 48% HBr (12 mL) and water (2 mL) at 60° C., compound 10 (6.3 g; 23.4 mmol) was added fractionwise. The reaction mixture was refluxed for fifteen minutes, and then cooled to room temperature and filtered. The resulting residue was washed with water (3×30 mL) and then poured into aqueous NaOH (32%, 12 mL). The resulting aqueous mixture was stirred and heated to 70° C. before adding dropwise a solution of sodium chloracetate (3 g, 26 mmol). The mixture was then refluxed for one hour, cooled to room temperature, diluted with water (150 mL), acidified to pH 2 with 4N aqueous HCl and then extracted into Et2O (250 mL). The dried (MgSO4) organic phase was evaporated to dryness to afford Example 6 (13.2 g; 38.5 mmol) as an yellow oil after solvent evaporation.",
        "Yield=69% (6.9 g; 20 mmol)",
        "Rf=0.36 (eluent: 93:7 methylenechloride/methanol).",
        "Compound I wherein Ar is 4-ClPhenyl, X is O, q is 0, Substitution in para Position, Y—R1 is CH3.",
        "To a stirred mixture of compound 11 (7.3 g; 19.5 mmol) in 0.6N aqueous sodium hydroxyde (20 mL), dimethylsulfate (2 mL, 18 mmol) was added. The reaction mixture was then refluxed for two hours, cooled and acidified with 1N aqueous hydrochloride. The precipitate was extracted with a mixture of ether (50 mL) and ethylacetate (50 mL). The organic layer was washed with water (2×100 mL) and concentrated under vacuum. The resulting residue was purified by column chromatography (eluent:methylene chloride) to produce 2.2 g of Example 7 as the major product (oil). It was used in the next step without any further purification.",
        "1-Methanesulfinylmethyl-4-(4-chlorophenoxy)-benzene",
        "Compound I wherein Ar is 4-ClPhenyl, X is O, q is 1, substitution in para position, Y—R1 is CH3.",
        "To a solution of Example 7 (2.2 g; 8.3 mmol) in acetic acid (30 mL), a 30% by wt hydrogen peroxide solution (0.99 mL; 9.7 mmol) was added. The mixture was stirred until no more starting material was detected (HPLC), concentrated under high vacuum. The resulting residue was purified by column chromatography (eluent:methylene chloride/methanol 95/5) to produce an oil which is taken up into methylene chloride (100 mL). The organic phase was washed with an aqueous solutiuon of sodium hydroxide (2×50 mL), water (1×50 mL), dried (MgSO4) and concentrated in vacuo to produce Example 8 as a white powder.",
        "Yield=39% (0.9 g; 3.2 mmol)",
        "1H-NMR (DMSO-d6) δ: 7.45 (d, 2H), 7.3 (d, 2H), 7.0 (m, 4H), 4.2 (d, 1H), 3.9 (d, 1H), 2.45 (s, 3H).",
        "MS: 303 (M+Na).",
        "di[4-(4-Chloro-phenoxy)-phenylmethyl]sulfoxyde",
        "Compound I Wherein Ar is 4-ClPhenyl, X is O, q is 1, Substitution in Para Position, Y—R1 is CH2[4(4-ClPhenoxy)phenyl].",
        "0.6 g of Example 9 was obtained as a by product during the preparation process of example 8 as white powder.",
        "1H-NMR (DMSO-d6) δ: 7.45 (d, 2H), 7.3 (d, 2H), 7.0 (m, 4H), 4.2 (d, 1H), 3.8 (d, 1H).",
        "MS 483 (M+H).",
        "1-Methanesulfinylmethyl-4-(3,4-dichlorophenoxy)-benzene",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, Substitution in Para Position, Y—R1 is CH3 was prepared following the same multistep general method as described in scheme A for Example 8 utilizing the appropriate substituted aryl alcohol.",
        "MS: 337 (M+Na).",
        "Compound I Wherein Ar is 4-ClPhenyl, X is O, R2 is 4′-Cl, R3 is H, q is 0, Substitution in Ortho Position, Y—R1 is CH2 COOH.",
        "To a stirred mixture of thiourea (6 g; 79 mmol), 48% HBr (34 mL) and water (6 mL) at 60° C., compound 10a (17.4 g; 65 mmol) was added portionwise. The reaction mixture was refluxed for one hour, cooled and filtered. The resulting residue was washed with water (3×30 mL) and then poured into aqueous NaOH (32%, 30 mL). The resulting aqueous mixture was stirred and heated to 70° C. before adding dropwise a solution of sodium chloracetate (8.4 g, 72 mmol) in water (16 mL). The mixture was then refluxed for one hour, cooled to room temperature, diluted with water (150 mL), acidified to pH 2 with 4N aqueous HCl and then extracted into Et2O (250 mL). The dried (MgSO4) organic phase was evaporated to dryness to give a residue. The crude product was purified by flash chromatography (eluent: methylenechloride/methanol (9/1) to afford Example 10a as an orange powder.",
        "Yield=57% (12.6 g; 37 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.0 (m, 3H), 6.75 (broad d, 1H), 6.65 (broad d, 2H), 6.5 (broad s, 1H), 3.4 (s, 2H), 2.8 (s, 1H).",
        "MS: 341 (M−1).",
        "E-Synthesis of Compound I (q is 0)-Scheme B, Route A",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 0, Substitution in Para Position, Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl.",
        "To a cooled solution of Example 1 (2.27 g; 6.6 mmol) in CH2Cl2 (50 mL), N-acetylpiperazine (0.94 g; 7.3 mmol) and EDCI (1.4 g; 7.3 mmol) were added. The reaction mixture was stirred until no more starting material was detected. The organic layer was washed with 1N HCN, water, dried (MgSO4) and concentrated in vacuo. The crude product was purified by column chromatography (eluent:methylenechloride/methanol 98.5/1.5) to produce Example 11 as an oil.",
        "Yield=76% (2.3 g; 5 mmol)",
        "Rf=0.26 (eluent: 96:4 methylenechloride/methanol)",
        "The following examples were prepared according to the process as described for example 11:",
        "Compound I Wherein Ar is Phenyl, X is O, q is 0, Substitution in Ortho Position, Y—R1 is CH2 CO NH(CH2)2OH.",
        "Reagents: Example 5 (0.7 g, 2.6 mmol) and ethanolamine (0.18 g; 2.9 mmol).",
        "Yield=56% (0.46 g; 1.4 mmol)",
        "Rf=0.5 (eluent: 90:10 methylenechloride/methanol)",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 0, Substitution in Para Position, Y—R1 is CH2 CO-1-(4-Boc)-piperazinyl.",
        "To a cooled solution of example 1 (8.8 g; 25.6 mmol) in CH2Cl2 (150 mL) N-Bocpiperazine (4.8 g; 25.8 mmol), EDCI (4.9 g; 25.6 mmol) and HOBT (3.5 g; 26 mmol) were added. The reaction mixture was stirred until no more starting material was detected. The organic layer was washed with 1N HCl (2×100 mL), water (100 mL), dried (MgSO4) and concentrated in vacuo. Trituration of the resulting residue with cold Et2O, filtration and drying under vacuum gave Example 13 as a white solid.",
        "Yield=70% (9 g; 18 mmol)",
        "Rf=0.13 (eluent: 99:1 methylenechloride/methanol)",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 0, Substitution in Para Position, Y—R1 is CH2 CO-N-piperazinyl.",
        "To a solution of Example 13 (2 g; 3.9 mmol) in 1,4-dioxane (20 mL), hydrogenchloride in 1,4-dioxane (4N solution; 20 mL) was added. The reaction mixture was stirred for one hour at room temperature, then ether (200 mL) was added. Filtration and drying under vacuum gave a powder which is dissolved in water (100 mL). The aqueous layer was basified with NaOH (1N) and the resulting precipitate was extracted with ether (150 mL). The dried (MgSO4) organic layer was evaporated to dryness to furnish Example 14 as an oil.",
        "Yield=87% (1.4 g; 3.4 mmol)",
        "1H-NMR (DMSO-d6) 6:9.5 (s, 2H), 7.7 (d, 1H), 7.4 (d, 1H), 7.3 (d, 1H), 7.05 (d, 1H), 6.95 (dd, 1H), 3.75 (s, 2H), 3.7 (broad, 4H), 3.4 (s, 2H), 3.15 (broad, 2H), 3.0 (broad, 2H)",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 0, Substitution in ortho Position, Y—R1 is CH2 CONH2.",
        "To a cold solution of Example 2 (3 g, 8.7 mmol) in methanol (50 mL), thionylchloride (4.2 ml; 57 mmol) was added dropwise. After 1 hour stirring at room temperature, the solvent was removed in vacuo. The oily residue was taken by mixture of MeOH (50 mL) and 28% NH4OH (50 mL) and the reaction mixture stirred overnight. The methanol was evaporated and water (200 mL) added. The precipitated solid was filtered, washed with water (4×50 mL) and dried in vacuo to generate Example 15 as an off-white solid.",
        "Yield=77% (2.3 g; 6.7 mmol).",
        "Rf=0.38 (eluent: 95:5 methylenechloride/methanol).",
        "Compound I Wherein Ar is 4-ClPhenyl, X is S, q is 0, Substitution in Para Position, Y—R1 is CH2 CO-1-(4-acetyl)-piperazinyl.",
        "To a cooled solution of Example 3 (2.14 g; 6.6 mmol) in CH2Cl2 (50 mL), N-acetylpiperazine (0.9 g; 7 mmol), EDCI (1.4 g; 7.3 mmol) and HOBT (1 g; 7.4 mmol) were added. The reaction mixture was stirred until no more starting material was detected. The organic layer was washed with 1N HCl (2×100 mL), water (100 mL), dried (MgSO4) and concentrated in vacuo. Trituration of the resulting residue with Et2O, filtration and drying under vacuum gave Example 16 as a white powder.",
        "Yield=74% (2.15 g; 4.9 mmol)",
        "Rf=0.27 (eluent: 95:5 methylenechloride/methanol).",
        "Compound I Wherein Ar is 4-ClPhenyl, R2 is 3-Cl, X is O, q is 0, Substitution in Para Position, Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl.",
        "To a cooled solution of Example 6 (3.18 g; 9.3 mmol) in CH2Cl2 (60 mL), N-acetylpiperazine (1.33 g; 10.4 mmol), EDCI (2 g; 10.4 mmol) and HOBT (1.41 g; 10.4 mmol) were added. The reaction mixture was stirred until no more starting material was detected. The organic layer was washed with 1N HCl, water, dried (MgSO4) and concentrated in vacuo. The crude product was purified by column chromatography (eluent: methylenechloride/methanol 98/2) to produce Example 17 as an oil.",
        "Yield=75% (1.6 g; 3.5 mmol)",
        "Rf=0.33 (eluent: 95:5 methylenechloride/methanol)",
        "Compound I Wherein Ar is 4-ClPhenyl, R2 is 3-Cl, X is O, q is 0, Substitution in Para Position, Y—R1 is CH2CONH2.",
        "To a cooled solution of Example 6 (3.6 g; 10.5 mmol) in methanol (100 mL), thionylchloride (2.2 ml; 30 mmol) was added dropwise. After 1 hour stirring at room temperature, the solvent was removed in vacuo. The oily residue was taken by mixture of MeOH (75 mL) and 28% NH4OH (75 mL) and the reaction mixture stirred overnight. The methanol was evaporated and water (200 mL) added. The precipitated solid was filtered, washed with water (2×50 mL) and purified by column chromatography (eluent: methylenechloride/methanol 98/2) to produce Example 18 as a white solid.",
        "Yield=58% (2.07 g; 6.0 mmol).",
        "Rf=0.52 (eluent: 95:5 methylenechloride/methanol).",
        "Compound I Wherein Ar is 4-ClPhenyl, X is O, R2 is 4′-Cl, R3 is H, q is 0, Substitution in Ortho Position, Y—R1 is CH2 CONH2.",
        "To a cold solution of Example 10a (6.3 g, 18.3 mmol) in methanol (100 mL), thionylchloride (3.8 ml; 52 mmol) was added dropwise. After 1 hour stirring at room temperature, the solvent was removed in vacuo. The oily residue was taken by mixture of MeOH (100 mL) and 28% NH4OH (100 mL) and the reaction mixture stirred overnight. The methanol was evaporated and the residue was purified by flash chromatography (eluent: methylenechloride/methanol (95/5) to afford Example 18a as a white powder.",
        "Yield=56% (3.5 g; 10.2 mmol).",
        "Rf=0.44 (eluent: 95:5 methylenechloride/methanol).",
        "F-Preparation of Compound I (q is 1 or 2)—Scheme B, Route A",
        "2-[4-(3,4-dichloro-phenoxy)-phenylmethanesulfinyl]-1-piperazin-1-yl-ethanone",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, Substitution in Para Position, Y—R1 is CH2CO-N-piperazinyl.",
        "To a solution of Example 14 (1.4 g; 3.4 mmol) in acetic acid (10 mL), a 30% by wt hydrogen peroxide solution (0.4 mL; 4 mmol) was added. The mixture was stirred until no more starting material was detected (HPLC), concentrated under high vacuum. Then water (100 mL) was added to the residue. The aqueous solution was basified with NaOH (1N) and the precipitate extracted with ethyl acetate (150 mL). The organic phase was dried over MgSO4 and evaporated to dryness to give an oil. Ethanol (30 mL) was added and the solution stirred before adding fumaric acid (0.11 g; 0.95 mmol). The reaction mixture was stirred overnight and filtered. The resulting solid was dried under vacuum to give Example 19.",
        "Yield=38% (0.63 g; 1.3 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.7 (d, 1H), 7.4 (d, 2H), 7.3 (d, 1H), 7.2 (d, 2H), 7.1 (dd, 1H), 6.5 (s, 1H), 4.25 (d, 1H), 4.05 (d, 1H), 3.9 (m, 2H), 3.5 (broad, 4H), 2.9 (broad, 4H).",
        "MS: 427 (M+H)",
        "According to the oxidation procedure as described for example 19, the following compounds were prepared:",
        "2-[4-(3,4-dichloro-phenoxy)-phenylmethanesulfinyl]-acetamide",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, Substitution in Ortho Position, Y—R1 is CH2CONH2.",
        "Reagent: Example 15 (2.3 g; 6.7 mmol) and a 30% by wt hydrogen peroxide (0.7 mL; 6.9 mmol).",
        "Yield=79% (1.9 g; 5.3 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.7 (broad s, 1H), 7.65 (d, 1H), 7.5 (broad d, 1H), 7.40 (broad t, 1H), 7.35 (broad s, 1H), 7.25 (broad s, 1H), 7.20 (t, 1H), 7.0 (broad, 2H), 4.30 (d, 1H), 4.05 (d, 1H), 3.75 (d, 1H), 3.55 (d, 1H).",
        "MS: 358 (M+H)",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, (−) enantiomer, Substitution in Ortho Position, Y—R1 is CH2 CONH2.",
        "The two enantiomers of Example 20 were separated by LC-Prep.",
        "The HPLC analysis was performed as described here:",
        "Column Chiralpak AS (10 μm, 250×4.6 mm, D068)",
        "Mobile phase: Methanol/ethanol 1/1",
        "Flow rate 0.5 mL/min",
        "UV detection 220 nm",
        "Retention time: 8.8 min",
        "Optical rotation [αD]20 =−47.",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, (+) Enantiomer, Substitution in Ortho Position, Y—R1 is CH2 CONH2.",
        "The two enantiomers of Example 20 were separated by LC-Prep.",
        "The HPLC analysis was performed as described here:",
        "Column Chiralpak AS (10 μm, 250×4.6 mm, D068)",
        "Mobile phase: Methanol/ethanol 1/1",
        "Flow rate 0.5 mL/min",
        "UV detection 220 nm",
        "Retention time: 10.9 min",
        "Optical rotation [αD]20=+43.",
        "N-(2-Hydroxy-ethyl)-2-(2-phenoxy-phenylmethanesulfinyl)-acetamide",
        "Compound I Wherein Ar is Phenyl, X is O, q is 1, Substitution in Ortho Position, Y—R1 is CH2 CONH(CH2)2OH.",
        "Reagents: Example 12 (0.46 g, 1.45 mmol) and a 30% by wt hydrogen peroxide solution (0.18 mL; 1.8 mmol).",
        "Yield=62% (0.3 g; 0.9 mmol).",
        "1H-NMR (DMSO-d6) δ: 8.25 (t, 1H), 7.45-7.25 (m, 4H), 7.2 (t, 2H), 7.0 (d, 2H), 6.8 (d, 1H), 4.7 (t, 1H), 4.3 (d, 1H), 4.05 (d, 1H), 3.75 (d, 1H), 3.6 (d, 1H), 3.4 (q, 2H), 3.2 (m, 2H).",
        "MS: 356 (M+Na)",
        "1-(4-Acetyl-piperazin-1-yl)-2-[4-(3,4-dichloro-phenoxy)-phenylmethanesulfinyl]-ethanone",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, Substitution in Para Position, Y—R1 is CH2 CO-1-(4-acetyl)-piperazinyl).",
        "Reagents: Example 11 (2.3 g, 5.1 mmol) and a 30% by wt hydrogen peroxide solution (0.6 mL; 5.9 mmol).",
        "Yield=84% (2 g; 4.3 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.65 (d, 1H), 7.4 (d, 2H), 7.3 (broad s, 1H), 7.1 (d, 2H), 7.0 (broad d, 1H), 4.25, (d, 1H), 4.1 (d, 1H), 4.0 (m, 2H), 3.6-3.35 (broad, 8H), 2.0 (s, 3H).",
        "MS: 469 (M+H).",
        "1-(4-Acetyl-piperazin-1-yl)-2-[4-(4-chloro-phenylsulfanyl)-phenylmethanesulfinyl]-ethanone",
        "Compound I Wherein Ar is 4-ClPhenyl, X is S, q is 1, Substitution in Para Position, Y—R1 is CH2 CO-1-(4-acetyl)-piperazinyl).",
        "Reagents: Example 16 (1 g; 2.3 mmol), 30% by wt hydrogen peroxide solution (0.25 mL; 2.5 mmol).",
        "Yield=61% (0.65 g; 1.4 mmol of Example 23 as a powder)",
        "1H-NMR (DMSO-d6) δ: 7.45 (broad d, 2H), 7.3 (m, 6H), 4.25 (d, 1H), 4.05 (d, 1H), 3.95 (m, 2H), 3.5 (broad, 8H), 2 (s, 3H).",
        "MS: 473 (M+Na).",
        "1-(4-Acetyl-piperazin-1-yl)-2-[4-(4-chloro-benzenesulfinyl)-phenylmethanesulfinyl]-ethanone",
        "Compound I Wherein Ar is 4-ClPhenyl, X is SO, q is 1, Substitution in Para Position, Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl.",
        "Reagents: Example 16 (1 g, 2.3 mmol), a 30% by wt hydrogen peroxide solution (0.25 mL; 2.5 mmol).",
        "Yield=19% (0.2 g; 0.43 mmol of Example 24 as a powder).",
        "1H-NMR (DMSO-d6) δ: 7.75 (broad d, 4H), 7.7 (d, 2H), 7.5 (d, 2H), 4.3 (d, 1H), 4.1 (d, 1H),4.0 (broad s, 2H), 3.4 (broad, 8H), 2.05 (s, 3H).",
        "MS:489 (M+Na).",
        "1-(4-Acetyl-piperazin-1-yl)-2-[2-chloro-4-(4-chloro-phenoxy)-phenylmethanesulfinyl]-ethanone",
        "Compound I Wherein Ar is 4-ClPhenyl, R2 is 3-Cl, X is O, q is 1, Substitution in Para Position, Y—R1 is CH2 CO-1-(4-acetyl)-piperazinyl;",
        "To a solution of Example 17 (3.15 g; 6.9 mmol) in acetic acid (20 mL), a 30% by wt hydrogen peroxide solution (0.82 mL; 8.1 mmol) was added. The mixture was stirred until no more starting material was detected (HPLC), and then concentrated under high vacuum. The resulting residue was taken into a mixture of water solution of sodium bicarbonate (200 mL) and ethyl acetate (200 mL). The organic layer was washed with water (1×100 mL), dried over MgSO4 and concentrated in vacuo to afford compound 25 as a white powder.",
        "Yield=83% (2.7 g; 5.8 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.5 (dd, 2H), 7.3 (m, 2H), 7.1 (dd, 2H), 6.8 (broad, 1H), 4.5 (d, 1H), 4.3 (d, 1H), 4.2 (m, 2H), 3.5 (broad, 8H), 2 (s, 3H).",
        "MS 469 (M+H).",
        "2-[2-Chloro-4-(4-chloro-phenoxy)-phenylmethanesulfinyl]-acetamide",
        "Compound I Wherein Ar is 4-ClPhenyl; R2 is 3-Cl, X is O, q is 1, Substitution in Para position, Y—R1 is CH2CONH2.",
        "Reagents: Example 18 (2.07 g; 6.0 mmol) and a 30% by wt hydrogen peroxide (0.7 mL; 6.9 mmol).",
        "Yield=91% (1.95 g; 5.4 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.75 (broad s, 1H), 7.5 (broad d, 2H), 7.3 (m, 3H), 7.15 (broad d, 2H), 6.8 (broad m, 1H), 4.35 (d, 1H), 4.30 (d, 1H), 3.8 (d, 1H), 3.6 (d, 1H).",
        "MS: 380 (M+Na).",
        "1-(4-Acetyl-piperazin-1-yl)-2-[4-(3,4-dichloro-phenoxy)-phenylmethanesulfonyl]-ethanone",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 2, Substitution in Para Position, Y—R1 is CH2 CO-1-(4-acetyl)-piperazinyl.",
        "To a solution of Example 22 (0.85 g; 1.8 mmol) in acetic acid (20 mL), a 30% by wt hydrogen peroxide solution (0.56 mL; 5.5 mmol) was added. The mixture was stirred at 55° C. until no more starting material was detected (HPLC), and then concentrated under high vacuum. The resulting residue was taken into a mixture of water solution of sodium bicarbonate (200 mL) and ethyl acetate (200 mL). The organic layer was washed with water (1×100 mL), dried over MgSO4 and concentrated in vacuo. The resulting residue was purified by column chromatography (eluent:methylenechloride/methanol 95/5) to generate Example 27 as a white powder.",
        "Yield=71% (0.62 g; 1.3 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.7 (d, 1H), 7.45 (d, 2H), 7.30 (broad s, 1H), 7.1 (d, 2H), 7.0 (broad d, 1H), 4.7 (s, 2H), 4.35 (broad d, 2H), 3.6-3.4 (broad m, 8H), 2 (s, 3H).",
        "MS: 507 (M+Na).",
        "Compound I Wherein Ar is 4-ClPhenyl, X is O, R2 is 4′-Cl, R3 is H, q is 1, Substitution in ortho Position, Y—R1 is CH2 CONH2.",
        "To a solution of Example 10a (3.5 g; 10.2 mmol) in acetic acid (30 mL), a 30% by wt hydrogen peroxide solution (1.36 mL; 13.3 mmol) was added. The mixture was stirred until no more starting material was detected (HPLC), and then concentrated under high vacuum. The residue was triturated in diethyloxide the resulting precipitated solid was filtered off, washed with diethyloxide and dried in vacuo to generate Example 27a as a white powder.",
        "Yield=93% (3.4 g; 9.5 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.7 (broad s, 1H), 7.45 (broad m, 3H), 7.3 (broad s, 1H), 7.25 (broad d, 1H), 7.1 (broad d, 2H), 6.9 (broad s, 1H), 4.30 (d, 1H), 4.05 (d, 1H), 3.75 (d, 1H), 3.5 (d, 1H).",
        "MS: 379.8 (M+Na).",
        "Compound I Wherein Ar is 4-ClPhenyl, X is O, R2 is 4′-Cl, R3 is H, q is 2, Substitution in ortho Position, Y—R1 is CH2 CONH2.",
        "To a solution of Example 27a (0.07 g; 0.2 mmol) in acetic acid (5 mL), a 30% by wt hydrogen peroxide solution (0.085 mL; 0.8 mmol) was added. The mixture was stirred at 55° C. until no more starting material was detected (HPLC), and then cooled to room temperature. The resulting precipitated solid was filtered off, washed with diethyl oxide and dried in vacuo to generate Example 27b as a white powder.",
        "Yield=65% (0.48 g; 0.13 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.8 (broad s, 1H), 7.5 (broad m, 4H), 7.25 (broad d, 1H), 7.1 (broad d, 2H), 6.8 (broad s, 1H), 4.75 (s, 2H), 4.1 (s, 2H).",
        "MS: 396 (M+Na).",
        "G-Synthesis of Compounds I (q is 0, 1, 2)-Scheme B-Route B",
        "Compound I Wherein Ar is Phenyl, X is O, q is 1, Substitution in Para Position, Y—R1 is CH2 COOH.",
        "To a solution of Example 4 (4 g; 14.6 mmol) in acetic acid (30 mL) a 30% by wt hydrogen peroxide solution (1.9 mL; 18 mmol) was added. The mixture was stirred until no more starting material was detected (HPLC), concentrated at high vacuum and triturated with ether to give Example 28 as an off-white solid.",
        "Yield=82% (3.5 g; 12 mmol)",
        "Rf=0.15 (eluent: 90:10 methylenechloride/methanol)",
        "N-Isopropropyl-2-(4-phenoxy-phenylmethanesulfinyl)-acetamide",
        "Compound I Wherein Ar is Phenyl, X is O, q is 1, Substitution in Para Position, Y—R1 is CH2CO NHCH(CH3)2.",
        "To a cooled solution of Example 28 (0.4 g; 1.4 mmol) in CH2Cl2 (25 mL), isopropylamine (0.095 g; 1.6 mmol), EDCI (0.31 g; 1.6 mmol) and HOBT (0.22 g; 1.6 mmol) were added. The reaction mixture was stirred until no more starting material was detected. Methylene chloride (100 mL) was added to the reaction mixture and the organic layer washed with 1N HCl (2×100 mL), water (100 mL), dried (MgSO4) and concentrated in vacuo. The resulting residue was purified by column chromatography (eluent: methylenechloride/methanol (93/7) to generate Example 29 as a powder.",
        "Yield=63% (0.35 g; 1 mmol).",
        "1H-NMR (DMSO-d6) δ: 8.15 (d, 1H), 7.45 (broad t, 2H), 7.35 (broad d, 2H), 7.15 (broad t, 1H),7.0 (broad t, 4H), 4.2 (d, 1H), 3.95 (d, 1H), 3.85 (m, 1H), 3.55 (d, 1H), 3.45 (d, 1H), 1.0 (d, 6H).",
        "MS: 354 (M+Na).",
        "[4-(3,4-dichloro-phenoxy)-phenylmethanesulfinyl]-acetic acid",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, Substitution in Para Position, Y—R1 is CH2 COOH.",
        "To a solution of Example 1 (0.94 g; 2.7 mmol) in acetic acid (20 mL) a 30% by wt hydrogen peroxide solution (0.32 mL; 3.2 mmol) was added. The mixture was stirred until no more starting material was detected (HPLC), concentrated at high vacuum and triturated with ether to give Example 30 as an off-white solid.",
        "Yield=57% (0.55 g; 1.53 mmol)",
        "1H-NMR (DMSO-d6) δ: 7.7 (d, 1H), 7.4-7.3 (m, 3H), 7.35 (broad d, 2H), 7.1 (d, 2H), 7.0 (broad d, 1H), 4.2 (d, 1H), 4.1 (d, 1H), 3.8 (d, 1H), 3.6 (d, 1H).",
        "MS: 381 (M+Na).",
        "[2-(3,4-Dichloro-phenoxy)-phenylmethanesulfinyl]-acetic acid",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, Substitution in Ortho Postion, Y—R1 is CH2 COOH.",
        "To a solution of Example 2 (20.58 g, 60 mmol) in glacial acetic acid (60 mL) was added 35% aqueous hydrogen peroxide (6.6 mL) at room temperature.The mixture was stirred until no more starting material was detected (TLC). After 2 h of stirring, the sulfoxyde precipitated; the precipitate was filtered, washed with water and diisopropyl oxide successively, dried under vacuum to yield Example 30a (white powder; 18.36 g)",
        "Yield=85%.",
        "Rt: 12.25 min.",
        "1H-NMR (DMSO) δ (ppm): 7.65 (d, 1H) 7.45 (d, 1H), 7.4 (t, 1H), 7.3-7.15 (m, 2H), 7.05-6.9 (m, 2H), 4.25 (d, 1H), 4.1 (d, 1H), 3.9 (d, 1H), 3.65 (d, 1H).",
        "[2-(3,4-Dichloro-phenoxy)-phenylmethanesulfonyl]-acetic acid",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 2, Substitution in Ortho Postion, Y—R1 is CH2 COOH.",
        "To a suspension of Example 30a (1.79 g, 5 mmol) in glacial acetic acid (5 mL) at room temperature was added 35% aqueous hydrogen peroxide (1.5 mL). The mixture was heated to 50° C. for 4 h until no more starting material was detected (HPLC). After concentration, the residue was triturated in water to give a precipitate that was filtered, washed with water and diisopropyl ether successively, dried under vacuum to yield Example 30b (white powder; 0.78 g)",
        "Yield=42%.",
        "Rt: 13.5 min.",
        "1H-NMR (DMSO) δ (ppm): 7.6 (d, 1H) 7.5 (d, 1H), 7.4 (t, 1H), 7.3-7.2 (m, 2H), 7.05-6.9 (m, 2H), 4.7 (s, 2H), 4.25 (s, 2H).",
        "MS: 373 (M−H); 749 (2M+H)",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 0, Substitution in Ortho Position, Y—R1 is CH2 COO (1R,2S,5R)Menthyl.",
        "To a stirred solution of Example 2 (5 g; 14.6 mmol) in DMF (30 mL), TBTU (o-Benzotriazol-1-yl-N,N,N′,N′-tetramethyluronium tetrafluoroborate) (7 g; 21.8 mmol), N-methyl morpholine (2.45 mL; 22.2 mmol) and (1R, 2S, 5R) (−) menthol were added. The reaction mixture was stirred for fifteen hours, and then ethyl acetate (200 mL) and brine (200 mL) were added into it. The resulting organic layer was evaporated and the residue was purified by flash chromatography (eluent:cyclohexane/ethyl acetate (95/5) to afford Example 30c as a yellow oil.",
        "Yield=60% (4.2 g; 8.7 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.7 (broad d, 1H), 7.45 (broad d, 1H), 7.30 (broad t, 1H), 7.2 (broad, 2H), 6.95 (broad m, 2H), 4.55 (m, 1H), 3.8 (s, 2H), 3.25 (s, 2H), 1.8 (broad m, 2H), 1.7 (broad m, 2H), 1.45 (broad, 1H), 1.30 (broad t, 1H), 1.0 (broad, 1H), 0.85 (broad t, 8H), 0.70 (d, 3H).",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, Substitution in ortho Position, Y—R1is CH2 COOH, enantiomer (−).",
        "To a solution of Example 30c (2.09 g; 4.35 mmol) in acetic acid (25 mL), a 30% by wt hydrogen peroxide solution (0.39 mL; 4.4 mmol) was added. The mixture was stirred at room temperature until no more starting material was detected (HPLC), and then the solvent was evaporated. The residue was purified by flash chromatography (eluent: cyclohexane/ethyl acetate (8/2) to afford a mixture of two diastereoisomers which were separated by LC Preparative. The HPLC analysis was performed as described here:",
        "Column AGP-Chiral (5 μm, 150×4. mm)",
        "Mobile phase: (aqueous ammonium acetate 0.1M)/n-Butanol: 98.5/1.5",
        "Flow rate 0.8 mL/min",
        "UV detection 230 nm",
        "Results: Diastereoisomer 1: retention time 8.1 min,\n\n    \n    \n        Diastereosomer 2: retention time 9.7 min.",
        "To a solution of diastereoisomer 2 in methanol (28 mL) and tetrahydrofuran (75 mL), barium hydroxide octahydrate (0.25 g; 0.8 mmol) was added. The mixture was stirred at room temperature until no more starting material was detected (HPLC), and then the solvent was evaporated. Methylene chloride (50 mL) was added into it. The organic layer was washed with water (1×50 mL), dried over MgSO4 and concentrated in vacuo. The resulting residue was washed with ether to afford a white powder. To a mixture of this powder in water (17 mL) and ethanol (5 mL), an aqueous hydrochloric acid solution (3 mL, 0.5N) was added. The mixture was stirred at room temperature for 6 hours. The resulting precipitated solid was filtered off, washed with water and dried in vacuo to generate Example 30d as a white powder.",
        "Yield=20% (0.317 g; 0.89 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.7 (broad d, 1H), 7.45 (broad d, 1H), 7.30 (broad t, 1H), 7.25 (broad m, 2H), 7.0 (broad t, 2H), 4.25 (d, 1H), 4.1 (d, 1H), 3.95 (s, 1H), 3.7 (s, 1H).",
        "Optical rotation [αD]20=−49.",
        "Enantiomeric excess >98%.",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, Substitution in )rtho Position, Y—R1 is CH2 COOH, enantiomer (+).",
        "To a solution of diastereoisomer 1 (isolated during the synthesis of Example 30d) in ethanol (5 mL) and water (7.5 mL), sodium hydroxide was added. The mixture was stirred at room temperature until no more starting material was detected (HPLC). Aqueous hydrochloric acid solution (10 mL, 0.5N) and methylene chloride (50 mL) were added into it. The organic layer was washed with water (1×50 mL), dried over MgSO4 and concentrated in vacuo. The resulting residue was triturated in diethyl oxide and the precipitated solid was filtered off, washed with diethyl oxide and dried in vacuo to generate Example 30e as a white powder.",
        "Yield=16% (0.255 g; 0.71 mmol).",
        "1H-NMR (DMSO-d6) δ: 7.7 (broad d, 1H), 7.45 (broad d, 1H), 7.30 (broad t, 1H), 7.25 (broad m, 2H), 7.0 (broad t, 2H), 4.25 (d, 1H), 4.1 (d, 1H), 3.95 (s, 1H), 3.7 (s, 1H).",
        "Optical rotation [αD]20=+46.",
        "Enantiomeric excess >98%.",
        "[2-(3,4-Dichloro-phenoxy)-phenylmethanesulfanyl]-N,N-dimethyl-acetamide",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 0, Substitution in Ortho Postion, Y—R1is CH2 CON(CH3)2",
        "To a cooled (ice-bath) solution of Example 2 (3.43 g, 10 mmol) in CH2Cl2 (60 mL), was added successively dimethylamine (0.495 g, 1.25 mL, 11 mmol), EDCI (2.1 g, 11 mmol) and HOBT (1.48 g, 11 mmol). The cooling bath was removed and the reaction mixture was stirred at room temperature for one night. It was then diluted with CH2Cl2 (40ml), washed successively with water (60 ml), aqueous NaHCO3, water (60ml) and dried over Na2SO4. On concentration, the solution generated an orange oil that was triturated in diisopropyl ether to yield the title compound Example 30f (2.9 g; beige powder).",
        "Yield=78%.",
        "Rf (CH2Cl2/CH3OH 9/1)=0.65.",
        "Rt: 15.86 min.",
        "[2-(3,4-Dichloro-phenoxy)-phenylmethanesulfinyl]-N,N-dimethyl-acetamide",
        "Compound I Wherein Ar is 3,4-DiClPhenyl, X is O, q is 1, Substitution in Ortho Postion, Y—R1 is CH2 CON(CH3)2",
        "To a suspension of Example 30f (2.91 g, 7.9 mmol) in glacial acetic acid (10 mL) at room temperature was added 35% aqueous hydrogen peroxide (0.87 mL). The mixture was stirred for 3 h until no more starting material was detected (HPLC). After concentration, the residue was triturated in diisopropyl ether to give a solid that was filtered, washed with diisopropyl ether and dried under vacuum to yield Example 30 g (slightly beige powder; 0.78 g).",
        "Yield=86%.",
        "Rt: 12.32 min.",
        "1H-NMR (DMSO) δ (ppm): 7.65 (d, 1H) 7.45 (d, 1H), 7.4 (t, 1H), 7.25-7.2 (m, 2H), 7 (dd, 2H), 4.25 (d, 1H), 4.15 (d, 1H), 3.95 (s, 2H), 2.95 (s, 3H), 2.75 (s, 3H).",
        "MS:408 (M+Na).",
        "Compounds 31 through 112 were prepared following the same multistep general method as described in scheme B utilizing the appropriate substituted amine —NR12R13 in steps 5 or 6. The analytical data is presented by each compounds molecular formula and masse spectrum (M+H) or (M+Na) as shown in the following Table 2.",
        "TABLE 2\n\n\n\n\n\nExample\n\n\n\n\n\nNo\nMolecular Formula\nPeak\nMass\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nScheme B, route A\n\n\n\n\n\n\n\n\n\n\n31\nC19H21NO3S\nM + H\n344\n\n\n32\nC15H15NO3S\nM + H\n290\n\n\n33\nC17H19NO3S\nM + H\n318\n\n\n34\nC18H21NO3S\nM + H\n332\n\n\n35\nC21H24N2O4S\nM + H\n401\n\n\n36\nC16H17NO4S\nM + Na\n342\n\n\n37\nC22H26N2O5S\nM + Na\n453\n\n\n38\nC20H24N2O4S.C4H4O4\nM + H\n389\n\n\n39\nC15H13Cl2NO3S\nM + Na\n380\n\n\n40\nC21H22Cl2N2O4S\nM + H\n469\n\n\n41\nC20H21Cl2N3O4S\nM + H\n470\n\n\n42\nC16H17NO4S\nM + Na\n342\n\n\n43\nC15H14ClNO3S\nM + Na\n346\n\n\n44\nC15H15NO4S\nM + Na\n328\n\n\n45\nC15H14ClNO3S\nM + H\n324\n\n\n46\nC21H23ClN2O4S\nM + Na\n457\n\n\n47\nC19H21ClN2O3S.C4H4O4\nM + H\n393\n\n\n48\nC21H23FN2O4S\nM + H\n419\n\n\n49\nC21H23FN2O4S\nM + H\n419\n\n\n50\nC15H14FNO3S\nM + Na\n330\n\n\n51\nC15H14FNO3S\nM + Na\n330\n\n\n52\nC19H17NO3S\nM + Na\n362\n\n\n53\nC26H27NO4S\nM + Na\n473\n\n\n54\nC19H17NO3S\nM + Na\n362\n\n\n55\nC21H19NO3S\nM + Na\n388\n\n\n56\nC21H19NO3S\nM + H\n366\n\n\n57\nC21H23ClN2O4S\nM + H\n435\n\n\n58\nC25H26N2O4S\nM + Na\n473\n\n\n59\nC27H28N2O4S\nM + H\n477\n\n\n60\nC27H28N2O4S\nM + Na\n499\n\n\n61\nC21H23ClN2O4S\nM + Na\n457\n\n\n62\nC21H26N2O4S.HCl\nM + H\n403\n\n\n63\nC22H24Cl2N2O5S\nM + H\n499\n\n\n64\nC21H25FN2O4S.HCl\nM + H\n421\n\n\n65\nC21H24Cl2N2O4S.HCl\nM + H\n471\n\n\n66\nC2OH23FN2O3S.HCl\nM + H\n391\n\n\n67\nC15H14ClNO3S\nM + Na\n346\n\n\n68\nC22H25FN2O5S\nM + H\n449\n\n\n69\nC23H28N2O6S\nM + Na\n483\n\n\n70\nC22H25ClN2O4S2\nM + Na\n503\n\n\n71\nC22H25ClN2O5S2\nM + Na\n519\n\n\n72\nC22H24Cl2N2O5S\nM + Na\n521\n\n\n73\nC19H21ClN2O2S2\nM + H\n409\n\n\n74\nC21H22Cl2N2O4S\nM + Na\n491\n\n\n75\nC21H22Cl2N2O4S\nM + Na\n491\n\n\n76\nC15H13Cl2NO3S\nM + Na\n380\n\n\n77\nC15H13Cl2NO3S\nM + Na\n380\n\n\n78\nC21H22Cl2N2O4S\nM + Na\n491\n\n\n79\nC21H22Cl2N2O4S\nM + H\n469\n\n\n80\nC15H13Cl2NO3S\nM + Na\n380\n\n\n81\nC15H13Cl2NO3S\nM + H\n358\n\n\n82\nC21H22Cl2N2O4S\nM + H\n469\n\n\n83\nC21H22Cl2N2O4S\nM + H\n469\n\n\n84\nC15H13Cl2NO3S\nM + Na\n380\n\n\n85\nC15H13Cl2NO3S\nM + H\n358\n\n\n86\nC21H22Cl2N2O4S\nM + H\n469\n\n\n87\nC21H22Cl2N2O3S2\nM + H\n485\n\n\n88\nC15H13Cl2NO3S\nM + Na\n380\n\n\n89\nC15H13Cl2NO2S2\nM + Na\n396\n\n\n90\nC21H22Cl2N2O4S\nM + Na\n491\n\n\n91\nC21H22Cl2N2O4S\nM + Na\n491\n\n\n92\nC15H13Cl2NO3S\nM + Na\n380\n\n\n93\nC15H13Cl2NO4S\nM + Na\n396\n\n\n94\nC15H13Cl2NO3S\nM + Na\n380\n\n\n95\nC21H23FN2O5S\nM + Na\n457\n\n\n96\nC21H22Cl2N2O5S\nM + Na\n507\n\n\n97\nC15H15NO3S\nM + H\n290\n\n\n98\nC19H21NO3S\nM + H\n344\n\n\n99\nC17H19NO3S\nM + H\n318\n\n\n100 \nC17H19NO3S\nM + H\n318\n\n\n101 \nC19H21NO3S\nM + H\n344\n\n\n102 \nC15H15NO3S\nM + Na\n312\n\n\n103 \nC17H16N2O3S\nM + Na\n351\n\n\n104 \nC18H21NO3S\nM + H\n332\n\n\n105 \nC19H23NO3S\nM + H\n346\n\n\n106 \nC2OH23NO4S\nM + H\n374\n\n\n107 \nC21H24N2O4S\nM + Na\n423\n\n\n108 \nC17H19NO4S\nM + H\n334\n\n\n109 \nC2OH23NO4S\nM + H\n374\n\n\n109a\nC15H14ClNO3S\nM + Na\n346\n\n\n109b\nC15H13ClFNO3S\nM + Na\n364\n\n\n109c\nC15H13ClFNO3S\nM + Na\n364\n\n\n109d\nC15H13ClFNO4S\nM + Na\n380\n\n\n109e\nC15H12ClF2NO3S\nM + Na\n381.8\n\n\n109f\nC15H13Cl2NO4S\nM + Na\n395.7\n\n\n\n\n\n\n\nScheme B, route B\n\n\n\n\n\n\n\n\n\n\n110 \nC21H24N2O4S\nM + Na\n423\n\n\n111 \nC17H19NO4S\nM + Na\n356\n\n\n112 \nC20H23NO4S\nM + Na\n396\n\n\n112a\nC16H15Cl2NO3S\nM + Na\n394\n\n\n\n\n2M + Na\n766\n\n\n112b\nC19H21Cl2NO3S\nM + Na\n436\n\n\n\n\n2M + Na\n851\n\n\n\n\n\n\n\n\n\nII-Compounds Prepared According to Scheme C.",
        "Examples 113 to 149 were synthesized according to Scheme C.",
        "A-Preparation of Compound J",
        "Compound 12",
        "Compound J wherein Y—R1 is CH2 COOCH3, NO2 is in ortho position, R2 and R3 are H.",
        "To a stirred solution of 2-nitrobenzyl bromide (43.2 g; 200 mmol) in dry acetone (200 mL), methylthioglycolate (19 ml; 212 mmol), potassium iodide (0.2 g; 1.2 mmol) and potassium carbonate (27.6 g; 200 nmmol) were added. The reaction mixture was refluxed for 4 hours and then the solvent removed. The resulting residue was taken into a mixture of water (500 mL) and ether (500 mL). The organic layer was washed with water, dried over MgSO4 and concentrated in vacuo to give compound 12 as an orange oil.",
        "Yield: 100% (48.2 g; 199.9 mmol)",
        "Rf=0.55 (eluent: methylenechloride)",
        "Compound 13",
        "Compound J wherein Y—R1 is CH2 COOH, NO2 is in ortho position, R2 and R3 are H.",
        "To a stirred solution of 2-nitrobenzyl bromide (25 g; 116 mmol) in dry acetone (100 mL), thioglycolic acid (8.5 mL; 122 mmol), potassium iodide (0.09 g; 0.5 mmol) and potassium carbonate (17.5 g; 127 mmol) were added. The reaction mixture. was refluxed overnight and the solvent was removed. The resulting residue was taken into water (500 mL) and the cooled aqueous mixture acidified with hydrochloric acid 4N to pH 2. The precipitate was extracted with ethylacetate (500 mL) and the organic layer washed with water (2×200 mL), dried over MgSO4 and concentrated in vacuo to furnish an oil that was purified by column chromatography (eluent: methylenechloride/methanol (9/1) to afford compound 13 as a yellow powder after solvent evaporation.",
        "Yield: 76% (19.9 g; 88 mmol).",
        "Rf=0.35 (eluent: 9:1 methylenechloride:methanol).",
        "Compound 13a",
        "Compound J wherein Y—R1 is CH2 COOCH3, NO2 is in para position, R2 and R3 are H.",
        "To a stirred solution of 4-nitrobenzyl bromide (43.2 g; 200 mmol) in dry acetone (200 mL), methylthioglycolate (19 mL; 212 mmol), potassium iodide (0.2 g; 1.2 mmol) and potassium carbonate (27.6 g; 200 mmol) were added. The reaction mixture was refluxed for 4 hours and then the solvent removed. The resulting residue was taken into a mixture of water (500 mL) and ether (500 mL). The organic layer was washed with water, dried over MgSO4 and concentrated in vacuo to give compound 13a as an orange oil.",
        "Yield: 100% (48.2 g; 199.9 mmol)",
        "Rf=0.95 (eluent: 9:1 methylenechloride/methanol)",
        "B-Preparation of Compound K",
        "Compound 14",
        "Compound K wherein Y—R1 is CH2CONH2, NO2 is in ortho position, R2 and R3 are H.",
        "To a stirred solution of compound 12 (20 g, 82.9 mmol) in methanol (50 mL), 28% NH4OH (50 mL) was added. The reaction mixture was stirred overnight, the methanol evaporated and water (250 mL) added into the mixture. The precipitated solid was filtered off, washed with water and dried in vacuo to generate compound 14 as a yellow powder.",
        "Yield: 81% (15.1 g; 67 mmol)",
        "Rf=0.28 (eluent: 95:5 methylenechloride/methanol)",
        "Compound 15",
        "Compound K wherein Y—R1 is CH2CO-1-(yl)-piperazinyl, NO2 is in ortho position, R2 and R3 are H.",
        "To a cooled solution of compound 13 (12 g, 53 mmol) in CH2Cl2 (200 mL), N-acetylpiperazine (7.3 g; 57 mmol), EDCI (10.9 g; 57 mmol) and HOBT (7.8 g; 58 mmol) were added. The reaction mixture was stirred until no more starting material was detected. The organic layer was washed with 1N HCl (2×100 mL), water (100 mL), dried (MgSO4) and concentrated in vacuo. Trituration of the resulting residue with Et2O, filtration and drying under vacuum gave compound 15 as an off-white solid.",
        "Yield: 92% (16.4 g; 49 mmol).",
        "Rf=0.23 (eluent: 97:3 methylenechloride/methanol).",
        "Compound 15a",
        "Compound K wherein Y—R1 is CH2CONH2, NO2 is in para position, R2 and R3 are H.",
        "To a stirred solution of compound 13a (48.2 g, 200 mmol) in methanol (250 mL), 28% NH4OH (250 mL) was added. The reaction mixture was stirred overnight, the methanol evaporated and water (700 mL) added into the mixture. The precipitated solid was filtered off, washed with water and dried in vacuo to generate compound 15a as an orange powder.",
        "Yield: 78% (35.5 g; 157 mmol)",
        "Rf=0.55 (eluent: 9:1 methylenechloride/methanol).",
        "C-Preparation of Compound L",
        "Compound 16",
        "Compound L wherein Y—R1 is CH2CONH2, q is 1, NO2 is in ortho position, R2 and R3 are H.",
        "To a solution of compound 14 (8 g; 35.4 mmol) in acetic acid (120 mL), a 30% by wt hydrogen peroxide solution (4.5 mL; 40 mmol) was added. The reaction mixture was stirred overnight and concentrated under high vacuum. Trituration of the resulting residue with ethylacetate, filtration and drying under vacuum gave compound 16 as a yellow powder.",
        "Yield: 90% (7.86 g; 32 mmol).",
        "Rf=0.34 (eluent: 9:1 methylenechloride/methanol).",
        "Compound 17",
        "Compound L wherein Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl, q is 1, NO2 is in ortho position, R2 and R3 are H.",
        "To a solution of compound 15 (8.2 g; 24.3 mmol) in acetic acid (60 mL), a 30% by wt hydrogen peroxide solution (2.8 mL; 28 mmol) was added. The reaction mixture was stirred for two hours and concentrated at high vacuum. The resulting residue was purified by column chromatography (eluent: with methylenechloride/methanol (9/1) to afford compound 17 as a yellow powder.",
        "Yield: 74% (6.4 g; 18 mmol).",
        "Rf=0.40 (eluent: 9:1 methylenechloride/methanol).",
        "D-Preparation of Compound M′",
        "Compound 17a",
        "Compound M wherein Y—R1 is CH2CONH2, q is 0, NH2 is in para position, R2 and R3 are H.",
        "To a stirred solution of compound 15a (5.5 g, 24 mmol) in acetic acid (60 mL) and water (120 mL), iron (6.7 g, 120 mmol) was added. The reaction mixture was refluxed for 15 minutes. The iron was removed by filtration on a pad of Celite, and the filtrate was evaporated. The resulting residue was purified by column chromatography (eluent: methylenechloride/methanol (9/1) to generate compound 17a as a grey powder.",
        "Yield: 71% (3.36 g; 17 mmol).",
        "Rf=0.46 (eluent: 9:1 methylenechloride/methanol).",
        "E-Preparation of Compound M",
        "Compound 18",
        "Compound M wherein Y—R1 is CH2CONH2, q is 1, NH2 is in ortho position, R2 and R3 are H.",
        "Compound 16 wherein (7.86 g, 32.5 mmol) in a mixture of DMF (50 mL) and MeOH (50 mL) was reduced in the presence of 10% Pd/C (1.6 g) in an autoclave under hydrogen pressure (50 PSI) for 12 hours. The catalyst was removed by filtration on a pad of Celite, and the filtrate was evaporated. Trituration of the resulting residue with ethylacetate, filtration and drying under vacuum gave compound 18 as an off-white solid.",
        "Yield: 80% (5.6 g; 26 mmol).",
        "Rf=0.25 (eluent: 5.6 g; 26 mmol).",
        "Compound 19",
        "Compound M wherein Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl, q is 1, NH2 is in ortho position, R2 and R3 are H.",
        "Compound 17 (2.1 g, 5.9 mmol) in MeOH (50 mL) was reduced in the presence of 10% Pd/C (0.2 g) in an autoclave under an hydrogen pressure (50 PSI) for 18 hours. The catalyst was removed by filtration on a pad of Celite, and the filtrate was evaporated. The resulting residue was purified by column chromatography (eluent: methylenechloride/methanol (96/4) to generate compound 19 as a white powder.",
        "Yield: 68% (1.3 g; 4 mmol).",
        "Rf=0.29 (eluent: 9:1 methylenechloride/methanol).",
        "Compound 19a",
        "Compound M wherein Y—R1 is CH2CONH2, q is 1, NH2 is in para position, R2 and R3 are H.",
        "To a solution of compound 17a (1 g; 5.09 mmol) in acetic acid (15 mL), a 30% by wt hydrogen peroxide solution (0.6 mL; 5.9 mmol) was added. The reaction mixture was stirred for three hours and then diethyloxide was added into the mixture. The precipitated solid was filtered off, washed with diethyloxide and dried in vacuo to generate compound 19a as an yellow powder.",
        "Yield: 65% (0.7 g; 3.3 mmol).",
        "Rf=0.20 (eluent: 9:1 methylenechloride/methanol).",
        "F-Preparation of Compound I",
        "N-(2-carbamoylmethanesulfinylmethyl-phenyl)-4-chloro-benzamide",
        "Compound I wherein Ar is 4-ClPhenyl, X is CONH, q is 1, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2 CO NH2.",
        "To a stirred solution of compound 18 (1 g; 4.7 mmol) in CH2Cl2 (50 mL) were added pyridine (0.76 mL; 9.4 mmol) and 4-chlorobenzoylchloride (0.6 mL; 4.7 mmol). The reaction mixture was stirred for one hour and filtered. The resulting solid was washed with water and methylenechloride and dried under vacuum to give Example 113 as a solid.",
        "Yield: 81% (1.32 g; 3.8 mmol).",
        "1H-NMR (DMSO-d6) δ: 10.6 (s, 1H), 8.0 (broad d, 2H), 7.75 (broad, 2H), 7.6 (broad d, 2H), 7.4 (broad, 3H), 7.25 (broad, 1H), 4.55 (d, 1H), 4.3 (d, 1H), 3.8 (d, 1H).",
        "MS: 373 (M+Na).",
        "The following examples were prepared according to the procedure as described for Example 113.",
        "N-(2-Carbamoylmethanesulfinylmethyl-phenyl)-3,4-dimethoxy-benzamide",
        "Compound I wherein Ar is 3,4-DiOCH3Phenyl, X is CONH, q is 1, substitution in ortho position, R2 and R3 are H, Y—R1 is CH2CONH2.",
        "Reagents: compound 18 (1 g; 4.7 mmol) and 3,4-dimethoxybenzoyl chloride (0.94 g; 4.7 mmol). Example 114 is a solid.",
        "Yield: 49% (0.87 g; 2.3 mmol).",
        "1H-NMR (DMSO-d6) δ: 10.5 (s, 1H), 7.8 (d, 1H), 7.75 (broad, 1H), 7.6 (d, 1H), 7.55 (broad, 1H), 7.35 (broad, 3H), 7.2 (t, 1H), 7.1 (d, 1H), 4.5 (d, 1H), 4.3 (d, 1H), 3.85 (s, 6H), 3.75 (d, 1H).",
        "MS: 399 (M+Na)",
        "Naphtalene-2-carboxylic acid (2-carbamoylmethanesulfinylmethyl-phenyl)-amide",
        "Compound I wherein Ar is 2-Naphthyl, X is CONH, q is 1, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2CONH2.",
        "Reagents: compound 18 (1 g; 4.7 mmol) and 2-naphthoylchloride (0.92 g; 4.7 mmol). Example 115 is a solid.",
        "Yield: 58% (1 g; 2.7 mmol)",
        "1H-NMR (DMSO-d6) δ: 10.75 (s, 1H), 8.7 (s, 1H), 8.1 (m, 3H), 8.05 (d, 1H), 7.8 (d, 1H), 7.75 (s, 1H), 7.60 (m, 2H), 7.45 (m, 3H), 7.30 (t, 1H), 4.55 (d, 1H), 4.30 (d, 1H), 3.8 (d, 1H), 3.55 (d, 1H).",
        "MS: 367 (M+H).",
        "N-{2-[2-(4-Acetyl-piperazin-1-yl)-2-oxo-ethanesulfinylmethyl]-phenyl}-4-chloro-benzamide",
        "Compound I wherein Ar is 4-ClPh, X is CONH, q is 1, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl.",
        "To a stirred solution of compound 19 (1 g; 3.7 mmol) in CH2Cl2 (40 mL), pyridine (0.76 mL; 9.4 mmol) and 4-chlorobenzoylchloride (0.6 mL; 4.7 mmol) were added. The reaction mixture was stirred for one hour and then the solvent was removed. Trituration of the resulting residue with ethylacetate, filtration and drying under vacuum gave Example 116 as a powder.",
        "Yield: 65% (0.92 g; 2 mmol).",
        "1H-NMR (DMSO-d6) δ: 10.55 (s, 1H), 8.0 (d, 2H), 7.75 (d, 1H), 7.65 (dd, 2H), 7.45 (m, 2H), 7.25 (t, 1H), 4.45 (m, 1H), 4.35 (m, 1H), 4.2 (d, 1H), 4.1 (d, 1H), 3.45 (broad, 8H), 2.0 (s, 3H).",
        "MS: 484 (M+Na).",
        "Examples 117 through 129 were prepared following the same multistep general method as described for Example 116 utilizing the appropriate substituted amine —NR12R13 and the appropriate benzoyl chloride in step 4. The analytical data is presented by each compounds molecular formula and masse spectrum (M+H) or (M+Na) as shown in the following Table 3.",
        "TABLE 3\n\n\n\n\n\nExample\n\n\n\n\n\nNo\nMolecular Formula\nPeak\nMass\n\n\n\n\n\n\n\n117\nC16H14F2N2O3S\nM + H\n353\n\n\n118\nC18H20N2O5S\nM + H\n377\n\n\n119\nC19H22N2O6S\nM + H\n407\n\n\n120\nC18H20N2O5S\nM + H\n377\n\n\n121\nC24H29N3O6S\nM + H\n488\n\n\n122\nC24H29N3O6S\nM + H\n488\n\n\n123\nC22H24FN3O4S\nM + H\n446\n\n\n124\nC22H23Cl2N3O4S\nM + H\n496\n\n\n125\nC18H20N2O5S\nM + H\n377\n\n\n126\nC16H15FN2O3S\nM + H\n335\n\n\n127\nC16H14Cl2N2O3S\nM + Na\n407\n\n\n128\nC22H23Cl2N3O4S\nM + Na\n518\n\n\n129\nC22H24FN3O4S\nM + Na\n468",
        "N-{2-[2-(4-Acetyl-piperazin-1-yl)-2-oxo-ethanesulfinylmethyl]-phenyl}-3,4-dichloro-benzenesul",
        "Compound I wherein Ar is 3,4-DiClPh, X is SO2NH, q is 1, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl.",
        "To a stirred solution of compound 19 (1 g; 3.1 mmol) in CH2Cl2 (30 mL), pyridine (0.5 mL; 6.2 mmol) and 3,4-Dichlorobenzenesulfonylchloride (0.48 mL; 3.1 mmol) were added. The reaction mixture was stirred for twelve hours and then, methylene chloride (200 mL) were added into it. The resulting mixture was washed with an aqueous hydrochloric acid solution 1N (1×150 mL) and evaporated. The resulting residue was purified by column chromatography (eluent: methylenechloride/methanol 9/1) to generate Example 130 as a white powder.",
        "Yield: 91% (1.5 g; 2.8 mmol).",
        "Rf=0.46 (eluent: 9:1 methylenechloride/methanol).",
        "1H-NMR (DMSO-d6) δ: 10.1 (s, 1H), 7.85 (broad d, 2H), 7.70 (broad d, 1H), 7.40-7.30 (m, 3H), 7.00 (broad m, 1H), 4.30 (d, 1H), 4.20-4.00 (broad m, 3H), 3.60-3.40 (broad, 8H), 2.0 (s, 3H).",
        "MS: 554 (M+Na).",
        "Examples 131 through 133 were prepared following the same multistep general method as described for Example 130 utilizing the appropriate substituted amine —NR12R13 and the appropriate sulfonylchloride in step 4. The analytical data is presented by each compounds molecular formula and masse spectrum (M+H) or (M+Na) as shown in the following Table 4:",
        "TABLE 4\n\n\n\n\n\nExample\n\n\n\n\n\nNo\nMolecular Formula\nPeak\nMass\n\n\n\n\n\n\n\n131\nC21H24FN3O5S2\nM + Na\n504\n\n\n132\nC21H24ClN3O5S2\nM−1(ESI−)\n496\n\n\n133\nC21H23Cl2N3O5S2\nM + Na\n554",
        "1-(4-Acetyl-piperazin-1-yl)-2-[2-(4-methoxy-phenylamino)-phenylmethanesulfinyl]-ethanone",
        "Compound I wherein Ar is 4-OCH3Ph, X is NH, q is 1, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl.",
        "To a stirred mixture of 4-methoxyphenyl boronic acid (1 g; 6.6 mmol), myristic acid (0.3 g; 1.3 mmol) and copper(II) acetate anhydrous (0.12 g; 0.66 mmol) in CH2Cl2 (10 mL) were added compound 19 (1.4 g; 4.3 mmol) in CH2Cl2 (10 mL) and 2,6-lutidine (0.52 mL; 4.5 mmol). The reaction mixture was stirred for two days. The catalyst was removed by filtration on a pad of Celite, and the filtrate was evaporated. The resulting residue was purified by column chromatography (eluent: methylenechloride/methanol 96/4) to generate Example 134 as a beige powder.",
        "Yield: 49 g; 2.1 mmol).",
        "Rf=0.49 (eluent: 9:1 methylenechloride/methanol).",
        "1H-NMR (DMSO-d6) δ: 7.70 (s, 1H), 7.20-7.10 (m, 2H), 7.05 (broad d, 1H), 6.90 (broad d, 2H), 6.85-6.70 (m, 3H), 4.30 (broad dd, 1H), 4.20 (broad d, 1H), 4.05 (broad m, 2H), 3.50 (broad, 8H), 2.00 (s, 3H).",
        "MS: 452 (M+Na).",
        "Examples 135 trough 141 were prepared following the same multistep general method as desribed for Example 134 utilizing the appropriate substituted amine —NR12R13 and the appropriate substituted boronic acid in step 4. The analytical data is presented by each compounds molecular formula and masse spectrum (M+H) or (M+Na) as shown in the following Table 5.",
        "TABLE 5\n\n\n\n\n\nExample\n\n\n\n\n\nNo\nMolecular Formula\nPeak\nMass\n\n\n\n\n\n\n\n135\nC21H25N3O3S\nM + Na\n422\n\n\n136\nC21H25N3O3S\nM + Na\n422\n\n\n137\nC22H27N3O4S\nM + Na\n452\n\n\n138\nC21H24FN3O3S\nM + Na\n440\n\n\n139\nC21H24ClN3O3S\nM + Na\n456\n\n\n140\nC21H24FN3O3S\nM + Na\n440\n\n\n141\nC21H23Cl2N3O3S\nM + Na\n490",
        "Thiophene-2-carboxylic acid {2-[2-(4-acetyl-piperazin-1-yl)-2-oxo-ethanesulfinylmethyl]-phenyl}-amide",
        "Compound I wherein Ar is 2-Thienyl, X is CONH, q is 1, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl.",
        "To a stirred solution of compound 19 (1 g; 3.1 mmol) in CH2Cl2 (30 mL), pyridine (0.5 mL; 6.2 mmol) and 2-thiophenecarbonyl chloride (0.46 g; 3.1 mmol) were added. The reaction mixture was stirred for twelve hours and then, methylene chloride (100 mL) were added into it. The resulting mixture was washed with an aqueous hydrochloric acid solution 1N (2×100 mL) and evaporated. The resulting residue was purified by column chromatography (eluent: methylenechloride/methanol 9/1) to generate Example 142 as a white powder.",
        "Yield: 86% (1.16 g; 2.7 mmol).",
        "Rf=0.50 (eluent: 9:1 methylenechloride/methanol).",
        "1H-NMR (DMSO-d6) δ: 10.55 (s, 1H), 7.80 (broad d, 2H), 7.75 (broad d, 1H), 7.45-7.30 (m, 2H), 7.25-7.15 (m, 2H), 4.45 (broad, 2H), 4.20-4.00 (broad m, 2H), 3.50-3.40 (broad, 8H), 2.0 (s, 3H).",
        "MS: 456 (M+Na).",
        "Example 143 was prepared following the same multistep general method as described for Example 142 utilizing the appropriate substituted amine —NR12R13 and the appropriate carbonyl chloride in step 4. The molecular formula and masse spectrum (M+H) or (M+Na) are presented for Example 143 in Table 6.",
        "TABLE 6\n\n\n\n\n\nExample\n\n\n\n\n\nNo\nMolecular Formula\nPeak\nMass\n\n\n\n\n\n\n\n143\nC20H23N3O5S\nM + Na\n440",
        "1-(4-acetyl-piperazin-1-yl)-2-{2-[(thiophen-2-ylmethyl)-amino]-phenylmethanesulfinyl}-ethanon",
        "Compound I wherein Ar is 2-thienyl, X is CH2NH, q is 1, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl.",
        "To a cooled solution of compound 19 (0.65 g; 2 mmol) in 1,2-dichloroethane (10 mL), 2-thiophene carboxaldehyde (0.29 g; 2.6 mmol), sodium triacetoxy borohydride (0.57 g; 2.7 mmol) and acetic acid (0.15 mL) were added. The reaction mixture was stirred under nitrogen for three hours and then, ethylacetate (100 mL) were added into it. The resulting mixture was washed with an aqueous sodium hydrogenocarbonate (1×100 mL), aqueous solution (1×100 mL) and evaporated. The resulting residue was purified by column chromatography (eluent: methylenechloride/methanol 9/1) to generate Example 144 as a white powder.",
        "Yield: 71% (0.6 g; 1.4 mmol).",
        "Rf=0.45 (eluent: 9:1 methylenechloride/methanol).",
        "1H-NMR (DMSO-d6) δ: 7.40 (broad d, 1H), 7.20-7.00 (m, 3H), 6.85-6.95 (broad m, 1H), 6.7-6.6 (broad m, 2H), 6.30 (broad, 1H), 4.50 (broad d, 1H), 4.30 (broad d, 1H), 4.20-4.00 (broad m, 3H), 3.55-3.45 (broad, 8H), 2.00 (s, 3H).",
        "MS: 442 (M+Na).",
        "Example 145 was prepared following the same multistep general method as described for Example 144 utilizing the appropriate substituted amine —NR12 R13 and the appropriate aldehyde in step 4. The molecular formula and masse spectrum (M+H) or (M+Na) is presented for Example 145 in Table 7.",
        "TABLE 7\n\n\n\n\n\nExample\n\n\n\n\n\nNo\nMolecular Formula\nPeak\nMass\n\n\n\n\n\n\n\n145\nC20H25N3O4S\nM + Na\n426",
        "1-(4-acetyl-piperazin-1-yl)-2-[2-(3,4-dichloro-benzylamino)-phenylmethanesulfinyl]-ethanone",
        "Compound I wherein Ar is 3,4-DiClPh, X is CH2NH, q is 1, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2CO-1-(4-acetyl)-piperazinyl.",
        "To a stirred solution of compound 19 (1 g; 3.1 mmol) in DMF (25 mL), diisopropylethylamine (0.6 mL; 3.4 mmol) and 3,4-dichlorobenzyl bromide (0.74 g; 3.1 mmol) were added. The reaction mixture was stirred for twelve hours and then, ethylacetate (250 mL) were added into it. The resulting mixture was washed with brine (2×200 mL) and evaporated. The resulting residue was purified by column chromatography (eluent: methylenechloride/methanol 9/1) to generate Example 146 as a white powder.",
        "Yield: 51% (0.76 g; 1.6 mmol).",
        "Rf=0.47 (eluent: 9:1 methylenechloride/methanol).",
        "1H-NMR (DMSO-d6) δ: 7.70 (broad s, 1H), 7.60 (broad d, 1H), (broad m, 1H), 7.4 (broad d, 1H), 7.10 (broad m, 2H), 6.6 (broad t, 1H), 6.5 (broad d, 1H), 6.3 (broad m, 1H), 4.4-4.3 (broad m, 3H), 4.2-4.0 (broad, 3H), 3.55-3.35 (broad, 8H), 2.0 (s, 3H).",
        "MS: 504 (M+Na).",
        "Examples 147 through 149 were prepared following the same multistep general method as described for Example 146 utilizing the appropriate substituted amine —NR12R13 and the appropriate benzyl halide in step 4. The molecular formula and masse spectrum (M+H) or (M+Na) are presented for each Examples in Table 8.",
        "TABLE 8\n\n\n\n\n\nExample\n\n\n\n\n\nNo\nMolecular Formula\nPeak\nMass\n\n\n\n\n\n\n\n147\nC22H26FN3O3S\nM + Na\n454\n\n\n148\nC22H25Cl2N3O3S\nM + Na\n504\n\n\n149\nC22H26FN3O3S\nM + Na\n454",
        "Compound I wherein Ar is 3,4-DiClPhenyl, X is CONH, q is 1, substitution in para position, R2 and R3 are H, Y—R1 is CH2 CO NH2.",
        "To a stirred solution of compound 19a (0.7 g; 3.3 mmol) in CH2Cl2 (30 mL) were added pyridine (0.53 mL; 6.6 mmol) and 3,4-dichlorobenzoylchloride (0.69 g; 3.3 mmol). The reaction mixture was stirred for eight days and filtered. The resulting solid was washed with water, ethyl acetate and ethanol, then dried under vacuum to give Example 149a as a yellow solid.",
        "Yield: 59% (0.75 g; 1.9 mmol).",
        "1H-NMR (DMSO-d6) δ: 10.5 (s, 1H), 8.25 (broad s, 1H), 7.9 (broad d, 1H), 7.8 (broad d, 1H), 7.75 (broad d, 2H), 7.7 (broad s, 1H), 7.3 (broad m, 3H), 4.25 (d, 1H), 4.0 (d, 1H), 3.6 (d, 1H), 3.45 (d, 1H).",
        "MS:407 (M+Na).",
        "III-Compounds Prepared According to Scheme D.",
        "Examples 150 to 153 were synthesized according to Scheme D.",
        "A-Preparation of Compound I",
        "Compound I wherein Ar is Ph, X is OCH2, q is 0, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2COOMe.",
        "A mixture of α,α′-dibromo-o-xylene (7.15 g, 27.1 mmol), methyl glycolate (2.87 g, 27.1 mmol) and K2CO3 (8.25 g, 59 mmol) in DMF (dry, 20 mL) was stirred under argon at room temperature for 4 h. Phenol (2.54 g, 27 mmol) was added to the reaction mixture and stirring was continued overnight. The reaction mixture was filtered and the residue was washed several times with EtOAc. Combined filtrate and washings were washed successively with 0.5N NaOH, water (twice) and brine, dried (magnesium sulfate), and concentrated to generate a crude product. It was purified by flash chromatography (eluent:hexane/ethyl acetate 85/15) to generate example 150 as a viscous oil.",
        "Yield=18% (1.48 g; 4.9 mmol).",
        "1H-NMR (CDCl3): δ7.74-6.81 (a series of m, 9H), 5.20 (s, 2H), 3.96 (s, 2H), 3.66 (s, 3H), 3.31 (s, 2H).",
        "MS: m/e 325 (M+Na).",
        "Compound I wherein Ar is Ph, X is OCH2, q is 0, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2COOH.",
        "A mixture of Example 150 (1.48 g, 4.9 mmol), 1N NaOH (25 mL) and methanol (25 mL) was kept under reflux for 4 h (the mixture became homogenous), cooled, concentrated, and diluted with water. It was then neutralized with conc. HCl. and extracted into ethyl acetate (twice). Combined organic layer was washed with water and brine, dried (MgSO4) and concentrated to generate Example 151 as a viscous oil that was directly used in the next step.",
        "Yield=88% (1.25 g; 4.34 mmol).",
        "1H-NMR (CDCl3): δ7.82-6.80 (a series of m, 9H), 5.20 (s, 2H), 3.98 (s, 2H), 3.14 (s, 2H).",
        "Compound I wherein Ar is Ph, X is OCH2, q is 0, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2COONH2.",
        "A mixture of Example 151 (1.25 g, 4.34 mmol), HOBt.NH3 complex (1.45 g, 9.53 mmol), TBTU (1.70 g, 5.29 mmol) in DMF (15 mL) was stirred at room temperature overnight. It was then diluted with dichloromethane and successively washed with water, 2% citric acid, water, 2% NaHCO3, water and brine, dried (MgSO4), and concentrated to generate a crude product. It was purified by flash chromatography (eluent:hexane/ethyl acetate 1/4) to generate Example 152.",
        "Yield=67% (0.83 g; 2.89 mmol).",
        "1H-NMR (CDCl3): δ7.74-6.96 (a series of m, 9H), 6.52 (br s, 1H), 5.39 (br s, 1H), 5.16 (s, 2H), 3.89 (s, 2H), 3.14 (s, 2H).",
        "2-(2-phenoxymethyl-phenylmethanesulfinyl)-acetamide",
        "Compound I wherein Ar is Ph, X is OCH2, q is 1, substitution in ortho postion, R2 and R3 are H, Y—R1 is CH2COONH2.",
        "To a solution of Example 152 (0.82 g, 2.87 mmol) in acetic acid (10 mL) was added hydrogen peroxide (50% in water, 200 μL). The reaction mixture was stirred at room temperature for 4 h, neutralized (carefully) with aq. NaHCO3 solution and extracted into ethyl acetate (twice). Combined organic layer was washed with brine, dried (MgSO4) and concentrated to give a crude product that was purified by flash chromatography (eluent dichloromethane/MeOH 93/7) to generate Example 153.",
        "Yield=70% (0.61 g; 2.01 mmol).",
        "m.p.: 153-154° C.",
        "1H-NMR (DMSO-d6): δ7.71 (s, 1H), 7.52(s, 1H), 7.37-6.93 (a series of m, 9H), 5.21 (s, 2H), 4.39 (d, 1H), 4.17(d, 1H), 3.77 (d, 1H), 3.55 (d, 1H).",
        "MS: 326 (M +Na),",
        "The methodology utilized for evaluating wake promoting activity of test compounds is based on that described by Edgar and Seidel, Journal of Pharmacology and Experimental Therapeutics, 283:757-769, 1997, and incorporated herein in its entirety by reference.",
        "Animal Surgery. Adult, male Wistar rats (275-320 g from Charles River Laboratories, Wilmington, Mass.) were anesthetized (Nembutal, 45 mg/kg, ip.) and surgically prepared with implants for recording of chronic EEG (encephalographic) and EMG (electromyographic) recording. The EEG implants were made from commercially available components (Plastics One, Roanoke, Va.). EEG signals were recorded from stainless steel screw electrodes: 2 frontal (+3.0 mm AP from bregma, ±2.0 mm ML), and 2 occipital (−4.0 mm AP from bregma, ±2.0 mm ML). Two Teflon-coated stainless steel wires were positioned under the nuchal trapezoid muscles for EMG recording. All electrode leads were inserted into a connector pedestal and the pedestal affixed to the skull by application dental acrylic. Antibiotic was administered post surgically and antibiotic cream was applied to the wound edges to prevent infection. At least one week elapsed between surgery and recording.",
        "Recording environment. Postsurgically, rats were housed in pairs in an isolated room. Food and water were available ad libitum, ambient temperature was 21° C., and humidity was 55%. At least 24 hrs prior to recording, they were placed in Nalgene containers (31×31×31 cm) with a wire-grid top, and entry to the room was prohibited during the day of recording except for dosing. The containers were placed on a rack with two shelves, 4 containers per shelf. Fluorescent overhead room lights were set to a 24 hr. light/dark cycle (on at 7 AM, off at 7 PM). Light levels inside the containers were 38 and 25 lux for the top and bottom shelves respectively. Background white-noise (68 db inside the containers) was present in the room to mask ambient sounds.",
        "Data acquisition. EEG and EMG signals were led via cables to a commutator (Plastics One) and then to pre-amplifiers (model 1700, A-M Systems, Carlsborg, Wash.). EEG and EMG signals were amplified (10K and 1K respectively) and bandpass filtered between 0.3 and 500 Hz for EEG and between 10 and 500 Hz for EMG. These signals were digitized at 128 samples per second using ICELUS sleep research software (M. Opp, U. Texas; see Opp, Physiology and Behavior 63:67-74, 1998, and Imeri, Mancia, and Opp, Neuroscience 92:745-749, 1999, incorporated by reference herein in their entirety) running under Labview 5.1 software and data acquisition hardware (PCI-MIO-16E-4; National Instruments, Austin, Tex.). On the day of dosing, data was recorded for 6 to 10 hours beginning at 11 AM.",
        "Drug administration and study design. Compounds were evaluated on groups of from 4 to 8 rats carried out over one or two separate test sessions. Each animal was tested with a different compound or vehicle for up to 10 weeks with at least 7 days between successive tests. A vehicle group was included in all experiments, and each animal received vehicle every 4th test. Test compounds were suspended in sterile 0.25% methylcellulose (pH=6.2; Upjohn Co., Kalamazoo, Mich.) at 30 mg/mL. Although compounds can be administered at dosages greater than 100 mg/kg and are expected to be active under the selection criteria of data analysis, unless otherwise noted, compounds were administered at a single dose of 100 mg/kg. Dosing was carried out at noon, while the rats were predominantly asleep. Each rat was lifted out of its container, given an intraperitoneal injection in a volume of 5 mL/kg, and replaced. Dosing required approximately 30 sec per rat.",
        "Sleep/wake scoring. Sleep and wake activity were determined manually using ICELUS software. This program displays the EEG and EMG data in blocks of 6 sec along with the EEG frequency spectrum. Arousal state was scored as awake, rapid eye-movement (REM), or slow-wave or non-REM sleep (NREM) according to visual analysis of EEG frequency and amplitude characteristics and EMG activity (Opp and Krueger, 1994; Van Gelder, et al., 1991; Edgar, et al., 1991, 1997; Seidel, et al, 1995, incorporated by reference herein in their entirety). Essentially, waking activity consists of relatively low-amplitude EEG activity with relatively lower power in the frequency band from 0.5-6 Hz, accompanied by moderate to high level EMG activity. In a particular waking state (“theta-waking”), EEG power can be relatively focused in the 6-9 Hz (theta) range, but significant EMG activity is always present. NREM sleep is characterized by relative high-amplitude EEG activity with relatively greater power in the low frequency band from 0.5-6 Hz, accompanied by little or no EMG activity. REM sleep is characterized by moderate and constant amplitude EEG focused in the theta (6-9 Hz) range, similar to waking theta, but with no EMG activity.",
        "Data analysis and statistics. Two basic outcome measures were used to ascertain whether a compound exhibited wake-enhancing activity. The first was the percent time spent awake for each 30 min period following dosing. The second was the total time spent awake in the first 3 hrs following dosing (3 hr AUC; maximum 180 min). For purposes of ascertaining activity of a test compound, wake activity values were compared against corresponding vehicle values. The vehicle values were of two types. The first type was the corresponding within-experiment vehicle, that is, a value for the vehicle group run concurrently with the test compound. A second “reference” vehicle value consisted of the mean 3 hr AUC value calculated from 234 animals in 59 separate experiments carried out during the same time period as the evaluations of the test compounds (mean ±SD =69.22±20.12; 95% confidence limits=66.63-71.81). Two-tailed, unpaired t-tests were performed on the wake time values for drug versus vehicle treated animals, and compounds with p≦0.05 were deemed significantly wake-promoting. A test compound was considered “active” if it met one of the following three criteria.\n\n    \n    \n        (i) The 3 hr AUC value for the test compound was significantly greater (p≦0.05) than the mean wake value for the reference vehicle group (N=234).\n        (ii) The 3 hr AUC value for the test compound was significantly greater (p≦0.05) than the corresponding value for the vehicle group within the same experiment.\n        (iii) One or more of the half-hour wake time values from 0.5 to 2 hrs after dosing was significantly greater (p≦0.05) in the test compound group than in the corresponding vehicle group within the same experiment.\n\nResults",
        "Compounds of the invention either have demonstrated or are expected to demonstrate utility for wake promoting activity.",
        "As example, the three-hours AUC value (mean±sem) for the reference vehicle group and for the test compounds are reported Table 9 for Examples 22, 40 and 113. These test compounds were administered by i.p. route at a 100 mg/kg dose and the time-course of the percent of time awake as function of time was estimated from 1 hr prior to 5 hours post dosing.",
        "TABLE 9\n\n\n\n\n\n\n\nMean AUC0–3h values (± sem) for the reference vehicle group and for test\n\n\ncompounds\n\n\n\n\n\n\n\n\n\n\n\nVehicle\nTest compound\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMean\nsem\nMean\nsem\np\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExample 22\n67.1\n5.3\n162.7\n6.5\n0.000\n\n\n\nExample 40\n66.9\n5.5\n118.9\n10.6\n0.001\n\n\n\nExample 113\n63.5\n9.1\n99.0\n10.4\n0.022\n\n\n\n\n\n\n\nAUC0–3h (% of waiking time × hr) − n = 8 Rats per test compound and 8 rats per control groups.",
        "As compared to the control groups, compounds of Example 22, 40 and 113 produced a significantly greated wakefulness than that observed in the vehicle-treated animals (p<0.05).",
        "References",
        "The following references, to the extent that they provide exemplary procedural or other details supplementary to those set forth herein, are specifically incorporated in their entirety herein by reference:\n\n    Touret, et al., Neuroscience Letters, 189:43-46, 1995.\n    Van Gelder, R. N. et al., Sleep 14:48-55, 1991.\n    Edgar, D. M., J. Pharmacol. Exp. Ther. 282:420-429, 1997.\n    Edgar and Seidel, J. Pharmacol. Exp. Ther., 283:757-69, 1997.\n    Hernant et al., Psychopharmacology, 103:28-32, 1991.\n    Lin et al., Brain Research, 591:319-326, 1992.\n    Opp and Krueger, American Journal of Physiology 266:R688-95, 1994\n    Panckeri et al., Sleep, 19(8):626-631, 1996.\n    Seidel, W. F., et al., J. Pharmacol. Exp. Ther. 275:263-273, 1995.\n    Shelton et al., Sleep 18(10):817-826, 1995.\n    Welsh, D. K., et al., Physiol. Behav. 35:533-538, 1985.\n\nUtility",
        "The present invention provides a method of treating diseases and conditions in a subject in need thereof comprising administering to said subject a therapeutically effective amount of a compound of formula (I). For example, the compounds of the present invention are use in the treatment of diseases, including treatment of sleepiness, promotion of wakefulness, treatment of Parkinson's disease, cerebral ischemia, stroke, sleep apneas, eating disorders, stimulation of appetite and weight gain, treatment of attention deficit hyperactivity disorder (“ADHD”), enhancing function in disorders associated with hypofunctionality of the cerebral cortex, including, but not limited to, depression, schizophrenia, fatigue, in particular, fatigue associated with neurologic disease, such as multiple sclerosis, chronic fatigue syndrome, and improvement of cognitive dysfunction.",
        "Dosage and Formulation",
        "The compounds of the present invention can be administered for therapeutic purposes by any means that results in the contact of the active agent with the agent's site of action in a subject. The compounds may be administered by any conventional means available for use in conjunction with pharmaceuticals, either as individual therapeutic agents or in a combination with other therapeutic agents, such as, for example, analgesics, or in combination with antidepressants, including but are not limited to tricyclic antidepressants (“TCAs”), Selective Serotonin Reuptake Inhibitors (“SSRIs”), Serotonin and Noradrenaline Reuptake Inhibitors (“SNRIs”), Dopamine Reuptake Inhibitors (“DRIs”), Noradrenaline Reuptake Inhibitors (“NRUs”), Dopamine, Serotonin and Noradrenaline Reuptake Inhibitors (“DSNRIs”) and Monoamine Oxidase Inhibitors (“MAOIs) including reversible inhibitors of monoamine oxidase type A (RIMAs). The compounds of the present invention are preferably administered in therapeutically effective amounts for the treatment of the diseases and disorders described herein.",
        "A therapeutically effective amount can be readily determined by the attending diagnostician, as one skilled in the art, by the use of conventional techniques. The effective dose will vary depending upon a number of factors, including the pharmacodynamics of the active agent, the type and extent of progression of the disease or disorder, the age, weight and health of the particular patient, the formulation of the active and its mode and frequency of administration, and the desired effect with a minimization of side effects. Typically, the compounds are administered at lower dosage levels, with a gradual increase until the desired effect is achieved.",
        "Typical dose ranges are from about 0.01 mg/kg to about 100 mg/kg of body weight per day, with a preferred dose from about 0.01 mg/kg to 10 mg/kg of body weight per day. A typical daily dose for adult humans can range from about 1 to about 1000 mg of the active agent, particularly from about 1 to about 400 mg, and including 25, 50, 85, 100, 150, 170, 200, 255, 250, 255, 340, 400, 425, 500, 600, 700, 750, 800, and 900 mg doses, and equivalent doses for a human child.",
        "The compounds may be administered in one or more unit dose forms, and they may be administered in a single daily dose or in two, three or four doses per day. The unit dose ranges from about 1 to about 1000 mg, particlularly from about 1 to about 400 mg, and including 25, 50, 85, 100, 150, 170, 200, 255, 250, 255, 340, 400, 425, 500, 600, 700, 750, 800, and 900 mg unit doses, and equivalent unit doses for a human child. In particular, the unit dosages range from about 1 to about 500 mg administered one to four times a day, preferably from about 10 mg to about 300 mg, two times a day. In an alternate method of describing an effective dose, an oral unit dose is one that is necessary to achieve a blood serum level of about 0.05 to 20 μg/ml in a subject, and preferably about 1 to 20 μg/ml.",
        "The compounds of the present invention may be formulated into pharmaceutical compositions by admixture with one or more pharmaceutically acceptable excipients. The active agent may be present in about 0.5-95% by weight of the composition. The excipients are selected on the basis of the chosen route of administration and standard pharmaceutical practice, as described, for example, in Remington: The Science and Practice of Pharmacy, 20th ed.; Gennaro, A. R., Ed.; Lippincott Williams & Wilkins: Philadelphia, Pa., 2000.",
        "The compositions can be prepared for administration by oral means, including tablets, pills, powders, capsules, troches and the like; parenteral means, including intravenous, intramuscular, and subcutaneous means; topical or transdermal means, including patches, creams, ointments, lotions, pastes, gels, solutions, suspensions, aerosols, and powders and the like; transmucosal means, including nasal, rectal, vaginal, sublingual and buccal means; ophthalmic or inhalation means. Preferably the compositions are prepared for oral administration, particularly in the form of tablets, capsules or syrups; parenteral administration, particularly in the form of liquid solutions, suspensions or emulsions; intranasal administration, particularly in the form of powders, nasal drops, or aerosols; or for topical use, such as patches, creams, ointments, and lotions.",
        "For oral administration, the tablets, pills, powders, capsules, troches and the like can contain one or more of the following: diluents or fillers such as starch, or cellulose; binders such as microcrystalline cellulose, gelatins, or polyvinylpyrrolidone; disintegrants such as starch or cellulose derivatives; lubricants such as talc or magnesium stearate; glidants such as colloidal silicon dioxide; sweetening agents such as sucrose or saccharin; and flavoring agents such as peppermint or cherry flavoring. Capsules may contain any of the above ingredients, and may also contain a semi-solid or liquid carrier, such as a polyethylene glycol. The solid oral dosage forms may have coatings of sugar, shellac, or enteric agents. Liquid preparations may be in the form of aqueous or oily suspensions, solutions, emulsions, syrups, elixirs, etc., or may be presented as a dry product for reconstitution with water or other suitable vehicle before use. Such liquid preparations may contain conventional additives such as surfactants, suspending agents, emulsifying agents, diluents, sweetening and flavoring agents, dyes and preservatives.",
        "The compositions may also be administered parenterally. The pharmaceutical forms acceptable for injectable use include, for example, sterile aqueous solutions, or suspensions. Aqueous carriers include mixtures of alcohols and water, buffered media, and the like. Nonaqueous solvents include alcohols and glycols, such as ethanol, and polyethylene glycols; oils, such as vegetable oils; fatty acids and fatty acid esters, and the like. Other components can be added including surfactants; such as hydroxypropylcellulose; isotonic agents, such as sodium chloride; fluid and nutrient replenishers; electrolyte replenishers; agents which control the release of the active compounds, such as aluminum monostearate, and various co-polymers; antibacterial agents, such as chlorobutanol, or phenol; buffers; suspending agents; thickening agents; and the like. The parenteral preparations can be enclosed in ampules, disposable syringes or multiple dose vials. Other potentially useful parenteral delivery systems for the active compounds include ethylene-vinyl acetate copolymer particles, osmotic pumps, implantable infusion systems, and liposomes.",
        "Other possible modes of administration include formulations for inhalation, which include such means as dry powder, aerosol, or drops. They may be aqueous solutions containing, for example, polyoxyethylene-9-lauryl ether, glycocholate and deoxycholate, or oily solutions for administration in the form of nasal drops, or as a gel to be applied intranasally. Formulations for topical use are in the form of an ointment, cream, or gel. Typically these forms include a carrier, such as petrolatum, lanolin, stearyl alcohol, polyethylene glycols, or their combinations, and either an emulsifying agent, such as sodium lauryl sulfate, or a gelling agent, such as tragacanth. Formulations suitable for transdermal administration can be presented as discrete patches, as in a reservoir or microreservoir system, adhesive diffusion-controlled system or a matrix dispersion-type system. Formulations for buccal administration include, for example lozenges or pastilles and may also include a flavored base, such as sucrose or acacia, and other excipients such as glycocholate. Formulations suitable for rectal administration are preferably presented as unit-dose suppositories, with a solid based carrier, such as cocoa butter, and may include a salicylate.",
        "The compositions of the present invention may be formulated to control and/or delay the release of the active agent(s). Such controlled-, delayed, sustained-, or extended-release compositions are well-known in the art, and may include, for example, reservoir or matrix diffusion products, as well as dissolution systems. Some compositions may utilize, for example biocompatible, biodegradable lactide polymer, lactide/glycolide copolymer, or polyoxyethylene-polyoxypropylene copolymers as excipients.",
        "Preferred embodiments of the invention include the following:",
        "1. A compound of formula (A):",
        "wherein:\n\n    Ar is independantly selected from C6-C10 aryl and 5 to 10-membered heteroaryl wherein:\n    \n        C6-C10 aryl and heteroaryl are optionally substituted with one to three groups selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22)2, (R22)2CO, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2—NR22, NR22S(O)2, C(R22)2C(R22)2, CR21═CR21, C≡C;\n    Y is C1-C6 alkylene; or\n    \n        (C1-C4 alkylene)m—Z—(C1-C4 alkylene)n;\n        wherein said alkylene groups are optionally substituted with one to three R20 groups;\n    \n    \n    Z is O, NR10A, S(O)y, CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene, C3-C6 cycloalkylene, or 3-6 membered heterocycloalkylene; wherein said arylene, heteroarylene, cycloalkylene, and heterocycloalkylene groups are optionally substituted with one to three R20 groups;\n    R1 is selected from NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13;\n    \n        wherein said aryl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R2 and R3 are each independently selected from H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21 CO2R22, OC(0)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R10 and R10A are each independently selected from H, C1-C6 alkyl, C6-C10 aryl, C(═O)R14, and S(O)yR14; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R11 at each occurrence is independently selected from H, C3-C7 alkyl and C6-C10 aryl;\n    \n        wherein said alkyl and aryl group are optionally substituted with one to three R20 groups;\n    \n    \n    R12 and R13 at each occurrence are each independently selected from H, C1-C6 alkyl, or R12 and R13, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    \n        wherein said alkyl group and heterocyclic ring are optionally substituted with one to three R20 groups;\n    \n    \n    R14 at each occurrence is independently selected from C1-C6 alkyl, C6-C10 aryl, and arylalkyl;\n    \n        wherein said alkyl, aryl and arylalkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R20 at each occurrence is independently selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl optionally substituted by one to three OH, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R21 at each occurrence is independently selected from H and C1-C6 alkyl;\n    R22 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    R23 and R24 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R23 and R24, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    R25 at each occurrence is independently the residue of an amino acid after the hydroxyl group of the carboxyl group is removed;\n    m is 0 or 1;\n    n is 0 or 1;\n    q is 0, 1, or 2;\n    y is 0, 1, or 2;\n    with the exclusion of the compounds wherein:\n    \n        Y is C2 alkylene substituted with one to three C1-C6 alkylene and/or NR23R24 and/or NR21CO2R22; and\n        R1 is C(═O)NR12R13.\n    \n    \n    and with the exclusion of the compound:\n    \n        tetrahydro-2-[[{4-(phenylthio)phenyl]methyl}thio]acetyl]-2H-1,2-oxazine;\n\nand the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof.",
        "2. The compound according to embodiment 1, wherein:\n\n    Y is C1-C6alkylene;\n    (C1-C4 alkylene)m—Z1—(C1-C4 alkylene)n;\n    C1-C4 alkylene-Z2—C1-C4 alkylene;\n    wherein said alkylene groups are optionally substituted with one to three R20 groups;\n    Z1 is CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene,\n    C3-C6 cycloalkylene, or 3-6 membered heterocycloalkylene; wherein said arylene, heteroarylene, cycloalkylene, and heterocycloalkylene groups are optionally substituted with one to three R20 groups;\n    Z2 is O, NR10A, or S(O)y.",
        "3. The embodiment according to any of claims 1 or 2 wherein q is 1.",
        "5. The compound according to any of embodiments 1 to 3 wherein R1 is selected from NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13.",
        "6. The compound according to embodiment 5 wherein R1 is selected from NR12R13; NR21C(═O)R14; C(═O)NR12R13; C(═NR11)NR12R13; and NR21C(═O)NR12R13.",
        "7. The compound according to embodiment 6 wherein R1 is C(═O)NR12R13.",
        "8. The compound according to any of the embodiments 5 to 7 wherein R12 and R13 are each independently selected from H and C1-C6 alkyl.",
        "9. The compound according to any of the embodiments 5 to 7 wherein R12 and R13 together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring, wherein said heterocyclic ring is optionally substituted with one R20 group.",
        "10. The compound according to embodiment 5 wherein R1 is selected from C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, and NR21S(O)2NR12R13.",
        "11. The compound according to embodiments 1 to 10 wherein X is O, S(O)y, N(R10).",
        "12. The compound according to embodiments 1 to 10 wherein X is OC(R22)2, C(R22)2O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2NR22, NR22S(O)2, C(R22)2C(R22)2.",
        "13. The compound according to embodiment 12 wherein X is OC(R22)2, C(R22)2NR21, C(═O)N(R21), S(O)2—NR22.",
        "14. The compound according to any of embodiments 1 to 13 wherein Y is C1-C6 alkylene.",
        "15. The compound according to embodiment 14 wherein Y is CH2.",
        "16. The compound according to any of embodiments 2 to 13 wherein Y is (C1-C4 alkylene)m—Z1—(C1-C4 alkylene)n.",
        "17. The compound according to embodiment 16 wherein Z1 is C6-C10 arylene or C3-C6 cycloalkylene.",
        "18. The compound according to embodiment 17 wherein Z1 is phenylene.",
        "19. The compound according to embodiment 16 wherein Z1 is 5-10 membered heteroarylene or 3-6 membered heterocycloalkylene.",
        "20. The compound according to embodiment 16 wherein Z1 is CR21=CR21 or C≡C.",
        "21. The compound according to any of embodiments 2 to 13 wherein Y is C1-C4 alkylene-Z2—C1-C4 alkylene.",
        "22. The compound according to embodiment 21 wherein Z2 is O.",
        "23. The compound according to embodiments 1 or 2 with the structure:",
        "wherein:\n\n    Ar is independantly selected from C6-C10 aryl and 5 to 10-membered heteroaryl wherein:\n    \n        C6-C10 aryl and heteroaryl are optionally substituted with one to three groups selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, C1-C6 alkyl, phenyl, arylalkyl, and C(═O)R22;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22)2, C(R22)2O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2NR22, NR22S(O)2;\n    Y is C1-C6 alkylene;\n    \n        C1-C4 alkylene-Z1—(C1-C4 alkylene)n; or\n        C1-C4 alkylene-Z2—C1-C4 alkylene;\n        wherein said alkylene groups are optionally substituted with one to three R20 groups;\n    \n    \n    Z1 is CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene,\n    \n        C3-C6 cycloalkylene, or 3-6 membered heterocycloalkylene;\n    \n    \n    Z2 is O, NR10A, or S(O)y;\n    R1 is selected from NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13;\n    R2 and R3 are each independently selected from H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22;\n    R2 and R3 are each independently selected from H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22;\n    R10 and R10A are each independently selected from H, C1-C6 alkyl, C(═O)R14, and S(O)yR14;\n    \n        wherein said alkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R11 at each occurrence is independently selected from H or C3-C7 alkyl, wherein said alkyl group is optionally substituted with one to three R20 groups;\n    R12 and R13 at each occurrence are each independently selected from H, and C1-C6 alkyl, or R12 and R13, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    \n        wherein said alkyl group and heterocyclic ring are optionally substituted with one to three R20 groups;\n    \n    \n    R14 at each occurrence is independently selected from C1-C6 alkyl, C6-C10 aryl, and arylalkyl;\n    \n        wherein said alkyl, aryl and arylalkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R20 at each occurrence is independently selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, phenyl, benzyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R21 at each occurrence is independently selected from H and C1-C6 alkyl;\n    R22 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    R23 and R24 at each occurrence are each independently selected from H, and C1-C6 alkyl, or R23 and R24, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    R25 at each occurrence is independently the residue of an amino acid after the hydroxyl group of the carboxyl group is removed;\n    n is 0 or 1;\n    y is 0, 1, or 2;\n\nand the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof.",
        "24. The compound according to embodiment 23 wherein:\n\n    Y is C1-C6 alkylene, C1-C4 alkylene-Z1—C1-C4 alkylene, or C1-C4 alkylene-Z2-C1-c4 alkylene, wherein said alkylene groups are optionally substituted with one to three C1-C6 alkyl groups;\n    \n        Z1 is CR21═CR21, C≡C, or phenyl;\n        Z2 is O, NR10A, or S(O)y;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22)2, C(R22)2O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2NR22, NR22S(O)2; and\n    R1 is selected from NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, and C(═O)NR12R13.",
        "25. The compound according to embodiment 24 wherein R1 is C(═O)NR12R13.",
        "26. The compound according to embodiment 25 having the structure of formula (Ib):",
        "",
        "27. The compound according to embodiment 26 wherein X is O, S(O)y, N(R10), OC(R22)2, C(R22)2O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2—NR22, NR22S(O)2.",
        "28. The compound according to embodiment 27 wherein X is O, S(O)y, NH.",
        "29. The compound according to embodiment 27 wherein X is OCH2, CH2O, CH2NH, NHCH2, C(═O)NH, NHC(═O), S(O)2NH, NHS(O)2.",
        "30. The compound according to any of embodiments 27 wherein X is NH, O—CH2, CH2NH, C(═O)NH, S(O)2—NH.",
        "31. The compound according to any of emdodiments 1 to 30 wherein R2 and R3 are each independently selected from H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22.",
        "32. The compound according to any of embodiments 26 to 31 wherein Y is C1-C6 alkylene.",
        "33. The compound according to embodiment 32 wherein Y is CH2.",
        "34. The compound according to any of embodiments 26 to 31 wherein Y is (C1-C4 alkylene)n-Z1—C1-C4 alkylene and Z1 is phenyl, 5-6 membered heteroarylene, CR21═CR21, or C≡C.",
        "35. The compound according to embodiment 1 selected in accordance with the following table, wherein:",
        "TABLE 1\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx. n°\nAr\nX\nPosition*\nR2\nR3\nq\nY—R1\n\n\n\n\n\n 13\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npiperazinyl-N-Boc\n\n\n 14\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-N-piperazinyl\n\n\n 19\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-N-piperazinyl\n\n\n 16\n4-ClPh\nS\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 23\n4-ClPh\nS\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 24\n4-ClPh\nSO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 29\nPh\nO\npara\nH\nH\n1\nCH2CONHCHMe2\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n 31\nPh\nO\nmeta\nH\nH\n1\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CONH2\n\n\n 32\nPh\nO\nmeta\nH\nH\n1\nCH2CONH2\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CONMe2\n\n\n 33\nPh\nO\nmeta\nH\nH\n1\nCH2CONMe2\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CONHCHMe2\n\n\n 34\nPh\nO\nmeta\nH\nH\n1\nCH2CONHCHMe2\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 35\nPh\nO\nmeta\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 36\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 37\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CO-N-piperazinyl\n\n\n 38\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CO-N-piperazinyl\n\n\n\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 39\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n 11\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 22\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 27\n3,4-DiClPh\nO\npara\nH\nH\n2\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 30\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2COOH\n\n\n 15\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 20\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 40\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\ncarboxamide)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 41\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\ncarboxamide)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 42\n4-OCH3Ph\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-ClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 43\n2-ClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n4-OHPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 44\n4-OHPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-ClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 45\n2-ClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-ClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 46\n2-ClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-ClPh\nO\npara\nH\nH\n0\nCH2CO-N-piperazinyl\n\n\n 47\n2-ClPh\nO\npara\nH\nH\n1\nCH2CO-N-piperazinyl\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 48\n4-FPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 95\n4-FPh\nO\npara\nH\nH\n2\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 96\n4-FPh\nO\npara\nH\nH\n1\nCH2COOH\n\n\n\n4-FPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 49\n4-FPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 50\n4-FPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n4-FPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 51\n4-FPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-Naphthyl\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 52\n2-Naphthyl\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-Naphthyl\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 53\n2-Naphthyl\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-Naphthyl\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 54\n2-Naphthyl\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2-BiPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 55\n2-BiPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2-BiPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 56\n2-BiPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2-ClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 57\n2-ClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-Naphthyl\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 58\n2-Naphthyl\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-BiPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 59\n2-BiPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2-BiPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 60\n2-BiPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-ClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 61\n4-ClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CO-1-(4-methyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 62\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CO-1-(4-methyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 63\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\nHHpiperazinyl\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxyethyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 64\n4-FPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxyethyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxyethyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 65\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxyethyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-methyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 66\n4-FPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-methyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-ClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 67\n4-ClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n4-FPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 68\n4-FPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-OCH3Ph\nO\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 69\n4-OCH3Ph\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n4-ClPh\nS\npara\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 70\n4-ClPh\nS\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 71\n4-ClPh\nSO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 72\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nethylcarboxylate)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 97\nPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n 98\nPh\nO\northo\nH\nH\n1\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONMe2\n\n\n 99\nPh\nO\northo\nH\nH\n1\nCH2CONMe2\n\n\n\nPh\nO\npara\nH\nH\n0\nCH2CONMe2\n\n\n100\nPh\nO\npara\nH\nH\n1\nCH2CONMe2\n\n\n\nPh\nO\npara\nH\nH\n0\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n101\nPh\nO\npara\nH\nH\n1\nCH2CO-N-\n\n\n\n\n\n\n\n\n\npyrrolidinyl\n\n\n\nPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n102\nPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONHCH2CN\n\n\n103\nPh\nO\northo\nH\nH\n1\nCH2CONHCH2CN\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONHCHMe2\n\n\n104\nPh\nO\northo\nH\nH\n1\nCH2CONHCHMe2\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CONHCMe3\n\n\n105\nPh\nO\northo\nH\nH\n1\nCH2CONHCMe3\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n106\nPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n 12\nPh\nO\northo\nH\nH\n0\nCH2CONH(CH2)2OH\n\n\n 21\nPh\nO\northo\nH\nH\n1\nCH2CONH(CH2)2OH\n\n\n\nPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n107\nPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CONH(CH2)2OH\n\n\n108\nPh\nO\nmeta\nH\nH\n1\nCH2CONH(CH2)2OH\n\n\n\nPh\nO\nmeta\nH\nH\n0\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n109\nPh\nO\nmeta\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n110\nPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n111\nPh\nO\npara\nH\nH\n1\nCH2CONH(CH2)2OH\n\n\n112\nPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-\n\n\n\n\n\n\n\n\n\nhydroxy)-piperidinyl\n\n\n113\n4-ClPh\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n114\n3,4-DiOCH3Ph\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n115\n2-Naphthyl\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n116\n4-ClPh\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n117\n3,4DiFPh\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n118\n2,4-DiOCH3Ph\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n119\n3,4,5-\nCONH\northo\nH\nH\n1\nCH2CONH2\n\n\n\nTriOCH3Ph\n\n\n120\n3,4-DiOCH3Ph\nCONH\nmeta\nH\nH\n1\nCH2CONH2\n\n\n121\n2,4-DiOCH3Ph\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n122\n3,4-DiOCH3Ph\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n123\n4-FPh\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n124\n3,4-DiClPh\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n125\n2,4-DiOCH3Ph\nCONH\nmeta\nH\nH\n1\nCH2CONH2\n\n\n126\n4-FPh\nCONH\nmeta\nH\nH\n1\nCH2CONH2\n\n\n127\n3,4-DiClPh\nCONH\nmeta\nH\nH\n1\nCH2CONH2\n\n\n7\n4-ClPh\nO\npara\nH\nH\n0\nCH3\n\n\n8\n4-ClPh\nO\npara\nH\nH\n1\nCH3\n\n\n9\n4-ClPh\nO\npara\nH\nH\n1\nCH2[4(4-\n\n\n\n\n\n\n\n\n\nClPhenoxy)phenyl]\n\n\n\n3,4-DiClPh\nO\npara\nH\nH\n0\nCH3\n\n\n 10\n3,4-DiClPh\nO\npara\nH\nH\n1\nCH3\n\n\n\n4-ClPh\nS\northo\nH\nH\n0\nCH2CO-N-piperazinyl\n\n\n 73\n4-ClPh\nS\northo\nH\nH\n1\nCH2CO-N-piperazinyl\n\n\n\n2,3-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 74\n2,3-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,5-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 75\n2,5-DiCiPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,5-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 76\n2,5-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2,3-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 77\n2,3-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2,4-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 78\n2,4-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,4-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 79\n2,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,4-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 80\n2,4-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2,4-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 81\n2,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n3,5-DiClPh\nO\northo\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 82\n3,5-DiClPh\nO\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,5-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 83\n3,5-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,5-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 84\n3,5-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n3,5-DiClPh\nO\northo\nH\nH\n0\nCH2CONH2\n\n\n 85\n3,5-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n2,5-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 86\n2,5-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n3,4-DiClPh\nS\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 87\n3,4-DiClPh\nS\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,5-DiClPh\nS\npara\nH\nH\n0\nCH2CONH2\n\n\n 88\n2,5-DiClPh\nS\npara\nH\nH\n1\nCH2CONH2\n\n\n\n3,4-DiClPh\nS\npara\nH\nH\n0\nCH2CONH2\n\n\n 89\n3,4-DiClPh\nS\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2,3-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 90\n2,3-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,6-DiClPh\nO\npara\nH\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 91\n2,6-DiClPh\nO\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n\n2,6-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 92\n2,6-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n\n2,3-DiClPh\nO\npara\nH\nH\n0\nCH2CONH2\n\n\n 93\n2,3-DiClPh\nO\npara\nH\nH\n1\nCH2CONH2\n\n\n 94\n2,3-DiClPh\nO\npara\nH\nH\n2\nCH2CONH2\n\n\n135\nPh\nNH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n136\nPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n134\n4-OCH3Ph\nNH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n131\n4-FPh\nSO2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n137\n4-OCH3Ph\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n138\n4-FPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n139\n4-ClPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n140\n4-FPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n128\n3,4-DiClPh\nCONH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n129\n4-FPh\nCONH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n141\n3,4-DiClPh\nNH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n132\n4-ClPh\nSO2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n147\n4-FPh\nCH2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n133\n3,4-DiClPh\nSO2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n148\n3,4-DiClPh\nCH2NH\npara\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n149\n4-FPh\nCH2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n146\n3,4-DiClPh\nCH2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n130\n3,4-DiClPh\nSO2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n145\n2-Furyl\nCH2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n144\n2-Thienyl\nCH2NH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n142\n2-Thienyl\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n143\n2-Furyl\nCONH\northo\nH\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n152\nPh\nOCH2\northo\nH\nH\n0\nCH2CONH2\n\n\n153\nPh\nOCH2\northo\nH\nH\n1\nCH2CONH2\n\n\n 17\n4-ClPh\nO\npara\n2′-Cl\nH\n0\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 18\n4-ClPh\nO\npara\n2′-Cl\nH\n0\nCH2CONH2\n\n\n 25\n4-ClPh\nO\npara\n2′-Cl\nH\n1\nCH2CO-1-(4-acetyl)-\n\n\n\n\n\n\n\n\n\npiperazinyl\n\n\n 26\n4-ClPh\nO\npara\n2′-Cl\nH\n1\nCH2CONH2\n\n\n149a\n3,4-DiClPh\nCONH\npara\nH\nH\n1\nCH2CONH2\n\n\n109a\n4-ClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n109b\n3-Cl-4-FPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n109c\n4-Cl-3-FPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n109d\n3-Cl-4-FPh\nO\northo\nH\nH\n2\nCH2CONH2\n\n\n 10a\n4-ClPh\nO\northo\n4′-Cl\nH\n0\nCH2COOH\n\n\n 18a\n4-ClPh\nO\northo\n4′-Cl\nH\n0\nCH2CONH2\n\n\n 27a\n4-ClPh\nO\northo\n4′-Cl\nH\n1\nCH2CONH2\n\n\n 27b\n4-ClPh\nO\northo\n4′-Cl\nH\n2\nCH2CONH2\n\n\n109e\n3,4-DiFPh\nO\northo\n4′-Cl\nH\n1\nCH2CONH2\n\n\n109f\n3,4-DiClPh\nO\northo\nH\nH\n2\nCH2CONH2\n\n\n 30a\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2COOH\n\n\n 30d\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2COOMenthyl\n\n\n\n\n\n\n\n\n\n(1R,2S,5R)\n\n\n 30e\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CO0H\n\n\n\n\n\n\n\n\n(−)\n\n\n 30f\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2COOH\n\n\n\n\n\n\n\n\n\n(+)\n\n\n 20a\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n\n\n\n\n\n\n(−)\n\n\n 20b\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONH2\n\n\n\n\n\n\n\n\n\n(+)\n\n\n 30b\n3,4-DiClPh\nO\northo\nH\nH\n2\nCH2COOH\n\n\n112a\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CONHCH3\n\n\n112b\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CON(C2H5)2\n\n\n 30f\n3,4-DiClPh\nO\northo\nH\nH\n0\nCH2CON(CH3)2\n\n\n 30g\n3,4-DiClPh\nO\northo\nH\nH\n1\nCH2CON(CH3)2\n\n\n\n\n\nPh = phenyl, ClPh = chlorophenyl, DiClPh = di-chlorophenyl, FPh = Fluoprophenyl.\n\n\n*Position: the position refers to the position of the ArX lateral side chain as compared to —CH2—S(O)q—Y—R1 group on the central benzyl ring.\n\n\n\n\n\n\n    \n    \n        Ortho is position 2′, meta is position 3′ and para is position 4′.",
        "36. A use of a compound of formula (A)",
        "wherein:\n\n    Ar is independantly selected from C6-C10 aryl and 5 to 10-membered heteroaryl wherein:\n    \n        C6-C10 aryl and heteroaryl are optionally substituted with one to three groups selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22)2, (R22)2C—O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2—NR22, NR22S(O)2, C(R22)2C(R22)2, CR2═CR21, C≡C;\n    Y is C1-C6 alkylene; or\n    \n        (C1-C4 alkylene)m—Z—(C1-C4 alkylene)n;\n        wherein said alkylene groups are optionally substituted with one to three R20 groups;\n    \n    \n    Z is O, NR10A, S(O)y, CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene, C3-C6 cycloalkylene, or 3-6 membered heterocyclo-alkylene; wherein said arylene, heteroarylene, cycloalkylene, and heterocycloalkylene groups are optionally substituted with one to three R20 groups;\n    R1 is selected from C6-C10 aryl, NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13;\n    \n        wherein said aryl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R2 and R3 are each independently selected from frem H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R10 and R10A are each independently selected from H, C1-C6 alkyl, C6-C10 aryl, C(═O)R14, and S(O)yR14; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R11 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R12 and R13 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R12 and R13, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    \n        wherein said alkyl and aryl groups and heterocyclic ring are optionally substituted with one to three R20 groups;\n    \n    \n    R14 at each occurrence is independently selected from C1-C6 alkyl, C6-C10 aryl, and arylalkyl;\n    \n        wherein said alkyl, aryl and arylalkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R20 at each occurrence is independently selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl optionally substituted by one to three OH, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R21 at each occurrence is independently selected from H and C1-C6 alkyl;\n    R22 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    R23 and R24 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R23 and R24, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    R25 at each occurrence is independently the residue of an amino acid after the hydroxyl group of the carboxyl group is removed;\n    m is 0 or 1;\n    n is 0 or 1;\n    q is 0, 1, or 2;\n    y is 0, 1, or 2;\n\nand the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof,\n\nfor the manufacture of a medicament useful for treating a disease or a disorder selected from the group consisting of sleepiness associated with narcolepsy, obstructive sleep apnea or shift work disorder; Parkinson's disease; Alzheimer's disease; attention deficit disorder; attention deficit hyperactivity disorder; depression; and fatigue.",
        "37. The use according to embodiment 36 for the manufacture of a medicament useful for the treatment of sleepiness associated with narcolepsy.",
        "38. A use of a compound of formula (A)",
        "wherein:\n\n    Ar is independantly selected from C6-C10 aryl and 5 to 10-membered heteroaryl wherein:\n    \n        C6-C10 aryl and heteroaryl are optionally substituted with one to three groups selected from F, Cl, Br, I, R22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22)2, (R22)2C—O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2—NR22, NR22S(O)2, C(R22)2, C(R22)2, CR21═CR21, C≡C;\n    Y is C1-C6 alkylene; or\n    \n        (C1-C4 alkylene)m—Z—(C1-C4 alkylene)n;\n        wherein said alkylene groups are optionally substituted with one to three R20 groups;\n    \n    \n    Z is O, NR10A, S(O)y, CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene, C3-C6 cycloalkylene, or 3-6 membered heterocyclo-alkylene; wherein said arylene, heteroarylene, cycloalkylene, and heterocycloalkylene groups are optionally substituted with one to three R20 groups;\n    R1 is selected from C6-C10 aryl, NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13;\n    \n        wherein said aryl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R2 and R3 are each independently selected from frem H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22,\n    R10 and R10A are each independently selected from H, C1-C6 alkyl, C6-C10 aryl, C(═O)R14, and S(O)yR14; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R11 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R12 and R13 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R12 and R13, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    \n        wherein said alkyl and aryl groups and heterocyclic ring are optionally substituted with one to three R20 groups;\n    \n    \n    R14 at each occurrence is independently selected from C1-C6 alkyl, C6-C10 aryl, and arylalkyl;\n    \n        wherein said alkyl, aryl and arylalkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R20 at each occurrence is independently selected from F, Cl, Br, I, OR22, OR25, NR3R24, NHOH, NO2, CN, CF3, C1-C6 alkyl optionally substituted by one to three OH, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22,\n    R21 at each occurrence is independently selected from H and C1-C6 alkyl;\n    R22 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    R23 and R24 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R23 and R24, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    R25 at each occurrence is independently the residue of an amino acid after the hydroxyl group of the carboxyl group is removed;\n    m is 0 or 1;\n    n is 0 or 1;\n    q is 0, 1, or 2;\n    y is 0, 1, or 2;\n\nand the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof,\n\nfor the manufacture of a medicament useful for the treatment of a sleep-affecting disease or disorder in order to promote wakefulness.",
        "39. A use of a compound of formula (A)",
        "wherein:\n\n    Ar is independantly selected from C6-C10 aryl and 5 to 10-membered heteroaryl wherein:\n    \n        C6-C10 aryl and heteroaryl are optionally substituted with one to three groups selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22)2, (R 22)2C—O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2—NR22, NR22S(O)2, C(R22)2C(R22)2, CR21═CR21, C≡C;\n    Y is C1-C6 alkylene; or\n    \n        (C1-C4 alkylene)m—Z—(C1-C4 alkylene)n;\n        wherein said alkylene groups are optionally substituted with one to three R20 groups;\n    \n    \n    Z is O, NR10A, S(O)y, CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene, C3-C6 cycloalkylene, or 3-6 membered heterocyclo-alkylene; wherein said arylene, heteroarylene, cycloalkylene, and heterocycloalkylene groups are optionally substituted with one to three R20 groups;\n    R1 is selected from C6-C10 aryl, NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13;\n    \n        wherein said aryl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R2 and R3 are each independently selected from H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R10 and R10A are each independently selected from H, C1-C6 alkyl, C6-C10 aryl, C(═O)R14, and S(O)yR14; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R11 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R12 and R13 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R12 and R13, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    \n        wherein said alkyl and aryl groups and heterocyclic ring are optionally substituted with one to three R20 groups;\n    \n    \n    R14 at each occurrence is independently selected from C1-C6 alkyl, C6-C10 aryl, and arylalkyl;\n    \n        wherein said alkyl, aryl and arylalkyl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R20 at each occurrence is independently selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl optionally substituted by one to three OH, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R21 at each occurrence is independently selected from H and C1-C6 alkyl;\n    R22 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    R23 and R24 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R23 and R24, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    R25 at each occurrence is independently the residue of an amino acid after the hydroxyl group of the carboxyl group is removed;\n    m is 0 or 1;\n    n is 0 or 1;\n    q is 0, 1, or 2;\n    y is 0, 1, or 2;\n\nand the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof,\n\nfor the manufacture of a medicament useful for treating a neurological disease or disorder selected from Parkinson's disease; Alzheimer disease; attention deficit disorder; attention deficit hyperactivity disorder; depression; and fatigue associated with a neurological disease or disorder.",
        "40. A pharmaceutical composition comprising a compound of formula (A)",
        "wherein:\n\n    Ar is independantly selected from C6-C10 aryl and 5 to 10-membered heteroaryl wherein:\n    \n        C6-C10 aryl and heteroaryl are optionally substituted with one to three groups selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    \n    \n    X is O, S(O)y, N(R10), OC(R22)2, (R22)2C—O, C(R22)2NR21, NR21C(R22)2, C(═O)N(R21), NR21C(═O), S(O)2—NR22, NR22S(O)2, C(R22)2C(R22)2, CR21═CR21, C≡C;\n    Y is C1-C6 alkylene; or\n    \n        (C1-C4 alkylene)m—Z—(C1-C4 alkylene)n;\n        wherein said alkylene groups are optionally substituted with one to three R20 groups;\n    \n    \n    Z is O, NR10A, S(O)y, CR21═CR21, C≡C, C6-C10 arylene, 5-10 membered heteroarylene, C3-C6 cycloalkylene, or 3-6 membered heterocyclo-alkylene; wherein said arylene, heteroarylene, cycloalkylene, and heterocycloalkylene groups are optionally substituted with one to three R20 groups;\n    R1 is selected from NR12R13, NR21C(═O)R14, C(═O)R14, CO2R11, OC(═O)R11, C(═O)NR12R13, C(═NR11)NR12R13, OC(═O)NR12R13, NR21S(O)2R11, NR21C(═O)NR12R13, and NR21S(O)2NR12R13;\n    \n        wherein said aryl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R2 and R3 are each independently selected from H, F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R10 and R10A are each independently selected from H, C1-C6 alkyl, C6-C10 aryl, C(═O)R14, and S(O)yR14; wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    R11 at each occurrence is independently selected from H, C1-C6 alkyl, and C6-C10 aryl;\n    \n        wherein said alkyl and aryl groups are optionally substituted with one to three R20 groups;\n    \n    \n    R12 and R13 at each occurrence are each independently selected from H, C1-C6 alkyl, or R12 and R13, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    \n        wherein said alkyl group and heterocyclic ring are optionally substituted with one to three R20 groups;\n    \n    \n    R14 at each occurrence is independently selected from C1-C6 alkyl, C6-C10 aryl, and arylalkyl;\n    \n        wherein said alkyl, aryl and arylalkyl groups are optionally substituted with one to three R groups;\n    \n    \n    R20 at each occurrence is independently selected from F, Cl, Br, I, OR22, OR25, NR23R24, NHOH, NO2, CN, CF3, C1-C6 alkyl optionally substituted by one to three OH, C2-C6 alkenyl, C2-C6 alkynyl, C3-C7 cycloalkyl, 3-7 membered heterocycloalkyl, phenyl, 5 or 6 membered heteroaryl, arylalkyl, C(═O)R22, CO2R22, OC(═O)R22, C(═O)NR23R24, NR21C(═O)R22, NR21CO2R22, OC(═O)NR23R24, NR21C(═S)R22, and S(O)yR22;\n    R21 at each occurrence is independently selected from H and C1C6 alkyl;\n    R22 at each occurrence is independently selected from H C1-C6 alkyl, and C6-C10 aryl;\n    R23 and R24 at each occurrence are each independently selected from H, C1-C6 alkyl, and C6-C10 aryl, or R23 and R24, together with the nitrogen to which they are attached, form a 3-7 membered heterocyclic ring;\n    R25 at each occurrence is independently the residue of an amino acid after the hydroxyl group of the carboxyl group is removed;\n    m is 0 or 1;\n    n is 0 or 1;\n    q is 0, 1, or 2;\n    y is 0, 1, or 2;\n\nand the stereoisomeric forms, mixtures of stereoisomeric forms or pharmaceutically acceptable salts forms thereof,\n\nin admixture with one or more pharmaceutically acceptable excipients.",
        "41. A method for preparing a compound of embodiments 1 to 35, comprising the steps of:\n\n    i) reacting a thiouronium compound (E) with a reactant of structure LG-YR1 to form a compound of formula (I):",
        "wherein Ar, X, R2, R3, Y, R1 are as defined in embodiment 1, q=0 and LG represents a leaving group; and optionally\n        ii) isolating the formed compound of formula (I).",
        "42. The method of embodiment 41, wherein step i) comprises:\n\n    \n    \n        a) converting the compound of formula (E) into the corresponding thiol compound; and\n        b) reacting the obtained thiol compound with the reactant LG-Y—R1.",
        "43. The method of embodiments 41 or 42, wherein the compound (E) is formed by reacting the compound (D) with thiourea and a suitable acid HA:",
        "wherein Ar, X, R2, R3 are as defined in embodiment 1.",
        "44. The method of embodiment 43, wherein the compound (D) is formed by reacting a compound (C) with a suitable reducing agent:",
        "wherein Ar, X, R2, R3 are as defined in embodiment 1 and W is C(═O)H or COOH.",
        "45. The method according to embodiment 44, wherein compound (C) is formed by reacting a compound (A) with a compound (B):",
        "",
        "46. The method according to any of embodiments 41 to 45, wherein the compound formed at step i) is a compound of formula (I) wherein q is 0, R1 is COOR, and R represents H or (C1-C6) alkyl:",
        "",
        "47. The method according to embodiment 46 further comprising:\n\n    \n    \n        a1) reacting the carboxylic acid or ester of formula (I) with an appropriate amine of general structure NHR12R13, wherein R12 and R13 are as defined in embodiment 1; and optionally\n        b1) isolating the obtained compound of formula (I) wherein R1 is C(═O)NR12R13.",
        "48. The method of any of embodiments 46 or 47 further comprising:\n\n    \n    \n        a2) oxidizing the compound of formula (I) wherein q is 0; and optionally\n        b2) isolating the obtained compound of formula (I) wherein q is 1 or 2.",
        "Although the present invention has been described in considerable detail, those skilled in the art will appreciate that numerous changes and modifications may be made to the embodiments and preferred embodiments of the invention and that such changes and modifications may be made without departing from the spirit of the invention. It is therefore intended that the appended embodiments cover all equivalent variations as fall within the scope of the invention."
    ],
    "citations": [
        "3976694",
        "4006183",
        "4066686",
        "4177290",
        "4744812",
        "4927855",
        "4935240",
        "4980372",
        "5180745",
        "5391576",
        "5401776",
        "5563169",
        "5612379",
        "5719168",
        "6346548",
        "6455588",
        "6472414",
        "6488164",
        "6492396",
        "6670358",
        "6919367",
        "6924314",
        "7119214",
        "2002/0045629",
        "2002/0143020",
        "2005/0192313",
        "2005/0228040",
        "2005/0234040",
        "2005/0245747",
        "2006/0241119",
        "150366",
        "04290983.8",
        "2 385 693",
        "1178279",
        "1 570 982",
        "1 600 840",
        "WO 95/01171",
        "WO 99/25329",
        "WO 02/10125"
    ],
    "us_classification": "564162",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "07",
            "subclass": "C",
            "main_group": "233",
            "subgroup": "05"
        }
    ]
}