{
    "title": "Touch panel and electronic equipment using the same",
    "abstract": "A touch panel and an electronic device using the touch panel have satisfactory, reliable operability. The touch panel is used for an operating section of the electronic device. In this touch panel, upper and lower substrates",
    "inventors": [
        "Yamamoto",
        "Komiya",
        "Yamaue",
        "Fukui",
        "Abe"
    ],
    "document_number": "07298366",
    "publication_date": "20071120",
    "assignees": [
        "Matsushita Electric Industrial Co., Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A touch panel for mounting on a planar display, the touch panel comprising:",
            "components": [
                {
                    "component": "a first light-transmitting substrate having a first surface and a second surface opposite to the first surface of the first light-transmitting substrate;",
                    "subcomponents": []
                },
                {
                    "component": "a second light-transmitting substrate having a first surface and a second surface, the first surface of the second light-transmitting substrate facing the first surface of said first light-transmitting substrate with a space therebetween, the second surface of the second light-transmitting substrate being a plane arranged to be mounted onto a planar surface of a display element;",
                    "subcomponents": []
                },
                {
                    "component": "a first light-transmitting electrode layer on the first surface of said first light-transmitting substrate; and",
                    "subcomponents": []
                },
                {
                    "component": "a second light-transmitting electrode layer on the first surface of said second light-transmitting substrate,",
                    "subcomponents": []
                },
                {
                    "component": "wherein respective center portions of the first surface of said first substrate, the second surface of said first substrate, and the first surface of said second subtrate protrude in a direction from the second substrate to the first substrate,",
                    "subcomponents": []
                },
                {
                    "component": "wherein said second light-transmitting substrate comprises a lens, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the center portion of said second substrate is thicker than a periphery of said second substrate.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The touch panel of claim 1 , wherein the second surface of said first substrate comprises a flat portion of the periphery thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The touch panel of claim 1 , further comprising:",
            "components": [
                {
                    "component": "a display sheet affixed to one of the second surface of said first substrate and the second surface of said second substrate.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The touch panel of claim 1 , further comprising:",
            "components": [
                {
                    "component": "a display mark on one of the second surface of said first substrate and the second surface of said second substrate.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A device comprising:",
            "components": [
                {
                    "component": "a display element having a planar surface;",
                    "subcomponents": []
                },
                {
                    "component": "a touch panel comprising:",
                    "subcomponents": []
                },
                {
                    "component": "a first light-transmitting substrate having a first surface and a second surface opposite to the first surface of the first light-transmitting substrate;",
                    "subcomponents": []
                },
                {
                    "component": "a second light-transmitting substrate having a first surface and a second surface of the second light-transmitting substrate, the first surface of the second light-transmitting substrate facing the first surface of said first substrate with a space therebetween, the second surface of the second light-transmitting substrate being a plane arranged to be mounted onto the planar surface of the display element;",
                    "subcomponents": []
                },
                {
                    "component": "a first light-transmitting electrode layer on the first surface of said second substrate wherein",
                    "subcomponents": []
                },
                {
                    "component": "respective center portion portions of the first surface of said first substrate, the second surface of said first substrate, and the first surface of said second substrate protrude in a direction from the second substrate to the first substrate,",
                    "subcomponents": []
                },
                {
                    "component": "said second light-transmitting substrate comprises a lens, and",
                    "subcomponents": []
                },
                {
                    "component": "the center portion of said second substrate is thicker than a periphery of said second substrate; and",
                    "subcomponents": []
                },
                {
                    "component": "a case having an opening to which said first substrate of said touch panel is engaged.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The device of claim 5 ,",
            "components": [
                {
                    "component": "wherein said case includes a portion surrounding the opening, the portion of said case being flat and parallel to the plane of said display element,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the second surface of said first substrate comprises a flat portion at a periphery thereof, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein the flat portion of the second surface of said first substrate contacts the portion of said case.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "The present invention relates to a touch panel used for an operating section of an electronic device, and to the electronic device using the panel.",
        "Electronic devices each equipped with a light-transmitting touch panel mounted in front of a display element, such as an LCD, have recently grown in number as the devices have covered a broad spectrum and have become multifunctional. Each of the devices is operated by visually identifying and selecting characters, marks, or patterns displayed on the display element through the touch panel, and operating the touch panel.",
        "A conventional touch panel is described with reference to FIGS. 6 to 8.",
        "FIG. 6 is a section of the conventional touch panel. Touch panel 8 includes transparent upper substrate 1, such as a film of polyethylene terephthalate, lower substrate 2 made of glass, transparent resin or the like, light-transmitting upper electrode layer 1A formed on a bottom of upper substrate 1, and light-transmitting lower electrode layer 2A formed on a top of lower substrate 2. Electrode layers 1A, 2A may be made of indium tin oxide (ITO). On the top of lower electrode layer 2A, plural dot spacers 3 made of epoxy, silicon, or the like is formed by printing, provides upper and lower electrode layers 1A and 2A with an established spacing between the layers to face each other. Over the top of lower substrate 2, insulating layer 4 and adhesive layer 5 are formed along an outer border of substrate 2, and upper and lower substrates 1 and 2 are put together by adhesive layer 5. Lower substrate 2 is bonded with adhesive layer 7 to a top of transparent supporter 6 made of resin or the like.",
        "When a top of upper substrate 1 is pressed with a finger or pen, as shown in FIG. 7, upper substrate 1 bends, upper electrode layer 1A contacts with lower electrode layer 2A of lower substrate 2. Consequently, upper electrode layer 1A is electrically connected to lower electrode layer 2A. When a pressing force is released, elastic restoring force of upper substrate 1 makes panel 8 return to that illustrated by FIG. 6.",
        "As shown in FIG. 8, touch panel 8 is installed at a bottom of opening 10A in case 10 of the electronic device, and is mounted to case 10 with holder 12 together with display element 11 (e.g., LCD) disposed below panel 8.",
        "Trough transparent touch panel 8, the characters, the marks, or the patterns displayed on display element 11 are visually identified and selected through pressing upper substrate 1 over element 11. The pressing makes touch panel 8 electrically connected and disconnected. In this way, for example, the electronic device switches among functions, or display element 11 switches among displays.",
        "Since being flat, conventional touch panel 8 mounted to case 10 of the electronic device has a top surface (operating surface) of upper substrate 1 positioned back to a surface of case 10. Therefore, as shown in FIG. 8, the finger or pen touches the surface of case 10 about an outer region of opening 10A when an outer border of upper substrate 1 is pressed for operation. Particularly for this case, a user hardly operate the panel and thus results in improper operation.",
        "A touch panel and an electronic device using the panel have reliable operability.",
        "The touch panel includes a light-transmitting upper substrate, a light-transmitting lower substrate spaced from and opposed to the upper substrate, a light-transmitting upper electrode layer on a surface of the upper substrate that faces the lower substrate, and a light-transmitting lower electrode layer provided on a surface of the lower substrate that faces the upper substrate. Respective center portion of the upper and lower substrates protrudes in a direction from the lower substrate to the upper substrate like a dome.",
        "FIG. 1 is a section of a touch panel in accordance with an exemplary embodiment of the present invention.",
        "FIG. 2 is a section of an electronic device in accordance with the embodiment.",
        "FIG. 3 is a plan view of the electronic device in accordance with the embodiment.",
        "FIGS. 4A to 4C are plan views of upper substrates in accordance with the embodiment.",
        "FIG. 5 is a section of another touch panel in accordance with the embodiment.",
        "FIG. 6 is a section of a conventional touch panel.",
        "FIG. 7 is a section of the conventional touch panel in operation.",
        "FIG. 8 is a section of an electronic device equipped with the conventional touch panel.",
        "An exemplary embodiment of the present invention is demonstrated hereinafter with reference to FIGS. 1-5. Elements similar to those in the prior art are denoted by the same reference numerals, and the detailed descriptions of those elements are omitted.",
        "FIG. 1 is a section of a touch panel in accordance with the embodiment of the present invention. Touch panel 25 includes transparent upper substrate 21, such as a film of polyethylene terephthalate or the like, massive, transparent lower substrate 22 that has a flat bottom and is made of polycarbonate, acrylic resin, norbornene resin or the like, light-transmitting upper electrode layer 21A formed on a bottom of upper substrate 21, and light-transmitting lower electrode layer 22A formed on a top of lower substrate 22. Electrode layers 21A and 22A may be made of indium tin oxide (ITO). Respective center portions of upper and lower substrates 21 and 22 protrude upward in a shape of a substantially hemispheric dome. On a top of lower electrode layer 22A, plural dot spacers 3 made of epoxy, silicon or the like is formed by printing, and provides upper and lower electrode layers 21A and 22A with an established spacing between the layers to face each other. Flat portions 21B and 22B are provided at respective outer borders of upper and lower substrates 21 and 22. Insulating layer 4, and adhesive layer 5 are formed along and over an outer border of flat part 22B. Flat portion 21B is coupled to adhesive layer 5, and thus upper and lower substrates 21 and 22 are put together.",
        "When a top surface of upper substrate 21 is pressed by a finger or pen, upper substrate 21 bends, and upper electrode layer 21A contacts with lower electrode layer 22A of lower substrate 22. Consequently, upper electrode layer 21A is electrically connected to lower electrode layer 22A. Similarly to the prior art, elastic restoring force of upper substrate 21 returns to its original form when pressing force is released.",
        "As shown in FIG. 2, touch panel 25 is installed at a bottom side of opening 10A in case 10 of an electronic device to be mounted to case 10 with holder 12 together with display element 11 (e.g., LCD) disposed below panel 25. The center portion of panel 25 is shaped domelike, and thus upper substrate 21 functioning as an operating side protrudes upward through opening 10A. This allows not only the center portion but also the outer border of panel 25 to be pressed easily, and this prevents the electronic device to be operated incorrectly.",
        "Trough transparent touch panel 25, characters, marks, patterns or the like displayed on display element 11 are visually identified and selected though pressing upper substrate 21 over the panel 25. The pressing makes touch panel 25 electrically connected and disconnected. In this way, for example, the electronic device switches among functions, or display element 11 switches among displays. Since lower substrate 22 is massive, panel 25 can be mounted directly to case 10 without a supporter.",
        "In touch panel 25 of the embodiment, respective center portions of upper and lower substrates 21 and 22 facing with the established spacing protrude upward in a dome shape. Touch panel 25, upon being mounted to a bottom of case 10 of the electronic device, has its center portion protrude upward through opening 10A of case 10. This prevents the panel from improper operation, and satisfactory operability is obtained.",
        "Since being massive, lower substrate 22 does not require the supporter for holding substrate 22. Massive substrate 22 having its center portion protruding in the dome shape functions as a lens, and thus enlarges a screen of display element 11 disposed below the touch panel, and is thus easy to see.",
        "Flat portions 21B and 22B provided at respective outer borders of upper and lower substrates 21 and 22 makes the upper and lower substrates put together easily, and thus the touch panel can be easily held and fixed to case 10 of the electronic device and display element 11.",
        "As shown in FIG. 3, display sheet 26 having display marks, such as marks or patterns of various functions, may be affixed to the outer border of the top surface of upper substrate 21 or the outer border of the bottom surface of lower substrate 22 which does not cover the screen of display element 11 disposed below. Sheet 26 allows switching among functions other than the functions displayed on display element 11, thus widening its functions. The display marks may be printed on the substrate instead of the sheet.",
        "In the above description, respective dome-like portions of upper and lower substrates 21 and 22 are substantially hemispheric, as illustrated by FIG. 4A. However, the present invention is not limited to this, and the same advantages can be obtained even if the dome-like portion is substantially elliptical as illustrated by FIG. 4B or substantially quadrangular as illustrated by FIG. 4C according to the shape of opening 10A of the device.",
        "Lower substrate 22, upon being sheet-like or having different thicknesses between the center portion and the outer border, exhibits various lens effects.",
        "In the above description, the center portion of the operating side of touch panel 25 protrudes upward relative to a top of case 10. However, the present invention is not limited to this, and the operating side may be positioned slightly back to the top of case 10 with a low dome-like shape when panel 25 is used in a portable device.",
        "The present invention provides a touch panel and an electronic device using the panel. The touch panel has satisfactory operability and is less likely to cause improper operation."
    ],
    "citations": [
        "4527862",
        "5274198",
        "5613137",
        "5668576",
        "5736688",
        "5748228",
        "5864335",
        "6559902",
        "6654071",
        "2002/0190961",
        "1-102625",
        "04309163",
        "5-197493",
        "05-197493",
        "8-328741",
        "9-305296",
        "10257148",
        "11-161428",
        "11-184631",
        "2000-207983",
        "2001-154592"
    ],
    "us_classification": "345174",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "09",
            "subclass": "G",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}