{
    "title": "Methods of separating feed materials using a magnetic roll separator",
    "abstract": "Methods include separating feed material containing magnetic particles and non-magnetic particles using a belt and magnetic roll separator that has an idler roll and a magnetic roll carrying magnets and the methods involve positioning a feed pan or slide for directing the feed onto the belt in contact with the magnetic roll at selectable positions on the belt and at selectable angles of impact onto the belt closely adjacent and contacting the magnetic roll to provide enhanced separation by the forces of feed impact, bounce and gravity and simultaneous magnetic attraction by the magnetic roll.",
    "inventors": [
        "Arvidson",
        "Zhu"
    ],
    "document_number": "07296687",
    "publication_date": "20071120",
    "assignees": [
        "Outotec Oyj"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of separating feed material including magnetic particles and non-magnetic particles using a magnetic roll separator having an idler roll and a driven magnetic roll carrying magnets about its circumference and a belt in contact with the rolls, comprising the steps of:",
            "components": [
                {
                    "component": "A) moving the belt in contact with and over the magnetic and idler rolls all moving in the same direction;",
                    "subcomponents": []
                },
                {
                    "component": "B) directing the feed material onto the belt after contact of the belt with the magnetic roll; and",
                    "subcomponents": []
                },
                {
                    "component": "C) selectively directing the feed towards the surface of the belt at a plurality of spaced positions.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 wherein step B includes the step of:",
            "components": [
                {
                    "component": "D) directing the feed into a stream at an angle of the feed stream substantially perpendicular to the surface of the belt and magnetic roll.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 wherein step B includes the step of:",
            "components": [
                {
                    "component": "D) directing the feed at an acute angle with respect to the surface of the belt and the magnetic roll.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 wherein step B includes the step of:",
            "components": [
                {
                    "component": "D) directing the feed with respect to the surface of such belt at a selectable angle.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 wherein step B includes the steps of:",
            "components": [
                {
                    "component": "D) providing the feed materials with predetermined kinetic energy to cause the non-magnetic particles to bounce away from the belt; and",
                    "subcomponents": []
                },
                {
                    "component": "E) kinetically dispersing the magnetic particles to allow the magnetic particles to be attracted and to adhere to magnetic poles provided by the magnetic roll.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 wherein step B includes the step of:",
            "components": [
                {
                    "component": "D) selecting the angle of direction of feed onto the belt to be between an angle perpendicular to the surface of the belt and an acute angle with respect to the surface of the belt.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 further including the step of:",
            "components": [
                {
                    "component": "D) providing an ionizer adjacent an idler roll for neutralizing an electric charge on the belt.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A method of separation feed material including magnetic particles and non-magnetic particles using a magnetic roll separator having an idler roll and a driven magnetic roll carrying magnets about its circumference and a belt in contact with the rolls. comprising the steps of:",
            "components": [
                {
                    "component": "A) moving the belt in contact with and over the magnetic and idler rolls all moving in the same direction;",
                    "subcomponents": []
                },
                {
                    "component": "B) directing the feed material onto the belt after contact of the belt with the magnetic roll; and",
                    "subcomponents": []
                },
                {
                    "component": "C) providing the feed materials in step B with predetermined kinetic energy to cause the non-magnetic particles to bounce away from the belt.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 8 wherein step B includes the step of:",
            "components": [
                {
                    "component": "D) providing the feed material with sufficient kinetic energy to disperse the magnetic particles to allow the magnetic particles to adhere to magnetic poles for enhancing the separation of particles making up the feed material.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A method of separating feed material including magnetic particles and non-magnetic particles using a magnetic roll separator having an idler roll and a driven magnetic roll carrying magnets about its circumference and a belt in contact with the rolls, comprising the steps of:",
            "components": [
                {
                    "component": "A) moving the belt in contact with and over the magnetic and idler rolls all moving in the same direction;",
                    "subcomponents": []
                },
                {
                    "component": "B) directing the feed material onto the belt after contact of the belt with the magnetic roll; and",
                    "subcomponents": []
                },
                {
                    "component": "C) kinetically dispersing the magnetic particles in step B to allow the magnetic particles to be attracted and adhere to magnetic poles provided by the magnetic roll.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A method of separating feed material including magnetic particles and non-magnetic particles using a magnetic roll separator having an idler roll spaced from a magnetic roll carrying magnets about its circumference and a continuous belt in contact with the rolls comprising the steps of:",
            "components": [
                {
                    "component": "A) moving the belt over the magnetic roll with the belt and roll moving in the same direction;",
                    "subcomponents": []
                },
                {
                    "component": "B) directing the feed onto the belt after contact between the belt and the magnetic roll at an angle of attack with respect to an outer surface of such belt; and",
                    "subcomponents": []
                },
                {
                    "component": "C) directing the feed material onto the belt to provide the feed material with sufficient kinetic energy to cause the non-magnetic particles to bounce on impact away from the belt and to disperse the magnetic particles to allow the magnetic particles to be attracted to and adhere to magnetic poles provided by the magnetic roll for enhancing the separation between the magnetic and non-magnetic particles.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 11 wherein step B includes the step of:",
            "components": [
                {
                    "component": "D) directing the feed onto the magnetic roll whereby the angle of the feed is perpendicular to the surface of the belt and magnetic roll.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 12 wherein step D includes the step of:",
            "components": [
                {
                    "component": "D) selecting the angle at which the feed is directed with respect to the surface of the belt.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 12 wherein step D includes the step of:",
            "components": [
                {
                    "component": "D) selecting the angle at which the feed is directed with respect to the surface of the belt.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 11 wherein step B includes the step of:",
            "components": [
                {
                    "component": "D) directing the feed onto the magnetic roll at an acute angle with respect to the surface of the belt and the magnetic roll.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 15 wherein step D includes the step of:",
            "components": [
                {
                    "component": "D) selectively directing the feed onto the belt at a plurality of positions where an inner surface of the belt is in contact with the magnetic roll.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 11 wherein step B includes the step of:",
            "components": [
                {
                    "component": "D) selectively directing the feed towards the magnetic roll onto an outer surface of the belt at a plurality of spaced positions.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 11 wherein step B includes the step of:",
            "components": [
                {
                    "component": "D) selecting the angle of feed onto the belt to be between an angle perpendicular to such belt surface and an acute angle with respect to the surface of the belt.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "Not Applicable.",
        "Not Applicable.",
        "Not Applicable.",
        "1. Field of the Invention",
        "The present invention relates to the use of belted roll magnetic material separation and particularly to an improved method of feeding materials onto such separator.",
        "2. Relevant Art",
        "Magnetic separation technology exploits the difference in magnetic properties between magnetic feed material and non-magnetic material mixed therewith. Magnetic particles are pulled toward a drum shell or belt surface by magnetic force from within the drum or roll. In dry separation processes non-magnetic material is thrown off the apparatus by centrifugal force. The process works reasonably well for relatively coarse particles (for example, >0.55 mm) because the centrifugal force is large enough to provide for adequate separation and when particles are not charged electrostatically to an extent or degree that would interfere with the separation process. What is needed is an improved method for introducing the feed material onto the separation apparatus to enhance separation of the material into magnetic and non-magnetic components, especially for small size or fine particles (for example, <0.55 mm) and for materials that tend to be electrostatically charged.",
        "In one aspect of the present invention there is provided a method of separating feed material including magnetic particles and non-magnetic particles using a magnetic roll separator having an idler roll and a driven magnetic roll carrying magnets about its circumference and a belt in contact with the rolls, comprising the steps of: moving the belt over the rolls; and directing the feed stream onto the belt after contact of the belt with the magnetic roll. Additional steps include: directing the feed stream at an angle perpendicular or nearly perpendicular to the surface of the belt and magnetic roll; directing the feed stream at an acute angle with respect to the surface of the belt and the magnetic roll; selectively directing the feed towards an outer surface of the belt at a plurality of spaced positions; directing the feed with respect to the surface of such belt at a selectable angle; and providing the feed materials with predetermined kinetic energy to cause the non-magnetic particles to bounce away from the belt.",
        "Other aspects of the present invention include kinetically dispensing the magnetic particles to allow the magnetic particles to be attracted and adhere to magnetic poles provided by the magnetic roll; providing the feed materials with predetermined kinetic energy to cause the non-magnetic particles to bounce away from the belt; kinetically dispersing the magnetic particles to allow the magnetic particles to be attracted and to adhere to magnetic poles provided by the magnetic roll; selecting the angle of direction of feed onto the belt to be between an angle perpendicular to the surface of the belt and an acute angle with respect to the surface of the belt.",
        "In an additional aspect of the present invention there is provided a method of separating feed material including magnetic particles and non-magnetic particles using a magnetic roll separator having an idler roll spaced from a magnetic roll carrying magnets about its circumference and a continuous belt in contact with the rolls comprising the steps of: moving the belt over the magnetic roll; directing the feed onto the belt after contact with the magnetic roll at an angle of attack with respect to an outer surface of such belt; and directing the feed stream onto the belt to provide the feed material with sufficient kinetic energy to cause the non-magnetic particles to bounce on impact away form the belt and to disperse the magnetic particles to allow the magnetic particles to be attracted to and adhere to magnetic poles provided by the magnetic roll for enhancing the separation between the magnetic and non-magnetic particles. Other steps include directing the feed stream onto the magnetic roll whereby the angle of the feed stream is substantially perpendicular to the surface of the belt and magnetic roll; directing the feed stream onto the magnetic roll at an acute angle with respect to the surface of the belt and the magnetic roll; or selectively directing the feed stream towards the magnetic roll onto an outer surface of the belt at a plurality of spaced positions; or selectively directing the feed onto the magnetic roll at a plurality of positions where an inner surface of the belt is closely adjacent the magnetic roll; or selecting the angle of feed onto the belt to be between an angle perpendicular to such belt surface and an acute angle with respect to the surface of the belt.",
        "In a further aspect of the present invention there is provided a method for separating feed material including magnetic particles and non-magnetic particles using a belt and magnetic roll separator including a magnetic roll and an idler roll comprising the steps of: moving the belt over the magnetic roll and directing the feed onto the belt closely adjacent and firmly supported by the magnetic roll at a selectable position on the belt and at a selectable angle onto the belt. An additional step includes providing the feed material with sufficient kinetic energy to disperse the magnetic particles to adhere to magnetic poles for enhancing the separation of particles making up the feed material.",
        "The novel features which are believed to be characteristic of this invention are set forth with particularity in the appended claims. The invention itself, however, both as to its organization and method of operation, together with further objects and advantages thereof, may best be understood by reference to the following description taken in connection with the accompanying drawings, in which:",
        "FIG. 1 is a pictorial illustration of a magnetic roll portion of a magnetic separator according to the prior art;",
        "FIG. 2 is a pictorial illustration of a magnetic separator showing various positions and angles of attack (or impact) of the incoming feed flow according to the present invention; and",
        "FIGS. 3-21 are illustrations of various samples and test results obtained using the methods of the present invention.",
        "A magnetic separator is a device used to separate a mixture of fine, dry materials based upon their magnetic properties. The principles governing this process are magnetism and the interaction between magnetic, gravitational, and centripetal forces. The magnetic characteristics of a material are based upon atomic structure and magnetic field intensity.",
        "The principles involved in the separation apparatus include feed rate, particle velocity and magnetic field strength. Magnetic separation has two general applications:",
        "1. Purification of feeds via the magnetic removal of impurities and (2) the concentration of magnetic materials from a mixture of materials.",
        "Magnetic separation is a process in which two or more materials are separated from each other. The primary force employed is magnetization, however, there are other forces that act upon the particles as well.",
        "As illustrated in FIG. 1, a separator system 10 employs a magnetic separator roll 11, driven by a mechanism 21 as well known in the art. Belt 12 is also a conventional belt as understood in the art. Feed 13 is directed from feed pan 16 via vibratory feeder 15 onto belt adjacent the idler roll 14. Ionizer 17, when used, provides an ion cloud 18 to neutralize electric charge on belt 12 and assists in removal of particles on the belt. Separated portions 19 are divided by splitters 20 also as understood in the art.",
        "THE PRESENT EMBODIMENT OF AN IMPACTING FEED METHOD",
        "As discussed hereinabove, normally the feed stream is fed onto the belt surface near the idler or non-magnetic roll 14 of the belt separator via feed pan 16. This location is chosen so that the particles have time to “settle down” before they approach the magnetic roll 11.",
        "In the present invention, the feed stream is directed onto the belt at the location where the belt is in contact with the magnetic roll. There are two distinct advantages that derive from this approach. First, the time interval during which particles “settle down” in the prior art can result in the attraction to the belt due to static charges, which causes some of the fine particles to stick to the belt even though they should have been thrown out as non-magnetic product by the centripetal force. Ionizers as discussed hereinabove may assist in the separation, but some interference may still result during the “settling down” time period",
        "Second, the use of direct-to-magnetic roll feed allows for directing a given feed at the angle appropriate for optimization of separation for the specific feed properties at hand. In addition, the exact radial location of the feed input to the magnetic roll may be changed to further enhance separation as desired. In the prior art systems, the only input point that is suggested is tangentially onto the belt prior to the belt contacting the magnetic roll 31 prior to the 12 o'clock position. The variability of the “angle of attack” allows for the positioning of the magnetic particles so as to allow them to approach the magnetic surface with some kinetic energy of a predetermined quantity allowing the particles to disperse and to “find” a magnetic pole to adhere to. Finally, the non-magnetic particles will bounce on impact and therefore be thrown out from the roll/belt surface with greater energy thereby enhancing the separation and providing a significant improvement over existing technology.",
        "With respect now to FIG. 2, a pictorial illustration of the improved separation method is illustrated. The idler 30, magnetic roll 31 and belt 32 moving in the direction as shown by arrow 33 are substantially as discussed for similar parts in connection with FIG. 1 hereinabove. Magnetic particles 34 are separated from non-magnetic particles 35 and deposited on collection surface 41 employing conventional splitter(s) 42.",
        "Each angle of direction or attack 37, 38, 39 and 40 is chosen based upon the content and type of feed 13 that is to be processed based upon the position of feed pan 13′. Angle of attack 39 is perpendicular to the surface of belt 32 over magnetic roll 31. The other angles 37, 38 and 40 form acute angles with respect to belt 32 surface. The angles of attack 37-40 may be at any position on the outer surface of belt 32 from the vertical axis 43 that extends from an upper 12 o'clock position to the horizontal axis 44 at the 9 o'clock position.",
        "As shown in FIGS. 3-21 a substantial improvement in a separation is obtained for the rare earth magnetic roll separator (RER) system with the impacting feed methods vs. the standard feed methods of the prior art.",
        "The results obtained when the angle of attack is substantially vertically is generally shown as angles 37 and 38 in FIG. 2. These results are set forth in FIGS. 3-12.",
        "FIG. 3 illustrates the significant improvements that result at four different feed rates in a roll feed method in accord with the present invention vs. a belt feed method of the prior art. The ionizer 17 was off during the test runs. As also shown in FIG. 4, a substantial improvement obtains and does not vary in any significant manner as feed rates increase.",
        "FIGS. 5-8 illustrate results with other samples also with four feed rates. Again, the differences between roll feed and belt feed methods of separation are substantial.",
        "FIGS. 9-10 illustrate six different samples each for belt operation vs. roll operation. A substantial reduction in Fe2O3 level is obtained from the use of the new impact feed methodology.",
        "FIGS. 11 and 12 illustrate test runs where ionizer 17 was on and different roll speeds were employed. Here again, the recovery rates of the impact feed methodology were substantially enhanced over the belt approach. In addition, as shown clearly in FIG. 12 the recovery percentage is significantly better employing the methodology of the present invention.",
        "FIGS. 13-18 illustrate results for angles substantially similar to angles 39, 40.",
        "FIGS. 13 and 14 illustrate test results at constant roll speed with ionizer 17 turned on. Recovery is substantially higher with the impact feed methodology and results are more constant in the non-magnetic fraction even with varying feed rates.",
        "FIGS. 15-16 illustrate results with ionizer 17 on and constant roll speed and show substantially the same improvements as seen hereinabove with respect to FIGS. 13-14.",
        "FIGS. 17-18 illustrate other test samples and show similar improvements as seen hereinabove with respect to FIGS. 13-16.",
        "FIGS. 19 and 20 illustrate five test runs employing constant roll speed and feed rates with ionizer 17 on (Nos. 1-4) and off (No. 5) illustrating that the 10 o'clock position of angle of attack offers a substantial improvement, with ionizer on or off, for the particular feed material over the prior art or standard feed position on the belt spacedly removed from the magnetic roll.",
        "FIG. 21 illustrates another set of test runs showing the improved recovery and consistency employing the impact feed methodology according to the present invention.",
        "While the invention has been described with respect to certain specific embodiments, it will be appreciated that many modifications and changes may be made by those skilled in the art without departing from the spirit of the invention. It is intended therefore, by the appended claims to cover all such modifications and changes as fall within the true spirit and scope of the invention."
    ],
    "citations": [
        "4375853",
        "5101980",
        "5271506",
        "5615775",
        "5931308",
        "6068133",
        "6467629",
        "6634504",
        "2005/0092656",
        "05277398"
    ],
    "us_classification": "209637",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "03",
            "subclass": "C",
            "main_group": "1",
            "subgroup": "16"
        }
    ]
}