{
    "title": "Limited access building connection",
    "abstract": "A limited access building connection for connecting a holding structure and a held structure which includes an anchor member having a threaded end adapted for connection to holding structure. A nut having an inner threaded wall threadably engages the threaded end of anchor member. Nut has a base which engages connector structure. Connector structure is adapted for connection to held structure. A nut rotational member is provided for imparting rotational motion to nut. Connection has dimensional limited access parameters existent between nut and connector structure and held structure. A linear power member is dimensioned and configured to work within the dimensional limited access parameters and is adapted for engaging and imparting rotational energy to nut rotational member.",
    "inventors": [
        "Leek",
        "Powell"
    ],
    "document_number": "07296501",
    "publication_date": "20071120",
    "assignees": [
        "Simpson Strong-Tie Company, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A limited access building connection for connecting a holding structure and a held structure comprising:",
            "components": [
                {
                    "component": "a. an anchor member adapted for connection to said holding structure and having a threaded end;",
                    "subcomponents": []
                },
                {
                    "component": "b. a nut having an inner threaded wall for threadably engaging said threaded end of said anchor member and having a base;",
                    "subcomponents": []
                },
                {
                    "component": "c. connector means adapted for engaging said base of said nut and adapted for connection to said held structure;",
                    "subcomponents": []
                },
                {
                    "component": "d. nut rotational means for imparting rotational motion to said nut;",
                    "subcomponents": []
                },
                {
                    "component": "e. dimensional limited access parameters existent between said nut and said connector means and said held structure;",
                    "subcomponents": []
                },
                {
                    "component": "f. an initially spirally wound flexible strap member having an elongated planar surface which unwinds to a linear power means dimensioned and configured to work within said dimensional limited access parameters and adapted for engaging and imparting rotational energy to said nut rotational means; and",
                    "subcomponents": []
                },
                {
                    "component": "g. holding means holding said strap member in an initial flat plane and retaining said unwound portion of said strap in said plane during unwinding from said spiral.",
                    "subcomponents": []
                },
                {
                    "component": "h. said nut rotational means and said linear power means are combined in an integral spiral hand pull device including;",
                    "subcomponents": [
                        "(1) a modified cap member formed with an inner ring wall forming an opening therethrough for coaxial movement along the axis of said anchor member and formed with a base section having an annular outer wall and having a plurality of segments forming a hexagonal inner wall configured and dimensioned to inter fit with said outer wall of said internally threaded nut and a head section having an integrally formed inner ring wall and an integrally formed outer ring wall and a flange extending from said outer ring wall and terminating with a planar annular outer wall surface coaxially aligned with said planar surface of said flexible strap member; and"
                    ]
                },
                {
                    "component": "(1) a modified cap member formed with an inner ring wall forming an opening therethrough for coaxial movement along the axis of said anchor member and formed with a base section having an annular outer wall and having a plurality of segments forming a hexagonal inner wall configured and dimensioned to inter fit with said outer wall of said internally threaded nut and a head section having an integrally formed inner ring wall and an integrally formed outer ring wall and a flange extending from said outer ring wall and terminating with a planar annular outer wall surface coaxially aligned with said planar surface of said flexible strap member; and",
                    "subcomponents": []
                },
                {
                    "component": "i. said spirally wound flexible elongated strap member is attached to said integrally formed flange at said outer wall annular surface at one end and to a handle at its other end.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A limited access building connection as defined in claim 1 comprising:",
            "components": [
                {
                    "component": "a. said holding means of said spiral hand pull device includes:",
                    "subcomponents": [
                        "(1) at least one rigid spoke connected to said flange and releasably attached at multiple points to said spirally wound flexible elongated strap member for successive breakaway release from each unwinding turn as said elongated strap member is unwound."
                    ]
                },
                {
                    "component": "(1) at least one rigid spoke connected to said flange and releasably attached at multiple points to said spirally wound flexible elongated strap member for successive breakaway release from each unwinding turn as said elongated strap member is unwound.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A limited access building connection for connecting a holding structure and a held structure comprising:",
            "components": [
                {
                    "component": "a. an anchor member adapted for connection to said holding structure and having a threaded end;",
                    "subcomponents": []
                },
                {
                    "component": "b. a nut having an inner threaded wall for threadably engaging said threaded end of said anchor member and having a base;",
                    "subcomponents": []
                },
                {
                    "component": "c. connector means adapted for engaging said base of said nut and adapted for connection to said held structure;",
                    "subcomponents": []
                },
                {
                    "component": "d. nut rotational means for imparting rotational motion to said nut;",
                    "subcomponents": []
                },
                {
                    "component": "e. dimensional limited access parameters existent between said nut and said connector means and said held structure;",
                    "subcomponents": []
                },
                {
                    "component": "f. linear power means dimensioned and configured to work within said dimensional limited access parameters and adapted for engaging and imparting rotational energy to said nut rotational means;",
                    "subcomponents": []
                },
                {
                    "component": "g. said nut rotational means and said linear power means are combined in an integral spiral hand pull device including;",
                    "subcomponents": [
                        "(1) a modified cap member formed with ring wall forming an opening therethrough for coaxial movement along axis of said anchor member and formed with a base section having an annular outer wall and having a plurality of segments forming a hexagonal inner wall configured and dimensioned to inter fit with said outer wall of said internally threaded nut and a head section having an integrally formed inner ring wall and an integrally formed outer ring wall;"
                    ]
                },
                {
                    "component": "(1) a modified cap member formed with ring wall forming an opening therethrough for coaxial movement along axis of said anchor member and formed with a base section having an annular outer wall and having a plurality of segments forming a hexagonal inner wall configured and dimensioned to inter fit with said outer wall of said internally threaded nut and a head section having an integrally formed inner ring wall and an integrally formed outer ring wall;",
                    "subcomponents": []
                },
                {
                    "component": "h. a spirally wound flexible elongated member attached to said integrally formed outer ring wall and to a handle;",
                    "subcomponents": []
                },
                {
                    "component": "i. said spiral hand pull device includes at least one spoke releasably attached to said spirally wound flexible elongated member and to said integrally formed outer ring wall and holding said spirally wound flexible elongated member in an initially flat plane; and",
                    "subcomponents": []
                },
                {
                    "component": "j. at least one spoke finger releasably attached to a face wall of the outermost spiral of said spirally wound flexible elongated member and to at least one spoke.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application is a divisional of and claims benefit from U.S. patent application Ser. No. 11/075,475, filed Mar. 9, 2005 now U.S Pat. No. 7,168,343.",
        "This invention relates to those connections in building structures in which wood or steel frame held embedded structures are connected to a holding structure such as a concrete foundation by means of a threaded end steel anchor bolt or rod or another steel or wood structure. In these connections, a nut is threadably attached to the distal end of the anchor bolt or rod. The nut engages a washer or holdown which in turn is connected to a wood or steel building structural frame member.",
        "More specifically, the invention relates to building connections in which there is a dimensional restriction which limits the access of standard tools to install and maintain a specified torque force on the threaded nut. The outer face of the nut may be too close to either the holdown member or the side wall of the structure being held. There also may be insufficient space above the end of the threaded anchor member for a standard tool to gain access to the nut.",
        "Access to threaded nuts which are difficult to access and turn due to dimensional restrictions have spawned a host of special tools to rotate the nuts. Special tools of varying complexity have been devised to tighten nuts in dimensionally restricted applications, but most are inadequate to cope with situations where there is an extreme restriction of less than about a 1/16th inch gap between the side wall of the nut and adjacent connection walls or the walls of the structure being held.",
        "Tools capable of operating in such extreme restriction conditions are either too fragile to successfully operate in the building connections of the present invention, or they are incapable of meeting the torque requirements of threaded connections in the present building connections.",
        "The present invention solves the problem of how to meet the torque requirements and to install a threaded nut in extreme dimensionally restricted conditions.",
        "An object of the present invention is to provide a connection between a holding and a held structure which maximizes the bearing surface area for the held structure while enabling threading and tightening of a nut on a threaded anchor bolt without the need for expensive tools.",
        "Another object of the present invention is to disclose a new disposable tool for tightening the threaded nuts.",
        "A further object is to provide a system for using the new disposable tool for automatically tightening the nut on the threaded anchor during the life of the connection as wood shrinkage in the structure being held occurs.",
        "Still another object is to provide a combination nut which both engages the threaded anchor member and serves as a washer in engaging a holdown member. The combination nut is formed with an annular ring of driven members for engaging the new disposable tool of the present invention.",
        "A still further object is to provide a cap member which can be used to engage and turn a standard hex nut using the new disposable tool of the present invention.",
        "Another object is to provide a cap member which is formed with ratchet teeth, sprocket teeth, or gear teeth so that the threaded nut can be turned in only one direction or in both directions by the new disposable tool of the present invention",
        "Another object of the present invention is to provide an alternate disposable tool for engaging and tightening a standard threaded hex nut wherein access to the nut is dimensionally limited from above the nut.",
        "Still another object of the present invention is to provide a system in which the nut can be rotated by means of a power drill using a worm gear bit.",
        "A still further object is to use a multistart nut in the limited access building connection of the present invention wherein maximum linear movement is attained with a minimum amount of rotation of the multistart threaded nut.",
        "The system used in the present invention is not only inexpensive to install the initial connection, but it is equally inexpensive to maintain the integrity of the connection as wood shrinkage degrades the connection.",
        "The system of the present invention can be inexpensively upgraded to an automatic take up device which continuously maintains the integrity of the connection without periodic skilled labor intervention during the many years the connection is in service.",
        "FIG. 1 is a side view of a connection of the present invention with portions of the internal portions of the connection shown in broken line to illustrate the operation of the invention",
        "FIG. 2 is a front view of one form of a portion of the present building connection showing a form of tool used in constructing and maintaining the present building connection.",
        "FIG. 3 is a side view of the portion of the present invention illustrated in FIG. 2.",
        "FIG. 4 is a side view of another form of the invention illustrated in FIG. 2 encompassing an automatic take up device.",
        "FIG. 5A is a side view of an alternate form of nut which may be used in the present invention.",
        "FIG. 5B is a top plan view of the nut illustrated in FIG. 5A.",
        "FIG. 5C is a sectional view of the nut taken along line 5C-5C of FIG. 5B.",
        "FIG. 6A is a top plan view of a cap member used in a form of the invention used to transfer rotational energy to a standard nut.",
        "FIG. 6B is a bottom plan view of the cap member of FIG. 6A.",
        "FIG. 6C is a sectional view of the cap member taken along line 6C-6C of FIG. 6B.",
        "FIG. 7A is a top plan view of another form of the invention illustrated in FIGS. 6A, 6B and 6C showing the side and bottom of the form of the invention.",
        "FIG. 7B is a bottom plan view of the invention illustrated in FIG. 7A.",
        "FIG. 7C is a sectional view taken along line 7C-7C in FIG. 7A.",
        "FIG. 8A is an inverted front elevation view of still another form of the invention.",
        "FIG. 8B is a top plan view of the invention illustrated in FIG. 8A.",
        "FIG. 8C is a back elevation view of the invention illustrated in FIG. 8B.",
        "FIG. 8D is a bottom plan view of the invention illustrated in FIG. 8B.",
        "FIG. 8E is a side elevation view of the invention illustrated in FIG. 8D.",
        "FIG. 9A is an exploded side elevation view of a portion of a building structure and another form of the limited access building connection of the present invention showing a spiral hand pull device 40 ready for positioning on nut 15.",
        "FIG. 9B is the same view as FIG. 9A with spiral hand pull device 40 mounted on nut 15.",
        "FIG. 9C is the same view as FIGS. 9A and 9B with spiral hand pull device actuated.",
        "FIG. 10 is a perspective view of a worm gear bit which may be used in the connection of the present invention.",
        "FIG. 11A is a perspective view of a multistart nut of the present invention.",
        "FIG. 11B is a sectional view of a multistart nut taken along line 11B-11B of FIG. 11A.",
        "FIG. 1 of the drawings illustrates one form of a limited access building connection 1 of the present invention for connecting a holding structure 2 and a held structure 3 and consists briefly of an anchor member 13 adapted for connection to holding structure 2 and having a threaded end 14; a nut 15 having an inner threaded wall 39 for threadably engaging threaded end 14 of anchor member 13 and having a base 22; connector means 8 adapted for engaging base 22 of nut 15 and adapted for connection to held structure 3; nut rotational means 26 for imparting rotational motion to nut 15; dimensional limited access parameters existent between nut 15 and connector means 8 and held structure 3; and linear power means 27 dimensioned and configured to work within dimensional limited access parameters and adapted for engaging and imparting rotational energy to nut rotational means 26.",
        "Still referring to FIG. 1, a limited access building connection 1 of the present invention may include a nut rotational means 26 which includes a ring 64 of externally formed rotational driven members 16 adapted for connection on the perimeter of nut 15; and linear power means 27 includes a plurality of driving means 20 for engaging rotational driven members 16 for imparting rotational motion to nut 15.",
        "Referring to FIG. 1, rotational driven members 16 may be ratchet teeth for one way rotation of nut 15.",
        "Still another way to construct nut rotational means 26 with rotational driven members which are gear teeth for two way rotation of the nut 15.",
        "Still another way to construct nut rotational means 26 is to form rotational driven members 16 as sprocket teeth for two way rotation of nut 15.",
        "Referring to FIGS. 5A, 5B and 5C, another form of a limited access building connection 1 is illustrated. In this form nut 15′ is formed as a disc having an annular circumferential wall 65 and a base 66 having a substantial planar portion adapted for engaging connector means 8; nut rotational means 26 includes a ring 64′ of externally formed driven members 16′ mounted on annular circumferential wall 65; and linear power means 27 includes a plurality of driving means 20 for engaging rotational driven members 16′ for imparting rotational motion to nut 15′. Inner threaded wall 39′ threadably engages threaded anchor member 13.",
        "Another way of constructing nut rotational means 26 as illustrated in FIGS. 6A, 6B and 6C is to form rotational driven members 16′ as ratchet teeth.",
        "Still another way of constructing nut rotational means 26 is to form rotational driven members 16′ as gear teeth.",
        "A further way of constructing nut rotational means 26 as illustrated in FIGS. 7A, 7B and 7C is to form rotational driven members 16′ as sprocket teeth.",
        "Referring to FIGS. 2 and 3, linear power means 27 is constructed as an elongated pull member 19 having a generally straight portion 53 formed from plastic.",
        "Still referring to FIGS. 2 and 3, driving means 20 are a plurality of openings 20′ formed in plastic elongated pull member 19.",
        "As best illustrated in FIG. 1, the limited access building connection 1 of the present invention includes a nut 15 which is laterally distant from held structure 3 a distance only slightly greater than the width of linear power means 27.",
        "Still referring to FIG. 1, connector means 8 of limited access building connection 1 includes a washer member 52 formed with a recess 11 having a recess wall 28; and the distance 73 between the outermost lateral dimension of nut 15 and recess wall 28 of washer member 52 is a distance 73 only slightly greater than the width 74 of linear power means 27.",
        "Referring to FIG. 1, limited access building connection 1 includes washer member 52 which is formed with a narrow lateral tunnel 17 therethrough permitting engagement of linear power means 27 with nut rotational means 26.",
        "Referring again to FIG. 1, limited access building connection 1 further includes washer member 52 which is formed with a bore 12 for receiving anchor member 13 therethrough and includes a support surface 10 and a base 9. Connector means 8 includes a concentric connector member 4 formed with a seat member 5 integrally connected to upright strap members 6 and 7 and is formed with an opening 21 in seat member 5 for receiving anchor member 13 therethrough. Washer member 52 is formed with a support surface 10 and is positioned to register with seat member 5 of concentric connector member 4 and held structure 3 is supported on support surface 10 and is connected to upright strap members 6 and 7.",
        "Limited access building connection 1 may be further defined as including a nut rotational means 26 illustrated in FIGS. 6A, 6B, 6C, 7A, 7B and 7C which includes a cap member 30 formed for coaxial movement along the axis 18 of anchor member 13 and formed with a base section 31 having an annular outer wall 55 and having an inner wall 34 configured and dimensioned to inter fit with outer wall 33 of internally threaded nut 15 and a head section 56 having an integrally formed inner ring wall 38 and an integrally formed outer ring wall 57 having externally formed cap rotational driven members 32 formed to engage and to be rotationally driven by driving means 20 of linear power means 27.",
        "Referring specifically to FIG. 6A, rotational driven members 32 may take several forms. One form is to form driven members 32 as ratchet teeth 36. Ratchet teeth 36 are preferable used where only one way rotational direction of the nut 15 is specified.",
        "Referring specifically to FIGS. 7A, 7B and 7C, rotational driven members 32 may also be formed as sprocket teeth 36′ in integrally formed outer ring wall 57′. Sprocket teeth 36′ are desirable where specifications call for the rotation of nut 15 in both directions. In some connections where it is desirable to remove the connection 1, the use of sprocket teeth 36′ is desirable.",
        "Referring to FIGS. 8A through 8E, limited access building connection 1 is constructed, wherein, nut rotational means 26 and linear power means 27 are combined in an integral spiral hand pull device 40 which includes: a modified cap member 30′ formed with ring wall 38′ forming an opening therethrough for coaxial movement along axis 18 of anchor member 13 and formed with a base section 31′ having an annular outer wall 55′ having a lower face 42 and having a plurality of segments 51 forming a hexagonal inner wall 34′ configured and dimensioned to inter fit with outer wall 33 of internally threaded nut 15 and a head section 56′ having an integrally formed inner ring wall 38′ and an integrally formed outer ring wall 57″. Spiral hand pull device 40 further includes a spirally wound flexible elongated member 44 attached to integrally formed outer ring wall 57″ and to a handle 45.",
        "As best shown in FIG. 8B, spiral hand pull device 40 includes: at least one spoke 47 releasably attached to spirally wound flexible elongated member 44 and to integrally formed outer ring wall 57″ and holding spirally wound flexible elongated member 44 in an initially flat plane.",
        "Spiral hand pull device 40 is preferably formed with at least one spoke finger 48 releasably attached to face wall 49 of the outermost spiral 50 of spirally wound flexible elongated member 44 and to at least one spoke 47.",
        "In a limited access connection, as illustrated in FIG. 1, it is very desirable to have a means of automatically tightening the nut as the wood in the connection shrinks.",
        "FIG. 4 illustrates a portion of a limited access building connection 1 as defined in the present invention which includes an automatic take up means 62 adapted for connection to linear power means 27 exteriorally from nut rotational means 26.",
        "Limited access building connection 1 as illustrated in FIG. 4 is further defined by an automatic take up means 62 which includes a housing 25 for retaining compression spring 24 and an abutment end 60 operatively bearing against limited access building connection 1; linear power means 27 is an elongated pull member 19 having a distal end 63 and having a bearing stop member 23 formed on the proximal end 58 of elongated pull member 19; and compression spring 24 has a proximal end 61 engaging housing 25 and a distal end 59 in thrust engagement with bearing stop member 23 on elongated pull member 19.",
        "Referring to FIGS. 9A, 9B and 9C, another form of limited access building connection 1′ is illustrated in which anchor member 13 embedded in a holding structure such as a foundation (not shown) is formed with an end 14′. Held structure 3, such as a rafter 69 and ceiling joist 77 connected to double top plate 70, may be axially distant from end 14′ a negligible distance only. In such event, integral spiral hand pull device 40 must be installed prior to installing sheathing boards 85 and shingles 86 as illustrated in FIG. 9C.",
        "In FIGS. 9A, 9B and 9C, base 22 of nut 15 bears against connector means 8′ which may be a flat washer 52′ which bears against the upper face of double top plate 70.",
        "The derivation of the foregoing species of the present invention illustrated in FIGS. 9A, 9B and 9C occurred during a quest for a solution to a building construction problem which occurs frequently in hurricane prone states such as Florida and South Carolina. In these states and other coastal states and off shore islands, the roofs of many residential buildings have a roof pitch which is so small that it is impossible for a workman to tighten nuts 15 on connectors between the roof rafters 69 and the top plate 70 after the roof has been installed.",
        "As shown in FIG. 9C, a workman would ordinarily tighten nut 15 on threaded anchor member 13 with a standard socket wrench or crescent wrench before the roofers installed the roof sheathing boards 85 on rafters 69 and roof shingles 86 or other roofing material.",
        "After the roof has been installed and after the wood framing members such as wall posts or studs and double plates 70 have gone through their time period for normal shrinkage, nut 15 will ordinarily become loose. In order for the limited access connection to retain its full holding strength, nut 15 must be tightened.",
        "After the roof has been installed, there is no longer sufficient access for a workman to reach and tighten nut 15 as illustrated in FIG. 9C with a standard wrench. Applicant Leek found that the only way to tighten nut 15 at the time wood shrinkage occurred was to install integral spiral hand pull device 40 illustrated in FIGS. 8A-8E on the upper annular face 86 of nut 15 before the roof sheathing 85 was installed. Integral spiral hand pull device 40 must be placed over nut 15 so that the inner wall 34′ of pull device 40 is in registration with the sides of nut 15 and handle 45 is located so that a workman may crawl out toward the outer wall; reach out his arm and grasp handle 45 with his hand and pull towards himself. Only a turn or two or even a fraction of a turn at times is sufficient to tighten the nut 15 to bring the connection 1′ up to its initial design holding capacity.",
        "Referring to FIG. 10, still another form of the limited access building connection 1 is illustrated wherein linear power means 27 is a worm gear bit 67 formed with a bit end 71 for engagement with a power drill and dimensioned and configured with worm gear threads 72 to engage with worm gear threads on a rotational means 26 such as nut 15′ illustrated in FIG. 5A for imparting rotational motion to nut 15′.",
        "Worm gear bit 67 is dimensioned to be received in narrow lateral tunnel 17 shown in FIG. 1.",
        "FIGS. 11A and 11B illustrate another form of nut 15″ in which the threads are formed with four starts. The use of multistart threading of the nut 15″ is particularly advantageous in the present invention because of the need to obtain as much vertical movement of the nut 15″ for the limits placed on the number of turns that can be achieved with elongated pull member 19 illustrated in FIGS. 2 and 3. Multistart threading of nuts is well known in the art and the use of standard well known multistart nuts may be used in the present invention. The use and principles of multistart nuts is so common that most every peanut jar has a multistart lid for quick removal and replacement of the threaded lid. In like manner a short pull on elongated pull member 19 will suffice to fully install nut 15″.",
        "As shown in FIG. 11 of the drawings, inner threaded wall 39″ of nut 15″ is formed with preferably four multistart threads 41 for rapid tightening of nut on 15″ on anchor member 13 with a limited number of rotations of nut 15″.",
        "Operation of the Invention",
        "FIG. 1 illustrates a preferred form of the invention, but it should be understood that this is but one of many possible forms of the invention. Washer member 52 is only one of many different washer forms. Washer member 52 , e.g. could be formed with a slot therethrough as wide as the bore diameter of recess 11 and no tunnel 17 would then be required. Also, if the held structural member 3 were held by fasteners 29, less, or in some cases no support at surface 10 of washer member 52 would be required.",
        "Turning to the operation of limited access connection 1, as illustrated in FIG. 1, concentric connector 4 is lowered onto anchor member 13 through opening 21 in seat member 5 until seat member 5 rests on holding structure 2 which in this case is a concrete foundation. Washer member 52 is then lowered over anchor member 13 through bore 12 formed in washer member 52 until base 9 rests on seat member 5. Nut 15 is then threaded onto threaded end portion 14 of anchor member 13 and rotated until base 22 of nut 15 bears against base 35 of recess 11. Held structure 3 which may be a post 3, is then lowered between strap members 6 and 7 until the base 37 of held structure 3 rests on support surface 10 of washer member 52. Post 3 is then firmly attached to strap members 6 and 7 by fasteners 29. After any adjustment that need to be made in aligning post 3 with anchor member 13 are made, Nut 15 is then ready for tightening onto threaded end 14 of anchor member 13.",
        "Nut 15 is tightened against base 35 of recess 11 by selecting either elongated pull member 19 illustrated in FIGS. 2 and 3, or automatic take up means 62 illustrated in FIG. 4. Using the elongated pull member 19, e.g., the distal end 63 of elongated pull member 19 is inserted through narrow lateral tunnel 17. As may be understood by viewing FIG. 1, the elongated pull member 19 must be flexible, in most cases, to be able to be inserted past the rotational driven members 16 on annular ring 64 surrounding nut 15. When elongated pull member 19 has been fully inserted into narrow lateral tunnel 17, it is pulled back slightly until one or more openings 20′ forming driving means 20 engage rotational driven members 16. Grasping head 43, elongated pull member 19 is then pulled until nut 15 is firmly tightened on threaded anchor member 13. If necessary, the process may be repeated as just described if it takes more than one pull on elongated member 19 to properly tighten the nut 15 on anchor member 13.",
        "If automatic take up means 62 is specified, the process is basically the same. When nut 15 is tight on anchor member 13, elongated pull member 19 is fully inserted into narrow lateral tunnel 17.",
        "In the example illustrated in FIG. 1, no wood shrinkage will occur in the connection 1 between the nut 15 and the holding structure 2 because of the metal washer 52 and metal seat 5 which rests directly on concrete held structure 2. In many instances, however, the seat 5 of connector means 8 rests on a wood mud sill or other wood structural member which does shrink with time. In such case, the connection 1 can become loose unless nut 15 is tightened. Because of the inaccessibility of many connections 1, it is desirable to tighten the nut 15 automatically as wood shrinkage occurs.",
        "The procedure for inserting the automatic take up means 62 illustrated in FIG. 4 as applied to the connection 1 as illustrated in FIG. 1 is as follows. Distal end 63 of elongated pull member 19 is inserted through narrow lateral tunnel 17 as illustrated in FIG. 1. Elongated pull member 19 is then pulled back slightly until an opening 20′ is securely registered with a rotational driven member 16 such as a sprocket tooth, gear tooth or ratchet tooth on ring 64 used in conjunction with nut 15. Abutment end 60 of housing 25 is then placed in engagement with an outside face 68 of washer member 52. A latch (not shown) which holds compression spring 24 within housing 25 until ready for use is then unlatched so that distal end 59 of compression spring 24 now is in compression against bearing stop 23 formed on head 43 of elongated pull member 19. The automatic take up means 62 is now operative and will automatically rotate nut 15 should any looseness occur between the base 22 of nut 15, and base 35 of recess 11 of washer member 52.",
        "Referring to FIG. 5A, 5B, and 5C, an alternative nut 15′ is illustrated which may replace the standard hex nut 15 illustrated in FIG. 1. As may be understood, the use of alternative nut 15′ illustrated in FIG. 5 does not require a separate ring 64 of externally formed rotational driven members 16. Also, because of its broad planar base 66, alternative nut 15′ can be used in some connections without using a separate washer 52.",
        "Where no separate washer 52 is used, planar base 66 would bear directly against seat member 5 of concentric member 4 and top surface 87 would directly support base 37 of held structure 3. Either elongated pull member 19 or automatic take up means 62 can be used to rotate nut 15′ illustrated in FIG. 5.",
        "Nut rotational means 26 illustrated in FIGS. 6A, 6B and 6C may be used where the recess 11 in washer member 52 is properly sized in depth so that there is sufficient space between the base 37 of held structure 3 and the base 35 of recess 11 to accommodate nut rotational means 26 being placed on top of nut 15.",
        "In operation, after hex nut 15 is threaded onto anchor bolt 13 and tightened down by finger pressure, nut rotational means 26 is placed over hex nut 15 so that inner walls 34 of the cap member 30 are in registration with the outer walls 33 of nut 15. At least one opening 20′ in pull member 19 is then placed in registration with at least one externally formed cap rotational driven member 32 such as a ratchet, sprocket, or gear tooth. As explained above, elongated pull member 19 is then pulled one or more times until nut 15 is tight.",
        "FIGS. 8A through 8E disclose an ingenious variation of the cap member 30 illustrated in FIGS. 6A, 6B, 6C, 7A, 7B, and 7C by disclosing an integral spiral hand pull device 40 which is a combination of the cap member 30 illustrated in FIGS. 6A-6C and elongated pull member 19 illustrated in FIGS. 2-4 by combining the cap member 30 and the pull member 19 into a single integrated unit. By making the integral spiral hand pull device 40 from a single plastic member which can be constructing by casting in a mold, the device 40 may be constructed so inexpensively that it may be actually used but a single time and the plastic recycled. In operation, integral spiral hand pull device 40 may be placed over a hex nut 15 in much the same way that cap member 30 is placed over nut 15.",
        "Flange 80, illustrated in FIG. 8B, is joined to and extends from outer ring wall 57″ to form outermost wall 83. Distal end 44′ of spirally wound flexible elongated member 44 is joined to outermost wall 83. Lower face 81 of flange 80, as shown in FIG. 8D, rests upon upper annular face 82 of nut 15 as shown in FIG. 9A. A workman then grasps handle 45 and pulls linearly until the nut 15 is tightened. As the workman pulls, the weakened bonds between spoke fingers 48 and spokes 47 break one by one and then as the spirally wound flexible elongated member 44 unwinds, at each quarter turn the top edge of elongated member 44 breaks away from each of the respective spokes 47. As the nut 15 comes to a stop, the handle 45 and spirally wound flexible elongated member 44 either breaks off or may be cut off and the remainder of the integral spiral hand pull device 40 may be simply left in place or pulled away from the connection 1.",
        "FIGS. 9A-9C illustrates another one of many examples that occur in the course of constructing a building where there is limited access to the nut 15 and the ability to tighten it. Often, this limited access results when a connection is easily accessed during construction, but then when another structure, such as a roof, is installed; the space between the rafters 69 and the nut 15 is so limited that a workman cannot reach the nut with standard tools to turn the nut 15 as when the connection 1′ becomes loosened due to shrinkage of the wood structure such as the top wall plates 70.",
        "There may not be enough room between the top of the threaded end portion 14 and the rafter 69 after the structure is built to insert either the cap members 30 illustrated in FIGS. 6A, 6B, and 6C or the integral spiral hand pull device 40 illustrated in FIGS. 9 and 10.",
        "Where there is negligible distance between the end of the anchor member 13 and the roof structure as illustrated in FIGS. 9A-9C, the integral spiral hand pull device 40 as illustrated in FIGS. 8A-8E, is installed on the nut 15 before the roof, including rafters 69, sheathing 85 and shingles 86 is installed, as previously described.",
        "The connection 1 of the present invention as illustrated in FIG. 1, also lends itself to the use of a worm gear bit 67 as illustrated in FIG. 10. Bit end 71 may be placed in a power drill and the worm gear configuration 72 is inserted through narrow lateral tunnel 17 and placed in registration with the rotational driven members 16 on ring 64 as illustrated in FIG. 1.",
        "FIGS. 11A-11B illustrate another variation 15″ of hex nut 15 illustrated in FIG. 1. Multistart threads are well known In the industry. Multistart threads may be one, two. three and four starts. Multistart threads are placed on nuts or caps where maximum linear movement is desired for a given number of rotations. Most every peanut jar cap has multistart threads for quick access to the contents of the jar. In the present application, multistart threads are useful where maximum linear movement of the nut is desired for a minimum amount of linear pull on the elongated pull member 19 illustrated in FIGS. 2, 3, and 4 or by the integral spiral hand pull device 40 illustrated in FIGS. 8A-8E."
    ],
    "citations": [
        "179994",
        "487721",
        "518165",
        "560554",
        "581551",
        "582424",
        "856868",
        "1306553",
        "1344417",
        "1347687",
        "1374713",
        "1516331",
        "1528691",
        "1589307",
        "1737543",
        "1746978",
        "1829940",
        "1944003",
        "1953354",
        "1966780",
        "2021051",
        "2066541",
        "2187399",
        "2261537",
        "2294745",
        "2357595",
        "2405889",
        "2587560",
        "2623427",
        "2656991",
        "2685812",
        "2733745",
        "2896496",
        "3104645",
        "3115804",
        "3124983",
        "3157215",
        "3161174",
        "3174386",
        "3187621",
        "3200676",
        "3285120",
        "3306154",
        "3429092",
        "3440334",
        "3469492",
        "3476010",
        "3728933",
        "3782061",
        "3878757",
        "3932957",
        "3948141",
        "4000681",
        "4020734",
        "4037516",
        "4047463",
        "4055875",
        "4149446",
        "4286482",
        "4407175",
        "4433879",
        "4436003",
        "4479747",
        "4592254",
        "4604014",
        "4656894",
        "4665672",
        "4703711",
        "4708555",
        "4720223",
        "4729703",
        "4761860",
        "4801231",
        "4812096",
        "4875314",
        "4887948",
        "4896985",
        "4909012",
        "4922771",
        "4936843",
        "4954032",
        "4979857",
        "5015132",
        "5081811",
        "5090855",
        "5115700",
        "5168681",
        "5180268",
        "5197176",
        "5199835",
        "5207543",
        "5228250",
        "5249404",
        "5254016",
        "5265326",
        "5308184",
        "5316319",
        "5340258",
        "5364214",
        "5365715",
        "5370483",
        "5379563",
        "5386748",
        "5487632",
        "5505026",
        "5522688",
        "5535561",
        "5540530",
        "5570549",
        "5582496",
        "5606839",
        "5704572",
        "5769581",
        "5815999",
        "5829531",
        "5839321",
        "5885034",
        "5931618",
        "5979130",
        "5987828",
        "6019556",
        "6068250",
        "6120723",
        "6135687",
        "6139113",
        "6158188",
        "6161350",
        "6167785",
        "6250041",
        "6256960",
        "6257813",
        "6282994",
        "6327831",
        "6390747",
        "6494654",
        "6513290",
        "6585469",
        "6688058",
        "6745649",
        "6880433",
        "2001/0002524",
        "2001/0002529",
        "2001/0037611",
        "2002/0020137",
        "2002/0066246",
        "2002/0092383",
        "2006/0000318",
        "2006/0037265",
        "2006/0053714",
        "2313735",
        "383460",
        "1099472",
        "1384511",
        "46-1521",
        "706586",
        "796498"
    ],
    "us_classification": "811761",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "25",
            "subclass": "B",
            "main_group": "13",
            "subgroup": "48"
        }
    ]
}