{
    "title": "Stone mount and clasp for jewelry",
    "abstract": "A bezel having a lumen open to the top and bottom and a recessed center section is used both to mount a stone to a piece of jewelry and to function as a clasp for the jewelry. The recessed center section of the jewelry can be coupled to a hook to secure the jewelry to the wearer.",
    "inventors": [
        "Kolb"
    ],
    "document_number": "07296438",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A piece of jewelry comprising:",
            "components": [
                {
                    "component": "a hollow bezel having an open top, an open bottom, an inside wall defining a lumen extending between said open top and said open bottom, a seat within said lumen, and an outside wall having an exterior recessed section proximate the middle of the bezel with the recessed section extending around the entire circumference of the bezel, the bezel having an upper portion above the bezel exterior recessed section and a lower portion below the bezel exterior recessed section;",
                    "subcomponents": []
                },
                {
                    "component": "a stone mounted at least partially within said lumen of said bezel and in contact with said seat; and",
                    "subcomponents": []
                },
                {
                    "component": "a band having a first end attached to the exterior wall of the lower portion of the bezel,",
                    "subcomponents": []
                },
                {
                    "component": "a hook at a second end of said band and having an opening sized to receive the recessed section of said bezel to clasp the two portions of the band together, wherein when said hook has received the recessed section of said bezel, the hook is impeded from detaching from the bezel by either the top or bottom of said bezel.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The piece of jewelry of claim 1 wherein said band comprises at least one metal wire.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The piece of jewelry of claim 1 wherein said band has spring characteristics such that the band, hook and bezel all cooperate to hold the inside of the hook against the exterior recessed section of the bezel as the piece of jewelry is worn.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The piece of jewelry of claim 3 wherein said spring characteristics of the band are between approximately 5 and 7 dies hard.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The piece of jewelry of claim 1 wherein the outside wall of said bezel has a substantially hour-glass shape.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The piece of jewelry of claim 1 further including a pair of recesses above the seat, a seat bead positioned within each of said recesses such that the edge of the stone is held in place between said seat beads and said seat.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The jewelry piece of claim 1 wherein said bezel is formed using a lost wax casting processes and a sprue that matches the inside and outside walls of said bezel.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A jewelry piece comprising:",
            "components": [
                {
                    "component": "(a) a band having first and second ends;",
                    "subcomponents": []
                },
                {
                    "component": "(b) a bezel having an outside wall comprising a top section, a bottom section and a recessed center section around the circumference of the exterior wall, an open top, an open bottom, and an inside wall defining a lumen extending between said open top and open bottom, and a lumen wall having a seat, and at least one recess;",
                    "subcomponents": []
                },
                {
                    "component": "(c) the bezel bottom section secured to the first end of the band, a hook formed at said second end of the band;",
                    "subcomponents": []
                },
                {
                    "component": "(d) a stone positioned at least partially within said lumen and in contact with said seat; and",
                    "subcomponents": []
                },
                {
                    "component": "(e) a seat bead positioned within said recess cooperating with said seat to hold said stone to said bezel,",
                    "subcomponents": []
                },
                {
                    "component": "wherein said hook receives said recessed center section of said bezel to secure said first and second portions of said band together.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The jewelry piece of claim 8 wherein said bezel is formed using a lost wax casting process and a hollow sprue that matches the inside and outside walls of the bezel.",
            "components": []
        }
    ],
    "description": [
        "I. Field of the Invention",
        "The present invention relates to jewelry. More specifically, the present invention provides a unique combination clasp and stone mounting for a bracelet, necklace or the like.",
        "II. Description of the Related Art",
        "Jewelry items have been made and worn for centuries. Bracelets and necklaces date back to ancient Egypt and even earlier. Jewelry items have been found throughout recorded history in virtually every culture and civilization.",
        "Many different clasp arrangements have been used to join the opposite ends of a bracelet or necklace together after the jewelry item has been placed about the neck, wrist or ankle. Also, many different types of settings exist to permit a stone to be mounted to the bracelet or necklace. However, very few jewelry pieces incorporate structure that constitutes both a part of a clasp and a mounting for a decorative stone.",
        "A first object of the present invention is to provide an improved clasp for jewelry items.",
        "A second object of the present invention is to provide an improved clasp that also serves as a secure mount for a decorative stone.",
        "Still another object of the present invention is to provide a secure mount that is open to the top and bottom so that the stone and interior of the mount can be easily cleaned.",
        "These and other objects of the invention are achieved by providing a piece of jewelry that includes a wire band having a clasp comprising a hook formed at one end of the band and a bezel connected to the other end of the band. The exterior of the bezel preferably has an hourglass shape so that it is wider at the top and bottom and narrower at the center. When the jewelry piece is wrapped about a body part such as the wrist or neck, the bezel is moved into the hook such that the hook engages the narrower center of the bezel. The wider top and bottom prevent the hook from slipping off the bezel.",
        "Preferably the wire band has a spring characteristic between 5 and 7 dies hard. If the spring characteristic is less than 5 dies hard, the band will not maintain its shape and the hook will not be held with sufficient force to the hourglass-shaped bezel. If the spring characteristic is greater than 7, the wire band will be too brittle and crack due to metal fatigue over time.",
        "The bezel preferably has an interior lumen that extends the entire length of the bezel. The top and bottom of the bezel are both preferably open to the lumen. The wall of the lumen preferably includes a seat upon which a decorative stone may be mounted. A plurality of notches or recesses can also be provided. These notches receive stone setting beads to secure the stone in place. Since both ends of the bezel are open to the lumen, the lumen (as well as the top and bottom of the stone) can easily be cleaned.",
        "FIG. 1 is a perspective view of a jewelry piece incorporating the present invention.",
        "FIG. 2 is a perspective view showing the bezel soldered to one end of a wire band.",
        "FIG. 3 is a cross-section of the bezel.",
        "FIG. 4 is a cross-section of the bezel showing a stone mounted in the lumen.",
        "FIGS. 5A-5C show how a hook at one end of the wire band is secured to the bezel attached to the other end of the wire band.",
        "FIG. 1 shows a jewelry piece 1. The jewelry piece includes a metal wire band 2. Formed at one end of the wire band 2 is a hook 3. The opposite end of the wire band 2 is joined to a bezel 4. The joint 5 between the wire band 2 and the bezel 4 is preferably a solder joint. The wire band has certain spring characteristics. Preferably the metal of the wire band 2 is between approximately 5 and 7 dies hard to give the metal sufficient spring characteristics without being too brittle.",
        "As shown in FIG. 2-4, the bezel 4 is elongated. The bezel 4 has an exterior wall 10 having a top section 12, a center section 14 and a lower section 16. The joint 5 between the band 2 and the bezel 4 is located at the lower section 16 of the bezel 4.",
        "The upper section 12 and the lower section 16 have generally cylindrical shapes. The center section 14 provides a recessed area. As such, the exterior wall 10 of the bezel 4 is shown as having an hour-glass shape. Other shapes can also be used without deviating from the invention so long as the exterior wall has a recessed area.",
        "The bezel 4 has a top opening 20 and a bottom opening 22. Extending between openings 20 and 22 is a lumen 24 having a lumen wall 26. The lumen wall 26 is generally cylindrical in shape.",
        "Associated with the top of the lumen 24 is a frusto-conical seat 30. The lumen wall 26 also has a pair of recesses 32 above the seat 30. FIG. 4 shows a stone 34 placed within the lumen 24 and resting on the seat 30. Also shown are a pair of seat beads 36 inserted into the recesses 32 to secure the stone 34 in place in the bezel 4. The edges of the stone 34 are, in essence, pinched between the seat 30 and the seat beads 36. The stone 34 and lumen 24 of the bezel 4 can be easily cleaned because of the top and bottom openings 20 and 22.",
        "The design of bezel 4 is particularly advantageous because it permits a stone mounted to the bezel 4 to be easily cleaned. During the course of wearing jewelry, water, perfume, lotion, body oils, dirt and other grime can seep through the top into the back of a standard bezel causing the stone to have a dark or cloudy appearance. No manner of cleaning, soaking, boiling, ultrasonic cleaning or steaming can remove such deposits once they have penetrated into a standard closed-base bezel. The design of bezel 4 solves these problems and permits the bezel 4 and stone 34 to be cleaned in a variety of ways restoring the original beauty of the stone.",
        "As shown in FIG. 1 and further demonstrated by FIGS. 5A-5C, the bezel 4 and the hook 3 cooperate to provide a clasp joining the two ends of the jewelry piece 1 together. The hook 3 is pushed past the bezel 4 and the opening of the hook 3 then receives the center section 14 of the bezel 4. The wider top section 12 and the lower section 16 prevent the hook 3 from moving up and down across the outer surface of the bezel past the top or bottom of the bezel 4. The spring characteristics of the metal wire band 2 hold the inside of the hook 3 tightly against the center section of the bezel 4 to secure the two ends together so the jewelry piece 1 can be worn. To disconnect the hook 3 from the bezel 4, all one needs to do is provide sufficient force to overcome the spring force of the wire band 2 so the hook 3 and bezel 4 are freed from each other. Thus, the spring characteristics of the band 2, the hook 3 and bezel 4 all cooperate to provide adequate latching together of the two ends of the jewelry piece.",
        "The bezel of the present invention can be formed in a number of ways. For example, a lost wax casting method can be employed using a hollow or tubular sprue that matches the inside and outside diameters of the bezel. When the bezel casting is removed from the hollow or tubular sprue, it is ready for finishing without further drilling or filing.",
        "Those skilled in the art will appreciate from the foregoing that various modifications to the preferred embodiment disclosed can be made without deviating from the invention. Thus, the following claims are provided to define the scope of the invention."
    ],
    "citations": [
        "581922",
        "755654",
        "854158",
        "899296",
        "1440229",
        "1864371",
        "D114649",
        "2763140",
        "2811024",
        "D199500",
        "3601178",
        "3898869",
        "4220017",
        "4292818",
        "4392289",
        "4794766",
        "5036682",
        "5377506",
        "5419158",
        "5433090",
        "5596887",
        "5735144",
        "5848539",
        "6094939",
        "6453701",
        "6490886",
        "D473812",
        "6568213",
        "6584804",
        "6629434",
        "7201021",
        "2004/0177647"
    ],
    "us_classification": "63  31",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "44",
            "subclass": "C",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}