{
    "title": "Method for catalytic dimerization of isocyanates",
    "abstract": "The invention concerns a method for preparing polyisocyanates by cyclodimerization of isocyanate functions borne by initial monomer isocyanates. The invention is characterised in that it comprises steps which consist in: a) providing a reaction medium comprising initial monomer isocyanates, optionally in the presence of a solvent; b) adding to said reaction mixture a (cyclo)dimerization catalyst comprising a compound of the family of super acids; c) heating the reaction medium to a temperature ranging between 0° C. and 300° C., advantageously between 20° C. and 200° C. until the desired rate of transformation is obtained; d) optionally inactivating or eliminating the reaction catalyst; and e) optionally eliminating the unreacted monomer.",
    "inventors": [
        "Bernard"
    ],
    "document_number": "07297752",
    "publication_date": "20071120",
    "assignees": [
        "Rhodia Chimie"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for preparing polyisocyanates by cyclodimerization of isocyanate functional groups (NCO) carried by starting monomeric isocyanates, comprising the steps of:",
            "components": [
                {
                    "component": "a. providing a reaction medium comprising starting monomeric isocyanates, optionally in the presence of a solvent;",
                    "subcomponents": []
                },
                {
                    "component": "b. adding to this reaction medium a (cyclo)dimerization catalyst of the superacid family having at least one highly labile hydrogen atom, the Hammett acid constant of which is less than −12;",
                    "subcomponents": []
                },
                {
                    "component": "c. conducting the reaction at a temperature in the range between 0EC and 300EC, until the desired rate of conversion of between 1 and 95%, of the initial isocyanate functional groups is obtained;",
                    "subcomponents": []
                },
                {
                    "component": "d. optionally inactivating or removing the reaction catalyst;",
                    "subcomponents": []
                },
                {
                    "component": "e. optionally removing the unreacted monomers; and",
                    "subcomponents": []
                },
                {
                    "component": "f. obtaining dimeric polyisocyanates containing at least one uretdione unit.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method as claimed in claim 1 , wherein the catalyst is a superacid selected from the group consisting of sulfonic acids, sulfonimides, sulfonylmethanes, alone or as a mixture, and derivatives thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The process as claimed in claim 1 , wherein the catalyst is a compound of the superacid family containing at least one divalent group —Y",
            "components": [
                {
                    "component": "X is selected from the group consisting of NH and C(Q)H;",
                    "subcomponents": []
                },
                {
                    "component": "Y",
                    "subcomponents": []
                },
                {
                    "component": "Q is selected from the group consisting of:",
                    "subcomponents": [
                        "H, Cl, F, Br, CN;",
                        "an alkyl radical having from 1 to 30 carbon atoms;",
                        "an aryl or aralkyl radical having from 6 to 30 carbon atoms;",
                        "a group R″",
                        "with the proviso that when Q represents H, then Y"
                    ]
                },
                {
                    "component": "H, Cl, F, Br, CN;",
                    "subcomponents": []
                },
                {
                    "component": "an alkyl radical having from 1 to 30 carbon atoms;",
                    "subcomponents": []
                },
                {
                    "component": "an aryl or aralkyl radical having from 6 to 30 carbon atoms;",
                    "subcomponents": []
                },
                {
                    "component": "a group R″",
                    "subcomponents": []
                },
                {
                    "component": "with the proviso that when Q represents H, then Y",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method as claimed in claim 1 , wherein the (cyclo)dimerization catalyst comprises a compound of formula (I):",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method as claimed in claim 4 , wherein said compound of general formula (I) is selected from the group consisting of the sulfonimides:",
            "components": [
                {
                    "component": "FSO",
                    "subcomponents": []
                },
                {
                    "component": "C",
                    "subcomponents": []
                },
                {
                    "component": "CF",
                    "subcomponents": []
                },
                {
                    "component": "(CF",
                    "subcomponents": []
                },
                {
                    "component": "(CF",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method as claimed in claim 4 , wherein said compound of general formula (I) is selected from the group consisting of the sulfonylmethanes:",
            "components": [
                {
                    "component": "FSO",
                    "subcomponents": []
                },
                {
                    "component": "CF",
                    "subcomponents": []
                },
                {
                    "component": "(CF",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method as claimed in claim 4 , wherein the compound of general formula (I) is selected from the group consisting of (FSO",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method as claimed in claim 7 , wherein the dimerization catalyst is the triflimide (CF",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method as claimed in claim 1 , wherein the superacid catalyst contains at least one S(O)",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method as claimed in claim 9 , wherein the electron-attracting atom or group has a Hammett constant p at least equal to 0.1.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method as claimed in claim 9 , wherein the catalyst is a compound of formula (II):",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method as claimed in claim 11 , wherein the catalyst is a compound of formula (II) in which R",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method as claimed in claim 11 , wherein the catalyst is a compound of formula (II) in which R",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method as claimed in claim 11 , wherein the symbols R",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method as claimed in claim 1 , wherein said electron-attracting atom or group is selected from the group consisting of:",
            "components": [
                {
                    "component": "F, CH",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method as claimed in claim 9 , wherein m is equal to 2.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method as claimed in claim 9 , wherein the dimerization catalyst is the triflic acid CF",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method as claimed in claim 1 , for the cyclodimerization of monomers in which at least one isocyanate functional group is at the cycloaliphatic, secondary, tertiary or neopentyl position.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method as claimed in claim 18 , wherein the starting monomer is IPDI.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method as claimed in claim 1 , wherein the catalyst/NCO molar ratio is at least 10",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The method as claimed in claim 3 , wherein the Y",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The method as claimed in claim 21 , wherein the Y",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The method as claimed in claim 9 , wherein the molar ratio of the S(O)",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The method as claimed in claim 1 , wherein an alcohol is added to the reaction medium so as to form allophanates in addition to the dimers.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The method as claimed in claim 1 , wherein a polyol is added to the reaction medium so as to form crosslinked dimers.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. An isocyanate composition, comprising uretdione polyisocyanates, which can be obtained by the method as defined in claim 1 .",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The method as claimed in claim 2 , wherein the catalyst further includes a phosphorus fluoride, an antimony fluoride, or a boron fluoride or hydrofluorides thereof, alone or as a mixture, or derivatives thereof.",
            "components": []
        }
    ],
    "description": [
        "The subject of the invention is a method for preparing oligomeric polyisocyanates containing at least one uretdione group by dimerization of starting monomeric isocyanates with the aid of catalysts of the superacid family.",
        "The invention more particularly relates to a method for the catalytic cyclodimerization of monomeric isocyanates, which has a high selectivity.",
        "Polyisocyanates containing uretdione groups, known by the name “dimers”, are synthesized by cycloaddition (2+2) of two aliphatic, cycloaliphatic or aromatic isocyanate molecules.",
        "While aromatic isocyanates can cyclodimerize in the absence of catalyst at room temperature, it is known that the other isocyanates require the use of basic catalysts such as trialkylphosphines, N,N,N′,N′-tetraalkylguanidines, 1,2-dialkylimidazoles, and the like.",
        "In general, these catalysts are however not very selective and, apart from the dimerization reaction, also promote the formation of trimeric polyisocyanates with a predominantly isocyanurate structure by cyclotrimerization of the starting monomeric isocyanates, resulting in the formation of polyisocyanate compositions having a smaller or larger proportion of compounds with isocyanurate groups apart from the polyisocyanates containing uretdione groups.",
        "To overcome the problem of the selectivity of the dimerization catalyts, it has been proposed to use compounds falling into the generic classes of N,N-dialkylaminopyridines, 4-(N-arylalkyl-N-alkyl)aminopyridines and tris(N,N-dialkyl)phosphotriamides. Concrete examples of the first group are 4-N,N-dimethylaminopyridine (designated by “DMAP”), 4-pyrrolidinylpyridine, while a concrete example of the second group is 4-(N-benzyl-N-methyl)aminopyridine (designated by “BMAP”), and while a concrete example of the third group is hexamethylphosphotriamide (HMPT).",
        "These catalysts, which are derived from aminopyridines, may also be useful for acylation or urethane forming reactions.",
        "For further information, reference may be made to the work by E. F. V. Scriven, Chem. Soc. Rev., 129, (1983) and by G. Hofle et al., Angew. Chem. Int. Ed. Engl., 17, 569, (1978).",
        "The work of the inventors who carried out the present invention has made it possible to demonstrate that, unexpectedly, the compounds of the superacid family constitute excellent dimerization catalysts, which make it possible to obtain dimeric polyisocyanates containing a uretdione unit with high selectivity and yield.",
        "The expression “high selectivity” for the purposes of the invention is understood to mean that the isocyanate functional groups of the starting monomers predominantly react with each other to form compounds having uretdione groups. Compounds having isocyanurate groups may also be formed, but in a minor quantity.",
        "The compounds may have a single uretdione group, in which case reference is made to “true dimers” or several uretdione groups, in which case reference is made to “oligodimers” or to “polydimers”. The oligodimers may be in particular bis- or tris-uretdiones or heavy compounds having more than three uretdione rings and are considered as polydimers.",
        "It is however not excluded that it may even be advantageous for the compounds of the invention to also catalyze the reaction of isocyanate functional groups with other reactive functional groups with the isocyanate functional group generally possessing functional groups with a labile hydrogen, in particular alcohol or thiol functional groups, and the like. Amines are in this case not being preferred because of the protonation of the dimerization catalyst by them.",
        "The subject of the invention is a method for preparing polyisocyanates by cyclodimerization of isocyanate functional groups carried by starting monomeric isocyanates, characterized in that it comprises the steps of:",
        "a. providing a reaction medium comprising starting monomeric isocyanates, optionally in the presence of a solvent;",
        "b. adding to this reaction medium a (cyclo)dimerization catalyst comprising a compound of the superacid family;",
        "c. heating the reaction medium at a temperature in the range between 0° C. and 300° C., advantageously from 20° C. to 200° C., until the desired rate of conversion of between 1 and 95%, advantageously 5 and 50%, of the initial isocyanate functional groups is obtained;",
        "d. optionally inactivating or removing the reaction catalyst; and",
        "e. optionally removing the unreacted monomers.",
        "The expression “compound of the superacid family” is understood to mean any compound, or mixture of compounds, whose acidity constant defined by Hammett is strictly less than −12. For the definition of the acidity constant according to Hammett, reference-may advantageously be made to the book by J. March, Advanced Organic Chemistry, third edition, John Wiley and Son, pp 223 sqq.",
        "Thus, the superacids used in the present invention are defined as being acids whose Hammett acidity constant “H” is strictly less than −12 and, by way of example, are chosen from sulfonic acids, sulfonimides, sulfonylmethanes, phosphorus fluorides, antimony fluorides, boron fluorides (and hydrofluorides), and the like, alone or as a mixture, and derivatives thereof.",
        "Thus, trifluoromethanesulfonic acid has an H acidity constant equal to −14, fluorosulfonic acid an H acidity constant of −15. Mixtures of superacids, such as the FSO3H/SbF5 mixture, also called “magic acid” make it possible to reach still lower H values, and for example −21 in the case of a 5% mixture of antimony pentafluoride in hydrofluoric acid.",
        "The catalysts of the superacid family used in the method of the present invention are more particularly chosen from superacids which cannot be dehydrated, that is to say those whose chemical structure does not allow their conversion to an anhydride, under operating conditions of the reactions for dimerization of the monomeric isocyanates of the invention.",
        "Such acids generally possess at least one highly labile hydrogen atom or can promote the formation of at least one highly labile hydrogen atom in the reaction medium. The presence of this highly labile hydrogen atom is generally due to the presence, in the chemical structure of the superacid, of at least one highly electron-attracting atom or group.",
        "The attracting atom or group is preferably chosen from functional groups whose Hammett constant σp is at least equal to 0.1. It is in addition preferable for the inductive component of σp, σi, to be at least equal to 0.2, advantageously to 0.3. In this regard, reference may be made to the book by J. March, ibid., pp. 242-250, and in particular to Table 4 of this section.",
        "According to a first variant, the present invention provides a method of cyclodimerization as defined above in which the catalyst is advantageously a compound of the superacid family containing at least one divalent group —Y1—X—Y2— linked to an electron-attracting atom or group, in which:\n\n    \n    \n        X is chosen from NH and C(Q)H;\n        Y1 and Y2, which are identical or different, are chosen from the SO2 group and the CO group;\n        Q is chosen from:\n        \n            H, Cl, F, Br, CN;\n            an alkyl radical having from 1 to 30 carbon atoms;\n            an aryl or aralkyl radical having from 6 to 30 carbon atoms;\n            a group R″F, a group R″FSO2—, or R″FCO—, a group R″FCH2OSO2— or R″FCH2OCO—, and a group (R″F)2CHO—SO2— or (R″F)2CH2O—CO—; R″F being chosen from the group consisting of fluorine, chlorine, bromine, the —CN group, the alkyl, alkenyl, haloalkyl, haloalkenyl, halocycloalkyl or halocycloalkenyl groups having from 1 to 20, preferably 1 to 6 carbon atoms, cycloalkyl, cycloalkenyl, halocycloalkyl or halocycloalkenyl groups having from 3 to 30, advantageously from 3 to 10, carbon atoms, aryl, alkylaryl or haloaryl groups having from 6 to 30, preferably 6 to 10, carbon atoms, perhaloalkyl groups having from 1 to 30 carbon atoms, (perhaloalkyl)alkoxy groups having from 2 to 30 carbon atoms, perhalogenated cycloaliphatic groups having from 3 to 30 carbon atoms optionally containing heteroatoms chosen from O, S and N and/or optionally carrying at least one perhaloalkyl grouping, and the perhalogenated aryl groups having from 6 to 30 atoms;\n            with the proviso that when Q represents H, then Y1 and Y2 each represent the —SO2— group.",
        "Advantageously, the catalyst comprises a compound of formula (I):\n\nRF—Y1—X—Y2—R′F  (I)\n\nin which:\n\n    \n    \n        X, Y1 and Y2 are as defined above, and\n        RF is chosen from RF1, RF1CH2O—; and (RF1)2CHO—;\n        RF1 and R′F, which are identical or different, are chosen from the group consisting of fluorine, chlorine, bromine, the CN group, alkyl, alkenyl, haloalkyl, haloalkenyl, halocycloalkyl or halocycloalkenyl groups having from 1 to 20, preferably 1 to 6 carbon atoms, cycloalkyl, cycloalkenyl, halocycloalkyl or halocycloalkenyl groups having from 3 to 30, advantageously from 3 to 10, carbon atoms, aryl, alkylaryl or haloaryl groups having from 6 to 30, preferably 6 to 10, carbon atoms, perhaloalkyl groups having from 1 to 30 carbon atoms, (perhaloalkyl)alkoxy groups having from 2 to 30 carbon atoms, perhalogenated cycloaliphatic groups having from 3 to 30 carbon atoms optionally containing heteroatoms chosen from O, S and N and/or optionally carrying at least one perhaloalkyl grouping, and perhalogenated aryl groups having from 6 to 30 atoms or\n        one of RF1 and R′F represents a polymer residue linked to Y1 or Y2 by a spacer group and provided that one of RF1 and R′F represents a group chosen from perhaloalkyl groups having from 1 to 30 carbon atoms, (perhaloalkyl)alkoxy groups having from 2 to 30 carbon atoms, perhalogenated cycloaliphatic groups having from 3 to 30 carbon atoms optionally containing heteroatoms chosen from O, S and N and/or optionally carrying at least one perhaloalkyl grouping, and perhalogenated aryl groups having from 6 to 30 atoms; or alternatively\n        RF1 and R′F form together a divalent radical chosen from perfluorinated or perchlorinated linear alkylene radicals having from 2 to 20 carbon atoms, advantageously from 2 to 8 carbon atoms; or alternatively\n        when X represents C(Q)H, R′F and R″F, on the one hand, and/or RF1 and R″F, on the other hand, form together a divalent radical chosen from perfluorinated or perchlorinated, linear or branched alkylene radicals having from 2 to 20, advantageously from 2 to 8, carbon atoms, and\n        with the proviso that when Q represents H, then Y1 and Y2 are SO2 groups.",
        "As particularly advantageous examples of compounds of general formula (I), there may be mentioned the sulfonimides:\n\n    \n    \n        FSO2NHSO2R′F,\n        CF3SO2—NH—SO2R′F,\n        CF3CH2OSO2NHSO2R′F,\n        (CF3)2CH—SO2—NH—SO2R′F, and\n        (CF3)2CHOSO2NHSO2R′F,\n\nin which the radical R′F is chosen from F, CF3CH2O, (CF3)2CHO, and a perfluoroalkyl group having from 1 to 20, advantageously from 1 to 10, carbon atoms, preferably —CF3, —C2F5, —C4F9, —C6F13, —C8F17 and —C10F21.",
        "It is also possible to mention the sulfonylmethanes:\n\n    \n    \n        FSO2C(Q)HSO2R′F,\n        CF3CH2OSO2C(Q)HSO2R′F, and\n        (CF3)2CHOSO2C(Q)HSO2R′F,\n\nin which:\n\n        R′F is chosen from F, CF3CH2O, (CF3)2CHO, and a perfluoroalkyl group having from 1 to 20, advantageously from 1 to 10 carbon atoms, preferably —CF3, —C2F5, —C4F9, —C6F13, —C8F17 and —C10F21, and\n        Q is chosen from H, FSO2, CF3CH2O—SO2, (CF3)2CH—O—SO2, an alkyl, aryl, alkylaryl or arylalkyl group having at most 30 carbon atoms, a perfluoroalkylsulfonyl group having from 1 to 8 carbon atoms, preferably CF3SO2, C2F5SO2, C4F9SO2, C6F13SO2 and C8F17SO2, and a perfluoroalkyl group having from 1 to 12 carbon atoms, preferably —CF3, —C2F5, —C4F9, —C6F13, —C8F17 and —C10F21; or alternatively\n        Q and R′F form together a perfluorinated linear divalent alkylene group having from 1 to 20, advantageously from 1 to 8, carbon atoms.",
        "Among the compounds defined above, those which form part of the group consisting of (FSO2)2NH; (CF3SO2)2—NH; CF3SO2NHSO2C4F9; (FSO2)3CH; (FSO2)2CH2; (CF3CH2OSO2)2NH; [(CF3)2CHOSO2]2NH; (CF3CH2OSO2)2CH2; [(CF3)2—CHO—SO2]2CH2; [(CF3)2—CHO—SO2]3CH; [(CF3)2—CHO—SO2]3CH; FSO2NHSO2CF3; FSO2NHSO2C2F5; (CF3)CHO—SO2NHSO2CF3;(CF3)2CHOSO2NHSO2CF3; (CF3)2CHOSO2NHSO2C2F5; CF3CH2OSO2NHSO2C2F5 and (C4F9SO2)2—NH are particularly advantageous. A most particularly preferred compound is the triflimide (CF3SO2)2NH.",
        "These compounds, and their method of preparation, are known and described, in particular in DE 2 239 817; FR 2 687 671; U.S. Pat. No. 5,162,177, EP 571 832 and EP 834 492.",
        "When RF1 or R′F represents a polymeric residue, it may be a polysiloxane, a polyether, and the like.",
        "According to another variant of the present invention, it relates to a method of cyclodimerization as defined above in which the catalyst is advantageously a compound of the superacid family containing at least one S(O)mOH functional group, m being equal to 1 or 2, linked to an electron-attracting atom or group, or a precursor of said compound.",
        "Advantageously, the catalyst comprises a compound of formula (II):\n\nRF2—S(O)mOH  (II)\n\nin which RF2 represents an electron-attracting atom or group and m represents 1 or 2.",
        "More particularly, RF2 may be chosen from preferably light halogen atoms, in particular fluorine and chlorine, and from hydrocarbon groups preferably C1-C6 hydrocarbon groups containing at least one halogen atom, preferably chosen from fluorine and chlorine.",
        "The hydrocarbon group may be an alkyl, alkylenyl, alkynyl, aryl, aralkyl or alkylaryl group having up to 20 carbon atoms, advantageously 4 carbon atoms, at most, optionally substituted with a group which is nonreactive or reactive toward an isocyanate functional group.",
        "Preferred electron-attracting groups are perhalogenated, in particular perchlorinated and preferably perfluorinated, C1-C6 hydrocarbon groups.",
        "In general, it is preferable that the halogen atoms are carried by carbon atoms situated as close as possible to the S(O)mOH group; preferably in α or in β. They may however be carried by more distant carbon atoms. In this case, it is advantageous for the carbon atom carrying the halogen atoms to be perhalogenated, preferably perfluorinated.",
        "A preferred group of compounds of general formula (II) is that in which RF2 corresponds to the following general formula (II′):\n\n—(CR1R2)p—GEA  (II′)\n\nin which\n\n    \n    \n        R1 and R2, which are identical or different, are chosen from a hydrogen atom, a halogen atom, in particular a fluorine atom, a C1-C6 alkyl group, a group —NO2, —CN, —COOH or —COOR3 where R3 is a C1-C6 alkyl group, a C1-C20 perfluoroalkyl or C6-C20 perfluoroaryl group,\n        p represents an integer between 0 and 2,\n        the symbol GEA represents the hydrogen atom, a halogen atom, in particular a fluorine atom, a C1-C6 alkyl, C6-C12 aryl, (C1-C2)alkyl(C6-C12)aryl group, optionally substituted with one or more electron-attracting groups or atoms, or one electron-attracting group, with the proviso that the Hammett constant for the group —(CR1R2)p—GEA is at least equal to 0.1.",
        "Advantageously, the symbols R1 and R2, which are identical or different, represent a fluorine atom or a group CnF2n+1, with n being an integer between 1 and 20, advantageously 1 and 5, and preferably between 1 and 2 and GEA advantageously represents a fluorine atom or a perfluorinated residue of formula CnF2n+1, with n as defined above.",
        "Among the possible definitions of RF2, there may be mentioned in particular the following electron-attracting atoms and groups:\n\n    F, CH2F, CHF2, CF3, CH2—CH2F, CH2—CHF2, CH2—CF3, CHF—CH2F2, CHF—CHF2, CHF—CF3, CF2—CH3, CF2—CH2F, CF2—CHF2, CF2—CF3, CH2—CH2—CH2F, CH2—CH2—CHF2, CH2—CH2—CF3, CH2—CHF—CH3, CH2—CHF—CH2F, CH2—CHF—CHF2, CH2—CHF—CF3, CH2—CF2—CH3, —CH2—CF2—CH2F, CH2—CF2—CHF2, CH2—CF2—CF3, CHF—CH2—CH3, CHF—CH2—CH2F, CHF—CH2—CHF2, CHF—CH2—CF3, CHF—CHF—CH3, CHF—CHF—CH2F, CHF—CHF—CHF2, CHF—CHF—CF3, CHF—CF2—CH3, CHF—CF2—CH2F, CHF—CF2—CHF2, CHF—CF2—CF3, CF2—CH2—CH3, CF2—CH2—CH2F, CF2—CH2—CHF2, CF2—CH2—CF3, CF2—CHF—CF3, CF2—CHF—CH2F, CF2—CHF—CHF2, CF2—CHF—CF3, CF2—CF2—CH3, CF2—CF2—CH2F, CF2—CF2—CHF2, CF2—CF2—CF3, and the groups",
        "and the corresponding groups in which the fluorine atom is replaced by a chlorine atom.",
        "A subgroup of preferred compounds of formula (II) is that in which m represents 2.",
        "A particularly preferred compound is the triflic acid CF3SO3H.",
        "The superacid compound which can be used in the method of the present invention as a catalyst may also be added to the reaction medium in the latent state, the latent forms generally being salts, in particular of phosphonium, sulfonium and iodonium.",
        "Such latent forms are described in particular in U.S. Pat. No. 5,554,664, EP 834 502, U.S. Pat. Nos. 5,699,224 and 4,031,036. The active acid forms may be restored, for example, by a physical process such as heating or by means of activable energy, in particular in the case where the latent catalyst is in the form of a phosphonium salt.",
        "For example, when the compound of general formula (II) is introduced into the reaction medium in the form of a precursor, the latter is a compound capable of releasing a compound of general formula (II) in the reaction medium under the reaction conditions. Reference is then made to a latent catalyst which regenerates the acid functional group S(O)mOH by a chemical, physical or physicochemical process.",
        "There may be mentioned, in particular as precursor compounds for the compounds of general formula (II), ester compounds of general formula (III) or silylated compounds of general formula (IV):",
        "",
        "RF2 and m being as defined above, and R4 representing an alkyl radical containing from 1 to 20 carbon atoms.",
        "There may also be mentioned energetically activable amine or onium salts such as phosphonium, sulfonium and iodonium salts. Reference may be made, for example, to the compounds described by Huang et al., Polymer, 41, (2000), 5001-5009.",
        "The catalyst according to the invention may also comprise a mixture of at least two different compounds described above.",
        "The dimerization reaction according to the invention may be carried out in the absence of a solvent or in a solvent which is not reactive with the isocyanate functional group and which is generally not reactive with the catalyst. Mention may be made in particular of chlorobenzene, toluene, trifluoromethylbenzene, n-butyl acetate, tert-butyl methyl ether, and the like.",
        "When the catalyst is soluble in isocyanates, the reaction is preferably carried out with no solvent. Isocyanates being as a general rule scarcely polar, it will be advantageous to have catalysts exhibiting some solubility in the reaction medium. To this effect, the use of a solvent, or even of a co-solvent, may then prove effective for the method according to the invention.",
        "The present invention is aimed at the dimerization of isocyanate compounds in general, and which preferably carry at least two isocyanate functional groups, designated in the present description by monomeric isocyanates.",
        "They may be linear, branched or cyclic aliphatic, or even aromatic isocyanate monomers with a hydrocarbon backbone. The monomers are advantageously diisocyanates or triisocyanates.",
        "The dimerization reaction may also be carried out starting with a mixture of various monomers, in-which case the products obtained will be mixed or asymmetric dimers, oligomers or polydimers, as well as the mixtures of trimers formed.",
        "There may be mentioned in particular, as a linear aliphatic diisocyanate monomer, hexamethylene diisocyanate (HDI), and, as branched aliphatic diisocyanate monomer, 2-methylpentamethylene diisocyanate. There may be mentioned, as triisocyanate monomer, 4-isocyanatomethyl-1,8-octamethylene diisocyanate.",
        "Surprisingly, the method according to the invention gives very good results with scarcely reactive monomers, in particular those in which at least one isocyanate functional group is at the cycloaliphatic, secondary, tertiary or neopentyl position, and in particular with the cycloaliphatic monomers, or alternatively with the isocyanates having a branched backbone, the branch(es) being in α or β of the isocyanate functional group.",
        "These monomers are advantageously such that at least one, advantageously both, of the isocyanate functional groups is (are) distant from the nearest ring by at most one carbon and, preferably, is (are) directly linked to it. In addition, these cycloaliphatic monomers advantageously have at least one, preferably two, isocyanate functional groups carried by a carbon atom chosen from secondary, tertiary or neopentyl isocyanate functional groups.",
        "The method according to the invention gives very good results, including when the conformational freedom of the cycloaliphatic monomer is low. As monomers of this type, the following monomers may be mentioned by way of example:\n\n    \n    \n        compounds corresponding to the hydrogenation of the aromatic ring(s) carrying the isocyanate functional groups of aromatic isocyanate monomers and in particular of TDI (toluene diisocyanate) and diisocyanatobiphenyls, the compound known by the acronym H12MDI, [4,4′-bis(isocyanato)cyclohexyl]-methane, and the various BICs [bis(isocyanatomethyl)cyclohexane] and optionally substituted cyclohexyl diisocyanates; and especially\n        norbornane diisocyanate, often designated by its acronym NBDI;\n        isophorone diisocyanate or IPDI, or more precisely 3-isocyanatomethyl-3,5,5-trimethylcyclohexylisocyanate.",
        "As aromatic monomers, there may be mentioned 2,4-toluene diisocyanate (TDI), 2,6,4,4′-diphenylmethane diisocyanate (MDI), 1,5-naphthalene diisocyanate (NDI), tolidine diisocyanate (TODI) and paraphenylene diisocyanate (PPDI).",
        "It is possible to use diisocyanate monomers carrying functional groups which are nonreactive with the isocyanate functional group, in particular ester functional groups. By way of example, the following product:",
        "also called LDI (lysine diisocyanate) may be mentioned.",
        "The starting monomers may also be triisocyanates such as 4-isocyanatomethyloctamethylene 1,8-diisocyanate, also called TTI or alternatively the compound of formula:",
        "also called LTI (lysine triisocyanate).",
        "The starting monomers may also be products of oligomerization of isocyanates of lower molecular mass, these products of oligomerization being carriers of isocyanate functional groups or prepolymers containing isocyanate functional groups of various types (polyurethane, polyester, polyacrylate, and the like). In this case, it is not necessary to separate the unconverted oligomer from the reaction product formed at the end of the dimerization reaction.",
        "When the starting monomeric isocyanate is an oligomerization product containing an isocyanurate ring, in particular a trimeric isocyanate, the final reaction product contains isocyanurate units. However, the number of isocyanurate units is substantially that present in the starting reaction medium before the dimerization reaction.",
        "It is also possible to use mixtures of at least one or two different compounds as defined above, in particular mixtures of isocyanate monomers of low molecular weight.",
        "A mixed or asymmetric dimer or polydimer is obtained in this case, apart from the symmetric dimers or polydimers (obtained by dimerization of a single monomeric isocyanate of a single type of monomeric isocyanates), as well as mixed trimers.",
        "The dimerization temperature is between 0° C. and 300° C., and advantageously between 20° C. and 200° C., preferably between 30° C. and 80° C. It will sometimes be advantageous to carry out the reaction at a temperature at which the isocyanate is in a partially or completely liquid or molten state.",
        "When the starting monomer is IPDI, the reaction temperature is advantageously between 60° C. and 100° C., preferably at about 60° C.",
        "The catalyst/NCO molar ratio is advantageously at least 10−5 and at most 10−1. More specifically, the —Y1—X—Y2—/NCO functional group molar ratio is advantageously at least 10−4, preferably 10−3, and at most 10−1, advantageously 5×10−2. As regards the molar ratios of the —S(O)mOH functional groups to the NCO functional groups of the catalyst, they generally vary between 6×10−4 and 1.5×10−2.",
        "Below the lower limit, the reaction kinetics is greatly reduced, but contributes to the formation of a product of lower viscosity. Above the upper limit, problems of solubility of the catalyst in the reaction medium or of an extremely rapid reactivity may occur.",
        "When the starting reaction medium contains an alcohol, the catalysts of the invention promote the formation of allophanate compounds, apart from dimeric compounds.",
        "When the formation of allophanates is desired, it may be advantageous to add to the reaction medium a catalyst of the Lewis acid type, such as tin dibutyl dilaurate.",
        "The superacid catalysts defined above also make it possible to obtain crosslinked dimeric isocyanates, by adding to the starting reaction medium a compound possessing at least two functional groups capable of reacting with the NCO functional groups. They are generally functional groups carrying an active hydrogen, for example a hydroxyl group.",
        "There may be mentioned the optionally oligomeric or polymeric compounds containing at least one, preferably two, OH functional groups such as ethylene glycol, hexanediol, trimethylolpropane, pentaerythritol, polyethylene glycol, acrylic polyols, polyol esters. In this case too, it is possible to work in the absence or in the presence of solvent.",
        "The destruction of the catalyst is complete when practically all the acid catalyst is neutralized or absorbed onto a support, which is preferably basic or amphoteric (silica, alumina, zeolite, and the like).",
        "In general, the dimerization is carried out until the desired conversion rate of between 1 and 95% of the isocyanate functional groups present is obtained. For obvious economic reasons, it is preferable to stop the reaction at rates of conversion of the isocyanate functional groups of at least 5%, and preferably of between 10 and 50%. Once the dimerization reaction has stopped, the remainder of the monomers is generally removed by evaporation or distillation on a thin film or under a strong vacuum.",
        "In the case of trifunctional monomeric compounds, this elimination of the monomers is not necessary. The elimination of the monomers is not necessary either in the case where the reaction medium is used with the aim of preparing a prepolymer.",
        "The reaction may be stopped by destroying the catalyst, as obtained by adding a base, in particular sodium acetate, or sodium hydrogen carbonate, or alternatively by removing the catalyst, for example by its absorption onto an inorganic support, for example (silica, alumina, charcoal), distillation of the reaction medium, absorption on a basic ion-exchange resin of the tertiary amine or quaternary ammonium type whose counterion has a weaker acidity than the catalyst, in particular for example an anion (—OH−, —COO− or —COO−) exchange Amberlite® resin or alternatively by distillation of the reaction medium.",
        "For the removal of the catalyst from the reaction medium, a simple filtration is sufficient, in particular in the case of a batch process.",
        "The catalysts according to the invention make it possible to obtain polyisocyanates containing uretdione unit(s) with a high selectivity, namely a high level of true dimers. However, if the conversion rate is high, this selectivity decreases simply because of oligomerization reactions. The selectivity is particularly high for monomers carrying several isocyanate functional groups exhibiting different reactivities, for example IPDI.",
        "The method according to the invention allows the preparation of isocyanate compositions comprising uretdione polyisocyanates. Advantageously, the final polyisocyanate composition comprises uretdione polyisocyanates, isocyanurate polyisocyanates and optionally minor heavy compounds or, where appropriate, allophanates ureas, biurets, carbonates, esters and the like.",
        "The following nonlimiting examples illustrate the invention. Unless otherwise stated, the percentages are expressed by weight.",
        "Reagents (% expressed by weight/weight):\n\n    \n    \n        IPDI=20 g.\n        catalyst (CF3SO2)2NH=0.2; 0.5 and 1 g, respectively.\n        blocking solution, sodium acetate=0.06; 0.15 and 0.3 g, respectively.\n\nProcedure",
        "The reaction is carried out in a 1 L reactor with mechanical stirring, temperature regulation and bubbling of argon with a submerged tube.",
        "The IPDI and then the catalyst are successively introduced into the reactor. The reaction medium is kept at a temperature of 60° C., with stirring. The progress of the reaction is monitored by titration of the residual isocyanate functional groups. After a total period of 5 hours, the rate of conversion of the IPDI reaches 19.1% (for a quantity of catalyst of 1%), the blocking solution (60 mg of sodium acetate per 1% of catalyst) is introduced and, 30 minutes later, the reaction mass is cooled to room temperature.",
        "The reaction mass is distilled in a double-effect thin-layer evaporator under a vacuum of 0.5 mmHg, and at a temperature of 170° C.",
        "The final product is a solid.",
        "The analysis of the reaction medium before distillation of the IPDI monomer is presented below.",
        "Ex 1\nEx 2\nEx 3\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReaction conditions\n\n\n\n\n\n\n\n\n\n\nReaction temperature and time\n60° C./5 H\n60° C./5 H\n60° C./5 H\n\n\nNature and quantity of\nIPDI 20 g/\nIPDI 20 g/\nIPDI 20 g/\n\n\nisocyanate\n0.09 mol\n0.09 mol\n0.09 mol\n\n\nNature and quantity of the\nTFSI/0.2 g\nTFSI/0.5 g\nTFSI/1 g\n\n\ncatalyst\n\n\n% by weight catalyst/iso-\n  1%\n 2.5%\n  5%\n\n\ncyanate\n\n\nMolar quantity catalyst used\n7.12 × 10−4\n1.8 × 10−3\n3.6 × 10−3\n\n\nMolar quantity H+ function\n7.12 × 10−4\n1.8 × 10−3\n3.6 × 10−3\n\n\nH+/NCO function molar ratio\n  4 × 10−3\n  1 × 10−2\n  2 × 10−2\n\n\nComponents\n\n\nIPDI\n80.9%\n71.2%\n60.3%\n\n\nRate of conversion of IPDI\n19.1%\n28.8%\n39.7%\n\n\nTrue dimmer\n14.3%\n17.6%\n16.4%\n\n\nTrimer + bis-dimer\n\n 6.3%\n 7.2%\n\n\nBis-dimer\n 3.7%\n\n\nBis-trimer\n\n\n  4%\n\n\nHeavy materials as tris-dimer\n 1.1%\n 5.0%\n 3.7%*\n\n\nRatio true dimmer/\n74.9%\n  61%\n  52%\n\n\nsum of the compounds\n\n\n\n\n\n*presence of isocyanurate\n\n\nTFSI = Bis(N,N-trifluoromethanesulfonyl)amine (CF3SO2)2—NH/MW of TFSI = 281",
        "The procedure is carried out as for Examples 1 to 3, with a quantity of catalyst equal to 5% by weight of TFSI relative to IPDI, and with the difference that 0.66 g of n-butanol is added to the starting reaction medium (that is 10 mol % relative to the IPDI used).",
        "The composition of the reaction medium before removal of the monomeric IPDI is given in the table below:",
        "Example 4\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReaction conditions\n\n\n\n\n\n\n\n\nReaction temperature and time\n60° C./5 H\n\n\nNature and quantity of isocyanate\nIPDI 20 g/0.09 mol\n\n\nNature and quantity of the catalyst\nTFSI/1 g\n\n\n% by weight catalyst/isocyanate\n  5%\n\n\nMolar quantity catalyst used\n3.6 × 10−3\n\n\nMolar quantity H+ function\n3.6 × 10−3\n\n\nH+/NCO function molar ratio\n  2 × 10−2\n\n\nNature and quantity of protic compound\n10 mol% n-BuOH/IPDI: 0.66 g\n\n\nComponents\n\n\nIPDI\n50.6%\n\n\nRate of conversion of IPDI\n49.4%\n\n\nTrue dimer of IPDI\n18.5%\n\n\nIPDI and n-butyl allophanate\n 5.4%\n\n\nBis-dimer + trimer in a small quantity*\n10.6%\n\n\nHeavy materials as tris-dimer*\n14.9%\n\n\nRatio true dimer to sum of the\n37.5%\n\n\ncomponents outside monomer\n\n\n\n\n\nIPDI and n-butyl allophanate functional group and trimer under the masses bis-dimer and heavy materials.",
        "The procedure is carried out as for Examples 1-3, except that the work is carried out at 100° C.",
        "Example 5\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReaction conditions\n\n\n\n\n\n\n\n\n\n\nReaction temperature and time\n100° C./5 H\n\n\n\nNature and quantity of isocyanate\nIPDI 20 g/0.09 mol\n\n\n\nNature and quantity of the catalyst\nTFSI/0.5 g\n\n\n\n% by weight catalyst/isocyanate\n2.5%\n\n\n\nMolar quantity catalyst used\n1.8 × 10−3\n\n\n\nMolar quantity H+ function\n1.8 × 10−3\n\n\n\nH+/NCO function molar ratio\n  1 × 10−2\n\n\n\nComponents\n\n\n\nIPDI\n82.4% \n\n\n\nRate of conversion of IPDI\n17.6% \n\n\n\nTrue dimer of IPDI\n7.7%\n\n\n\nBis-dimer + trimer\n7.2%\n\n\n\nHeavy materials\n2.7%\n\n\n\nTrue dimer/sum of the components (except\n43.75% \n\n\n\nmonomer) ratio",
        "Reagents (% expressed by weight/weight):\n\n    \n    \n        IPDI=20 g\n        catalyst=triflic acid (CF3SO3H)=0.2 g\n        blocking agent=sodium acetate=0.5 g\n\nProcedure",
        "The reaction is carried out in a 1 L reactor with mechanical stirring, temperature regulation and bubbling of argon with a submerged tube. The isocyanate and then the catalyst are successively introduced into the reactor. The catalytic solution is introduced over 10 minutes, with stirring so as to keep the reaction medium at a temperature of 60° C. The progress of the reaction is monitored by titration of the residual isocyanate functional groups. After a total period of 6 h, the rate of conversion of the IPDI reaches about 20%. The blocking agent is introduced and, 15 minutes later, the reaction mass is cooled to room temperature.",
        "The reaction mass is distilled in a double-effect thin-layer evaporator, at a temperature of 180° C. and under a vacuum of 0.3 mbar, in order to remove the residual isocyanate monomer.",
        "The composition of the reaction medium before addition of the blocking agent and removal of the monomeric IPDI is given in the table below:",
        "Products\n% by weight\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIPDI\n81.3\n\n\n\nDimer\n12.6\n\n\n\nBis-dimer\n3.2\n\n\n\nTris-dimer\n2.7\n\n\n\nTrue dimer/sum of the dimers ratio\n68",
        "The operating conditions of Example 6 are repeated except that the quantity of CF3SO3H added is 0.5 g and the quantity of sodium acetate is 1 g.",
        "The operating conditions of Example 6 are repeated except that 0.74 g of n-butanol is added to the starting reaction medium.",
        "The operating conditions of Example 7 are repeated except that 0.74 g of n-butanol is added to the starting reaction medium.",
        "Example 6 is repeated using 2.5% by weight of the catalyst and by increasing the reaction temperature to 100° C.",
        "Example 10 is repeated, replacing IPDI with HDI.",
        "The composition of the final reaction medium of Examples 6 to 11 is given below:",
        "Examples\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n6\n7\n8\n9\n10\n11\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIPDI\n81.3%\n72.3%\n65.0%\n50.6%\n80.7%\n\n\n\nHDI\n\n\n\n\n\n93.6%\n\n\nDimer\n12.6%\n16.9%\n15.7%\n18.5%\n7.3%\n1.62%\n\n\nBis-dimer\n3.2%\n5.5%\n7.1%\n\n4.1%\n 2.5%\n\n\nTris-dimer\n2.7%\n5.3%\n4.0%\n\n\nIPDI and butyl allophanate\n\n\n8.2%\n5.4%\n\n\nBis-dimer*\n\n\n\n10.6%\n\n\nHeavy materials as tris-dimer*\n—\n—\n4.0%\n14.9%\n6.9%\n 1.8%\n\n\nRatio true dimmer/\n68\n61\n59\n\n\nsum of the dimers\n\n\n\n\n\n*containing IPDI and butyl allophanate functional groups"
    ],
    "citations": [
        "4031036",
        "4476054",
        "4618707",
        "5202358",
        "5461135",
        "5484916",
        "6538095",
        "0 896 973"
    ],
    "us_classification": "528 44",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "08",
            "subclass": "G",
            "main_group": "18",
            "subgroup": "00"
        }
    ]
}