{
    "title": "Randomly changing pulse polarity and phase in an UWB signal for power spectrum density shaping",
    "abstract": "A method and system eliminate spectral lines and shapes the power spectral density of an ultra bandwidth signal. First, a train of non-periodic pulses is generated. The non-periodic pulses are then modulated in time according to uncorrelated symbols. A polarity of the non-periodic pulses is inverted randomly before transmitting the non-periodic pulses as an ultra wide bandwidth signal to eliminate spectral lines and to shape a power spectral density of the ultra wide bandwidth signal.",
    "inventors": [
        "Nakache",
        "Molisch",
        "Zhang"
    ],
    "document_number": "07298792",
    "publication_date": "20071120",
    "assignees": [
        "Mitsubishi Electric Research Laboratories, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for eliminating spectral lines and shaping a power spectral density of an ultra wide bandwidth signal, comprising:",
            "components": [
                {
                    "component": "generating a train of non-periodic pulses;",
                    "subcomponents": []
                },
                {
                    "component": "modulating the non-periodic pulses in time according to uncorrelated symbols; and",
                    "subcomponents": []
                },
                {
                    "component": "inverting, randomly, a polarity of the non-periodic pulses before transmitting the non-periodic pulses as an ultra wide bandwidth signal to eliminate spectral lines and to shape a power spectral density of the ultra wide bandwidth signal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 wherein each uncorrelated symbol includes one uncorrelated pulse.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 2 wherein the modulation of the one uncorrelated pulse per uncorrelated symbol is pulse position modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 2 wherein the modulation of the one uncorrelated pulse per uncorrelated symbol is amplitude modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 2 wherein the modulation of the one uncorrelated pulse per uncorrelated symbol is a combination of amplitude modulation and pulse position modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 4 wherein the amplitude modulation is accomplished with on/off keying, wherein for every time period a zero is represented by a non-periodic pulse, and a one by no pulse.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 wherein each uncorrelated symbol includes a combination of individual non-periodic pulses.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 7 wherein the polarity of a combination of N non-periodic pulses of each uncorrelated symbol is randomly and independently inverted from uncorrelated symbol to uncorrelated symbol.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 7 wherein the polarity of individual non-periodic pulses of each uncorrelated symbol are randomly and independently inverted within each uncorrelated symbol and from uncorrelated symbol to uncorrelated symbol.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 7 wherein the polarity of individual non-periodic pulses of each uncorrelated symbol are randomly inverted within each uncorrelated symbol and identically inverted from uncorrelated symbol to uncorrelated symbol.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 7 wherein the uncorrelated symbols are modulated by pulse position modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 7 where the uncorrelated symbols are modulated by amplitude modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 7 wherein the uncorrelated symbols are modulated by a combination of pulse position modulation and amplitude modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 7 wherein the combination of non-periodic pulses follows a pattern of a time hopping sequence.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 7 wherein a combination of non-periodic pulses is according to a pattern of a direct sequence spread spectrum.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 7 wherein different non-periodic pulses sequences are codewords used as uncorrelated symbols of a modulation format.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 16 wherein the modulation format is M-ary orthogonal keying and M-ary bi-orthogonal keying.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 1 further comprising:",
            "components": [
                {
                    "component": "shaping a spectrum of the UWB signal to a predetermined shape by the random inverting of the polarity of the non-periodic pulses.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 18 wherein the modulation is pulse amplitude modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method of claim 18 wherein the modulation is pulse position modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The method of claim 18 wherein the modulation is a combination of pulse amplitude modulation and pulse position modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The method of claim 18 wherein the modulation uses codewords.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The method of claim 18 wherein the modulation is a M-ary orthogonal keying modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The method of claim 7 further comprising:",
            "components": [
                {
                    "component": "shaping a spectrum of the UWB signal to a predetermined shape by the random inverting of the polarity of the non-periodic pulses.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The method of claim 24 wherein the modulation is pulse amplitude modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The method of claim 24 wherein the modulation is pulse position modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The method of claim 24 wherein the modulation is a combination of pulse amplitude modulation and pulse position modulation.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The method of claim 9 further comprising:",
            "components": [
                {
                    "component": "shaping a spectrum of the UWB signal to a predetermined shape by the random inverting of the polarity of the non-periodic pulses.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The method of claim 14 further comprising:",
            "components": [
                {
                    "component": "shaping a spectrum of the UWB signal to a predetermined shape by the random inverting of the polarity of the non-periodic pulses.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The method of claim 1 further comprising:",
            "components": [
                {
                    "component": "grouping sets of non-periodic pulses into subwaveforms; and",
                    "subcomponents": []
                },
                {
                    "component": "means for inverting randomly a polarity of the subwaveforms.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The method of claim 30 further comprising:",
            "components": [
                {
                    "component": "shaping a spectrum of the UWB signal to a predetermined shape by the random inverting of the polarity of the subwaveforms.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. The method of claim 30 further comprising:",
            "components": [
                {
                    "component": "shaping a spectrum of the ultra wide band signal to a predetermined shape by the random inverting of the polarity of a set of subwaveforms of N-tuplets of non-periodic pulses using a transmit references scheme to carry information.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. The method of claim 2 further comprising:",
            "components": [
                {
                    "component": "grouping sets of uncorrelated symbols;",
                    "subcomponents": []
                },
                {
                    "component": "means for inverting, randomly, a polarity of the uncorrelated symbols a first set of the sets of uncorrelated symbols; and",
                    "subcomponents": []
                },
                {
                    "component": "means for inverting a polarity of a next set of the sets of uncorrelated symbols according to the polarity of the uncorrelated symbols of the first set.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The method of claim 1 wherein each uncorrelated symbol includes subwaveforms composed of a combination of non-periodic pulses with a sequence of polarities that depends on the data.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. The method of claim 1 , in which the modulating is according a sub part of the uncorrelated symbol.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. The method of claim 1 , in which the modulating is according to a group of uncorrelated symbols.",
            "components": []
        },
        {
            "claim_number": "CLM-00037",
            "preamble": "37. The method of claim 35 , in which the sub part of the uncorrelated symbol includes chips of a spreading sequence.",
            "components": []
        },
        {
            "claim_number": "CLM-00038",
            "preamble": "38. The method of claim 35 , in which the sub part of the uncorrelated symbol includes elements of codewords.",
            "components": []
        },
        {
            "claim_number": "CLM-00039",
            "preamble": "39. The method of claim 1 further comprising:",
            "components": [
                {
                    "component": "randomizing a phase of the non-periodic pulses to shape a spectrum of the UWB signal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00040",
            "preamble": "40. A system for eliminating spectral lines and shaping the spectrum of an ultra wide bandwidth signal, comprising:",
            "components": [
                {
                    "component": "means for generating a train of non-periodic pulses;",
                    "subcomponents": []
                },
                {
                    "component": "means for modulating the non-periodic pulses in time according to uncorrelated symbols; and",
                    "subcomponents": []
                },
                {
                    "component": "means for inverting, randomly, a polarity of the non-periodic pulses before transmitting the non-periodic pulses as an ultra wide bandwidth signal to eliminate spectral lines and to shape a power spectral density of the ultra wide bandwidth signal.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This Application is a Continuation-in-Part of U.S. patent application, Ser. No. 10/361,315 titled “Randomly Inverting Pulse Polarity in an UWB Signal for Power Spectrum Density Shaping” filed on Feb. 10, 2003 now U.S. Pat. No. 7,103,109 by Nakache et al.",
        "This invention relates generally to wireless communication, and more particularly to communicating with ultra wide bandwidth (UWB) systems.",
        "Ultra wide bandwidth (UWB) systems have recently received considerable attention for wireless radio communication systems. Recently, the US Federal Communications Commission (FCC) has allowed UWB systems for limited indoor and outdoor applications.",
        "The IEEE 802.15.3a standards group has defined performance requirements for the use of UWB in short-range indoor communication systems. Throughput of at least 110 Mbps at 10 meters are required. This means that the transmission data rate must be greater. Furthermore, a bit rate of at least 200 Mbps is required at four meters. Scalability to rates in excess of 480 Mbps is desirable, even when the rates can only be achieved at smaller ranges. These requirements provide a range of values for a pulse repetition frequency (PRF).",
        "In February 2002, the FCC released the “First Order and Report” providing power limits for UWB signals. The average limits over all useable frequencies are different for indoor and outdoor systems. These limits are given in the form of a power spectral density (PSD) mask 200, see FIG. 2. In the frequency band from 3.1 GHz to 10.6 GHz, the PSD is limited to −41.25 dBm/MHz. The limits on the PSD must be fulfilled for each possible 1 MHz band, but not necessarily for smaller bandwidths.",
        "For systems operating above 960 MHz, there is a limit on the peak emission level contained within a 50 MHz bandwidth centered on the frequency, fM, at which the highest radiated emission occurs. The FCC has adopted a peak limit based on a sliding scale dependent on an actual resolution bandwidth (RBW) employed in the measurement. The peak EIRP limit is 20log(RBW/50) dBm, when measured with a resolution bandwidth ranging from 1 MHz to 50 MHz. Only one peak measurement, centered on fM, is required. As a result, UWB emissions are average-limited for PRFs greater than 1 MHz and peak-limited for PRFs below 1 MHz.",
        "These data rate requirements and emission limits result in constraints on the pulse shape, the level of the total power used, the PRF, and the positions and amplitudes of the spectral lines.",
        "In UWB systems, trains of electromagnetic pulses are used to carry data. FIG. 1 shows an example symbol structure 100 of UWB signal with a one pulse per frame 101, i.e., the symbol length, a time hopping (TH) sequence of eight pulses 102 or subframes, and a subframe 103 including a TH margin. The signal comprises symbols 110 equal to a frame length, subframes 111, with a pulse position modulation (PPM) margin 112, and a TH margin 113. Instead of grouping N pulses to create a symbol of N frame durations, the frame duration is split into N subframes with 1 pulse per subframe, as shown in FIG. 1.",
        "Many UWB signals use pulse position modulation (PPM) for modulation, and time hopping (TH) spreading for multiple access. This results in a dithered pulse train. The spectrum of the signal can be obtained by considering this dithered signal as a M-PPM signal.",
        "If the modulating sequence is composed of independent and equiprobable symbols , then the PSD for non-linear memoryless modulation is given by Equation 1 as:",
        "G\n              s\n            \n            ⁡\n            \n              (\n              f\n              )\n            \n          \n          =\n          \n            \n              \n                1\n                \n                  \n                    M\n                    2\n                  \n                  ⁢\n                  \n                    T\n                    s\n                    2\n                  \n                \n              \n              ·\n              \n                \n                  ∑\n                  \n                    n\n                    =\n                    \n                      -\n                      ∞\n                    \n                  \n                  \n                    +\n                    ∞\n                  \n                \n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  (\n                  \n                    \n                      \n                        \n                        \n                          \n                            ∑\n                            \n                              i\n                              =\n                              0\n                            \n                            \n                              M\n                              -\n                              1\n                            \n                          \n                          ⁢\n                          \n                            \n                              S\n                              i\n                            \n                            ⁡\n                            \n                              (\n                              \n                                n\n                                \n                                  T\n                                  s\n                                \n                              \n                              )\n                            \n                          \n                        \n                        \n                      \n                      2\n                    \n                    ⁢\n                    \n                      δ\n                      ⁡\n                      \n                        (\n                        \n                          f\n                          -\n                          \n                            n\n                            \n                              T\n                              s\n                            \n                          \n                        \n                        )\n                      \n                    \n                  \n                  )\n                \n              \n            \n            +\n            \n              \n                1\n                \n                  T\n                  s\n                \n              \n              ⁢\n              \n                (\n                \n                  \n                    \n                      ∑\n                      \n                        i\n                        =\n                        0\n                      \n                      \n                        M\n                        -\n                        1\n                      \n                    \n                    ⁢\n                    \n                      \n                        1\n                        M\n                      \n                      ·\n                      \n                        \n                          \n                          \n                            \n                              S\n                              i\n                            \n                            ⁡\n                            \n                              (\n                              f\n                              )\n                            \n                          \n                          \n                        \n                        2\n                      \n                    \n                  \n                  -\n                  \n                    \n                      \n                      \n                        \n                          ∑\n                          \n                            i\n                            =\n                            0\n                          \n                          \n                            M\n                            -\n                            1\n                          \n                        \n                        ⁢\n                        \n                          \n                            1\n                            M\n                          \n                          ·\n                          \n                            \n                              S\n                              i\n                            \n                            ⁡\n                            \n                              (\n                              f\n                              )\n                            \n                          \n                        \n                      \n                      \n                    \n                    2\n                  \n                \n                )\n              \n            \n          \n        \n        ,\n      \n    \n    \n      \n        (\n        1\n        )\n      \n    \n  \n\n\n\n\nwhere M denotes the number of symbols, Ts is the symbol period or frame, and Si is the PSD of the ith symbol of the constellation.",
        "Inherent in PPM, and as shown in FIG. 2, the first term of Equation (1) causes spectral lines which are outside the FCC mask 200. The spectrum of a signal with a 2-PPM usually contains spectral lines spaced by the PRF. Consequently, the amplitude of these spectral lines can be 10*log10(Ts−1) dB above the level of the continuous part of the spectrum. That corresponds to 80 dB for the 100 Mbps data rate mandated by IEEE 802.15a.",
        "The FCC measurement procedures average the power of these spectral lines over the resolution bandwidth. Even then, the power level remains higher than the threshold and thus violates the FCC limits or requires a reduction of the total power. Time hopping is generally used to reduce the problem of spectral lines by reducing their number in a given frequency band. However TH does not necessarily attenuate the amplitude of the remaining spectral lines.",
        "In a non-periodic time hopped pulse train, each individual pulse can be in one of M equally probable positions within its frame. This signal has the same spectrum as a M-PPM signal with the same PRF, fPR, and uncorrelated modulated data. Increasing M enlarges the constellation of the PPM, and therefore the number of pulse positions within the frame. If these positions are uniformly spaced within the frame, then all the spectral lines that are not a multiple of M·fPR disappear.",
        "Instead of grouping N pulses to create a symbol of N frame durations, the former frame duration is split into N subframes with one pulse per subframe 111 as shown in FIG. 1. As a consequence, the PRF is N*fPR. Hence, this non-periodic TH pulse train is composed of N pulses per frame, and each pulse can take M positions within the duration of a subframe. The spectrum of this pulse train is the same as for a M-PPM signal with a PRF=N*fPR. As a result, the spectral lines are spaced by M*N*fPR when the M pulse positions are uniformly spaced. If M goes to infinity, which is equivalent to a uniform distribution of the pulse, then all spectral lines occur at infinite spacing and thus effectively vanish.",
        "However, in order to consider realistic pulse trains that can be used in the generation of UWB signals, some modifications need to be made. If pulses are truly uniformly distributed within each frame, overlaps may happen at the junction between subframes when M increases. Margins or guard intervals eliminate these overlaps.",
        "In order to modulate the symbols by PPM, additional margins are introduced between frames. However, by introducing margins, the uniform distribution of pulse positions within each subframe is destroyed, which has an impact on the spectral lines. Furthermore TH sequence is limited in time and contributes to the periodicity of the signal and undesirable spectral lines as shown in FIG. 2.",
        "Therefore, there is a need to provide a system and method that can eliminate these undesirable spectral lines. Furthermore it is desired to influence the design of the power spectral density of the signal.",
        "Commonly, ultra wide bandwidth (UWB) systems communicate with trains of short-duration pulses that have a low duty-cycle. Thus, the energy of the radio signal is spread very thinly over a wide range of frequencies. Almost all of the known systems use a combination of spreading techniques such as time-hopping (TH) spreading for multiple access, and modulation formats such as pulse position modulation (PPM). This combination results in spectral lines that either lead to a violation of FCC requirements, or require a significant reduction in power, which decreases performance and range of the signal.",
        "The invention provides a method for eliminating spectral lines caused by transmitting data using modulation formats and spreading techniques such as PPM and TH sequences. The spectral lines are eliminated by randomly changing the polarity of the pulses of the signal. Hereinafter, the word ‘random’ means pseudo-random as commonly used in the art.",
        "Similarly, spectral lines can be eliminated in bandpass signals by randomizing the phase of the pulses in a signal. It is understood for this invention that all methods and apparatuses that are proposed for polarity randomization have their equivalents for phase randomization.",
        "Changing the pulse polarity does not have a negative impact on the performance of the transceiver because the polarity of the signal is not used to carry information. When the polarity is used to carry information, the sequence used to change the pulse polarity has to be known at the receiver in order to decode the signal. By changing randomly the polarity of the pulses of the signal, the discrete frequency components of the spectrum vanish. Furthermore, this randomization of the polarity can be used to shape the spectrum of the signal.",
        "A method eliminates spectral lines in an ultra wide bandwidth signal. First, a train of pulses is generated. The pulses are then modulated in time according to symbols. A polarity of the pulses is inverted randomly before",
        "FIG. 1 is a timing diagram of a pulse train signal to be modified according to the invention;",
        "FIG. 2 is a power spectral density (PSD) graph of a prior art UWB signal;",
        "FIG. 3 is a timing diagram of a pulse train before modification;",
        "FIG. 4 is a timing diagram of a pulse train after modification according to the invention;",
        "FIG. 5 is a pulse train with one pulse per symbol;",
        "FIG. 6 is a prior art PSD of signal of FIG. 5 without modification;",
        "FIG. 7 is pulse train of FIG. 5 with randomly inverted polarity of pulses;",
        "FIG. 8 is a PSD of the signal of FIG. 7 according to the invention;",
        "FIG. 9 is a block diagram of a system for randomly inverted pulses according to the invention;",
        "FIG. 10 is a pulse train generated by pulse amplitude modulation before modification;",
        "FIG. 11 is a PSD of the signal of FIG. 10;",
        "FIG. 12 is a pulse train generated by pulse amplitude modulation after modification;",
        "FIG. 13 a PSD of the signal of FIG. 12;",
        "FIG. 14 is a block diagram of a system for generating the signal of FIG. 12;",
        "FIG. 15 are pulse trains before and after modification of pulses within symbol durations according to the invention;",
        "FIG. 16 are pulse trains before and after modification from symbol to symbol according to the invention;",
        "FIG. 17 are pulse trains before and after modification within symbol duration according to the invention;",
        "FIG. 18 are pulse trains before and after modification within symbol duration;",
        "FIG. 19 are pulse trains before and after modification from symbol to symbol;",
        "FIG. 20 are pulse trains before and after modification within symbol duration;",
        "FIG. 21 are pulse trains before and after modification within symbol duration;",
        "FIG. 22 are pulse trains before and after modification from symbol to symbol;",
        "FIG. 23 are pulse trains before and after modification within symbol duration;",
        "FIG. 24 are pulse trains before and after modification within symbol duration and from symbol to symbol;",
        "FIG. 25 is a PSD of the signal of FIG. 24 after modification;",
        "FIG. 26 is a subwaveform with two pulses of opposite polarity;",
        "FIG. 27 is a time hopping sequence with four subwaveforms; and",
        "FIG. 28 is the PSD of the signal of FIG. 27.",
        "To solve the problem of discrete frequency components in a spectrum of an ultra wide bandwidth (UWB) radio signal, the invention inverts randomly the polarity of the signal. The resultant signal with randomly inverted polarity is compliant with FCC regulations. It should be noted that the polarity randomization can be applied to pulses, to subparts of symbols, to an entire symbol, and to groups of symbols. Subparts of a symbol can be chips of spreading sequences and elements of codewords of a modulation scheme. This random polarization enables the invention to eliminate spectral lines and to shape the power spectral density of the signal.",
        "To solve the problem of shaping a spectrum of an ultra wide bandwidth (UWB) radio signal, the invention inverts randomly the polarity of the signal. The resultant signal with randomly inverted polarity can more closely approximate a prescribed spectral mask, the FCC power spectral density (PSD) mask 200 of FIG. 2, than a signal without the polarity randomization.",
        "One could use binary phase-shift keying (BPSK) to randomize the polarity of the pulses. BPSK would also reduce the complexity of the system. However, with BPSK, the channel conditions can modify the polarity of the signal and destroy the data.",
        "Therefore, the invention inverts the polarity of the pulses to shape the spectrum of the signal without carrying information. Thus, it is unnecessary to have zero mean information symbols to control the spectral characteristics of the modulated signal. The inversions of polarity can be applied to symbols, i.e., the set of pulses composing a symbol taken together, as well to individual pulses, or to subparts of symbols or groups of symbols. The effect of this modification according to the invention is to eliminate spectral lines caused by, for example, pulse position modulation (PPM), and other dithering techniques, such as time hopping (TH) spreading used in UWB systems.",
        "The polarity randomization can be applied in addition to the modulation formats using polarity to modulate the data. This alleviates the need for equiprobable symbols to eliminate spectral lines and to shape the spectrum of the signal.",
        "The polarity randomization can also be applied in addition to differential modulation schemes using the difference between the polarity of substructures of the symbols, for example, in the case of transmit reference (TR) schemes. The information can be coded by the difference between a first pulse and a second pulse, for example. The data can also be encoded by phase differences within an N-tuplet of pulses. Therefore, the random polarity applies to the polarity of all the pulses of each N-tuplet. In this case, the polarity of the signal is partly dependant on the data.",
        "The polarity randomization can also be applied in addition to modulation schemes that involve the use of orthogonal or quasi-orthogonal sequences to encode a subsequence of the information bits. In this format, different sequences, also called codewords, signify different data symbols.",
        "A symbol is constructed in the following manner. We first select a subsequence of length M bits from our input bit stream. This subsequence is now considered as our modulation symbol. The symbol is mapped to one of a set of orthogonal or quasi-orthogonal sequences. A size of the set of orthogonal or quasi-orthogonal sequences is at least 2M, in order to ensure that all transmitted waveforms are orthogonal or quasi-orthogonal. The subsequence is used as an index to select one of the orthogonal sequences. For example, if M is 3, then the set has 8 sequences, and a subsequence of ‘011’ selects the fourth sequence of the set.",
        "The polarity randomization is now applied to each element, e.g., pulse, symbol, part of symbol, etc., of the codeword. The randomization sequence is independent of the data sequence.",
        "This principle can be applied if each element of the (quasi-) orthogonal sequence is transmitted as multiple pulses, e.g., enabling transmitted-reference detection.",
        "The polarity randomization code is known at the receiver. The receiver can use the polarity randomization code to reverse the code and demodulate the information.",
        "Thus, the method according to the invention solves the problem of spectral lines caused by non-equiprobable symbols and non-antipodal modulation schemes at the same time. Furthermore, the polarity of the signal can be specifically used to shape the spectrum of the UWB signal.",
        "Random Polarity Inversion",
        "FIG. 3 shows a signal 301 that includes a train of pulses to be processed according to the invention. The spectrum of the transmitted signal 301, after pulse position modulation (PPM) and time hopping (TH) spreading, for the purpose of ultra wide bandwidth wireless communication, contains undesirable spectral lines, as shown in FIG. 2.",
        "FIG. 4 shows a transmitted waveform 401 where the polarity of pulses is randomly inverted according to the invention to eliminate the spectral lines.",
        "The discrete part of the spectral density of a pulse train is given by Equation (2) as:",
        "G\n              s\n            \n            ⁡\n            \n              (\n              f\n              )\n            \n          \n          =\n          \n            \n              1\n              \n                T\n                s\n                2\n              \n            \n            ·\n            \n              \n                ∑\n                \n                  n\n                  =\n                  \n                    -\n                    ∞\n                  \n                \n                \n                  +\n                  ∞\n                \n              \n              ⁢\n              \n                \n              \n              ⁢\n              \n                (\n                \n                  \n                    \n                      \n                      \n                        \n                          ∑\n                          \n                            i\n                            =\n                            0\n                          \n                          \n                            M\n                            -\n                            1\n                          \n                        \n                        ⁢\n                        \n                          \n                            P\n                            i\n                          \n                          ·\n                          \n                            \n                              S\n                              i\n                            \n                            ⁡\n                            \n                              (\n                              \n                                n\n                                \n                                  T\n                                  s\n                                \n                              \n                              )\n                            \n                          \n                        \n                      \n                      \n                    \n                    2\n                  \n                  ⁢\n                  \n                    δ\n                    ⁡\n                    \n                      (\n                      \n                        f\n                        -\n                        \n                          n\n                          \n                            T\n                            s\n                          \n                        \n                      \n                      )\n                    \n                  \n                \n                )\n              \n            \n          \n        \n        ,\n      \n    \n    \n      \n        (\n        2\n        )\n      \n    \n  \n\n\n\n\nwhere, M is the number of symbols, Ts the symbol period, Si is the power spectral density (PSD) of the ith symbol for Iε[0,M−1], and Pi is the probability of the ith symbol.",
        "By changing randomly the polarity of M symbols Si, Equation (2) can be rewritten as a discrete part of the spectral density of a pulse train composed of 2*M antipodal symbols.",
        "The symbols of each antipodal pair have the probability Pi/2, and the Fourier transform Si and −Si. As a result, the spectral lines vanish as given by Equation (3):",
        "G\n            s\n          \n          ⁡\n          \n            (\n            f\n            )\n          \n        \n        =\n        \n          \n            \n              1\n              \n                T\n                s\n                2\n              \n            \n            ·\n            \n              \n                ∑\n                \n                  n\n                  =\n                  \n                    -\n                    ∞\n                  \n                \n                \n                  +\n                  ∞\n                \n              \n              ⁢\n              \n                \n              \n              ⁢\n              \n                (\n                \n                  \n                    \n                      \n                      \n                        \n                          ∑\n                          \n                            i\n                            =\n                            0\n                          \n                          \n                            M\n                            -\n                            1\n                          \n                        \n                        ⁢\n                        \n                          (\n                          \n                            \n                              \n                                \n                                  P\n                                  i\n                                \n                                2\n                              \n                              ·\n                              \n                                \n                                  S\n                                  i\n                                \n                                ⁡\n                                \n                                  (\n                                  \n                                    n\n                                    \n                                      T\n                                      s\n                                    \n                                  \n                                  )\n                                \n                              \n                            \n                            -\n                            \n                              \n                                \n                                  P\n                                  i\n                                \n                                2\n                              \n                              ·\n                              \n                                \n                                  S\n                                  i\n                                \n                                ⁡\n                                \n                                  (\n                                  \n                                    n\n                                    \n                                      T\n                                      s\n                                    \n                                  \n                                  )\n                                \n                              \n                            \n                          \n                          )\n                        \n                      \n                      \n                    \n                    2\n                  \n                  ⁢\n                  \n                    δ\n                    ⁡\n                    \n                      (\n                      \n                        f\n                        -\n                        \n                          n\n                          \n                            T\n                            s\n                          \n                        \n                      \n                      )\n                    \n                  \n                \n                )\n              \n            \n          \n          =\n          0.\n        \n      \n    \n    \n      \n        (\n        3\n        )",
        "There are several polarity inversion embodiments possible considering the main idea behind the invention, including:",
        "One pulse per symbol\n\n    \n    \n        Pulse Position Modulation\n        Pulse Amplitude Modulation",
        "Multiple pulses per symbol\n\n    \n    \n        Pulse Position Modulation\n        Random polarity of pulses within the symbol duration\n        Random polarity from symbol to symbol\n        Identical set of different polarities for pulses in the symbol duration",
        "Pulse Amplitude Modulation\n\n    \n    \n        Random polarity of pulses within the symbol duration\n        Random polarity from symbol to symbol\n        Identical sets of different polarities for pulses in the symbol duration from symbol to symbol",
        "Different modulation schemes\n\n    \n    \n        Random polarity of pulses within the symbol duration\n        Random polarity from symbol to symbol\n        Identical set of different polarities for pulses in symbol duration",
        "Random Polarity for Spectrum Shaping",
        "Random polarity of sub structure of a symbol—dual pulse waveform",
        "One Pulse Per Symbol",
        "As stated above, the randomization of the polarity of the whole symbol eliminates the spectral lines of the power spectrum density. These symbols have a specific waveform. A single pulse constitutes this waveform here. The power spectral density of the modulated signal depends on the power spectral density of the pulse.",
        "Pulse Position Modulation",
        "FIG. 5 shows an example pulse train 500 with a 2 PPM. The train is constituted by pulses dithered in time as follows. The pulse codes a logical zero in its original position. The pulse is delayed to encode a logical one.",
        "The discrete part of the power spectrum density of a dithered pulse train using a 2-PPM is given by Equation (4) as:",
        "G\n            s\n          \n          ⁡\n          \n            (\n            f\n            )\n          \n        \n        =\n        \n          \n            1\n            \n              T\n              s\n              2\n            \n          \n          ·\n          \n            \n              ∑\n              \n                n\n                =\n                \n                  -\n                  ∞\n                \n              \n              \n                +\n                ∞\n              \n            \n            ⁢\n            \n              \n            \n            ⁢\n            \n              \n                (\n                \n                  \n                    \n                      \n                      \n                        \n                          ∑\n                          \n                            i\n                            =\n                            0\n                          \n                          \n                            M\n                            -\n                            1\n                          \n                        \n                        ⁢\n                        \n                          \n                            P\n                            i\n                          \n                          ·\n                          \n                            \n                              S\n                              i\n                            \n                            ⁡\n                            \n                              (\n                              \n                                n\n                                \n                                  T\n                                  s\n                                \n                              \n                              )\n                            \n                          \n                        \n                      \n                      \n                    \n                    2\n                  \n                  ⁢\n                  \n                    δ\n                    ⁡\n                    \n                      (\n                      \n                        f\n                        -\n                        \n                          n\n                          \n                            T\n                            s\n                          \n                        \n                      \n                      )\n                    \n                  \n                \n                )\n              \n              .\n            \n          \n        \n      \n    \n    \n      \n        (\n        4\n        )",
        "FIG. 6 shows the spectrum of this signal. FIG. 7 shows this signal after inverting randomly the polarity of individual pulses. After inverting randomly the polarity of the symbols, the discrete part of the power spectrum density is given by Equation (5) as:",
        "G\n            s\n          \n          ⁡\n          \n            (\n            f\n            )\n          \n        \n        =\n        \n          \n            \n              1\n              \n                T\n                s\n                2\n              \n            \n            ·\n            \n              \n                ∑\n                \n                  n\n                  =\n                  \n                    -\n                    ∞\n                  \n                \n                \n                  +\n                  ∞\n                \n              \n              ⁢\n              \n                \n              \n              ⁢\n              \n                (\n                \n                  \n                    \n                      \n                      \n                        \n                          ∑\n                          \n                            i\n                            =\n                            0\n                          \n                          1\n                        \n                        ⁢\n                        \n                          (\n                          \n                            \n                              \n                                \n                                  P\n                                  i\n                                \n                                2\n                              \n                              ·\n                              \n                                \n                                  S\n                                  i\n                                \n                                ⁡\n                                \n                                  (\n                                  \n                                    n\n                                    \n                                      T\n                                      s\n                                    \n                                  \n                                  )\n                                \n                              \n                            \n                            -\n                            \n                              \n                                \n                                  P\n                                  i\n                                \n                                2\n                              \n                              ·\n                              \n                                \n                                  S\n                                  i\n                                \n                                ⁡\n                                \n                                  (\n                                  \n                                    n\n                                    \n                                      T\n                                      s\n                                    \n                                  \n                                  )\n                                \n                              \n                            \n                          \n                          )\n                        \n                      \n                      \n                    \n                    2\n                  \n                  ⁢\n                  \n                    δ\n                    ⁡\n                    \n                      (\n                      \n                        f\n                        -\n                        \n                          n\n                          \n                            T\n                            s\n                          \n                        \n                      \n                      )\n                    \n                  \n                \n                )\n              \n            \n          \n          =\n          0.\n        \n      \n    \n    \n      \n        (\n        5\n        )",
        "As shown in FIG. 8, inverting the polarity in such a way makes all the discrete components, i.e., spectral lines, disappear to result in a continuous spectrum.",
        "FIG. 9 shows a system and method 900 for eliminating spectral lines in a dithered UWB signal according to the invention. The system includes a pulse generator 910, a modulator 920, and an inverter 930 coupled serially to an antenna 931. Generated pulses are dithered in time 920, i.e., by a time hopping sequence for multiuser access and by PPM for modulation, according to data symbols 940, and the polarity of resultant pulses are inverted according to a pseudo random number (PRN) 950.",
        "Pulse Amplitude Modulation",
        "Pulse amplitude modulation is accomplished by on/off keying (OOK) modulation, which is a special case of PAM. For every time period Tp, “zero” is represented by a pulse, and “one” by no pulse as shown in FIG. 10.",
        "The discrete part of the power spectrum density of a OOK modulated signal is given by Equation (6) as:",
        "G\n            s\n          \n          ⁡\n          \n            (\n            f\n            )\n          \n        \n        =\n        \n          \n            1\n            \n              T\n              s\n              2\n            \n          \n          ·\n          \n            \n              ∑\n              \n                n\n                =\n                \n                  -\n                  ∞\n                \n              \n              \n                +\n                ∞\n              \n            \n            ⁢\n            \n              \n            \n            ⁢\n            \n              \n                (\n                \n                  \n                    \n                      \n                      \n                        \n                          P\n                          1\n                        \n                        ·\n                        \n                          \n                            S\n                            1\n                          \n                          ⁡\n                          \n                            (\n                            \n                              n\n                              \n                                T\n                                s\n                              \n                            \n                            )\n                          \n                        \n                      \n                      \n                    \n                    2\n                  \n                  ⁢\n                  \n                    δ\n                    ⁡\n                    \n                      (\n                      \n                        f\n                        -\n                        \n                          n\n                          \n                            T\n                            s\n                          \n                        \n                      \n                      )\n                    \n                  \n                \n                )\n              \n              .\n            \n          \n        \n      \n    \n    \n      \n        (\n        6\n        )",
        "FIG. 11 shows the spectrum of this signal.",
        "FIG. 12 shows that after changing randomly the polarity of the symbols, the discrete part of the power spectrum density is eliminated as given by Equation (7):",
        "G\n              s\n            \n            ⁡\n            \n              (\n              f\n              )\n            \n          \n          =\n          \n            \n              \n                1\n                \n                  T\n                  s\n                  2\n                \n              \n              ·\n              \n                \n                  ∑\n                  \n                    n\n                    =\n                    \n                      -\n                      ∞\n                    \n                  \n                  \n                    +\n                    ∞\n                  \n                \n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  (\n                  \n                    \n                      \n                        \n                        \n                          \n                            \n                              \n                                P\n                                1\n                              \n                              2\n                            \n                            ·\n                            \n                              \n                                S\n                                1\n                              \n                              ⁡\n                              \n                                (\n                                \n                                  n\n                                  \n                                    T\n                                    s\n                                  \n                                \n                                )\n                              \n                            \n                          \n                          -\n                          \n                            \n                              \n                                P\n                                1\n                              \n                              2\n                            \n                            ·\n                            \n                              \n                                S\n                                1\n                              \n                              ⁡\n                              \n                                (\n                                \n                                  n\n                                  \n                                    T\n                                    s\n                                  \n                                \n                                )\n                              \n                            \n                          \n                        \n                        \n                      \n                      2\n                    \n                    ⁢\n                    \n                      δ\n                      ⁡\n                      \n                        (\n                        \n                          f\n                          -\n                          \n                            n\n                            \n                              T\n                              s\n                            \n                          \n                        \n                        )\n                      \n                    \n                  \n                  )\n                \n              \n            \n            =\n            0\n          \n        \n        ,\n      \n    \n    \n      \n        (\n        7\n        )",
        "FIG. 13 shows the spectrum of this signal, and FIG. 14 shows the system and method according to the invention to achieve this result.",
        "Multiple Pulses Per Symbol",
        "The waveform of each symbol can also be constituted by a combination of individual pulses.",
        "Pulse Position Modulation",
        "Random Polarity of Pulses within Symbol Duration",
        "Here, the symbol is a combination of N pulses. By changing the polarity of the pulses randomly and independently within the symbol, and from symbol to symbol, the spectral lines are eliminated. FIG. 15 shows the signal before 1501 and after 1502 inverting the polarity of random pulses.",
        "Random Polarity of Pulses from Symbol to Symbol",
        "Here, the symbol is a combination of N pulses. By changing randomly independently the polarity from symbol to symbol, the spectral lines are eliminated. FIG. 16 shows the signal before 1601 and after 1602 polarity inversion.",
        "Identical Set of Different Polarities for Pulses in Symbol Duration",
        "In this case, the symbol is a combination of N pulses. The polarity of the pulses within the symbol is randomly changed for each of the M symbols of the constellation. A polarity pattern is thus affected for each symbol of the constellation. FIG. 17 shows the signal before 1701 and after 1702 random polarization inversion.",
        "Pulse Amplitude Modulation",
        "Here, the symbols are composed by a TH sequence whose amplitude varies.",
        "Random Polarity of Pulses within Symbol Duration",
        "The symbol is a combination of N pulses. By changing randomly independently the polarity of the pulses within the symbol and from symbol to symbol, as shown in FIG. 18, the spectral lines are eliminated.",
        "Random Polarity of Pulses from Symbol to Symbol",
        "The symbol is a combination of N pulses. By changing randomly the polarity from symbol to symbol, as shown in FIG. 19, the spectral lines are eliminated. FIG. 19 shows the signal before 1901 and after 1902 random polarization inversion.",
        "Identical Set of Different Polarities for Pulses in Symbol Duration",
        "The symbol is a combination of N pulses. The polarity of the pulses within the symbol is randomly changed for each of the M symbols of the constellation, as shown in FIG. 20. A polarity pattern is thus affected for each symbol of the constellation.",
        "Different Modulation Schemes",
        "The random polarity can be applied to other modulation schemes. The symbols can be coded by different TH sequences for example. The mth symbol is a combination of nm pulses.",
        "The random polarity also can be applied to systems with TH sequences, without time hopping sequence, with other direct spread techniques, and with modulations format using codewords like M-ary bi-orthogonal keying (MBOK).",
        "The random polarity can be applied in addition to the modulation format using polarity to code information. The random polarity can also be applied in addition to differential modulation schemes using the difference between the polarity of substructures of the symbols, for example, in the case of transmit reference systems (TR).",
        "Random Polarity of Pulses within Symbol Duration",
        "By changing randomly independently the polarity of the pulses within the symbol and from symbol to symbol, as shown in FIG. 21, the spectral lines disappear.",
        "Random Polarity of Pulses from Symbol to Symbol",
        "By changing randomly independently the polarity from symbol to symbol, as shown in FIG. 22, the spectral lines disappear too.",
        "Identical Set of Different Polarities for Pulses in Symbol Duration",
        "The polarity of the pulses within the symbol can be randomly changed for each of the M symbols of the constellation, as shown in FIG. 23. A polarity pattern is thus affected for each symbol of the constellation.",
        "Random Polarity for Spectrum Shaping",
        "As described above, the spectral lines disappear when the polarity changes from symbol to symbol. The continuous part of the spectrum can be derived from Equation (1). The power spectrum of the signal before polarity changes is:",
        "G\n        s\n      \n      ⁡\n      \n        (\n        f\n        )\n      \n    \n    =\n    \n      \n        \n          1\n          \n            \n              M\n              2\n            \n            ⁢\n            \n              T\n              s\n              2\n            \n          \n        \n        ·\n        \n          \n            ∑\n            \n              n\n              =\n              \n                -\n                ∞\n              \n            \n            \n              +\n              ∞\n            \n          \n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            \n              \n                \n                  \n                  \n                    \n                      ∑\n                      \n                        i\n                        =\n                        0\n                      \n                      \n                        M\n                        -\n                        1\n                      \n                    \n                    ⁢\n                    \n                      \n                        S\n                        i\n                      \n                      ⁡\n                      \n                        (\n                        \n                          n\n                          \n                            T\n                            s\n                          \n                        \n                        )\n                      \n                    \n                  \n                  \n                \n                2\n              \n              ⁢\n              \n                δ\n                ⁡\n                \n                  (\n                  \n                    f\n                    -\n                    \n                      n\n                      \n                        T\n                        s\n                      \n                    \n                  \n                  )\n                \n              \n            \n            )\n          \n        \n      \n      +\n      \n        \n          1\n          \n            T\n            s\n          \n        \n        ⁢\n        \n          (\n          \n            \n              \n                ∑\n                \n                  i\n                  =\n                  0\n                \n                \n                  M\n                  -\n                  1\n                \n              \n              ⁢\n              \n                \n                  1\n                  M\n                \n                ·\n                \n                  \n                    \n                    \n                      \n                        S\n                        i\n                      \n                      ⁡\n                      \n                        (\n                        f\n                        )\n                      \n                    \n                    \n                  \n                  2\n                \n              \n            \n            -\n            \n              \n                \n                \n                  \n                    ∑\n                    \n                      i\n                      =\n                      0\n                    \n                    \n                      M\n                      -\n                      1\n                    \n                  \n                  ⁢\n                  \n                    \n                      1\n                      M\n                    \n                    ·\n                    \n                      \n                        S\n                        i\n                      \n                      ⁡\n                      \n                        (\n                        f\n                        )\n                      \n                    \n                  \n                \n                \n              \n              2\n            \n          \n          )\n        \n      \n    \n  \n  ,\n  and\n\n\n\n\nafter polarity changes:",
        "G\n      s\n    \n    ⁡\n    \n      (\n      f\n      )\n    \n  \n  =\n  \n    \n      \n        1\n        \n          \n            M\n            2\n          \n          ⁢\n          \n            T\n            s\n            2\n          \n        \n      \n      ·\n      \n        \n          ∑\n          \n            n\n            =\n            \n              -\n              ∞\n            \n          \n          \n            +\n            ∞\n          \n        \n        ⁢\n        \n          \n        \n        ⁢\n        \n          (\n          \n            \n              \n                \n                \n                  \n                    \n                      1\n                      2\n                    \n                    ⁢\n                    \n                      \n                        ∑\n                        \n                          i\n                          =\n                          0\n                        \n                        \n                          M\n                          -\n                          1\n                        \n                      \n                      ⁢\n                      \n                        \n                          S\n                          i\n                        \n                        ⁡\n                        \n                          (\n                          \n                            n\n                            \n                              T\n                              s\n                            \n                          \n                          )\n                        \n                      \n                    \n                  \n                  +\n                  \n                    \n                      1\n                      2\n                    \n                    ⁢\n                    \n                      \n                        ∑\n                        \n                          j\n                          =\n                          0\n                        \n                        \n                          M\n                          -\n                          1\n                        \n                      \n                      ⁢\n                      \n                        \n                          S\n                          j\n                        \n                        ⁡\n                        \n                          (\n                          \n                            n\n                            \n                              T\n                              s\n                            \n                          \n                          )\n                        \n                      \n                    \n                  \n                \n                \n              \n              2\n            \n            ⁢\n            \n              δ\n              ⁡\n              \n                (\n                \n                  f\n                  -\n                  \n                    n\n                    \n                      T\n                      s\n                    \n                  \n                \n                )\n              \n            \n          \n          )\n        \n      \n    \n    +\n    \n      \n        1\n        \n          T\n          s\n        \n      \n      ⁢\n      \n        (\n        \n          \n            \n              ∑\n              \n                i\n                =\n                0\n              \n              \n                M\n                -\n                1\n              \n            \n            ⁢\n            \n              \n                1\n                M\n              \n              ·\n              \n                \n                  \n                  \n                    \n                      S\n                      i\n                    \n                    ⁡\n                    \n                      (\n                      f\n                      )\n                    \n                  \n                  \n                \n                2\n              \n            \n          \n          -\n          \n            \n              \n              \n                \n                  \n                    1\n                    M\n                  \n                  ⁢\n                  \n                    \n                      ∑\n                      \n                        i\n                        =\n                        0\n                      \n                      \n                        M\n                        -\n                        1\n                      \n                    \n                    ⁢\n                    \n                      \n                        1\n                        2\n                      \n                      ⁢\n                      \n                        \n                          S\n                          i\n                        \n                        ⁡\n                        \n                          (\n                          f\n                          )\n                        \n                      \n                    \n                  \n                \n                +\n                \n                  \n                    1\n                    M\n                  \n                  ⁢\n                  \n                    \n                      ∑\n                      \n                        j\n                        =\n                        0\n                      \n                      \n                        M\n                        -\n                        1\n                      \n                    \n                    ⁢\n                    \n                      \n                        1\n                        2\n                      \n                      ⁢\n                      \n                        \n                          S\n                          i\n                        \n                        ⁡\n                        \n                          (\n                          f\n                          )\n                        \n                      \n                    \n                  \n                \n              \n              \n            \n            2\n          \n        \n        )",
        "The symbols si+M are the symbols si with an opposite polarity. Hence Si+M=−Si for i from 0 to M−1.",
        "G\n              s\n            \n            ⁡\n            \n              (\n              f\n              )\n            \n          \n          =\n          \n            \n              \n                \n                  1\n                  \n                    \n                      M\n                      2\n                    \n                    ⁢\n                    \n                      T\n                      s\n                      2\n                    \n                  \n                \n                ·\n                \n                  1\n                  2\n                \n              \n              ⁢\n              \n                \n                  ∑\n                  \n                    n\n                    =\n                    \n                      -\n                      ∞\n                    \n                  \n                  \n                    +\n                    ∞\n                  \n                \n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  (\n                  \n                    \n                      \n                        \n                        \n                          \n                            ∑\n                            \n                              i\n                              =\n                              0\n                            \n                            \n                              M\n                              -\n                              1\n                            \n                          \n                          ⁢\n                          \n                            (\n                            \n                              \n                                \n                                  S\n                                  i\n                                \n                                ⁡\n                                \n                                  (\n                                  \n                                    n\n                                    \n                                      T\n                                      s\n                                    \n                                  \n                                  )\n                                \n                              \n                              -\n                              \n                                \n                                  S\n                                  i\n                                \n                                ⁡\n                                \n                                  (\n                                  \n                                    n\n                                    \n                                      T\n                                      s\n                                    \n                                  \n                                  )\n                                \n                              \n                            \n                            )\n                          \n                        \n                        \n                      \n                      2\n                    \n                    ⁢\n                    \n                      δ\n                      ⁡\n                      \n                        (\n                        \n                          f\n                          -\n                          \n                            n\n                            \n                              T\n                              s\n                            \n                          \n                        \n                        )\n                      \n                    \n                  \n                  )\n                \n              \n            \n            +\n            \n              \n                1\n                \n                  T\n                  s\n                \n              \n              ⁢\n              \n                (\n                \n                  \n                    \n                      ∑\n                      \n                        i\n                        =\n                        0\n                      \n                      \n                        M\n                        -\n                        1\n                      \n                    \n                    ⁢\n                    \n                      \n                        1\n                        M\n                      \n                      ·\n                      \n                        \n                          \n                          \n                            \n                              S\n                              i\n                            \n                            ⁡\n                            \n                              (\n                              f\n                              )\n                            \n                          \n                          \n                        \n                        2\n                      \n                    \n                  \n                  -\n                  \n                    \n                      \n                      \n                        \n                          1\n                          \n                            2\n                            ⁢\n                            M\n                          \n                        \n                        ⁢\n                        \n                          \n                            ∑\n                            \n                              i\n                              =\n                              0\n                            \n                            \n                              M\n                              -\n                              1\n                            \n                          \n                          ⁢\n                          \n                            (\n                            \n                              \n                                \n                                  S\n                                  i\n                                \n                                ⁡\n                                \n                                  (\n                                  f\n                                  )\n                                \n                              \n                              -\n                              \n                                \n                                  S\n                                  i\n                                \n                                ⁡\n                                \n                                  (\n                                  f\n                                  )\n                                \n                              \n                            \n                            )\n                          \n                        \n                      \n                      \n                    \n                    2\n                  \n                \n                )\n              \n            \n          \n        \n        ⁢\n        \n          \n\n        \n        ⁢\n        \n          \n            \n              G\n              s\n            \n            ⁡\n            \n              (\n              f\n              )\n            \n          \n          =\n          \n            \n              1\n              \n                M\n                ·\n                \n                  T\n                  s\n                \n              \n            \n            ⁢\n            \n              \n                ∑\n                \n                  i\n                  =\n                  0\n                \n                \n                  M\n                  -\n                  1\n                \n              \n              ⁢\n              \n                \n                  \n                    \n                    \n                      \n                        S\n                        i\n                      \n                      ⁡\n                      \n                        (\n                        f\n                        )\n                      \n                    \n                    \n                  \n                  2\n                \n                .\n              \n            \n          \n        \n      \n    \n    \n      \n        (\n        8\n        )",
        "From Equation (8), it appears that the spectrum of the signal is defined by the summation of the spectrum of the symbols. For example, if the symbols have the same waveform, the spectral properties of the signal are identical to the spectral properties of this waveform.",
        "That is the case for example for the PAM and PPM schemes. For the PPM, the same waveform is delayed in time, and for the PAM, the waveform is associated with different amplitudes in order to create the different symbols.",
        "Considering Equation (8), changing randomly the polarity from symbol to symbol provides an efficient way to shape the spectrum. The task of spectrum shaping of the signal is determined by the design of the symbol waveforms.",
        "Thus, the waveform of the symbol characterizes entirely the spectrum of the whole signal. If the spectrum of this waveform contains nulls, then the power spectral density function of the modulated signal gets the same nulls.",
        "For example, a TH sequence of four pulses constitutes the waveform of the symbol. The modulation is a 2 PPM. Thus, the Fourier transform of the TH sequence defines the power spectral density of the total signal. As well as their position or amplitude, the polarity of these four pulses can be used to shape the spectrum in order to create nulls in the spectrum.",
        "In the example of FIG. 24, the modulation scheme is PAM. A TH sequence constitute the symbols. The polarity is random from symbol to symbol. Thus, the polarity sequence for the pulses composing the TH sequence modifies the spectral characteristics of the signal. Furthermore, the symbol polarity randomization eliminates spectral lines as shown in FIG. 25.",
        "When the polarity changes from symbol to symbol and when the symbols have different waveforms, it appears from Equation (9) that the spectrum of the signal is defined by the sum of the spectrum of the symbols weighted by the probability of each symbol.",
        "G\n                  s\n                \n                ⁡\n                \n                  (\n                  f\n                  )\n                \n              \n              =\n              \n              ⁢\n              \n                \n                  \n                    \n                      1\n                      \n                        T\n                        s\n                        2\n                      \n                    \n                    ·\n                    \n                      1\n                      2\n                    \n                  \n                  ⁢\n                  \n                    \n                      ∑\n                      \n                        n\n                        =\n                        \n                          -\n                          ∞\n                        \n                      \n                      \n                        +\n                        ∞\n                      \n                    \n                    ⁢\n                    \n                      (\n                      \n                        \n                          \n                            \n                            \n                              \n                                ∑\n                                \n                                  i\n                                  =\n                                  0\n                                \n                                \n                                  M\n                                  -\n                                  1\n                                \n                              \n                              ⁢\n                              \n                                (\n                                \n                                  \n                                    \n                                      P\n                                      i\n                                    \n                                    ·\n                                    \n                                      \n                                        S\n                                        i\n                                      \n                                      ⁡\n                                      \n                                        (\n                                        \n                                          n\n                                          \n                                            T\n                                            s\n                                          \n                                        \n                                        )\n                                      \n                                    \n                                  \n                                  -\n                                  \n                                    \n                                      P\n                                      i\n                                    \n                                    ·\n                                    \n                                      \n                                        S\n                                        i\n                                      \n                                      ⁡\n                                      \n                                        (\n                                        \n                                          n\n                                          \n                                            T\n                                            s\n                                          \n                                        \n                                        )\n                                      \n                                    \n                                  \n                                \n                                )\n                              \n                            \n                            \n                          \n                          2\n                        \n                        ⁢\n                        \n                          δ\n                          ⁡\n                          \n                            (\n                            \n                              f\n                              -\n                              \n                                n\n                                \n                                  T\n                                  s\n                                \n                              \n                            \n                            )\n                          \n                        \n                      \n                      )\n                    \n                  \n                \n                +\n              \n            \n          \n        \n        \n          \n            \n              \n              ⁢\n              \n                \n                  1\n                  \n                    T\n                    s\n                  \n                \n                ⁢\n                \n                  (\n                  \n                    \n                      \n                        ∑\n                        \n                          i\n                          =\n                          0\n                        \n                        \n                          M\n                          -\n                          1\n                        \n                      \n                      ⁢\n                      \n                        \n                          P\n                          i\n                        \n                        ·\n                        \n                          \n                            \n                            \n                              \n                                S\n                                i\n                              \n                              ⁡\n                              \n                                (\n                                f\n                                )\n                              \n                            \n                            \n                          \n                          2\n                        \n                      \n                    \n                    -\n                    \n                      \n                        \n                        \n                          \n                            ∑\n                            \n                              i\n                              =\n                              0\n                            \n                            \n                              M\n                              -\n                              1\n                            \n                          \n                          ⁢\n                          \n                            (\n                            \n                              \n                                \n                                  P\n                                  i\n                                \n                                ·\n                                \n                                  \n                                    S\n                                    i\n                                  \n                                  ⁡\n                                  \n                                    (\n                                    f\n                                    )\n                                  \n                                \n                              \n                              -\n                              \n                                \n                                  P\n                                  i\n                                \n                                ·\n                                \n                                  \n                                    S\n                                    i\n                                  \n                                  ⁡\n                                  \n                                    (\n                                    f\n                                    )\n                                  \n                                \n                              \n                            \n                            )\n                          \n                        \n                        \n                      \n                      2\n                    \n                  \n                  )\n                \n              \n            \n          \n        \n        \n          \n            \n              =\n              \n              ⁢\n              \n                \n                  1\n                  \n                    T\n                    s\n                  \n                \n                ⁢\n                \n                  \n                    ∑\n                    \n                      i\n                      =\n                      0\n                    \n                    \n                      M\n                      -\n                      1\n                    \n                  \n                  ⁢\n                  \n                    \n                      P\n                      i\n                    \n                    ·\n                    \n                      \n                        \n                        \n                          \n                            S\n                            i\n                          \n                          ⁡\n                          \n                            (\n                            f\n                            )\n                          \n                        \n                        \n                      \n                      2\n                    \n                  \n                \n              \n            \n          \n        \n      \n    \n    \n      \n        (\n        9\n        )",
        "Thus, the waveforms of the symbols characterize entirely the spectrum of the whole signal. With a symbol polarity randomization, designing the spectrum of these waveforms is equivalent to designing the power spectral density function of the modulated signal. Furthermore, this symbol polarity randomization removes spectral lines.",
        "This symbol polarity randomization can also be used for other spreading sequences such as direct sequence spread spectrum (DSSS), and when the modulation format uses codewords such as M-ary orthogonal keying, M-ary bi-orthogonal keying, and complementary code keying (CCK) modulations, for example.",
        "Random Polarity of Sub-Structures of Symbols",
        "Here, the waveform of the symbol is a combination of several identical subwaveform dithered in time (PPM scheme). In addition, different pulse amplitude modulation (PAM) schemes can be applied. By changing randomly the polarity of these substructures, the power spectral density of the substructure is identical to the power spectral density of the symbol, and thus, of the total signal.",
        "The waveform of the symbol can also be a combination of several different subwaveforms, dithered in time. By changing randomly the polarity of these waveforms, the power spectral density of the symbol is an average of the power spectral density of these waveforms, and thus, of the entire signal.",
        "This mode can be used for the design of a TH sequence for multi-user detection with nulls at specific frequency in order to reduce interference with narrow band systems.",
        "This mode can also be used for other spreading sequences, such as direct sequence spread spectrum (DSSS), and when codewords are used for modulation such as M-ary orthogonal keying, M-ary bi-orthogonal keying, and complementary code keying (CCK) modulations.",
        "In the example shown in FIG. 26, the subwaveform is a grouping of two pulses with an opposite polarity. FIG. 27 shows a TH sequence composed of four subwaveforms with two grouped pulses each. As shown in FIG. 28, the power spectrum density for this TH sequence does not have spectral lines and contains nulls periodically. One is at 5 GHz, i.e., notch 2800, to avoid interference with the 802.11a standard.",
        "Hence, the random polarity reversal eliminates the spectral lines, shapes the continuous part of the spectrum, and enables a flexible design of a multi-user receiver. This subwaveform can be used to generate a TH sequence independently of the spectral characteristics of the symbols.",
        "Although the invention has been described by way of examples of preferred embodiments, it is to be understood that various other adaptations and modifications can be made within the spirit and scope of the invention. Therefore, it is the object of the appended claims to cover all such variations and modifications as come within the true spirit and scope of the invention."
    ],
    "citations": [
        "4351064",
        "5994973",
        "6107850",
        "6169670",
        "6563880",
        "6763057",
        "2002/0012145",
        "2003/0099280",
        "2004/0156444",
        "2004/0156504"
    ],
    "us_classification": "375295",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "04",
            "subclass": "L",
            "main_group": "27",
            "subgroup": "04"
        }
    ]
}