{
    "title": "Paper bulking promoter",
    "abstract": "This invention is to provide a paper bulking promoter with which a highly bulky sheet can be obtained without impairing paper strength. Namely, this invention provides a process for producing a bulky paper, comprising the step of making paper from pulp in the presence of a bulking promoter comprising a cationic compound.",
    "inventors": [
        "Ikeda",
        "Ishibashi",
        "Tadokoro",
        "Takahashi"
    ],
    "document_number": "07297229",
    "publication_date": "20071120",
    "assignees": [
        "KAO Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A process for producing a paper having a bulk density of more than 0.308 g/cm",
            "components": [
                {
                    "component": "obtaining a pulp slurry containing a virgin and/or a deiniced pulp that has been subjected to a deinicing process including both a floatation step and a washing step;",
                    "subcomponents": []
                },
                {
                    "component": "adding a cationic compound and a nonionic surfactant to the pulp slurry containing the virgin and/or the deiniced pulp and evenly blending the cationic compound and the nonionic surfactant with the pulp slurry containing the virgin and/or the deinked pulp; and",
                    "subcomponents": []
                },
                {
                    "component": "obtaining a paper having a bulk density of more than 0.308 g/cm",
                    "subcomponents": []
                },
                {
                    "component": "wherein the cationic compound is a cationic compound represented by formula (a",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The process of claim 1 , wherein the ratio by weight of said cationic compound to said at least one non-ionic surfactants represented by (A) to (C) is from 10/90 to 50/50.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The process of claim 1 , wherein the blended mixture of the cationic compound and the nonionic surfactant with the pulp slurry containing the virgin and/or the deinked pulp is subjected to a sheet-forming step as a part of said “obtaining a paper” step.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The process of claim 1 , wherein the virgin and/or the deinked pulp is a deinked pulp.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The process of claim 1 , wherein a produced pulp sheet of said bulky paper has a bulk density lower by at least 5% to that of a produced pulp sheet not containing the cationic compound and the nonionic surfactant.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The process of claim 5 , wherein the produced pulp sheet of said bulky paper has a tearing strength as measured according to JIS P8116 of at least 90% of that of the produced pulp sheet not containing the cationic compound and the nonionic surfactant.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A process for producing a paper having a bulk density of more than 0.308 g/cm",
            "components": [
                {
                    "component": "obtaining a pulp slurry containing a virgin and/or a deinked pulp that has been subjected to a deinking process including both a floatation step and a washing step;",
                    "subcomponents": []
                },
                {
                    "component": "adding a cationic compound and a nonionic surfactant to the pulp slurry containing the virgin and/or the deinked pulp and evenly blending the cationic compound and the nonionic surfactant with the pulp slurry containing the virgin and/or the deinked pulp; and",
                    "subcomponents": []
                },
                {
                    "component": "obtaining a paper having a bulk density of more than 0.308 g/cm",
                    "subcomponents": []
                },
                {
                    "component": "wherein the cationic compound is a cationic compound represented by formula (a",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The process of claim 7 , wherein the ratio by weight of said cationic compound to said at least one non-ionic surfactants represented by (A) to (C) is from 10/90 to 50/50.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The process of claim 7 , wherein the blended mixture of the cationic compound and the nonionic surfactant with the pulp slurry containing the virgin and/or the deinked pulp is subjected to a sheet-forming step as a part of said “obtaining a paper” step.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The process of claim 3 or 9 , wherein said step of “obtaining a paper” includes as a part thereof a step of pressing a sheet-formed paper with a press.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The process of claim 1 or 7 , wherein the cationic compound and the nonionic surfactant are added in a combined amount of 0.01 to 5 wt % based on the weight of the virgin and/or the deinked pulp.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The process of claim 1 or 7 , wherein the cationic compound and the nonionic surfactant are added in a combined amount of 0.01 to 3 wt % based on the weight of the virgin and/or the deinked pulp.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The process of claim 1 or 7 , wherein the cationic compound and the nonionic surfactant are added in a combined amount of 3 to 10 wt % based on the weight of the virgin and/or the deinked pulp.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The process of claim 1 or 7 , wherein the cationic compound and the nonionic surfactant are added in a combined amount of 3 wt % based on the weight of the virgin and/or the deinked pulp.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The process of claim 1 or 7 , wherein said step of “obtaining a paper” includes as a part thereof a step of adjusting a pulp slurry's pH with aluminum sulfate.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The process of claim 1 or 7 , wherein said step of “obtaining a paper” includes as a part thereof a step of drying a paper with a drum dryer.",
            "components": []
        }
    ],
    "description": [
        "This application is a divisional part of application Ser. No. 09/957,184, filed on Sep. 21, 2001, now U.S. Pat. No. 6,576,085 B2, which is a divisional of application Ser. No. 09/224,804 filed on Dec. 31, 1998, now U.S. Pat. No. 6,346,169 B1, for which priority is claimed under 35 U.S.C. § 120. This application also claims priority of Application No. 10-4877 filed in Japan on Jan. 13, 1998 under 35 U.S.C. § 119. The entire contents of each of these applications is hereby incorporated by reference.",
        "1. Technical Field",
        "This invention relates to a paper bulking promoter with which the sheets of paper obtained from a pulp feedstock can be bulky without impairing paper strength.",
        "2. Description of the Prior Art",
        "Recently, there is a desire for high-quality paper, e.g., paper excellent in printability and voluminousness. Since the printability and voluminousness of paper are closely related to the bulkiness thereof, various attempts have been made to improve bulkiness. Examples of such attempts include a method in which a crosslinked pulp is used (JP-A 4-185792, etc.) and a method in which a mixture of pulp with synthetic fibers is used as a feedstock for papermaking (JP-A 3-269199, etc.). Examples thereof further include a method in which spaces among pulp fibers are filled with a filler such as an inorganic (JP-A 3-124895, etc.) and a method in which spaces are formed (JP-A 5-230798, etc.). On the other hand, with respect to mechanical improvements, there is a report on an improvement in calendering, which comprises conducting calendering under milder conditions (JP-A 4-370298).",
        "However, the use of a crosslinked pulp, synthetic fibers, etc. makes pulp recycling impossible, while the technique of merely filling pulp fiber spaces with a filler and the technique of forming spaces result in a considerable decrease in paper strength. Furthermore, the improvement in mechanical treatment produces only a limited effect and no satisfactory product has been obtained so far.",
        "Also known is a method in which a bulking promoter is added during papermaking to impart bulkiness to the paper. Although fatty acid polyamide polyamines for use as such bulking promoters are on the market, use of these compounds results in a decrease in paper strength and no satisfactory performance has been obtained therewith.",
        "The inventors have made intensive investigations in view of the problems described above. As a result, they have found that by incorporating at least one compound selected among specific cationic compounds, amine compounds, acid salts of amine compounds, amphoteric compounds, amide compounds, quaternary ammonium salts, and imidazoline derivatives optionally together with at least one specific nonionic surfactant into a pulp feedstock, e.g., a pulp slurry, in the papermaking step, the sheet made from the feedstock can have improved bulkiness without detriment to paper strength. This invention has thus been achieved.",
        "Namely, this invention provides a process for producing a bulky paper, comprising the step of making paper from pulp in the presence of a bulking promoter comprising at least one compound selected from the group consisting of a cationic compound, an amine compound, an acid salt of an amine compound, an amphoteric compound, an amide compound, a quaternary ammonium salt, and an imidazoline derivative.",
        "The term “paper bulking promoter” used herein means an agent with which a sheet of paper obtained from a pulp feedstock can have a larger thickness (can be bulkier) than that having the same basis weight obtained from the same amount of a pulp feedstock.",
        "Examples of the cationic compounds for use in this invention include compounds represented by the following formulae (a1) and (b1):",
        "wherein R11 and R12 are the same as or different from each other, and an alkyl, alkenyl or β-hydroxyalkyl group having 8 to 24 carbon atoms; R13, R14 and R15 are the same as or different from each other, and an alkyl or hydroxyalkyl group having 1 to 8 carbon atoms, benzyl or -(AO)n11-Z11, wherein AO is an oxyalkylene unit having 2 or 3 carbon atoms, Z11 is a hydrogen atom or an acyl group and n11 is an integer of 1 to 50; R16 is an alkyl, alkenyl or β-hydroxyalkyl group having 8 to 36 carbon atoms; and X− is an anionic ion.",
        "In the formula (a1), R11 and R12, which are the same or different, each preferably is an alkyl or alkenyl group having 10 to 22 carbon atoms. R13 and R14, which are the same or different, each preferably is a hydrogen atom or an alkyl group having 1 to 3 carbon atoms. Examples of X−, which is an anionic ion, include hydroxy, halide, and monoalkyl(C1-C3)sulfate ions and anions derived from inorganic or organic acids. X− is preferably a halide ion, especially Cl−.",
        "In the formula (b1), R13, R14, and R15, which are the same or different, each is preferably an alkyl group having 1 to 3 carbon atoms or a benzyl group. R16 is preferably an alkyl group having 10 to 22 carbon atoms. Examples of the anionic ion X− are the same as those in the formula (a1). X− is preferably a halide ion, especially Cl−.",
        "In the present invention, the cationic compounds may include quaternary ammonium salts.",
        "Hereinafter X− may be an anionic ion as an anionic ion.",
        "Examples of the amine compounds and the acid salts of amine compounds for use in this invention include compounds represented by the following formulae (a2) to (f2):",
        "wherein R21 is an alkyl, alkenyl or β-hydroxyalkyl group having 8 to 36 carbon atoms; R22 and R23 are the same as or different from each other, and a hydrogen atom, an alkyl group having 1 to 24 carbon atoms or an alkenyl group having 2 to 24 carbon atoms; R24 and R25 are the same as or different from each other, and a hydrogen atom or an alkyl group having 1 to 3 carbon atoms; HB represents an inorganic acid or an organic acid; AO is an oxyalkylene unit having 2 or 3 carbon atoms; l21 and m21 are 0 or a positive integer, and the sum in total of l21, and m21 is in an integer ranging from 1 to 300; and n21 is a number of 1 to 4.",
        "In the formulae (a2) to (f2), R21 is preferably an alkyl group having 10 to 22 carbon atoms. R22 and R23, which are the same or different, each preferably is a hydrogen atom or an alkyl group having 1 to 22 carbon atoms. In HB in the acid salts of amine compounds, B is preferably a halogen or a carboxylate having 2 to 5 carbon atoms, especially preferably a carboxylate having 2 or 3 carbon atoms. Preferred amine compounds and preferred acid salts of amine compounds are the compounds represented by the formulae (a2) and (b2), respectively.",
        "The acid salt represented by the formula (b2) may be signified by the following formula (b21):",
        "wherein R21, R22 and R23 are same as above-mentioned; H is hydrogen atom; and B− represents a base.",
        "That is, the acid salt may be an ionized compound.",
        "Examples of the amphoteric compounds for use in this invention include compounds represented by the following formulae (a3) to (j3):",
        "wherein R31, R32 and R33 are the same as or different from each other, and an alkyl group having 1 to 24 carbon atoms or an alkenyl group having 2 to 24 carbon atoms; R34 is an alkyl, alkenyl or β-hydroxyalkyl group having 8 to 36 carbon atoms; M is a hydrogen atom, an alkali metal atom, a half a mole of an alkaline earth metal atom or an ammonium group; Y31 is R35NHCH2CH2—, wherein R35 is an alkyl group having 1 to 36 carbon atoms, or an alkenyl or a hydroxy alkyl group having 2 to 36 carbon atoms; Y32 is a hydrogen atom or R35NHCH2CH2—, R35 being defined above; Z31 is —CH2COOM, M being defined above; and Z32 is a hydrogen atom or —CH2COOM, M being defined above.",
        "In the formulae (a3) to (j3), R31, R32, and R33, which are the same or different, each preferably is an alkyl group having 1 to 22 carbon atoms. Especially preferably, R31 is an alkyl group having 10 to 20 carbon atoms, and R32 and R33 each is an alkyl group having 1 to 3 carbon atoms. R34 is preferably an alkyl group having 10 to 22 carbon atoms. Preferred amphoteric compounds are those represented by the formulae (a3) and (b3).",
        "Examples of the other amine compounds and the other acid salts of an amine compound for use in this invention include compounds represented by the following formulae (a4) to (d4):",
        "wherein R41 is an alkyl, alkenyl or β-hydroxyalkyl having 8 to 35 carbon atoms; R43 and R44 are same as or different from each other, an alkyl, alkenyl or β-hydroxyalkyl group having 7 to 35 carbons atoms; R46 is a hydrogen atom or an alkyl group having 1 to 3 carbon atoms; R45 is an alkyl group having 1 to 3 carbon atoms; R42 is a hydrogen atom or R47, wherein R47 is an alkyl, alkenyl or β-hydroxyalkyl group having 7 to 35 carbons atoms; Y41 is a hydrogen or —COR44; and Z41 is —CH2CH2O(AO)n41—OCOR47, wherein A is a liner or branched alkylene unit having 2 to 3 carbon atoms, or —CH2CH(OH)—CH2OCOR47 and n41 is an average added-number ranging 1 to 20.",
        "Examples of the amide compounds for use in this invention include compounds represented by the following formulae (a5) and (b5):",
        "wherein R51 and R54 are same as or different from each other, an alkyl, alkenyl or β-hydroxyalkyl group having 7 to 35 carbon atoms; R52 and R53 are same as or different from each other, a hydrogen atom or an alkyl group having 1 to 3 carbon atoms; and Y51 and Y52 are same as or different from each other, and a hydrogen atom, R52CO—, R54CO—, —(AO)n51—COR55, wherein A is a liner or branched alkylene unit having 2 to 3 carbon atoms n51 is an average added-number ranging 1 to 20, and R55 is an alkyl, alkenyl or β-hydroxyalkyl group having 7 to 35 carbon atoms, or —(AO)n51—H, wherein A and n51 are defined above.",
        "Examples of the cationic compounds for use in this invention include quaternary ammonium salts represented by the following formulae (a6) and (b6):",
        "wherein R61 and R63 are same as or different from each other, an alkyl, alkenyl or β-hydroxyalkyl group having 7 to 35 carbons atoms; R65 is a hydrogen atom or an alkyl group having 1 to 3 carbon atoms; R62 and R64 are same as or different from each other, an alkyl group having 1 to 3 carbon atoms; and X− is an anionic ion.",
        "Examples of the imidazoline derivative for use in this invention include compounds represented by the following formulae (a7):",
        "wherein R71 is an alkyl, alkenyl or β-hydroxyalkyl group having 7 to 35 carbons atoms.",
        "The paper bulking promoter of this invention preferably further contains at least one specific nonionic surfactant. By the use of at least one of compounds represented by the above formulae (a1) and (b1), (a2) to (e2), (a3) to (h3), (a4) to (d4), (a5) and (b5), (a6) and (b6), and (a7); and at least one specific nonionic surfactant in combination, the effect of this invention can be improved. Examples of the nonionic surfactant for use in this invention include the following (A) to (C).",
        "(A): a compound represented by the following formula (A)\n\nR81O (EO)m81(PO)n81H  (A)\n\nwherein R81 is a C6 to C22 straight or branched alkyl or alkenyl group or an alkylaryl group having a C4 to C20 alkyl group; E is an ethylene unit; P is a propylene unit; m81 and n81 are an average number of added moles, m81 is a number in the range of 0 to 20 and n81 is a number in the range of 0 to 50; and the addition form of EO and PO may be any of block and random and the addition order of EO and PO may be not limited.",
        "The compounds represented by the formula (A) are ones each obtained by causing a higher alcohol, an alkylphenol, or the like in which the alkyl has 6 to 22 carbon atoms to add an alkylene oxide such as ethylene oxide (EO) or propylene oxide (PO). In this invention is used the compound in which the average number of moles of ethylene oxide added is in the range of 0≦m81≦20. The range of the average number of moles added, m81, is preferably 0≦m81≦10, more preferably 0≦m81≦5. If m81 exceeds 20, the effect of imparting bulkiness to paper is lessened. Further, the compound used is one in which the average number of moles of propylene oxide (PO) added, n81, is in the range of 0≦n81≦50, preferably 0≦n81≦20. When n81 exceeds 50, such a compound is economically disadvantageous although the decrease in performance is little.",
        "R81 in the formula (A) is preferably a linear or branched, alkyl or alkenyl group having 8 to 18 carbon atoms. If R81 in the formula (A) is an alkyl or alkenyl group in which the number of carbon atoms is outside the range of from 6 to 22 or if R81 is an alkylaryl group in which the number of carbon atoms of the alkyl group is outside the range of from 4 to 20, then the compound is less effective in imparting bulkiness to paper.",
        "Examples of E and P in the formula (A), which each represents a linear or branched alkylene group having 2 or 3 carbon atoms, include ethylene and propylene. When the group (EO)m81(PO)n81 in the formula (A) is composed of a combination of polyoxyethylene and polyoxypropylene, the C2H4O and C3H6O units may have any of random and block arrangements (or the addition form of EO and PO may be any of block and random). In this case, the polyoxypropylene (C3H6O) group(s) account for preferably at least 50 mol %, especially preferably at least 70 mol %, of all groups added on the average. The alkylene oxide group bonded to R may begin with any of EO and PO (or the addition order of EO and PO may be not limited).",
        "(B): Compounds represented by the following formula (B)\n\nR81COO (EO)m81(PO)n81Rb  (B)\n\nwherein R81, E, P, m81 and n81 are the same as those of the formula (A); and Rb is H, an alkyl, an alkenyl or an alkylaryl group.",
        "Preferred examples of R81, E, P, m81, and n81 in the formula (B) are the same as those in the formula (A). Examples of the alkyl and alkenyl groups represented by Rb in the formula (B) include those having 1 to 4 carbon atoms, while examples of the alkylaryl group represented by Rb include alkylphenyl groups in each of which the alkyl has 1 to 4 carbon atoms.",
        "(C): a nonionic surfactant selected from the followings (1) to (3):",
        "(1) an oil-fat type nonionic surfactant (i.e. a ninionic surfactant based on fat),\n    (2) a sugar-alcohol type nonionic surfactant (i.e. a nonionic surfactant based on sugar alcohol) and\n    (3) a sugar-type nonionic surfactant (i.e. a nonionic surfactant based on sugar).\n\n(1) Nonionic Surfactants Based on Fat",
        "Examples of the nonionic surfactants based on a fat (1) include ones obtained by mixing an alcohol having 1 to 14 hydroxy groups with a fat such as those given in, e.g., JP-A 4-352891 or with a product of the reaction of the fat with glycerol and causing the mixture to add an alkylene oxide (AO) Preferred is one obtained by causing a mixture of a fat and a polyhydric alcohol to add an AO. The AO is ethylene oxide (EO) and/or propylene oxide (PO). In the case of using both EO and PO, the EO/PO polymer may have any of random and block arrangements. The average number of moles of EO added is preferably 0 to 200, more preferably 10 to 100, while that of PO added is preferably 0 to 150, more preferably 2 to 100.",
        "Examples of the fat usable for this type of nonionic surfactant include land animal fats, marine animal fats, hardened or semihardened oils obtained therefrom, and recovery oils obtained during the purification of these fats. Preferred examples thereof include coconut oil, beef tallow, fish oils, linseed oil, rapeseed oil, and castor oil. In the case where any of these fats is reacted beforehand with glycerol, the fat/glycerol ratio is preferably from 1/0.05 to 1/1.",
        "Examples of monohydric alcohols among the alcohols having 1 to 14 hydroxy groups usable for this type of nonionic surfactant include linear or branched, saturated or unsaturated alcohols having 1 to 24 carbon atoms and cyclic alcohols. Preferred are linear or branched, saturated alcohols having 4 to 12 carbon atoms. Examples of dihydric alcohols include α,ω-glycols having 2 to 32 carbon atoms, 1,2-diols, symmetric α-glycols, and cyclic 1,2-diols. Preferred are α,ω-glycols having 2 to 6 carbon atoms. Examples of trihydric and higher alcohols include those having 3 to 24 carbon atoms, such as glycerol, diglycerol, sorbitol, and stachyose. Especially preferred alcohols are di- to hexahydric alcohols having 2 to 6 carbon atoms.",
        "(2) Nonionic Surfactants Based on Sugar Alcohol",
        "Examples of the nonionic surfactants based on a sugar alcohol (2) include sugar alcohol/AO adducts, fatty acid esters of sugar alcohol/AO addicts, and fatty acid esters of sugar alcohols. The sugar alcohol as a component of a nonionic surfactant based on a polyhydric alcohol is an alcohol obtained from a monosaccharide having 3 to 6 carbon atoms through reduction of the aldehyde or ketone group. Examples thereof include glycerol, erythritol, arabitol, sorbitol, and mannitol. Especially preferred are those having 6 carbon atoms. The fatty acid as a component of the fatty acid ester in a sugar alcohol/AO adduct may be any of saturated and unsaturated fatty acids each having 1 to 24, preferably 12 to 18, carbon atoms. Preferred is oleic acid. With respect to the degree of esterification of the sugar alcohol, the number of OH groups which have undergone esterification may be any of from zero to all of the OH groups. However, the degree of esterification is preferably 1 to 3. The kinds of AO and the average number of moles of AO added are the same as in (1).",
        "(3) Nonionic Surfactants Based on Sugar",
        "Examples of the nonionic surfactants based on a sugar (3) include sugar/AO adducts, fatty acid esters of sugar/AO adducts, and sugar/fatty acid esters. The sugar may be a polysaccharide such as sucrose, besides any of the monosaccharides mentioned above with regard to the sugar alcohol. Preferred are glucose and sucrose. The kinds of AO and the average number of moles of AO added are the same as in (1). Especially preferred of the nonionic surfactants based on a sugar (3) are sugar/AO adducts, in particular, glucose/PO adducts in which the average number of moles of PO added is 1 to 10.",
        "When at least one compound (i) selected among cationic compounds, amine compounds, acid salts of amine compounds, amphoteric compounds, amide compounds, quaternary ammonium salts, and imidazoline derivatives is used in combination with at least one nonionic surfactant (ii) such as the compounds (A) to (C) described above, the proportion of the compound (i) to the nonionic surfactant (ii) is from 100/0 to 1/99, preferably from 100/0 to 10/90 by weight.",
        "The compounds (i) and (ii) maybe added either as a mixture of both or separately.",
        "The bulking promoter of this invention is applicable to a variety of ordinary pulp feedstocks ranging from virgin pulps such as mechanical pulps and chemical pulps to pulps prepared (deinked) from various waste papers. The point where the bulking promoter of this invention is added is not particularly limited as long as it is within the papermaking process steps. In a factory, for example, the bulking promoter is desirably added at a point where it can be evenly blended with a pulp feedstock, such as, the refiner, machine chest, or headbox. After the bulking promoter of this invention is added to a pulp feedstock, the resultant mixture is subjected as it is to sheet forming. The bulking promoter remains in the paper. The paper bulking promoter of this invention is added in an amount of 0.01 to 10 wt. %, preferably 0.1 to 5 wt. %, based on the pulp.",
        "The pulp sheet obtained by using the paper bulking promoter of this invention has a bulk density (the measurement method is shown in the Examples given later) lower by desirably at least 5%, preferably at least 7% than the product not containing the paper bulking promoter and has a tearing strength as measured according to JIS P 8116 of desirably at least 90%, preferably at least 95% of that of the product.",
        "This invention will be explained below in more detail by reference to Examples, but the invention should not be construed as being limited thereto. In the Examples, all parts and percents are based on weight unless otherwise indicated.",
        "When the unit number of an (AO) group is, defined by an integer, the compound is one of a mixture of reaction products. When it is defined by an average value, the compound is a mixture of reaction products.",
        "[Pulp Feedstocks]",
        "The deinked pulp and virgin pulp shown below were used as pulp feedstocks.",
        "<Deinked Pulp>",
        "A deinked pulp was obtained in the following manner. To feedstock waste papers collected in the city (newspaper/leaflet=70/30%) were added warm water, 1% (based on the feedstock) of sodium hydroxide, 3% (based on the feedstock) of sodium silicate, 3% (based on the feedstock) of a 30% aqueous hydrogen peroxide solution, and 0.3% (based on the feedstock) of EO/PO block adduct of beef tallow/glycerol (1:1), as a deinking agent, in which the amounts of EO and PO were respectively 70 and 10 (average number of moles added). The feedstock was disintegrated and then subjected to flotation. The resultant slurry was washed with water and regulated to a concentration of 1% to prepare a deinked pulp (DIP) slurry. This DIP had a freeness of 220 ml.",
        "<Virgin Pulp>",
        "A virgin pulp was prepared by disintegrating and beating an LBKP (bleached hardwood pulp) with a beater at room temperature to give a 1% LBKP slurry. This LBKP had a freeness of 420 ml.",
        "[Bulking Promoters]",
        "The cationic compounds, amine compounds, acids salts of amine compounds, and amphoteric compounds shown in Tables 1 to 5 were used optionally together with the nonionic surfactants shown in Table 6 in the combinations shown in Tables 7 and 8, which will be given later.",
        "TABLE 1\n\n\n\n\n\n\n\n\n\nCompound\nStructure in the formula (a1)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNo.\nR11\nR12\nR13\nR14\nX−\n\n\n\n\n\n\n\nCationic\n\n\n\n\n\n\n\n\nCompound\n\n\n\nA-1\nC18\nC18\nC1\nC1\nCl−\n\n\n\nA-2\nC12\nC14\nC1\nC1\nCl−\n\n\n\na-1\nC2 \nC2 \nC1\nC1\nCl−\n\n\n\na-2\nC4 \nC4 \nC1\nC1\nBr−",
        "TABLE 2\n\n\n\n\n\n\n\n\n\nCompound\nStructure in the formula (b1)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNo.\nR13\nR14\nR15\nR16\nX−\n\n\n\n\n\n\n\nCationic\n\n\n\n\n\n\n\n\nCompound\n\n\n\nB-1\nC1\nC1\nC1\nC12\nCl−\n\n\n\nB-2\nC1\nC1\nC1\nC16\nBr−\n\n\n\nB-3\nC1\nC1\nC1\nC18\nCl−\n\n\n\nB-4\nbenzyl\nC1\nC1\nC12\nCl−\n\n\n\nb-1\nC1\nC1\nC1\nC2 \nCl−\n\n\n\nb-2\nC1\nC1\nC1\nC4 \nBr−",
        "TABLE 3\n\n\n\n\n\n\n\nCompound\nStructure in the formula (a2) or (b2)\n\n\n\n\n\n\n\n\n\n\n\nNo.\nR21\nR22\nR23\nHB\n\n\n\n\n\nAmine compound\n\n\n\n\n\n\nand acid salt of\n\n\namine compound\n\n\nC-1\nC12\nH\nH\n—\n\n\nC-2\nC18\nH\nH\n—\n\n\nC-3\nC16/C18 =\nC16/C18 =\nH\n—\n\n\n\n3/7\n3/7\n\n\n\nC-4\nC18\nC1\nC1\n—\n\n\nc-1\nC4 \nH\nH\n—\n\n\nc-2\nC6 \nH\nH\n—\n\n\nc-3\nC2 \nC2\nH\n—\n\n\nc-4\nC4 \nC1\nC1\n—\n\n\nC-5\nC16/C18 =\nH\nH\nCH3COOH\n\n\n\n3/7\n\n\n\nc-5\nC4 \nH\nH\nCH3COOH",
        "TABLE 4\n\n\n\n\n\n\n\n\n\n\nStructure in the\n\n\n\nCompound\nformula (a3)\n\n\n\n\n\n\n\n\n\n\n\n\nNo.\nR31\nR32\nR33\n\n\n\n\n\n\n\nAmphoteric\n\n\n\n\n\n\ncompound\n\n\n\nD-1\nC12\nC1\nC1\n\n\n\nd-1\nC4 \nC1\nC1",
        "TABLE 5\n\n\n\n\n\n\n\n\n\n\nStructure in the formula\n\n\n\nCompound\n(b3)\n\n\n\n\n\n\n\n\n\n\n\n\nNo.\nR31\nR32\nR33\n\n\n\n\n\n\n\nAmphoteric\n\n\n\n\n\n\ncompound\n\n\n\nD-2\nC12\nC1\nC1\n\n\n\nD-3\nC18\nC1\nC1\n\n\n\nd-2\nC6 \nC1\nC1",
        "TABLE 6\n\n\n\n\n\n\n\n\n\n\n(1)/(2)/(3)\n\n\n\nNonionic surfactant\nWeight\n\n\n\n\n\n\n\n\n\n\n\nNo.\n(1)\n(2)\n(3)\nratio\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\nC12 alcohol\n\n\n100/0/0\n\n\n2\nC12/C14 alcohol = 5/5\n\n\n100/0/0\n\n\n\nPO = 5\n\n\n\n3\nBeef tallow/fatty acid,\n\n\n100/0/0\n\n\n\nPO = 5\n\n\n\n4\nMethyl laurate,\n\n\n100/0/0\n\n\n\nEO2/PO3 block\n\n\n\n5\nCoconut\n\n\n100/0/0\n\n\n\noil/glycerol = 1/1,\n\n\n\n\nEO2/PO10 block\n\n\n\n6\nSorbitan monooleate,\n\n\n100/0/0\n\n\n\nEO20\n\n\n\n7\nDobanol23 EO2/PO4\nSorbitan\n\n75/25/0 \n\n\n\nrandom\nmonooleate, EO10\n\n\n\n8\nC12 alcohol\nSorbitan\nHardened\n80/15/5 \n\n\n\n\nmonooleate, EO15\ncastor oil,\n\n\n\n\n\n\nEO25\n\n\n\n9\nC18 alcohol, PO = 10\n\n\n100/0/0\n\n\n10\nCastor oil/fatty acid,\n\n\n100/0/0\n\n\n\nEO5/PO15 random\n\n\n\n11\nC12/C14/C18\nC12 alcohol EO = 5\nFish oil/\n75/15/10\n\n\n\nalcohol = 6/2/2, PO = 10\n\nsorbitol = 1/1,\n\n\n\n\n\n\nPO = 15\n\n\n\n12\nBeef tallow/glycerol =\n\n\n100/0/0\n\n\n\n1/0.3 EO10/PO10 block\n\n\n\n13\nSorbitan monolaurate,\n\n\n100/0/0\n\n\n\nEO15\n\n\n\n14\nC12/C14/C18\nlauric acid EO5,\n\n90/10/0 \n\n\n\nalcohol = 60/30/10,\nPO25\n\n\n\n\nPO20\n\n\n\n15\nC12/C14 alcohol = 70/30\n\n\n100/0/0\n\n\n16\nLauric acid/stearic\n\n\n100/0/0\n\n\n\nacid = 50/50, PO = 18\n\n\n\n17\nDobanol23, PO = 2\nlauric acid/myristic\nSorbitan\n70/15/15\n\n\n\n\nacid/palmitic acid =\ntrioleate EO6\n\n\n\n\n\n70/20/10. EO10,\n\n\n\n\n\nPO20\n\n\n\n\n\n(Note) In the table, Cn means an alkyl group having n carbon atoms. In Table 6, each fat/polyhydric alcohol ratio is by mole, and the other ratios are by weight. EO and PO mean ethylene oxide and propylene oxide, respectively, and the numbers following these are the average numbers of moles added. “Dobanol 23” is an alcohol manufactured by Mitsubishi Chemical.\n\n\n\n\n\n\n[Papermaking Method]",
        "Each of the above 1% pulp slurries was weighed out in such an amount as to result in a sheet of paper having a basis weight of 60 g/m2. The pH thereof was adjusted to 4.5 with aluminum sulfate. Subsequently, various bulking promoters shown in Tables 7 and 8 were added in an amount of 3% based on the pulp. Each resultant mixture was formed into a sheet with a rectangular TAPPI paper machine using an 80-mesh wire. The sheet obtained was pressed with a press at 3.5 kg/cm2 for 2 minutes and dried with a drum dryer at 105° C. for 1 minute. After each dried sheet was held under the conditions of 20° C. and a humidity of 65% for 1 day to regulate its moisture content, it was evaluated for bulk density as a measure of paper bulkiness and for tearing strength as a measure of paper strength performance. The results obtained are shown in Tables 7 and 8. Ten found values were averaged.",
        "<Evaluation Item and Method>",
        "Bulkiness (Bulk Density)",
        "The basis weight (g/m2) and thickness (mm) of each sheet having a regulated moisture content were measured, and its bulk density (g/cm3) was determined as a calculated value.",
        "Equation for calculation:\n\nBulkiness (Bulk Density)=(basis weight)/(thickness)×0.001",
        "The smaller the absolute value of bulk density, the higher the bulkiness. A difference of 0.02 in bulk density is sufficiently recognized as a significant difference.",
        "Paper Strength (Tearing Strength)",
        "Each sheet having a regulated moisture content was examined according to JIS P 8116 (Testing Method for Tearing Strength of Paper and Paperboard).",
        "Equation for calculation:\n\nTearing strength=A/S×16\n\n    \n    \n        Tearing strength: (gf)\n        A: Reading\n        S: Number of torn sheets",
        "The larger the absolute value of tearing strength, the higher the paper strength. A difference of 20 gf in tearing strength is sufficiently recognized as a significant difference.",
        "TABLE 7\n\n\n\n\n\n\n\n\n\nCationic\n\n\n\n\n\n\n\ncompound, amine\n\n\n\n\ncompound, acid\nNonionic\n\nDeinked\n\n\n\n\nsalt of amine\nsurfactant\n\npulp\nLBKP\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncompound, of\nused in\n\nBulk\nTearing\nBulk\nTearing\n\n\n\namphoteric\ncombination\n(i)/(ii)\ndensity\nstrength\ndensity\nstrength\n\n\nExample\ncompound (i)\n(ii)\nweight ratio\n(g/cm3)\n(gf)\n(g/cm3)\n(gf)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\nB-1\nnone\n—\n0.330\n420\n0.377\n480\n\n\n2\nB-2\n↑\n—\n0.328\n420\n0.376\n480\n\n\n3\nB-3\n↑\n—\n0.325\n415\n0.374\n475\n\n\n4\nB-4\n↑\n—\n0.330\n415\n0.378\n480\n\n\n5\nA-1\n↑\n—\n0.325\n420\n0.375\n475\n\n\n6\nA-2\n↑\n—\n0.330\n420\n0.377\n480\n\n\n7\nC-1\n↑\n—\n0.342\n430\n0.385\n485\n\n\n8\nC-2\n↑\n—\n0.340\n430\n0.383\n485\n\n\n9\nC-3\n↑\n—\n0.338\n425\n0.383\n480\n\n\n10\nC-4\n↑\n—\n0.335\n420\n0.379\n480\n\n\n11\nC-5\n↑\n—\n0.332\n420\n0.377\n480\n\n\n12\nD-1\n↑\n—\n0.331\n415\n0.377\n475\n\n\n13\nD-2\n↑\n—\n0.331\n415\n0.377\n475\n\n\n14\nD-3\n↑\n—\n0.328\n420\n0.375\n475\n\n\n15\nB-1\n1\n20/80\n0.313\n410\n0.349\n470\n\n\n16\nB-3\n2\n30/70\n0.308\n400\n0.342\n460\n\n\n17\nB-3\n3\n50/50\n0.309\n405\n0.344\n455\n\n\n18\nB-3\n4\n85/15\n0.312\n410\n0.346\n460\n\n\n19\nB-3\n5\n90/10\n0.314\n410\n0.349\n465\n\n\n20\nA-1\n6\n85/15\n0.309\n400\n0.345\n460\n\n\n21\nB-4\n7\n30/70\n0.310\n405\n0.345\n455\n\n\n22\nB-3\n8\n20/80\n0.308\n400\n0.341\n460\n\n\n23\nC-2\n9\n65/35\n0.324\n410\n0.360\n470\n\n\n24\nC-3\n10\n80/20\n0.323\n415\n0.358\n470\n\n\n25\nC-4\n11\n10/90\n0.317\n415\n0.355\n465\n\n\n26\nC-5\n12\n70/30\n0.321\n410\n0.357\n465\n\n\n27\nC-5\n13\n55/45\n0.322\n415\n0.357\n470\n\n\n28\nC-5\n14\n20/80\n0.319\n415\n0.356\n465\n\n\n29\nD-1\n15\n15/85\n0.314\n410\n0.348\n460\n\n\n30\nD-3\n16\n80/20\n0.312\n405\n0.345\n460\n\n\n31\nD-3\n17\n35/65\n0.308\n400\n0.342\n455",
        "TABLE 8\n\n\n\n\n\n\n\n\n\nCationic compound,\n\n\n\n\n\n\namine compound,\n\n\n\n\nacid salt of amine\n\n\n\n\ncompound, or\nNonionic\nDeinked pulp\nLBKP\n\n\n\n\n\n\n\n\n\n\n\n\n\n\namphoteric\nsurfactant used in\nBulk density\nTearing strength\nBulk density\nTearing strength\n\n\nExample\ncompound (i)\ncombination (ii)\n(g/cm3)\n(gf)\n(g/cm3)\n(gf)\n\n\n\n\n\n32\nb-1\nnone\n0.366\n440\n0.405\n495\n\n\n33\nb-2\n↑\n0.365\n440\n0.402\n485\n\n\n34\na-1\n↑\n0.365\n435\n0.404\n490\n\n\n35\na-2\n↑\n0.366\n430\n0.405\n490\n\n\n36\nc-1\n↑\n0.367\n435\n0.404\n495\n\n\n37\nc-2\n↑\n0.368\n430\n0.407\n490\n\n\n38\nc-3\n↑\n0.365\n425\n0.404\n490\n\n\n39\nc-4\n↑\n0.365\n435\n0.403\n485\n\n\n40\nc-5\n↑\n0.366\n430\n0.405\n490\n\n\n41\nd-1\n↑\n0.364\n440\n0404\n495\n\n\n42\nd-2\n↑\n0.363\n430\n0.406\n490\n\n\n\n\n\n\n\n\n\n\n\nControl (no bulking\n0.375\n430\n0.414\n490\n\n\npromoter)\n\n\n\nComparative example 1\n0.330\n280\n0.379\n345\n\n\n\n\n\nNote\n\n\nIn Comparative Example 1 was used commercial bulking promoter “Bayvolume P Liquid” (fatty acid polyamide polyamine type; manufactured by Bayer AG)"
    ],
    "citations": [
        "3554963",
        "3677886",
        "5102501",
        "5302243",
        "5552020",
        "6033761",
        "6083348",
        "6103056",
        "6113741",
        "124900",
        "118744",
        "3124895",
        "3269199",
        "4185792",
        "4352591",
        "4370298",
        "5230798"
    ],
    "us_classification": "162158",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "D",
            "classification_class": "21",
            "subclass": "F",
            "main_group": "11",
            "subgroup": "00"
        }
    ]
}