{
    "title": "Transistor device and method",
    "abstract": "A method for making a heterojunction bipolar transistor includes the following steps: forming a heterojunction bipolar transistor by depositing, on a substrate, subcollector, collector, base, and emitter regions of semiconductor material; the step of depositing the subcollector region including depositing a material composition transition from a relatively larger bandgap material nearer the substrate to a relatively smaller bandgap material adjacent the collector; and the step of depositing the collector region including depositing a material composition transition from a relatively smaller bandgap material adjacent the subcollector to a relatively larger bandgap material adjacent the base.",
    "inventors": [
        "Feng"
    ],
    "document_number": "07297589",
    "publication_date": "20071120",
    "assignees": [
        "The Board of Trustees of The University of Illinois"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for making a heterojunction bipolar transistor, comprising the steps of:",
            "components": [
                {
                    "component": "forming a heterojunction bipolar transistor by depositing, on a substrate, subcollector, collector, base, and emitter regions of semiconductor material;",
                    "subcomponents": []
                },
                {
                    "component": "said step of depositing said subcollector region comprising depositing In",
                    "subcomponents": []
                },
                {
                    "component": "said step of depositing said collector region comprising depositing a material composition transition from a relatively smaller bandgap material adjacent the subcollector to a relatively larger bandgap material adjacent the base.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method as defined by claim 1 , wherein said step of depositing said collector region with material composition transition from a relatively smaller bandgap material adjacent the subcollector to a relatively larger bandgap material adjacent the base comprises depositing a graded composition of material.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method as defined by claim 1 , wherein said step of depositing said collector region with material composition transition from a relatively smaller bandgap material adjacent the subcollector to a relatively larger bandgap material adjacent the base comprises depositing a graded composition of material.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method as defined by claim 1 , wherein said step of depositing said collector region comprises depositing In",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method as defined by claim 1 , wherein said step of depositing said base region comprises depositing a material composition transition from a relatively smaller bandgap adjacent said collector to a relatively larger bandgap adjacent said emitter.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method as defined by claim 1 , wherein said step of depositing said base region comprises depositing In",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method as defined by claim 1 , wherein said emitter comprises InP graded to InAs.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A method for making a heterojunction bipolar transistor, comprising the steps of:",
            "components": [
                {
                    "component": "forming a heterojunction bipolar transistor by depositing, on a substrate, subcollector, collector, base, and emitter regions of semiconductor material;",
                    "subcomponents": []
                },
                {
                    "component": "said step of depositing said subcollector region comprising depositing a material composition transition from a relatively larger bandgap material nearer the substrate to a relatively smaller bandgap material adjacent the collector; and",
                    "subcomponents": []
                },
                {
                    "component": "said step of depositing said collector region comprising depositing In",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method as defined by claim 8 , wherein said step of depositing said subcollector with material composition transition from a relatively larger bandgap material nearer the substrate to a relatively smaller bandgap material adjacent the collector comprises depositing a graded composition of material.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method as defined by claim 8 , wherein said step of depositing said subcollector with material composition transition from a relatively larger bandgap material nearer the substrate to a relatively smaller bandgap material adjacent the collector comprises depositing a stepped composition of material.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method as defined by claim 8 , wherein said substrate comprises InP and said step of depositing includes depositing said subcollector region as In",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method as defined by claim 8 , wherein said step of depositing said base region comprises depositing a material composition transition from a relatively smaller bandgap adjacent said collector to a relatively larger bandgap adjacent said emitter.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method as defined by claim 8 , wherein said step of depositing said base region comprises depositing In",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method as defined by claim 8 , wherein said emitter comprises InP graded to InAs.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A method for making a heterojunction bipolar transistor, comprising the steps of:",
            "components": [
                {
                    "component": "forming a heterojunction bipolar transistor by depositing subcollector; collector, base, and emitter regions of semiconductor material;",
                    "subcomponents": []
                },
                {
                    "component": "said step of depositing said collector region comprising depositing In",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method as defined by claim 15 , wherein said transition comprises a graded transition.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method as defined by claim 15 , wherein said transition comprises a stepped transition.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method as defined by claim 15 , wherein said step of depositing includes depositing said subcollector region as InGaAs on an InP layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. A method for making a heterojunction bipolar transistor, comprising the steps of:",
            "components": [
                {
                    "component": "forming a heterojunction bipolar transistor by depositing, on a substrate, subcollector; collector, base, and emitter regions of semiconductor material;",
                    "subcomponents": []
                },
                {
                    "component": "said step of depositing said subcollector region comprising depositing In",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method as defined by claim 19 , wherein said transition comprises a graded transition.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The method as defined by claim 19 , wherein said transition comprises a stepped transition.",
            "components": []
        }
    ],
    "description": [
        "This invention relates to semiconductor devices and methods and, more particularly, to an improved heterojunction bipolar transistor and a method of making same, and also to an improved heterojunction bipolar light-emitting transistor, all capable of operating at extremely high frequencies.",
        "Following Bardeen's and Brattain's discovery of the transistor (J. Bardeen and W. H. Brattain, Phys. Rev. 74, 230 (1948)) and the identification of minority carrier injection and collection as the physical principle underlying transistor action, followed by Shockley's development of PN junction theory and junction transistors (W. Shockley, Bell System Technology Journal 28, 435 (1949)), the transistor and the development of integrated circuits (J. S. Kilby, U.S. Pat. No. 3,138,743; R. N. Noyce, U.S. Pat. No. 2,981,877) have revolutionized the military and consumer electronic industries. The concept of a wide band-gap semiconductor emitter (W. Shockley, U.S. Pat. No. 2,569,347; H. Kroemer, Proceedings of the IRE 45, 1535 (1957)) has been used to achieve high minority carrier injection efficiency in a heterojunction bipolar transistor (HBT), with the InP material system so far demonstrating the fastest transistors, now operated at speeds (fT) above 500 GHz (see W. Hafez, J. W. Lai and M. Feng, Elec. Lett. 39, No. 20, 1475 (2003); M. Feng, W. Hafez, and J. W. Lai, Proceedings of IPRM, 653-658 (2004)). Efforts to improve fT have focused, inter alia, on the reduction of electron transit time by vertically scaling the base and collector thicknesses at the cost of increasing base-collector parasitic capacitance as demonstrated in SiGe HBTs, as well as type I and type II InP DHBTs (see, for example, W. Hafez, J. W. Lai and M. Feng, Elec. Lett. 39, No. 20, 1475 (2003); M. Feng, W. Hafez, and J. W. Lai, Proceedings of IPRM, 653-658 (2004); J.-S. Rieh, B. Jagannathan, H. Chen, K. Schonenberg, S.-J. Jeng, M. Khater, D. Ahlgren, G. Freeman, and S. Subbanna, Proceedings of IPRM, 374-377 (2003); M. Ida, K. Kurishima, K. Ishii, and N. Watanabe, Proceedings GaAs IC Symposium, 2003. 25th Annual Technical Digest, 211-214 (2003); B. F. Chu-Kung and M. Feng, Elect. Lett. 40 (20), 1305 (2004); C. Bolognesi, M. W. Dvorak, N. Matine, O. J. Pitts, and S. P. Watkins, Jpn. J. Appl. Phys 41 (2B), 1131-1135 (2002)).",
        "A graded composition base region has contributed to increased operating frequency, as described, for example, in the above referenced documents, but improvements in transistor speed, toward terahertz operation, will require further advances in transistor processing and structure. The same is also true for light emitting HBT's (see, for example M. Feng, N. Holonyak, Jr. and W. Hafez, “Light-Emitting Transistor: Light Emission From InGaP/GaAs Heterojunction Bipolar Trnsistors”, App. Phys. Lett., Vol. 84, No. 1, (January 2004); M. Feng, N. Holonyak Jr., and R. Chan “Quantum-Well-Base Heterojunction Bipolar Light-Emitting Transistor”, App. Phys. Lett., Vol. 84, No. 1, (March 2004); G. Walter, N. Holonyak, Jr., M. Feng, and R. Chan “Laser Operation Of A Heterojunction Bipolar Light-Emitting Transistor”, App. Phys. Lett., Vol. 85, No. 20 (November 2004)), in which operation approaching terahertz frequencies will provide advantages in communications, switching, and many other commercial and military applications.",
        "It is among the objects of the present invention to improve operating characteristics, including transistor speed, of HBTs and light emitting HBTs, and to devise methods and devices which will permit operation approaching terahertz frequencies.",
        "Applicant has observed that the fundamental operating speed of an HBT transistor has also been limited by the lattice constant considerations and by transit time delays in the HBT subcollector and collector regions, as well as considerations of contact resistance and current density. In an embodiment of the present invention, a pseudomorphic heterojunction bipolar transistor provides advantages over prior HBTs by virtue of bandgap design in the subcollector and collector, as well as the base of the transistor. Also, subcollector contact resistance is improved by material composition transition to lower bandgap material. In one embodiment, InP, instead of InGaAs, is used in the bulk of the subcollector, leaving a relatively thin InGaAs contact layer for low resistance ohmic contacts, resulting in substantial reduction in total thermal resistance compared to prior devices. Also, a compositionally graded InGaAs to InAs emitter cap reduces emitter resistance and thus improves junction charging time.",
        "In accordance with an embodiment of the invention, a method is set forth for making a heterojunction bipolar transistor, including the following steps: forming a heterojunction bipolar transistor by depositing, on a substrate, subcollector, collector, base, and emitter regions of semiconductor material; said step of depositing said subcollector region comprising depositing a material composition transition from a relatively larger bandgap material nearer the substrate (or lattice matched layer thereon) to a relatively smaller bandgap material adjacent the collector; and said step of depositing said collector region comprising depositing a material composition transition from a relatively smaller bandgap material adjacent the subcollector to a relatively larger bandgap material adjacent the base.",
        "In a form of this embodiment, the step of depositing the subcollector region comprises depositing InxGa1-xAs having a relatively lower indium fraction nearer the substrate with transition to a relatively higher indium fraction adjacent the collector. Also in this embodiment, the step of depositing the collector region comprises depositing InxGa1-xAs having a relatively higher indium fraction adjacent the subcollector with transition to a relatively lower indium fraction adjacent the base. In a form of this embodiment, the substrate comprises InP and said step of depositing includes depositing said subcollector region as InxGa1-xAs on a heavily doped InP layer.",
        "In another form of the invention, a heterojunction bipolar light emitting transistor, is set forth, and includes: a heterojunction bipolar structure including a substrate, subcollector, collector, base, and emitter regions of semiconductor material; said subcollector region comprising a material composition transition from a relatively larger bandgap material nearer the substrate to a relatively smaller bandgap material adjacent the collector; said collector region comprising depositing a material composition transition from a relatively smaller bandgap material adjacent the subcollector to a relatively larger bandgap material adjacent the base; and means for applying electrical signals across terminals coupled with said subcollector, base, and emitter regions to cause light emission by radiative recombination in the base region.",
        "Further features and advantages of the invention will become more readily apparent from the following detailed description when taken in conjunction with the accompanying drawings.",
        "FIG. 1 is a simplified diagram, not to scale, of the epitaxial layer structure of devices in accordance with an embodiment of the invention and which can be used in practicing an embodiment of the method of the invention.",
        "FIG. 2 is an energy band diagram of the device of FIG. 1.",
        "FIG. 3 is a scanning electron micrograph top view of a device in accordance with an embodiment of the invention, before passivation thereof.",
        "FIG. 4 shows common-emitter I-V curves for an example of a device in accordance with an embodiment of the invention.",
        "FIG. 5 shows h21, U, and MSG/MAG for an example of a device in accordance with an embodiment of the invention, and shows extrapolations to obtain cutoff.",
        "FIG. 6 shows the device cutoff frequency scalling trend for different emitter lengths of examples of devices in accordance with an embodiment of the invention.",
        "FIG. 7 shows components of delay time that affect device operating speed. Delay terms obtained from extracted device parameters show the effect of scaling between a 62.5 nm collector device hereof, and a 75 nm collector HBT. A reduction of 16% is observed in the total delay time.",
        "FIG. 8 is a simplified diagram, not to scale, of a light emitting pHBT in accordance with an embodiment of the invention.",
        "FIG. 1 is a simplified diagram of the epitaxial layer structure of devices in accordance with an embodiment of the invention that were grown by molecular beam epitaxy (MBE) on semi-insulating InP substrates. It will be understood that other suitable techniques for growth, for example MOCVD, can alternatively be used. The substrate is represented at 110, and may comprise semi-insulating N+ InP. A subcollector structure 120 included a 250 nm heavily doped N+ InP subcollector, a 50 nm In0.53Ga0.47As layer, and a 10 nm strained In0.63Ga0.37As contact layer silicon-doped to 5×1019 cm−3. A collector 130, lightly-doped at 3×1016 cm−3 to suppress Kirk effect, was then linearly graded over 62.5 nm from In0.63Ga0.37As at the collector/subcollector interface, to In0.53Ga0.47As (lattice-matched) at the junction with base 140. Techniques for achieving material composition transitions, continuous and/or discrete, are well known in the art. In the present embodiment, the base was 20 nm and carbon-doped (8×1019 cm−3, RSB=1350 Ω/sq.) and graded 6% indium mole-fraction to In0.47Ga0.53As at the junction with the emitter. The emitter structure included a 35 nm InP emitter 150, a compositionally graded cap transition 160 (In0.53Ga0.47As to InAs), and a 10 nm InAs emitter cap 170, doped to 8×1019 cm−3. Collector, base and emitter contacts are represented in FIG. 3 below, and in FIG. 8, described subsequently. An InAs emitter cap was employed, as it has been shown to effectively reduce the emitter contact resistance REE by 50% for small-area emitters (see W. Hafez and M. Feng, IEEE Electronics Lett. 40 (18), 1151 (2004). Due to the relatively large parasitic base-to-collector capacitance associated with the vertically scaled epitaxial structure, small emitter areas are required to allow lateral device scaling to maintain respectable unity power gain (fMAX) frequencies. Replacing InGaAs with InP in the bulk of the subcollector and leaving only a thin InGaAs contact layer for low resistance ohmic contacts results in a 15% reduction in the total thermal resistance of the device when compared with a conventional lattice-matched InGaAs subcollector.",
        "FIG. 2 shows an energy-band diagram of the heterojunction (HBT) of the device of FIG. 1.",
        "In examples of an embodiment of the invention, HBT devices were fabricated using an all wet-etch process (see for example, W. Hafez, J. W. Lai, and M. Feng, IEEE Electron Device Lett. 24 (5), 292-294 (2003)), with emitters designed to have a width of 0.5 μm after electrode evaporation. Corresponding physical emitter/base junction widths were 0.4 μm after the emitter etch, and emitter lengths range from 1 μm to 6 μm. The devices were passivated in benzocyclobutene (BCB). A scanning-electron micrograph of a device before passivation is shown in FIG. 3. The scale bar represents 5 μm.",
        "FIG. 4 shows the common-emitter I-V curves for a 0.4×6 μm2 emitter device. Measurements were taken at room temperature, and indicate BVCEO values of 1.7 V. Current density at peak fT=16.82 mA/μm2 at a VCE=0.907 V. The knee voltage is less than 0.6 V at current densities in excess of 18 mA/μm2. The output conductance is very low, exhibiting output characteristics that are superior to pseudomorphic high-electron mobility transistors (pHEMTs) with similar RF performance (see Y. Yamashita, A. Endoh, K. Shinohara, K. Hikosaka, T. Matsui, S. Hiyamizu, and T. Mimura, IEEE Electron Device Lett. 23 (10), 573-575 (2002)). The common emitter breakdown voltage, defined when the current density reaches 100 A/cm2, is BVCEO=1.7 V. Gummel characteristics exhibit peak DC gain (β) of 65 and idealities of 1.1 and 1.62 for the collector and base junctions, respectively.",
        "Microwave performance at room temperature was characterized from 0.5 GHz to 50 GHz using an HP8510C network analyzer, with calibration performed using on-wafer SOLT standards. The measurement of a thru standard after calibration showed deviation of less than ±0.015 dB, assisting of verification in the accuracy of the calibration. FIG. 5 shows extrapolations of h21 (short circuit current gain), U (ratio of output to input power), and MSG/MAG (ratio of maximum stable gain to maximum available gain) for a 0.4×6 μm2 device, operating at a collector current density, JC, of 16.82 mA/μm2. The cutoff frequencies are extrapolated using a least-squares fit of a −20 dB/decade line, and show a peak fT (unity current gain cutoff frequency) of 604 GHz and associated fMAX (unity power gain cutoff frequency) of 246 GHz, respectively. To applicant's knowledge, this fT is the highest value reported for any transistor to date. Thermal resistance was calculated using an emitter thermal-shunt model (see W. Hafez, F. Dixon, and M. Feng. 2004 CS MANTECH Conf. Dig. Of Papers, 269-272 (2004)), with a 0.4×6 μm2 device exhibiting a normalized thermal resistance of 9.6° C. μm2/mW, corresponding to a temperature increase of 148° C. and a power dissipation of 36 mW when biased at peak fT. FIG. 6 shows the device cutoff frequency scaling trend for 0.4 μm HBTs versus emitter length, with fT remaining relatively flat for emitter lengths above 3 μm and fMAX monotonically increasing for shorter emitters.",
        "Equivalent circuit parameters were extracted/optimized from measured S-parameters and device geometry for a 0.4×6 μm2 HBT, where rE=kT/IC is the dynamic emitter resistance (0.8 Ω), REE is the emitter contact resistance (2.1 Ω), RC is the collector resistance (0.9 Ω), CJE is the emitter junction capacitance (54 fF), and CBC is the total base-collector capacitance (21.83 fF). The calculated delay times are shown in-the bar graph of FIG. 7. The current cutoff frequency, fT, for an HBT is given in Eq. (1), where τB and τC represent the base and collector transit times,",
        "1\n          \n            2\n            ⁢\n            \n              \n            \n            ⁢\n            π\n            ⁢\n            \n              \n            \n            ⁢\n            \n              f\n              T\n            \n          \n        \n        =\n        \n          \n            τ\n            EC\n          \n          =\n          \n            \n              τ\n              B\n            \n            +\n            \n              τ\n              C\n            \n            +\n            \n              τ\n              E\n            \n            +\n            \n              τ\n              CC\n            \n          \n        \n      \n    \n    \n      \n        (\n        1\n        )\n      \n    \n  \n\n\n\n\nrespectively. The junction charging times consist of the emitter charging time, defined as τE=τE*CJE, and the collector charging time, τCC=(rE+REE+RC)*CBC. The forward delay τF, obtained from extrapolating the total delay, τEC vs. 1/IC to 1/IC=0 A−1, is measured to be 204 fs, indicating a base and collector transit time of τB+τC=137 fs. Comparing a similar HBT with a 75 nm collector and 25 nm base operating with fT=509 GHz (see W. Hafez, J. W. Lai and M. Feng, Elec. Lett. 39, No. 20, 1475 (2003)), a 16% reduction in total transit time τEC is observed, 7% of which is due to a reduction in the collector transit time, 5% from the base transit time, and 3% from the emitter charging time. The collector charging time is observed to have a negligible change from the 75 nm collector device (83 fs versus 86 fs for the 62.5 and 75 nm collectors, respectively), despite the thinner collector thickness; the increase in CBC from the thinner collector is offset by the increase in the operating current density, effectively keeping the charging time constant. The decrease in emitter charging time (ΔτE=10 fs) is due to the low dynamic emitter resistance, also a benefit from the high current density operation. The transit time compromises roughly half of the total device delay, indicating parasitic capacitances (CBC primarily) have been adequately controlled through layout and processing techniques. The benefit obtained through the use of the 10% compositionally graded collector, in this example, is estimated to result in a 7% reduction in collector transit time compared with a lattice-matched collector of the same thickness, resulting in an average velocity in excess of 4.3×107 cm/s through the collector. The boost in the drift velocity is due to faster drift transport in the graded indium composition of InGaAs collector.",
        "The above described embodiment was set forth in terms of an InP—InGaAs HBT which is seen to exhibit substantially improved characteristics including a frequency of operation at the leading edge of present technology. The principles hereof also have application to methods and devices using, for example, other Type I, as well as Type II and Type I/Type II HBTs. The following listing is non-limiting and refers to grading as a form of material composition transition, although it will be understood that any suitable continuous and/or discrete transitions can be utilized:\n\n    Type I HBT: Wide gap emitter with graded base, graded collector and graded sub-collector\n    \n        GaAs HBT: AlGaAs or GaAs or InGaP(Emitter)/InGaAs(graded-base)/InGaAs(graded-collector)/InGaAs(graded-sub-collector);\n        GaN HBT: GaN (Emitter)/InGaN(graded-base)/InGaN(graded-collector)/InGaN(graded-sub-collector);\n    \n    \n    Type II HBT: Wide gap emitter with graded base, graded collector and graded sub-collector\n    \n        InGaP or InAlGaP or InP (Emitter)/GaAsSb(graded-base)/InGaAsSb or InGaP (graded-collector)/InGaAsSb(graded-sub-collector);\n    \n    \n    Type I/Type II HBT: Type I Wide gap emitter with graded base and with type II base to graded collector and graded sub-collector\n    \n        AlGaSb (emitter)/GaAsSb (base)/InP, InGaAs, InGaAsSb (collector).",
        "FIG. 8 shows a light-emitting pHBT, using the improvements described hereinabove, and showing light emission from radiative recombination in the base region. The heterostructure has corresponding regions to those of FIG. 1, with like reference numerals, and also showing subcollector contact 115 and lead 117, base contact 145 and lead 147, and emitter contact 165 and lead 167."
    ],
    "citations": [
        "2569347",
        "2981877",
        "3138743",
        "4827320",
        "5283448",
        "6667498",
        "6696710",
        "6765242",
        "6797996",
        "6806513",
        "7091082",
        "2002/0195619",
        "2004/0065898",
        "2004/0124435",
        "2005/0040387",
        "2005/0054172",
        "2005/0067629",
        "2005/0139863",
        "2006/0186420",
        "2006/0208290"
    ],
    "us_classification": "438235",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "L",
            "main_group": "21",
            "subgroup": "8249"
        }
    ]
}