{
    "title": "Optical detector for a particle sorting system",
    "abstract": "An optical system for acquiring fast spectra from spatially channel arrays includes a light source for producing a light beam that passes through the microfluidic chip or the channel to be monitored, one or more lenses or optical fibers for capturing the light from the light source after interaction with the particles or chemicals in the microfluidic channels, and one or more detectors. The detectors, which may include light amplifying elements, detect each light signal and transducer the light signal into an electronic signal. The electronic signals, each representing the intensity of an optical signal, pass from each detector to an electronic data acquisition system for analysis. The light amplifying element or elements may comprise an array of phototubes, a multianode phototube, or a multichannel plate based image intensifier coupled to an array of photodiode detectors.",
    "inventors": [
        "Gilbert",
        "Sinofsky",
        "Deshpande"
    ],
    "document_number": "07298478",
    "publication_date": "20071120",
    "assignees": [
        "Cytonome, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An optical detection system for observing a microfluidic system that contains an array of channels for conveying particles or molecules, comprising:",
            "components": [
                {
                    "component": "a light source for producing a light beam;",
                    "subcomponents": []
                },
                {
                    "component": "a set of beam shaping optics for focusing the light beam;",
                    "subcomponents": []
                },
                {
                    "component": "an array of pinholes, each pinhole matched to and associated with a microfluidic channel in said array of channels in the microfluidic system;",
                    "subcomponents": []
                },
                {
                    "component": "at least one columnated detector ribbon for receiving and conveying one of optical extinction, forward scatter or side scatter produced after the light beam passes through one of said channels via one of said pinholes; and",
                    "subcomponents": []
                },
                {
                    "component": "a high numerical aperture fluorescence detector receiving optical signals produced by a particle in any of said array of channels when the particle intersects said light beam.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The optical detection system of claim 1 , wherein the array of pinholes is disposed between said light source and the array of channels to direct the light beam into the array of channels.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The optical detection system of claim 1 , wherein the array of pinholes is formed in an optical mask coupled to a surface of the microfluidic system.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The optical detection system of claim 1 , wherein the array of pinholes is formed in an optical mask formed on a surface of the microfluidic system.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The optical detection system of claim 1 , wherein the columnated detector ribbon is a mechanical component having an aperture extending therethrough including an open first end for receiving light from an associated channel and an open second end for receiving a fiber for receiving and conveying the received light to a detector.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The optical detection system of claim 5 , wherein the aperture extending through the columnated detector ribbon includes a fiber hole extending from the second end and a columnating hole extending from the first end and intersecting the fiber hole, wherein the columnating hole is concentric with and has a smaller diameter than the fiber hole.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The optical detection system of claim 6 , wherein the columnating hole is greater in diameter than said one of said pinholes for an associated channel.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The optical detection system of claim 7 , wherein the pinhole aperture is about 150 microns in diameter, the columnating hole is about 250 microns in diameter, and the fiber hole is about 300 microns in diameter.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The optical detection system of claim 5 , further comprising a high numerical aperture fiber inserted into the open second end.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The optical detection system of claim 5 , wherein the columnated detector ribbon is mounted along vector defined by the path of the light beam, such that light extending along the path of the light beam through the channel passes into the columnating hole.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The optical detection system of claim 5 , wherein the aperture extends at an angle of about 45 degrees relative to the channels and the microfluidic system.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The optical detection system of claim 1 , wherein the columnated detector ribbon is positioned within about 2 millimeters of an associated channel.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The optical detection system of claim 1 , wherein the columnated detector ribbon is about 1 millimeter in length.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The optical detection system of claim 1 , wherein the columnated detection ribbon is a mechanical component comprising an array of apertures extending therethrough, each aperture aligned with and associated with a channel in the microfluidic system.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The optical detection system of claim 14 , further comprising an array of fibers, each fiber placed into an associated aperture in the columnated detection ribbon to form an array of fibers, with each fiber associated with a channel for conveying an optical signal from the channel and received in the associated aperture to a detector.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The optical detection system of claim 15 , wherein each aperture extending through the columnated detector ribbon includes a fiber hole extending from the second end and a columnating hole extending from the first end and intersecting the fiber hole, wherein the columnating hole is concentric with and has a smaller diameter than the fiber hole.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The optical detection system of claim 1 , further comprising a second columnating detection ribbon positioned at an angle relative to the first columnating detection ribbon.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The optical detection system of claim 17 , wherein the second columnating detection ribbon includes at array of apertures extending at an angle about 90 degrees relative to a vector defined by the path of the light beam.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. An optical detection system for observing microfluidic systems that contain channels that convey particles or molecules, comprising:",
            "components": [
                {
                    "component": "a light source for producing a light beam;",
                    "subcomponents": []
                },
                {
                    "component": "a set of beam shaping optics for focusing the light beam;",
                    "subcomponents": []
                },
                {
                    "component": "an array of pinholes matched to the microfluidic channels, wherein said set of beam shaping optics passes the light beam through said array of pinholes;",
                    "subcomponents": []
                },
                {
                    "component": "at least one columnated detector ribbon for receiving and conveying one of optical extinction, forward scatter or side scatter produced after the light beam passes through one of said channels via one of said pinholes; and",
                    "subcomponents": []
                },
                {
                    "component": "a high numerical aperture fluorescence detector for simultaneous interrogation of a plurality of channels in the microfluidic system and simultaneous detection of three fluorescence wavelength bands.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The optical detection system of claim 19 , wherein the array of pinholes is disposed between said light source and the array of channels to direct the light beam into the array of channels.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The optical detection system of claim 19 , wherein the columnated detector ribbon is a mechanical component having an aperture extending therethrough including an open first end for receiving light from an associated channel and an open second end for receiving a fiber for receiving and conveying the received light to a detector.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The optical detection system of claim 21 , wherein the aperture extending through the columnated detector ribbon includes a fiber hole extending from the second end and a columnating hole extending from the first end and intersecting the fiber hole, wherein the columnating hole is concentric with and has a smaller diameter than the fiber hole.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The optical detection system of claim 22 , wherein the columnating hole is greater in diameter than said one of said pinholes for an associated channel.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The optical detection system of claim 21 , wherein the aperture extends at an angle of about 45 degrees relative to the channels and the microfluidic system.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The optical detection system of claim 19 , wherein the columnated detection ribbon is a mechanical component comprising an array of apertures extending therethrough, each aperture aligned with and associated with a channel in the microfluidic system.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The optical detection system of claim 25 , further comprising an array of fibers, each fiber placed into an associated aperture in the columnated detection ribbon to form an array of fibers, with each fiber associated with a channel for conveying an optical signal from the channel and received in the associated aperture to a detector.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The optical detection system of claim 19 , further comprising a second columnating detection ribbon positioned at an angle relative to the first columnating detection ribbon for receiving one of optical extinction, forward scatter and side scatter produced after the light beam passes through one of said channels via one of said pinholes.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The optical detection system of claim 27 , wherein the first columnating detection ribbon captures forward scatter extend at about a 45-degree angle from the channel, the second columnating detection ribbon captures side scatter extending about 90 degrees from forward scatter, and the high numerical aperture fluorescence detector has a cone of mechanical freedom between the first columnating detection ribbon and the second columnating detection ribbon of about 90 degrees.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The optical detection system of claim 19 , wherein the high numerical aperture fluorescence detector comprises at least one lens for collecting and directing photons emitted from an associated channel, an image plane for reconstructing the photons into an optical signal representative of a particle in a channel, and a fiber array extending from the image plane for conveying the optical signal to detectors for analysis.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. An optical detection system for observing microfluidic systems that contain channels that convey particles or molecules, comprising:",
            "components": [
                {
                    "component": "a light source for producing a light beam;",
                    "subcomponents": []
                },
                {
                    "component": "a set of beam shaping optics for focusing the light beam;",
                    "subcomponents": []
                },
                {
                    "component": "pinhole in communication with a channel of the microfluidic system; and",
                    "subcomponents": []
                },
                {
                    "component": "a high numerical aperture fluorescence detector for simultaneous interrogation of a plurality of channels in the microfluidic system and using an image intensifier as an optical amplification element, wherein the image intensifier includes an input window for an image signal, a light-sensitive electron emitter for transforming light emitted from a channel to photoelectrons, an electron multiplier for electron multiplication, a phosphor screen for converting the electrons to light and an output window for outputting an amplified image signal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The optical detection system of claim 30 , wherein the pinhole is disposed between said light source and the channel to direct the light beam into the channel.",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. The optical detection system of claim 30 , wherein the output window is a fiber optic plate.",
            "components": []
        }
    ],
    "description": [
        "The present invention claims priority to U.S. Provisional Patent Application Ser. No. 60/495,374, filed Aug. 14, 2003, the contents of which are expressly incorporated by reference.",
        "The present invention relates to a system and method for monitoring particles flowing through a channel.",
        "In a system, such as a microfluidic system, that conveys particles through one or more channels, an optical system may be used for monitoring, analyzing or detecting the particles. Optical systems may be useful, for example in particle sorting systems, which sort a stream of particles flowing through one or more channels based on a predetermined characteristic.",
        "Conventional detection systems have significant drawbacks. For example, prior optical detection systems are at times inaccurate and provide poor results due to the difficulty of observing low light level signals from fluorescent labels on particles when spread out over a large area. Prior optical systems also have difficulty when the light signals to be detected are of short duration, for example, less than one millisecond. For example, conventional CCD (charge coupled device) technology has a frame rate of more than one millisecond.",
        "Prior systems for interrogating microchannels also are limited to focusing light on a single channel, a region of less than about 500 um, and capturing light from a similarly limited region.",
        "The present invention provides an optical system for acquiring fast spectra from spatially channel arrays. The system is designed to be used to interrogate a microfluidic particle analysis or sorting chip that contains an array of one or more parallel fluidic channels spaced over 1 to 200 millimeters. The particles conveyed in the channels have velocities from 0.1 to 10 meters per second, therefore the signals observed by the detectors may be sub-millisecond in duration and may require observation with 1 to 100 Megahertz bandwidth detectors and electronics.",
        "The optical detection system includes a light source for producing a light beam that passes through the microfluidic chip or the channel to be monitored, one or more lenses or optical fibers for capturing the light from the light source after interaction with the particles or chemicals in the microfluidic channels, and one or more detectors. The detectors, which may include light amplifying elements, detect each light signal and transduce the light signal into an electronic signal. The electronic signals, each representing the intensity of an optical signal, pass from each detector to an electronic data acquisition system for analysis. The light amplifying element or elements may comprise an array of phototubes, a multianode phototube, or a multichannel plate based image intensifier coupled to an array of photodiode detectors.",
        "The optical system cost effectively and simultaneously captures extinction signals, one or more optical scatter signals, and one or more fluorescence signals all at low light levels and at high bandwidth (>1 MHz) from an array of one or more particle conveying channels at once. The system provides efficient and accurate monitoring of each particle under various conditions.",
        "The invention will be apparent from the description herein and the accompanying drawings, in which like reference characters refer to the same parts throughout the different views.",
        "FIG. 1 illustrates a system having a plurality of channels for conveying streams of particles, suitable for implementing an illustrative embodiment of the present invention.",
        "FIG. 2 is a schematic diagram of an optical detection system of the present invention.",
        "FIG. 3 illustrates a cross section through one microchannel in a plane perpendicular to the microchannel",
        "FIG. 4 is a schematic diagram of an optical detection system of the present invention, illustrating in detail the components of the fluorescence detector.",
        "FIG. 5 illustrates an optical detection system suitable for analyzing particles in a plurality of channels of a microfluidic system.",
        "FIGS. 6A-6C shows an embodiment of the subsystem for detecting optical scatter at a 90 degree angle or extinction in the optical detection system or FIG. 2.",
        "FIG. 7 is a schematic of beam shaping optics suitable for use in the optical detection system of FIG. 2.",
        "FIG. 8 illustrates a segmented mirror suitable for using in the optical detection system of the present invention.",
        "FIG. 9 is a partial view of a groove of the segmented mirror of FIG. 8.",
        "FIG. 10 is a table showing different configurations for a groove of the segmented mirror based on a corresponding spot width.",
        "FIG. 11 is a schematic of beam shaping optics employing a segmented mirror in an optical detection system of an illustrative embodiment of the invention.",
        "FIG. 12 illustrates an image intensifier suitable for use with the optical detection system of an illustrative embodiment of the invention.",
        "The present invention provides an optical system for monitoring and detecting particle flow through an array of channels. The present invention will be described below relative to illustrative embodiments. Those skilled in the art will appreciate that the present invention may be implemented in a number of different applications and embodiments and is not specifically limited in its application to the particular embodiments depicted herein.",
        "FIG. 1 illustrates a microfluidic system 10 suitable for implementing an illustrative embodiment of the invention, including a plurality of channels for conveying a substance, such as particles or cells, therethrough. The illustrative microfluidic system 10 comprises a substrate 1 having a plurality of channels, such as microchannels 3, disposed therein. The channels transport fluid and/or particles through the microfluidic system 10 for processing, handling, and/or performing any suitable operation on a liquid sample. As used herein, the term “microfluidic” refers to a system or device for handling, processing, ejecting and/or analyzing a fluid sample including at least one channel having microscale dimensions. The term “channel” as used herein refers to a pathway formed in or through a medium that allows for movement of fluids, such as liquids and gases. The term “microchannel” refers to a channel preferably formed in a microfluidic system or device having cross-sectional dimensions in the range between about 1.0 μm and about 500 μm, preferably between about 25 μm and about 350 μm and most preferably between about 50 μm and about 300 μm. One of ordinary skill in the art will be able to determine an appropriate volume and length of the channel. The ranges are intended to include the above-recited values as upper or lower limits. The channel can have any selected shape or arrangement, examples of which include a linear or non-linear configuration and a U-shaped configuration. The microfluidic system 10 may comprise any suitable number of microchannels 3 for transporting fluids through the microfluidic system 10.",
        "The present invention provides an optical detector for use with a microfluidic chip, such as the microfluidic system of FIG. 1. The optical detector of the present invention may be implemented in a measurement region 2 of the microfluidic system to interrogate the system in this region. The invention provides facilitates building of a detection system that can scale to microfluidic chips with parallel arrays of channels from 1 to 200 channels laid out over one or more interrogation regions 2, that have physical extent from 1 to 250 mm with preferred extent from 1 to 100 mm.",
        "The optical detector may monitor flow through a plurality of channels in the chip simultaneously. The optical detector or a system of optical detectors can inspect individual particles for one or more particular characteristics, such as size, form, fluorescent intensity optical scattering, as well as other characteristics obvious to one of ordinary skill. For example, in an illustrative embodiment, the optical detector of the present invention can be positioned over a relatively large area of the chip (e.g., an active area of between about twelve millimeters and fifty millimeters in diameter) containing over one-hundred channels of flowing particles to be observed. The optical detector is capable of cost effectively capturing fast, low light level, signals from a plurality or all of the channels at once. One skilled in the art will recognize that the optical system is not limited to use in particle or cell sorting systems and may be implemented in any suitable system having a substance, such as particles, to be monitored flowing through one or more channels.",
        "FIG. 2 illustrates an overview of an optical detection system 8 of an illustrative embodiment of the invention, which may be implemented in the microfluidic system of FIG. 1. Those skilled in the art will recognize that the optical detection system may be implemented in any suitable system and is not limited to the microfluidic system of FIG. 1.",
        "The optical detection system 8 includes a light source 11, illustrated as a laser, coupled to beam shaping optics 12 for producing and forming a beam of light 14 that passes through an optical mask 13, illustrated as an array of pinholes aligned with an array of particle conveying channels 3 in the microfluidic chip 10. The light admitted by the pinholes subsequently passes through the conveying channels 3 themselves. The light beam admitted to each channel via one or more associated pin holes intersects particles 18 are conveyed through the channel 3 to create optical signals. Examples of optical signals that can be produced in optical particle analysis, cytometry or sorting when a light beam intersects a particle include optical extinction, angle dependent optical scatter and fluorescent light. Optical extinction refers to the amount of light that passes the particle without interacting. Angle dependent optical scatter refers to the fraction of light that is scattered or bent at each angle (theta) away from the incident light beam. Fluorescent light is light that is absorbed by molecules in the particle and re-emitted at a longer wavelength.",
        "Detector optics 15, 16, 17, located on an opposite side of the channel 3 from the light source 11, capture and observe the optical signals generated by the intersection of a light beam with a particle in a channel. Optical Extinction detectors 15 are placed directly opposite the light source 11 and aligned with the incident light path 14 for detecting optical extinction. Optical scatter detectors 16 are placed substantially perpendicular to the incident light path 14 in the plane formed by the incident light vector and the microfluidic channel it intersects. Preferably, the optical scatter detectors are located at an angle of about 90 degrees relative to the incident light path 14. Optical Scatter detectors for other angles may optionally be placed at those angles in that same plane. A fluorescence detection subsystem 17 captures optical signals from fluorescence. The fluorescence detection subsystem 17 may include a large high numerical aperture lens and accompanying optical elements. As shown, the fluorescence detection subsystem is placed above the microfluidic chip 10 to capture as many fluorescent photons as possible and image them onto detectors (not shown).",
        "The optical detection system 8 may be implemented in an interrogation area 2 of the chip 10. The illustrative interrogation area 2 encompasses 24 channels 3, though one skilled in the art will recognize that any suitable number of channels may be observed using the optical detection system 8. In the illustrative embodiment, the interrogation area 2 is about 10 mm wide (across a plurality of channels 3) by 4 mm long (along each channel 3), though one skilled in the art will recognize that the invention is not limited to this range",
        "When light 14 from a laser 11 or other optical source is incident on the chip 10, only light that passes through the narrow region that particles follow can interact with particles to produce an optical signal. Light that passes through the chip 10 outside of the channels 3 or light that passes through a region of a channel that does not contain the particles can contribute only to background or noise and not to signal and therefore is stray light and should be minimized. It is also a consideration that light which passes through the chip without passing through the particles to be observed represents wasted laser source power and should therefore be minimized for cost and thermal management reasons. The optical mask 13, formed by the layer of pinholes, and the beam shaping optics 12 both minimize stray light and minimizes waste of laser power.",
        "As shown, the light source 11 provides the incident light at about a 45-degree angle relative to the channel 3. In this manner, the forward scatter/extinction extends in the same direction on the opposite side of the channel 3. As shown, the forward scatter 14b extends at a 45-degree angle from the channel 3. The side scatter 14c extends about 90 degrees from the incident light, providing the fluorescence optics 17 a cone of mechanical freedom 170. The cone of mechanical freedom 170 provides a 90 degree unobstructed view for the detector in between the forward scatter 14b and side scatter 14c.",
        "FIG. 3 shows an illustrative picture of the cross section through a part of a microfluidic chip 10 containing a pair of microchannels 3a and 3b. The cross-section is in a plane that cuts through the microchannels and the pinholes 13a, 13b of the mask 13. The incident light 14 is partly blocked by the pinhole layer 13 and narrows the initial beam 14 to focused beams 18 defined by each pinhole 13a, 13b. The focused beams 18 intersect each channel to illuminate the region 31 in which particles 18 are permitted to flow in a conventional core flow. Much stray light is blocked by the pinhole layer 13, which may be a separate part from the microfluidic chip or may be fabricated on the surface of the chip by photolithography or other methods known to those skilled in the art of chip fabrication.",
        "The microfluidic system may comprise any system including channels for flowing a substance, such as particles or cells, therethrough. For example, the microfluidic system 10 may comprise a particle sorting system, such as the particle sorting systems described in U.S. patent application Ser. Nos. 10/179,488 and 10/329,008, the contents of both patent applications are herein incorporated by reference. Other suitable microfluidic systems are described in U.S. patent application Ser. Nos. 10/028,852 10/027,484, 10/027,516 and 10/607,287, all of which are herein incorporated by reference.",
        "FIG. 4 illustrates a schematic diagram of the optical detection system of FIG. 2 illustrating in detail the components of the fluorescence detection subsystem 17. The fluorescence detection subsystem 17 includes a high numerical aperture (low F#) collection lens 45 configured and positioned to capture as many of the photons emitted from the illuminated particle as possible. The lens 45 may be an off the shelf F#=1 lenses of 50 mm and focal length commercially available. An example is the Leica Noctilux 50 mm F#1 lens. Larger lenses are also available and in use for imaging multiwell plates. A dispersive element 46, illustrated as a littrow grating, is located above the first collection lens 45. The dispersive element 46 bends light in a manner related to the wavelength of the particular light beam. The illustrative littrow grating 46 grating is 76.2 mm in diameter with a 73 mm active area. The littrow grating 46 has 720 grooves/mm and has a blaze angle of 43.1 degrees at 550 nm (the angle that the grating is positioned from the vertical). The Littrow angle is 23.33 degrees which is the angle that 550 nm light is bent away from the vertical in FIG. 4. One skilled in the art will recognize that any suitable means for bending light in a particular manner may be used in accordance with the teachings of the invention. A reconstruction lens 47 is positioned at the littrow angle to catch the 1st order diffraction light from the grating 46 and reconstruct the diffracted light into an image of the illuminated particle in the image plane 48.",
        "A fiber array 49 extends from the image plane 48 and conveys signals to detectors 50 for analyzing the signal. The detectors may be a camera or other suitable device.",
        "Due to the presence of the littrow grating in the optical path the illuminated particle in the microchannel 3 is imaged into the plane 48 with longer wavelength photons tilted through a larger angle than shorter wavelength photons so that the particle has a spectra spread over that image plane. Photons having wavelength from 500 nm to 700 nm are spread over about 7841 microns in the image plane 48 for the 50 mm focal length lenses used for lenses 45 and 47. The illustrative embodiment has a spectral resolution of 39.2 microns per nm wavelength.",
        "The optical detection system 8 can be used to observe particles labeled with antibodies bound to fluorophores or other fluorescent particle markers known to those skilled in the art of cytometry. When the excitation light is of 488 nm wavelength then, for example, one can use particles labeled with antibodies bound to fluorophores FITC (fluorescein isothiocyanate), PE (R-Phycoerythrin), APC (AlloPhycoCyanin) and PerCP (Peridinin-chlorophyll-protein Complex) which have peak fluorescence emission at 530 nm, 575 nm, 630 nm, and 695 nm respectively. The photons from FITC, PE, and PerCP are placed onto the image plane at positions −784 microns, 980 microns, 3136 nm, and 5684 microns, (relative to 0 at 550 nm) respectively. An opaque plate with 400 um holes in it and 400 um diameter optical fibers placed in those holes will then give each fiber 49 a wavelength capture bandwidth of about 10 nm. Placing a fiber 49 at each location corresponding to the peak emission of desirable fluorophores produces an efficient and compact multiple color detection system. Fibers 49 placed with one end in the image plane 48 have their other end attached to a detector. In the illustrative embodiment, the second end of the fibers is coupled to the photocathode window of a phototube (for example single anode H6780-20 or 32-anode H7260-20 phototubes from Hamamatsu Inc.) at a location corresponding to a single anode, in order to amplify the fluorescence optical signals and convert them to electronic signals. Other amplifying light detectors such as image intensifiers or avalanche photodiode arrays or others known to those skilled in the art of optics may also be used to detect the optical signals and convert them into electronic signals.",
        "In FIG. 4, the fibers 49 which interrogate particles in the illustrated channel are located in the same plane as the plane of the channel in the microfluidic chip. If the system is used on a multiple channel array then the other channels lie in front of the plane of illustrated channel or behind the plane of illustrated channel.",
        "FIG. 5 shows a perspective view of an optical detector system 80 used for observing multiple channels in a microfluidic chip. The optical detector system 80 also includes a pinhole array 13 blocking most incident light 14 and illuminating small detection regions 2 in each channel 3 of the six channels of the microfluidic chip. The optical column of the collection lens, littrow grating and reconstruction lens is similar to that shown in FIG. 4, and can have the same embodiments of lens and grating specifications. In general, the size of the components of lens and grating sets must be sufficient to give a field of view on the chip in excess of the size of the detection region (the region where channels are illuminated through pinholes). In the image plane 48 there is placed a plate 480 holding six arrays 490, including four fibers each. Each array of four optical fibers 49 is positioned to sample the optical spectra emitted from an associated channel 3. Each fiber in the array is positioned on the peak emission location of one fluorophore. High numerical aperture fibers or lensed fibers are appropriate here as will be apparent to those skilled in the art.",
        "FIGS. 6A-6C shows an embodiment of the subsystem for detecting optical scatter at a 90 degree angle or extinction. In this embodiment, an optical extenciton columnated detector ribbon 63 is positioned above a multichannel chip 10 with interchannel spacing of about 500 microns. The optical extenciton columnated detector ribbon 63, a cross-section of which is shown in FIG. 6B, is a mechanical part with 300 micron diameter holes drilled in it to a depth of less than the ribbon thickness 63d, and spaced 500 microns on centers so as to line up the holes with channel spacing. A high numerical aperture fiber 65 is placed into each hole to form an array of fibers 61, with one fiber per channel. A columnating hole of smaller diameter but concentric with the fiber hole 63c is drilled in each hole. This columnating hole penetrates the ribbon connector 63b, and allows light to pass through the columnating hole 63c and into the fiber 65 positioned in the larger diameter shaft. To make this subsystem work, the incident light 68 intersects the pinhole and channel at a near 45 degree angle and the optical extinction detection ribbon 63 is mounted directly along the incident light vector (i.e. at an angle of 180 degrees to the incident light) as shown by the position of the ribbon. The aperture of the columnator must be in excess of the aperture of the pinhole so that for well columnated incident light all of the light that crosses the pinhole may be detected in the fiber at the end of the columnator. The columnator itself is chosen to be long enough to reject any stray light from other channels. For example, in one embodiment, the pinhole aperture is 150 micron diameter, the columnator is 250 micron diameter, the fiber is 300 micron diameter, and the collimator, which is positioned within 2 mm of the channel, is 1 mm long. At the far end of the fiber array 61, each fiber is attached to a phototube or other optical detector. Optical extinction is often sufficiently bright to use a photodiode for its detector.",
        "In FIG. 6C, a second ribbon 66 constructed substantially the same as the first described ribbon 63 but positioned at 90 degrees from the incident light which is appropriate for measuring 90 degree scatter or side scatter signals from cells or particles. One skilled in the art will recognize that similar ribbons may be positioned at other angles to observe other scattering parameters. A particular angle of interest is so called forward scatter which is optical scattering in the almost forward direction generally as close to direct forward positioning (nearly 180 degrees from incident) without acquiring straight through light in the extinction path.",
        "In a further embodiment, the light source 11 is a Coherent Sapphire 488/200 laser, which is a small, air-cooled solid state device producing about 200 mw with little or no noise from gas laser tube emissions. Alternatively, an OPSS (optically pumped solid state) laser is used, which is also capable of generating all the different excitation wavelengths needed to perform monitoring. One skilled in the art will recognize that any suitable light source may be used.",
        "FIG. 7 is a cross-section of one embodiment of beam shaping optics 12 suitable for use with the optical detector of the illustrative embodiment of the invention. The optical schematic is drawn in the x-z plane with the overall direction of light propagation along the z axis. Each dotted line leads up to a light beam x-y profile sketch 14′ to show how the beam is manipulated by the shaping optics. The beam passes from a single laser 11 output of nearly round profile 700 microns in diameter to a wavelength filtered beam after a low pass or band pass filter 74. The beam then passes through a first pair of cylindrical collimation lenses 73 having focal length 5 mm having focal length 250 mm, which produces a substantially rectangular-shaped beam. The beam then passes through a focusing lens 71 having focal length is a 150 mm cylindrical lens to sharpen the beam 14 to 100 microns in the y-axis. The overall profile in this embodiment after the focusing lens 71 is 36 mm by 100 micron and can be used to illuminate a pinhole array 13 of up to seventy pinholes/channels at 500 micron spacing. Since the pinholes are less than about 100 microns in the direction of the y-axis, the limitation of the beam prevents waste of the light. In an N pinhole chip spaced 500 microns on centers it is preferable for the beam to be slightly more than 500×N microns along the x-axis and 200 microns along the y-axis (slightly more than 100 microns) in order to minimize wasted laser power. The columnated and shaped beam then intersects the pinhole array 13 and becomes N pinhole shaped beams 78 that are spaced to intersect the matching array of channels 3.",
        "The beam shaping embodiment of FIG. 7 is very usable allowing minimal stray light and acceptable power efficiency of about 10% considering that this design allows simultaneous observation of fast (bandwidth>10 MHZ) extinction, scatter, and fluorescence from many channels at once.",
        "FIG. 8 shows a reflective beam splitter 80 based on a grooved mirror, suitable for use in the optical detection system of the present invention. The beam splitter 80 includes a segmented mirror 83 for splitting an incoming light beam into a plurality of beams. A columnated incident beam 82 enters the splitter 80 and is reflected off an incidence mirror 81 which is used to set the correct angle of incidence (generally a low angle) for the beam on the segmented mirror 83, which splits the incident beam into an array of smaller beams 84. The array of smaller beams 84 extend upwards parallel to the incident beam 82.",
        "The segmented mirror 83 comprises a uniform array of reflective grooves. Preferably, the uniform array comprises anisotropically etched silicon. Alternatively, the uniform array of grooves is made out of conventionally machined metal with an optical finish. In another embodiment, the uniform array of grooves formed in a plastic material, which is then covered with a reflective coating to for the array of grooves.",
        "FIG. 9 shows the angles and formulas guiding the design of such segmented mirrors. The incident beam 82 is partly clipped by each groove 83a in the mirror and that clipped part is reflected off at a fixed angle to make a narrower beam 84a. A second narrow beam 84b is formed by an adjacent groove 84b. Each groove is separated by the groove spacing A and the splitter generates beams of uniform spot width (assuming uniform grooves) and beam or lane spacing L which we design to match the pinhole and channel spacing in the microfluidic chip.",
        "FIG. 10 is a table of embodiments of the beam splitter of FIG. 8 where lane spacing L is 500 microns and the grooves are fabricated with silicon anisotropic etching (which has a fixed groove angle e=54.74) The table indicates a suitable mirror configuration for a selected spot size. For example, a 100 micron spot size, is suitable for pinholes <100 microns, corresponds to a groove spacing A=575 microns, groove inclination G=29.7 degrees and incident angle I=25 degrees.",
        "FIG. 11 sketches an embodiment of the beam shaping subsystem 112 suitable for use in the optical detector system. The illustrative beam shaping subsystem 112 makes use of a segmented mirror 80, such as the segmented mirror of FIG. 8, in a final stage after employing similar beam shaping optics 12 similar to the beam shaping optics 12 described with respect to FIG. 7.",
        "An alternative embodiment includes fabricating the pinhole arrays 13 on each microfluidic chip rather than having them separately mounted on the optical system.",
        "An alternative embodiment to the detectors for the array of fibers used in the image plane of FIGS. 4 and 5 is to place an image intensifier in that plane and place fibers behind that image intensifier to readout the optical signal it produces on its phosphor. Such an alternative may reduce costs by using only one light amplifying element (the image intensifier ) for all the fluorescence signals, and then photodiodes for conversion of post-image intensifier optical signals to electronic signals.",
        "FIG. 12 shows a picture of a standard Hamamatsu image intensifier 220 but one skilled in the art will recognize that any large area light amplifying component with high spatial resolution may be used in this alternative. The image intensifier 220 is used to amplify the intensity of an optical image before passing the signal to a photodiode array or other suitable detection device. As shown, the image intensifier includes an input window 221 for the image signal, a light-sensitive electron emitter, such as a photocathode 222, for transforming the light to photoelectrons, a MCP 223 for electron muitiplication, a phosphor screen 224 for converting the electrons to light and an output window 225, illustrated as a fiber optic plate. According to an illustrative embodiment, the image intensifier may comprise a 25 mm-40 mm Hamamatsu image intensifier, though one skilled in the art will recognize that any suitable device may be used.",
        "An alternative embodiment to both the beam shaping subsystem 12 and the fluorescence detection subsystem 17 includes short pass or long pass or wavelength band pass or band blocking filters to remove stray or spurious source light in the case of the fluorescence detection system or to remove stray or spurious wavelength components from the light emitted by the light source 11.",
        "An alternative embodiment to the extinction and scatter detectors 15 and 16 is to add an independent laser power monitor to the system to use in normalizing those signals. This is useful since both of those signals are directly proportional to laser power so noise on the laser may distort those signals.",
        "An alternative embodiment to the arrays of fibers used with the detectors 15, 16 and 17 is to replace each array of fibers with an array of photodiodes or avalanche photodiodes or other optical detector array. One skilled in the art will recognize that alternative detectors are possible here as long as they match the light level requirement of the samples and the form factor requirements of the specific chip embodiments to be used.",
        "An alternative embodiment to the beam splitter might use reflective groove arrays manufactured by anisotropically etching crystalline materials or conventional machining of metal or forming of plastic followed by appropriate optical polishing or reflective coating In all embodiments of this invention the pinhole array is generally matched in spacing to the microfluidic channels. When a reflective beam splitter is used in the beam shaping optics it also must be matched to the pinholes.",
        "While the simplest implementations use uniformly arrayed channels and uniformly arrayed pinholes and possibly uniformly arrayed grooves in beam splitting this is not required by the invention and similar embodiments can be designed to use irregular spacing or patterns of channels",
        "An alternative embodiment to the fluorescence detection subsystem A7 is to add narrow bandpass filters before or after the fibers in the image plane (3-5), (2-8)·a 400 micron fiber in that plane will capture a 10 nm bandwidth. Adding 10 nm or 5 nm bandpass filters will improve the sensitivity and reduce noise in some cases.",
        "The present invention has been described relative to an illustrative embodiment. Since certain changes may be made in the above constructions without departing from the scope of the invention, it is intended that all matter contained in the above description or shown in the accompanying drawings be interpreted as illustrative and not in a limiting sense.",
        "It is also to be understood that the following claims are to cover all generic and specific features of the invention described herein, and all statements of the scope of the invention which, as a matter of language, might be said to fall therebetween."
    ],
    "citations": [
        "4498353",
        "5644388",
        "5867266",
        "6197575",
        "6221226",
        "6316781",
        "6337740",
        "6353475",
        "6504607",
        "6567163",
        "6602702",
        "6616823",
        "6632400",
        "6649403",
        "6674525",
        "6703205",
        "6744038",
        "6747285",
        "6756019",
        "6759662",
        "6767706"
    ],
    "us_classification": "356338",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "01",
            "subclass": "N",
            "main_group": "21",
            "subgroup": "00"
        }
    ]
}