{
    "title": "Methods and compositions for treating epilepsy",
    "abstract": "Compositions comprising a plurality of yeast cells, wherein said plurality of yeast cells have been cultured in the presence of an alternating electric field having a specific frequency and a specific field strength for a period of time sufficient to increase the capability of said plurality of yeast cells to treat epilepsy. Also included are methods of making such compositions and methods of treating epilepsy.",
    "inventors": [
        "Cheung"
    ],
    "document_number": "07297522",
    "publication_date": "20071120",
    "assignees": [
        "Ultra Biotech Limited"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of preparing a yeast composition, comprising: culturing yeast cells of",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein the range of the frequency is about 10200 to 10270, 12330 to 12390 or 12970 to 13040 MHz.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , wherein the range of the field strength is about 200 to 500 mV/cm.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A method of treating epilepsy in a subject having epilepsy, comprising the step of administering to said subject the composition made by the method of any one of claims 1 to 3 .",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 4 , wherein the administration is through oral administration.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein the composition is in the form of a tablet, powder or health drink.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein the composition is in the form of a health drink.",
            "components": []
        }
    ],
    "description": [
        "The invention relates to compositions that treat epilepsy and can be taken as dietary supplements or medication. These compositions contain yeast cells obtainable by growth in electromagnetic fields with specific frequencies and field strengths.",
        "Epilepsy is a chronic illness caused by abnormality in the central nervous system. An epileptic seizure is a brief, excessive surge of electrical activity in the brain that causes a change in consciousness, sensation and behavior. During an epileptic seizure, the regulatory systems that maintain the normal balance between excitation and inhibition of the brain's electrical activity break down. There may be a loss of inhibitory nerve cells or an overproduction of an excitatory neurotransmitter. Groups of abnormal cells are activated synchronously, creating a storm of electrical activity.",
        "Patients taking anticonvulsant drugs display a broad spectrum of side-effects. The widely used drug carbamazepine, shows side effects such as dizziness, ataxia, drowsiness and reduction of alertness. See, A. Delcker et al., Eur. Neuropsychopharmacold., 7, pp. 213-8 (1997). Valproic acid may precipitate metabolic disorders, liver disease, gastrointestinal symptomatology, excessive bodyweight gain and alopecia. See, S. J. Wallace, Drug Saf, 15, pp. 378-93 (1996). Barbiturates precipitates metabolic bone disease and rash. See, S. J. Wallace, Drug Saf, 15, pp. 378-93 (1996). Therefore, there is a need on the market for anticonvulsant medication with fewer side effects.",
        "The composition of the invention assists in the recovery of epilepsy and can be taken as dietary supplements in the form of health drinks or pills.",
        "This invention embraces a composition comprising a plurality of yeast cells that have been cultured in the presence of an alternating electric field having a frequency in the range of about 10200 to 13040 MHz and a field strength in the range of about 20 to 600 mV/cm. In one embodiment, the frequency is in the range of about 10200-10270, 12330-12390, or 12970-13040 MHz. In another embodiment, the field strength is in the range of about 200-500 mV/cm. The yeast cells are cultured in the alternating electric field for a period of time sufficient to increase the capability of said plurality of yeast cells to have an anti-seizure effect or treat epilepsy as compared to unactivated yeast cells. In one embodiment, the composition comprising the activated yeast cells reduces the occurrence of epileptic seizures in mammals. Preferably, the mammal is human. In one embodiment, the human has seizure activity. In one embodiment, the frequency and/or the field strength of the alternating electric field can be altered within the aforementioned ranges during said period of time. In other words, the yeast cells can be exposed to a series of electromagnetic fields. An exemplary period of time is about 140-210 hours.",
        "Also included in this invention is a composition comprising a plurality of yeast cells that have been cultured under acidic conditions in an alternating electric field having a frequency in the range of about 12970-13040 MHz and a field strength in the range of about 260 to 510 mV/cm (e.g., 260-280, 330-360, 350-380, 430-470 or 470-510 mV/cm). In one embodiment, the yeast cells are exposed to a series of electromagnetic fields. An exemplary period of time is about 180-210 hours.",
        "Included in this invention are also methods of making the above compositions and methods of treating a subject with epilepsy.",
        "Yeast cells that can be included in this composition can all be derived from parent strains publically available from the China General Microbiological Culture Collection Center (“CGMCC”) (China Committee for Culture Collection of Microorganisms, Institute of Microbiology, Chinese Academy of Sciences, Haidian, P.O. BOX 2714, Beijing, 100080, China). Useful yeast species include, but are not limited to Schizosaccharomyces pombe, Saccharomyces sake, Saccharomyces uvarum, Saccharomyces rouxii, Saccharomyces carlsbergensis, Rhodotorula aurantiaca and Saccharomyces cerevisiae. In one embodiment, the yeast species is Saccharomyces carlsbergensis Hansen or Saccharomyces cerevisiae Hansen. For instance, the yeast cells can be of the strain Saccharomyces cerevisiae Hansen IFFI1335. In one embodiment, the yeast cells are from the strains selected from the group consisting of Saccharomyces cerevisiae Hansen AS2.501, AS2.502, AS2.503, AS2.504, AS2.535, AS2.558, AS2.560, AS2.561, AS2.443 and AS2.562. Other useful yeast species are illustrated in Table 1.",
        "Unless otherwise defined, all technical and scientific terms used herein have the same meaning as commonly understood by one of ordinary skill in the art to which this invention belongs. Exemplary methods and materials are described below, although methods and materials similar or equivalent to those described herein can also be used in the practice or testing of the present invention. All publications and other references mentioned herein are incorporated by reference in their entirety. In case of conflict, the present specification, including definitions, will control. The materials, methods, and examples are illustrative only and not intended to be limiting. Throughout this specification and claims, the word “comprise,” or variations such as “comprises” or “comprising” will be understood to imply the inclusion of a stated integer or group of integers but not the exclusion of any other integer or group of integers.",
        "Other features and advantages of the invention will be apparent from the following detailed description, and from the claims.",
        "FIG. 1 is a schematic diagram showing an exemplary apparatus for activating yeast cells using electromagnetic fields. 1: yeast culture; 2: container; 3: power supply.",
        "FIG. 2 is a schematic diagram showing an exemplary apparatus for making yeast compositions of the invention. The apparatus comprises a signal generator (such as models 83721B and 83741A manufactured by HP) and interconnected containers A, B and C.",
        "This invention is based on the discovery that certain yeast strains can be activated by electromagnetic fields (“EMF”) having specific frequencies and field strengths to produce agents useful in treating epilepsy. Yeast compositions comprising activated yeast cells can be used as medication or dietary supplements in the form of health drinks or dietary pills. In one embodiment, the yeast compositions of this invention have an anti-seizure effect in a mammal. In one embodiment, the mammal is human.",
        "Since the activated yeast cells contained in these yeast compositions have been cultured to endure acidic conditions of pH 2.5-4.2, the compositions are stable in the stomach and can pass on to the intestines. Once in the intestines, the yeast cells are ruptured by various digestive enzymes, and agents for regulating the central nervous system are released and readily absorbed.",
        "I. Yeast Strains Useful in the Invention",
        "The types of yeasts useful in this invention include, but are not limited to, yeasts of the genera Saccharomyces, Schizosaccharomyces, and Rhodotorula.",
        "Exemplary species within the above-listed genera include, but are not limited to, the species illustrated in Table 1. Yeast strains useful in this invention can be obtained from laboratory cultures, or from publically accessible culture depositories, such as CGMCC and the American Type Culture Collection, 10801 University Boulevard, Manassas, Va. 20110-2209. Non-limiting examples of useful strains (with the accession numbers of CGMCC) are illustrated in Table 1. In general, yeast strains preferred in this invention are those used for fermentation in the food and wine industries. As a result, compositions containing these yeast cells are safe for human consumption.",
        "The preparation of the yeast compositions of this invention is not limited to starting with a pure strain of yeast. A yeast composition of the invention may be produced by culturing a mixture of yeast cells of different species or strains.",
        "TABLE 1\n\n\n\n\n\nExemplary Yeast Strains \n\n\n\n\n\n\n\nSaccharomyces cerevisiae Hansen\n\n\n\n\n\n\n\n\n\n\n\nACCC2034\nACCC2035\nACCC2036\nACCC2037\nACCC2038\n\n\nACCC2039\nACCC2040\nACCC2041\nACCC2042\nAS2.1\n\n\nAS2.4\nAS2.11\nAS2.14\nAS2.16\nAS2.56\n\n\nAS2.69\nAS2.70\nAS2.93\nAS2.98\nAS2.101\n\n\nAS2.109\nAS2.110\nAS2.112\nAS2.139\nAS2.173\n\n\nAS2.174\nAS2.182\nAS2.196\nAS2.242\nAS2.336\n\n\nAS2.346\nAS2.369\nAS2.374\nAS2.375\nAS2.379\n\n\nAS2.380\nAS2.382\nAS2.390\nAS2.393\nAS2.395\n\n\nAS2.396\nAS2.397\nAS2.398\nAS2.399\nAS2.400\n\n\nAS2.406\nAS2.408\nAS2.409\nAS2.413\nAS2.414\n\n\nAS2.415\nAS2.416\nAS2.422\nAS2.423\nAS2.430\n\n\nAS2.431\nAS2.432\nAS2.451\nAS2.452\nAS2.453\n\n\nAS2.458\nAS2.460\nAS2.463\nAS2.467\nAS2.486\n\n\nAS2.501\nAS2.502\nAS2.503\nAS2.504\nAS2.516\n\n\nAS2.535\nAS2.536\nAS2.558\nAS2.560\nAS2.561\n\n\nAS2.562\nAS2.576\nAS2.593\nAS2.594\nAS2.614\n\n\nAS2.620\nAS2.628\nAS2.631\nAS2.666\nAS2.982\n\n\nAS2.1190\nAS2.1364\nAS2.1396\nIFFI1001\nIFFI1002\n\n\nIFFI1005\nIFFI1006\nIFFI1008\nIFFI1009\nIFFI1010\n\n\nIFFI1012\nIFFI1021\nIFFI1027\nIFFI1037\nIFFI1042\n\n\nIFFI1043\nIFFI1045\nIFFI1048\nIFFI1049\nIFFI1050\n\n\nIFFI1052\nIFFI1059\nIFFI1060\nIFFI1062\nIFFI1063\n\n\nIFFI1202\nIFFI1203\nIFFI1206\nIFFI1209\nIFFI1210\n\n\nIFFI1211\nIFFI1212\nIFFI1213\nIFFI1214\nIFFI1215\n\n\nIFFI1220\nIFFI1221\nIFFI1224\nIFFI1247\nIFFI1248\n\n\nIFFI1251\nIFFI1270\nIFFI1277\nIFFI1287\nIFFI1289\n\n\nIFFI1290\nIFFI1291\nIFFI1292\nIFFI1293\nIFFI1297\n\n\nIFFI1300\nIFFI1301\nIFFI1302\nIFFI1307\nIFFI1308\n\n\nIFFI1309\nIFFI1310\nIFFI1311\nIFFI1331\nIFFI1335\n\n\nIFFI1336\nIFFI1337\nIFFI1338\nIFFI1339\nIFFI1340\n\n\nIFFI1345\nIFFI1348\nIFFI1396\nIFFI1397\nIFFI1399\n\n\nIFFI1411\nIFFI1413\nIFFI1441\nIFFI1443\n\n\n\n\n\n\n\nSaccharomyces cerevisiae Hansen Var. ellipsoideus (Hansen) Dekker\n\n\n\n\n\n\n\n\n\n\n\nACCC2043\nAS2.2\nAS2.3\nAS2.8\nAS2.53\n\n\nAS2.163\nAS2.168\nAS2.483\nAS2.541\nAS2.559\n\n\nAS2.606\nAS2.607\nAS2.611\nAS2.612\n\n\n\n\n\n\n\nSaccharomyces chevalieri Guilliermond\n\n\n\n\n\n\n\n\n\n\n\nAS2.131\nAS2.213\n\n\n\n\n\n\n\n\n\n\nSaccharomyces delbrueckii\n\n\n\n\n\n\n\n\n\n\n\nAS2.285\n\n\n\n\n\n\n\n\n\n\n\nSaccharomyces delbrueckii Lindner ver. mongolicus (Saito) Lodder et van Rij\n\n\n\n\n\n\n\n\n\n\n\nAS2.209\nAS2.1157\n\n\n\n\n\n\n\n\n\n\nSaccharomyces exiguous Hansen\n\n\n\n\n\n\n\n\n\n\n\nAS2.349\nAS2.1158\n\n\n\n\n\n\n\n\n\n\nSaccharomyces fermentati (Saito) Lodder et van Rij\n\n\n\n\n\n\n\n\n\n\n\nAS2.286\nAS2.343\n\n\n\n\n\n\n\n\n\n\nSaccharomyces logos van laer et Denamur ex Jorgensen\n\n\n\n\n\n\n\n\n\n\n\nAS2.156\nAS2.327\nAS2.335\n\n\n\n\n\n\n\n\n\nSaccharomyces mellis (Fabian et Quinet) Lodder et kreger van Rij\n\n\n\n\n\n\n\n\n\n\n\nAS2.195\n\n\n\n\n\n\n\n\n\n\n\nSaccharomyces mellis Microellipsoides Osterwalder\n\n\n\n\n\n\n\n\n\n\n\nAS2.699\n\n\n\n\n\n\n\n\n\n\n\nSaccharomyces oviformis Osteralder\n\n\n\n\n\n\n\n\n\n\n\nAS2.100\n\n\n\n\n\n\n\n\n\n\n\nSaccharomyces rosei (Guilliermond) Lodder et Kreger van Rij\n\n\n\n\n\n\n\n\n\n\n\nAS2.287\n\n\n\n\n\n\n\n\n\n\n\nSaccharomyces rouxii Boutroux\n\n\n\n\n\n\n\n\n\n\n\nAS2.178\nAS2.180\nAS2.370\nAS2.371\n\n\n\n\n\n\n\n\nSaccharomyces sake Yabe\n\n\n\n\n\n\n\n\n\n\n\nACCC2045\n\n\n\n\n\n\n\n\n\n\n\nCandida arborea\n\n\n\n\n\n\n\n\n\n\n\nAS2.566\n\n\n\n\n\n\n\n\n\n\n\nCandida lambica (Lindner et Genoud) van. Uden et Buckley\n\n\n\n\n\n\n\n\n\n\n\nAS2.1182\n\n\n\n\n\n\n\n\n\n\n\nCandida krusei (Castellani) Berkhout\n\n\n\n\n\n\n\n\n\n\n\nAS2.1045\n\n\n\n\n\n\n\n\n\n\n\nCandida lipolytica (Harrison) Diddens et Lodder\n\n\n\n\n\n\n\n\n\n\n\nAS2.1207\nAS2.1216\nAS2.1220\nAS2.1379\nAS2.1398\n\n\nAS2.1399\nAS2.1400\n\n\n\n\n\n\n\nCandida parapsilosis (Ashford) Langeron et Talice Var. intermedia Van Rij et Verona\n\n\n\n\n\n\n\n\n\n\n\nAS2.491\n\n\n\n\n\n\n\n\n\n\n\nCandida parapsilosis (Ashford) Langeron et Talice\n\n\n\n\n\n\n\n\n\n\n\nAS2.590\n\n\n\n\n\n\n\n\n\n\n\nCandida pulcherrima (Lindner) Windisch\n\n\n\n\n\n\n\n\n\n\n\nAS2.492\n\n\n\n\n\n\n\n\n\n\n\nCandida rugousa (Anderson) Diddens et Lodder\n\n\n\n\n\n\n\n\n\n\n\nAS2.511\nAS2.1367\nAS2.1369\nAS2.1372\nAS2.1373\n\n\nAS2.1377\nAS2.1378\nAS2.1384\n\n\n\n\n\n\n\nCandida tropicalis (Castellani) Berkhout\n\n\n\n\n\n\n\n\n\n\n\nACCC2004\nACCC2005\nACCC2006\nAS2.164\nAS2.402\n\n\nAS2.564\nAS2.565\nAS2.567\nAS2.568\nAS2.617\n\n\nAS2.637\nAS2.1387\nAS2.1397\n\n\n\n\n\n\n\nCandida utilis Henneberg Lodder et Kreger Van Rij\n\n\n\n\n\n\n\n\n\n\n\nAS2.120\nAS2.281\nAS2.1180\n\n\n\n\n\n\n\n\n\nCrebrothecium ashbyii (Guillermond)\n\n\nRoutein (Eremothecium ashbyii Guilliermond)\n\n\n\n\n\n\n\n\n\n\n\nAS2.481\nAS2.482\nAS2.1197\n\n\n\n\n\n\n\n\n\nGeotrichum candidum Link\n\n\n\n\n\n\n\n\n\n\n\nACCC2016\nAS2.361\nAS2.498\nAS2.616\nAS2.1035\n\n\nAS2.1062\nAS2.1080\nAS2.1132\nAS2.1175\nAS2.1183\n\n\n\n\n\n\n\nHansenula anomala (Hansen)H et P sydow\n\n\n\n\n\n\n\n\n\n\n\nACCC2018\nAS2.294\nAS2.295\nAS2.296\nAS2.297\n\n\nAS2.298\nAS2.299\nAS2.300\nAS2.302\nAS2.338\n\n\nAS2.339\nAS2.340\nAS2.341\nAS2.470\nAS2.592\n\n\nAS2.641\nAS2.642\nAS2.782\nAS2.635\nAS2.794\n\n\n\n\n\n\n\nHansenula arabitolgens Fang\n\n\n\n\n\n\n\n\n\n\n\nAS2.887\n\n\n\n\n\n\n\n\n\n\n\nHansenula jadinii (A. et R Sartory Weill et Meyer) Wickerham\n\n\n\n\n\n\n\n\n\n\n\nACCC2019\n\n\n\n\n\n\n\n\n\n\n\nHansenula saturnus (Klocker) H et P sydow\n\n\n\n\n\n\n\n\n\n\n\nACCC2020\n\n\n\n\n\n\n\n\n\n\n\nHansenula schneggii (Weber) Dekker\n\n\n\n\n\n\n\n\n\n\n\nAS2.304\n\n\n\n\n\n\n\n\n\n\n\nHansenula subpelliculosa Bedford\n\n\n\n\n\n\n\n\n\n\n\nAS2.740\nAS2.760\nAS2.761\nAS2.770\nAS2.783\n\n\nAS2.790\nAS2.798\nAS2.866\n\n\n\n\n\n\n\nKloeckera apiculata (Reess emend. Klocker) Janke\n\n\n\n\n\n\n\n\n\n\n\nACCC2022\nACCC2023\nAS2.197\nAS2.496\nAS2.714\n\n\nACCC2021\nAS2.711\n\n\n\n\n\n\n\nLipomycess starkeyi Lodder et van Rij\n\n\n\n\n\n\n\n\n\n\n\nAS2.1390\nACCC2024\n\n\n\n\n\n\n\n\n\n\nPichia farinosa (Lindner) Hansen\n\n\n\n\n\n\n\n\n\n\n\nACCC2025\nACCC2026\nAS2.86\nAS2.87\nAS2.705\n\n\nAS2.803\n\n\n\n\n\n\n\nPichia membranaefaciens Hansen\n\n\n\n\n\n\n\n\n\n\n\nACCC2027\nAS2.89\nAS2.661\nAS2.1039\n\n\n\n\n\n\n\n\nRhodosporidium toruloides Banno\n\n\n\n\n\n\n\n\n\n\n\nACCC2028\n\n\n\n\n\n\n\n\n\n\n\nRhodotorula glutinis (Fresenius) Harrison\n\n\n\n\n\n\n\n\n\n\n\nAS2.2029\nAS2.280\nACCC2030\nAS2.102\nAS2.107\n\n\nAS2.278\nAS2.499\nAS2.694\nAS2.703\nAS2.704\n\n\nAS2.1146\n\n\n\n\n\n\n\nRhodotorula minuta (Saito) Harrison\n\n\n\n\n\n\n\n\n\n\n\nAS2.277\n\n\n\n\n\n\n\n\n\n\n\nRhodotorula rubar (Demme) Lodder\n\n\n\n\n\n\n\n\n\n\n\nAS2.21\nAS2.22\nAS2.103\nAS2.105\nAS2.108\n\n\nAS2.140\nAS2.166\nAS2.167\nAS2.272\nAS2.279\n\n\nAS2.282\nACCC2031\n\n\n\n\n\n\n\nRhodotorula aurantiaca (Saito) Lodder\n\n\n\n\n\n\n\n\n\n\n\nAS2.102\nAS2.107\nAS2.278\nAS2.499\nAS2.694\n\n\nAS2.703\nAS2.1146\n\n\n\n\n\n\n\nSaccharomyces carlsbergensis Hansen\n\n\n\n\n\n\n\n\n\n\n\nAS2.113\nACCC2032\nACCC2033\nAS2.312\nAS2.116\n\n\nAS2.118\nAS2.121\nAS2.132\nAS2.162\nAS2.189\n\n\nAS2.200\nAS2.216\nAS2.265\nAS2.377\nAS2.417\n\n\nAS2.420\nAS2.440\nAS2.441\nAS2.443\nAS2.444\n\n\nAS2.459\nAS2.595\nAS2.605\nAS2.638\nAS2.742\n\n\nAS2.745\nAS2.748\nAS2.1042\n\n\n\n\n\n\n\nSaccharomyces uvarum Beijer\n\n\n\n\n\n\n\n\n\n\n\nIFFI1023\nIFFI1032\nIFFI1036\nIFFI1044\nIFFI1072\n\n\nIFFI1205\nIFFI1207\n\n\n\n\n\n\n\nSaccharomyces willianus Saccardo\n\n\n\n\n\n\n\n\n\n\n\nAS2.5 AS2.7\nAS2.119\nAS2.152\nAS2.293\n\n\n\nAS2.381\nAS2.392\nAS2.434\nAS2.614\nAS2.1189\n\n\n\n\n\n\n\nSaccharomyces sp.\n\n\n\n\n\n\n\n\n\n\n\nAS2.311\n\n\n\n\n\n\n\n\n\n\n\nSaccharomycodes ludwigii Hansen\n\n\n\n\n\n\n\n\n\n\n\nACCC2044\nAS2.243\nAS2.508\n\n\n\n\n\n\n\n\n\nSaccharomycodes sinenses Yue\n\n\n\n\n\n\n\n\n\n\n\nAS2.1395\n\n\n\n\n\n\n\n\n\n\n\nSchizosaccharomyces octosporus Beijerinck\n\n\n\n\n\n\n\n\n\n\n\nACCC2046\nAS2.1148\n\n\n\n\n\n\n\n\n\n\nSchizosaccharomyces pombe Lindner\n\n\n\n\n\n\n\n\n\n\n\nACCC2047\nACCC2048\nAS2.214\nAS2.248\nAS2.249\n\n\nAS2.255\nAS2.257\nAS2.259\nAS2.260\nAS2.274\n\n\nAS2.994\nAS2.1043\nAS2.1149\nAS2.1178\nIFFI1056\n\n\n\n\n\n\n\nSporobolomyces roseus Kluyver et van Niel\n\n\n\n\n\n\n\n\n\n\n\nACCC2049\nACCC2050\nAS2.19\nAS2.962\nAS2.1036\n\n\nACCC2051\nAS2.261\nAS2.262\n\n\n\n\n\n\n\nTorulopsis candida (Saito) Lodder\n\n\n\n\n\n\n\n\n\n\n\nAS2.270\nACCC2052\n\n\n\n\n\n\n\n\n\n\nTorulopsis famta (Harrison) Lodder et van Rij\n\n\n\n\n\n\n\n\n\n\n\nACCC2053\nAS2.685\n\n\n\n\n\n\n\n\n\n\nTorulopsis globosa (Olson et Hammer) Lodder et van Rij\n\n\n\n\n\n\n\n\n\n\n\nACCC2054\nAS2.202\n\n\n\n\n\n\n\n\n\n\nTorulopsis inconspicua Lodder et Kreger van Rij\n\n\n\n\n\n\n\n\n\n\n\nAS2.75\n\n\n\n\n\n\n\n\n\n\n\nTrichosporon behrendii Lodder et Kreger van Rij\n\n\n\n\n\n\n\n\n\n\n\nACCC2056\nAS2.1193\n\n\n\n\n\n\n\n\n\n\nTrichosporon capitatum Diddens et Lodder\n\n\n\n\n\n\n\n\n\n\n\nACCC2056\nAS2.1385\n\n\n\n\n\n\n\n\n\n\nTrichosporon cutaneum (de Beurm et al.) Ota\n\n\n\n\n\n\n\n\n\n\n\nACCC2057\nAS2.25\nAS2.570\nAS2.571\nAS2.1374\n\n\n\n\n\n\n\nWickerhamia fluorescens (Soneda) Soneda\n\n\n\n\n\n\n\n\n\n\n\nACCC2058\nAS2.1388\n\n\n\n\n\n\n\n\n\nII. Application of Electromagnetic Fields",
        "An electromagnetic field useful in this invention can be generated and applied by various means well known in the art. For instance, the EMF can be generated by applying an alternating electric field or an oscillating magnetic field.",
        "Alternating electric fields can be applied to cell cultures through electrodes in direct contact with the culture medium, or through electromagnetic induction. See, e.g., FIG. 1. Relatively high electric fields in the medium can be generated using a method in which the electrodes are in contact with the medium. Care must be taken to prevent electrolysis at the electrodes from introducing undesired ions into the culture and to prevent contact resistance, bubbles, or other features of electrolysis from dropping the field level below that intended. Electrodes should be matched to their environment, for example, using Ag—AgCl electrodes in solutions rich in chloride ions, and run at as low a voltage as possible. For general review, see Goodman et al., Effects of EMF on Molecules and Cells, International Review of Cytology, A Survey of Cell Biology, Vol. 158, Academic Press, 1995.",
        "The EMFs useful in this invention can also be generated by applying an oscillating magnetic field. An oscillating magnetic field can be generated by oscillating electric currents going through Helmholtz coils. Such a magnetic field in turn induces an electric field.",
        "The frequencies of EMFs useful in this invention range from about 10200 to 13040 (e.g., 10200 to 10270, 12330 to 12390 and 12970 to 13040 MHz). Exemplary frequencies include 10231, 10237, 12361, 12997 and 13008 MHz. The field strength of the electric field useful in this invention ranges from about 20 to 600 mV/cm (e.g., 240-300, 310-340, 350-380, 380-430, 430-470 and 470-510 mV/cm). Exemplary field strengths include 246, 272, 288, 322, 343, 346, 364, 393, 446 and 483 mV/cm.",
        "When a series of EMFs are applied to a yeast culture, the yeast culture can remain in the same container while the same set of EMF generator and emitters is used to change the frequency and/or field strength. The EMFs in the series can each have a different frequency or a different field strength; or a different frequency and a different field strength. Such frequencies and field strengths are preferably within the above-described ranges. Although any practical number of EMFs can be used in a series, it may be preferred that the yeast culture be exposed to a total of 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13 or more EMFs in a series. In one embodiment, the yeast culture is exposed to a series of EMFs, wherein the frequency of the electric field is alternated in the range of about 10200 to 10270, 12330 to 12390 and 12970 to 13040 MHz.",
        "Although the yeast cells can be activated after even a few hours of culturing in the presence of an EMF, it may be preferred that the compositions comprising activated yeast cells be allowed to multiply and grow in the presence of the EMF(s) for a total of about 140-210 hours. In the presence of 13 EMFs, the compositions can be grown for about 50-380, 80-380, 100-350, or 250-350 hours. In the presence of 1 EMF, the compositions can be grown for about 5-60, 10-50, 80-180 or 100-150 hours.",
        "FIG. 1 illustrates an exemplary apparatus for generating alternating electric fields. An electric field of a desired frequency and intensity can be generated by an AC source (3) capable of generating an alternating electric field, preferably in a sinusoidal wave form, in the frequency range of 5 to 20,000 MHz. Signal generators capable of generating signals with a narrower frequency range can also be used. If desired, a signal amplifier can also be used to increase the output. The culture container (2) can be made from a non-conductive material, e.g., glass, plastic or ceramic. The cable connecting the culture container (2) and the signal generator (3) is preferably a high frequency coaxial cable with a transmission frequency of at least 30 GHz.",
        "The alternating electric field can be applied to the culture by a variety of means, including placing the yeast culture (1) in close proximity to the signal emitters such as a metal wire or tube capable of transmitting EMFs. The metal wire or tube can be made of red copper, and be placed inside the container (2), reaching as deep as 3-30 cm. For example, if the fluid in the container (2) has a depth of 15-20 cm, 20-30 cm, 30-50 cm, 50-70 cm, 70-100 cm, 100-150 cm or 150-200 cm, the metal wire can be 3-5 cm, 5-7 cm, 7-10 cm, 10-15 cm, 15-20 cm, 20-30 cm and 25-30 cm from the bottom of the container (2), respectively. The number of metal wires/tubes used can be from 1 to 10 (e.g., 2 to 3). It is recommended, though not mandated, that for a culture having a volume up to 10 L, metal wires/tubes having a diameter of 0.5 to 2 mm be used. For a culture having a volume of 10-100 L, metal wires/tubes having a diameter of 3 to 5 mm can be used. For a culture having a volume of 100-1000 L, metal wires/tubes having a diameter of 6 to 15 mm can be used. For a culture having a volume greater than 1000 L, metal wires/tubes having a diameter of 20-25 mm can be used.",
        "In one embodiment, the electric field is applied by electrodes submerged in the culture (1). In this embodiment, one of the electrodes can be a metal plate placed on the bottom of the container (2), and the other electrode can comprise a plurality of electrode wires evenly distributed in the culture (1) so as to achieve even distribution of the electric field energy. The number of electrode wires used depends on the volume of the culture as well as the diameter of the wires.",
        "III. Culture Media",
        "Culture media useful in this invention contain sources of nutrients assimilatable by yeast cells. Complex carbon-containing substances in a suitable form (e.g., carbohydrates such as sucrose, glucose, dextrose, maltose, starch and xylosel; or mannitol) can be the carbon sources for yeast cells. The exact quantity of the carbon sources can be adjusted in accordance with the other ingredients of the medium. In general, the amount of carbon-containing substances varies between about 0.5% and 10% by weight of the medium, and preferably between about 1% and 5%, most preferably between about 1.0-2.0%. Vitamins can also be added to the medium, for example, Vitamin E, D3, H and B6. Among the inorganic salts which can be added to a laboratory culture medium are the customary salts capable of yielding sodium, potassium, calcium, phosphate, sulfate, carbonate, and like ions. Non-limiting examples of nutrient inorganic salts are (NH4)2HPO4, CaCO3, KH2PO4, K2HPO4, MgSO4, NaCl, and CaSO4.",
        "IV. Electromagnetic Activation of Yeast Cells",
        "To activate or enhance the innate ability of yeast cells to produce agents that are useful in regulating the central nervous system, these cells can be cultured in an appropriate medium under sterile conditions at 20° C.-35° C. (e.g., 28-32° C.) for a sufficient amount of time, e.g. 5-60, 10-50, 80-180, 100-150, 140-210, 50-380, 80-380, 100-350, or 250-350 hours in an alternating electric field or a series of alternating electric fields as described above.",
        "An exemplary set-up of the culture process is depicted in FIG. 1 (see above). An exemplary culture medium contains the following in per 1000 ml of sterile water: 6.0 g of sucrose, 12 g of mannitol, 60 μg of Vitamin E, 50 μg of Vitamin D3, 60 μg Vitamin H, 90 μg of Vitamin B6, 50 ml bovine serum, 0.2 g of KH2PO4, 0.25 g of MgSO4•7H2O, 0.3 g of NaCl, 0.2 g of CaSO4•2H2O, 4.0 g of CaCO3°5H2O and 2.5 g of peptone. All vitamins are sterilized before added to the solution. Yeast cells of the desired strains are then added to the culture medium to form a mixture containing 1×108 yeast cells per 1000 ml of culture medium. The yeast cells can be of any of the strains illustrated in Table 1. In one embodiment, the yeast cells are of the strain Saccharomyces cerevisiae Hansen IFFI1335. The mixture is then added to the apparatus of FIG. 1.",
        "The activation process of the yeast cells involves the following steps: 1) maintaining the temperature of the activation apparatus at 20-35° C. (e.g., 28-32° C.), and culturing the yeast cells for 28 hours; 2) applying an electric field having a frequency of about 10231 MHz and a field strength of 240-260 mV/cm (e.g., about 246 mV/cm) for 16 hours; 3) then applying an electric field having a frequency of about 10237 MHz and a field strength of 310-340 mV/cm (e.g., about 322 mV/cm) for 42 hours; 4) then applying an electric field having a frequency of about 12361 MHz and a field strength of 350-380 mV/cm (about 364 mV/cm) for 38 hours; 5) then applying an electric field having a frequency of about 12997 MHz and a field strength of 380-420 mV/cm (e.g., about 393 mV/cm) for 38 hours; 6) then applying an electric field having a frequency of about 13008 MHz and a field strength of 280-300 mV/cm (e.g., about 288 mV/cm) for 16 hours; and 7) finally lyophilizing the activated yeast cells to form a powder and storing the powder at 4° C. Preferably, the concentration of the lyophilized yeast cells is more than 1010 cells/g.",
        "V. Acclimatization of Yeast Cells To the Gastric Environment",
        "Because the yeast compositions of this invention must pass through the stomach before reaching the small intestine, where the effective components are released from these yeast cells, it is preferred that these yeast cells be cultured under acidic conditions to acclimatize the cells to the gastric juice. This acclimatization process results in better viability of the yeasts in the acidic gastric environment.",
        "To achieve this, the yeast powder containing activated yeast cells can be mixed with an acclimatizing culture medium at 10 g (containing more than 1010 activated cells per gram) per 1000 ml. The yeast mixture is then cultured first in the presence of an alternating electric field having a frequency of about 12997 MHz and a field strength of 370-430 mV/cm (e.g., about 446 mV/cm) at about 28 to 32° C. for 34-42 hours (e.g., 38 hours). The resultant yeast cells are further incubated in the presence of an alternating electric field having a frequency of about 13008 MHz and a field strength of 350-380 mV/cm (e.g., about 364 mV/cm) at about 28 to 32° C. for 16-28 hours (e.g., 20 hours). The resulting acclimatized yeast cells are then dried and stored either in powder form (≧1010 cells/g) at room temperature or stored in vacuum at 0-4° C.",
        "An exemplary acclimatizing culture medium is made by mixing 700 ml of fresh pig gastric juice and 300 ml of wild Chinese hawthorn extract. The pH of acclimatizing culture medium is adjusted to 2.5 with 0.1 M hydrochloric acid and 0.2 M potassium biphthalate (C6H4(COOK)COOH). The fresh pig gastric juice is prepared as follows. At about 4 months of age, newborn Holland white pigs are sacrificed, and the entire contents of their stomachs are retrieved and mixed with 2000 ml of water under sterile conditions. The mixture is then allowed to stand for 6 hours at 4° C. under sterile conditions to precipitate food debris. To prepare the wild Chinese hawthorn extract, 500 g of fresh wild Chinese hawthorn is dried under sterile conditions to reduce the water content (≦8%). The dried fruit is then ground (≧20 mesh) and added to 1500 ml of sterile water. The mixture is allowed to stand for 6 hours at 4° C. under sterile conditions. The supernatant is collected to be used in the acclimatizing culture medium.",
        "VI. Manufacture of Yeast Compositions",
        "To prepare the yeast compositions of the invention, an apparatus depicted in FIG. 2 or an equivalent thereof can be used. This apparatus includes a first container (A), a second container (B), and a third container (C), each equipped with a pair of electrodes (4). One of the electrodes is a metal plate placed on the bottom of the containers, and the other electrode comprises a plurality of electrode wires evenly distributed in the space within the container to achieve even distribution of the electric field energy. All three pairs of electrodes are connected to a common signal generator.",
        "The culture medium used for this purpose is a mixed fruit extract solution containing the following ingredients per 1000 L: 300 L of wild Chinese hawthorn extract, 300 L of jujube extract, 300 L of fruit extract from Schisandra chinensis Baill (wu wei zi), and 100 L of soy bean extracts. To prepare hawthorn, jujube and wu wei zi extracts, the fresh fruits are washed and dried under sterile conditions to reduce the water content to no higher than 8%. One hundred kilograms of the dried fruits are then ground (≧20 mesh) and added to 400 L of sterile water. The mixtures are stirred under sterile conditions at room temperature for twelve hours, and then centrifuged at 1000 rpm to remove insoluble residues. To make the soy bean extract, fresh soy beans are washed and dried under sterile conditions to reduce the water content to no higher than 8%. Thirty kilograms of dried soy beans are then ground into particles of no smaller than 20 mesh, and added to 130 L of sterile water. The mixture is stirred under sterile conditions at room temperature for twelve hours and centrifuged at 1000 rpm to remove insoluble residues. Once the mixed fruit extract solution is prepared, the solution is sterilized at 121° C. for 30 minutes, and cooled to 40° C. before use.",
        "One thousand grams of the activated yeast powder prepared as described above (Section V, supra) is added to 1000 L of the mixed fruit extract solution, and the yeast solution is transferred to container (A) shown in FIG. 2. The yeast cells are then cultured in the presence of an alternating electric field having a frequency of about 12997 MHz and a field strength of about 430-470 mV/cm (e.g., about 446 mV/cm) at 28-32° C. under sterile conditions for 38 hours. The yeast cells are further incubated in an alternating electric field having a frequency of about 13008 MHz and a field strength of 330-360 mV/cm (e.g., about 343 mV/cm). The culturing continues for another 12 hours.",
        "The yeast culture is then transferred from the first container (A) to the second container (B) (if need be, a new batch of yeast culture can be started in the now available first container (A)), and subjected to an alternating electric field having a frequency of about 12997 MHz and a field strength of 470-510 mV/cm (e.g., about 483 mV/cm) for 24 hours. Subsequently the frequency and field strength of the electric field are changed to about 13008 MHz and 350-380 mV/cm (e.g., about 368 mV/cm), respectively. The culturing continues for another 12 hours.",
        "The yeast culture is then transferred from the second container (B) to the third container (C), and subjected to an alternating electric field having a frequency of about 12997 MHz and a field strength of 330-360 mV/cm (e.g., about 346 mV/cm) for 28 hours. Subsequently the frequency and field strength of the electric field are changed to about 13008 MHz and 260-280 mV/cm (e.g., about 272 mV/cm), respectively. The culturing continues for another 12 hours.",
        "The yeast culture from the third container (C) can then be packaged into vacuum sealed bottles of 30-50 ml or 100 ml for use as a dietary supplement, e.g., health drinks, or medication in the form of pills, powder, etc. The dietary supplement can be taken 3-4 times daily at 30-60 ml each time for a period of three months (10-30 minutes before meals and at bedtime). If desired, the final yeast culture can also be dried within 24 hours and stored in powder form.",
        "In one embodiment, the compositions of the invention can also be administered intravenously or peritoneally in the form of a sterile injectable preparation. Such a sterile preparation is prepared as follows. A sterilized health drink composition is first treated under ultrasound (>=18,000 Hz) for 10 minutes and then centrifuged at 4355 rpm for another 10 minutes. The resulting supernatant is adjusted to pH 7.2-7.4 using 1 M NaOH and subsequently filtered through a membrane (0.22 μm for intravenous injection and 0.45 μm for peritoneal injection) under sterile conditions. The resulting sterile preparation is submerged in a 35-38° C. water bath for 30 minutes before use.",
        "The yeast compositions of the present invention are derived from yeasts used in food and pharmaceutical industries. The yeast compositions are thus devoid of side effects associated with many pharmaceutical compounds.",
        "In other embodiments, the compositions of the invention may also be formulated with pharmaceutically acceptable carriers to be orally administered in any orally acceptable dosage form including, but not limited to, capsules, tablets, suspensions or solutions.",
        "The following examples are meant to illustrate the methods and materials of the present invention. Suitable modifications and adaptations of the described conditions and parameters which are obvious to those skilled in the art are within the spirit and scope of the present invention.",
        "The activated yeast compositions used in the following experiments were prepared as described above, using Saccharomyces cerevisiae Hansen IFFI1335 cultured in the presence of an alternating electric field having the electric field frequency and field strength exemplified in the parentheses following the recommended ranges in Section IV, supra. Control yeast compositions were those prepared in the same manner except that the yeast cells were cultured in the absence of EMFs. Unless otherwise indicated, the yeast compositions and the corresponding controls were admitted to the animals via intragastric feeding.",
        "Electrodes are placed at the ears of the mice to provide instant stimulation through a strong electric currency. An appropriate electric currency induces an excessive surge of electrical activity in the brain resulting in seizures to occur.",
        "Kunming grade healthy mice, which were 50-70 days old, weighing 18-22 g, were provided by the Institute of Zoology, Chinese Academy of Sciences, Beijing, China. The electroshock device (model GJ-2, manufactured by Medical Instrument Factory, Zhejiang Medical University) was adjusted to an output frequency of 60 Hz and voltage of 125 V. An equal number of male and female mice were selected. The ears of the mice were covered with saturated saline soaked-cotton. The electrodes were then clipped onto the ears of the mice. The mice were electroshocked three times for 0.3 seconds at an interval of 10 seconds. Mice with seizure activity were then divided into four groups, each group containing 70 mice: the test group (AY), the control yeast group (NY), the positive control group (CK2) and negative control group (CK1). Each mouse in the test, control yeast and negative control groups was administered twice daily 0.4 ml of the activated yeast composition, the control yeast composition, and saline, respectively, for 1 week. Each mouse in the positive control group was administered twice daily 15 mg/kg of phenobarbital for 1 week.",
        "On each day, the mice were electroshocked once for 0.3 seconds. The number of mice with seizure activity were monitored as illustrated in Table 2.",
        "TABLE 2\n\n\n\n\n\n\n\n\n\nDay 1\nDay 2\nDay 3\nDay 4\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNo. mice\n% mice\nNo. mice\n\nNo. mice\n\nNo. mice\n\n\n\n\nwith\nwith\nwith\n% mice\nwith\n% mice\nwith\n% mice\n\n\n\nseizure\nanti-\nseizure\nanti-\nseizure\nanti-\nseizure\nanti-\n\n\nGroup\nactivity\nseizure\nactivity\nseizure\nactivity\nseizure\nactivity\nseizure\n\n\n\n\n\nAY\n67\n4.3\n56\n20\n44\n37.1\n32\n54.3\n\n\nNY\n70\n0\n70\n0\n70\n0\n69\n1.4\n\n\nCK2\n59\n15.7\n48\n31.4\n56\n20\n55\n21.4\n\n\nCK1\n70\n0\n70\n0\n70\n0\n70\n0\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDay 5\nDay 6\nDay 7\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNo. mice\n\nNo. mice\n\nNo. mice\n\n\n\n\nwith seizure\n% mice\nwith seizure\n% mice\nwith seizure\n% mice\n\n\nGroup\nactivity\nanti-seizure\nactivity\nanti-seizure\nactivity\nanti-seizure\n\n\n\n\n\nAY\n17\n75.7\n4\n94.3\n1\n98.6\n\n\nNY\n70\n0\n70\n0\n70\n0\n\n\nCK2\n58\n17.1\n61\n12.8\n61\n12.9\n\n\nCK1\n70\n0\n70\n0\n70\n0",
        "As illustrated above, compared to the control (CK1) and control yeast (NY) groups, the test group (AY) shows a significant decrease in the number of rats with seizure activity after day 4. Further, nearly all of the rats in the test group show an anti-seizure effect after day 7, while only 12.9% of the rats in the positive control group (CK2) have an anti-seizure effect. Thus, the activated yeast composition of this invention has an anti-seizure affect on electro-shocked mice.",
        "Cardiazol induces seizure activity through intensifying excitatory synaptic activity of the brain. At the appropriate dose, cardiazol induces epileptic bursts that occur spontaneously.",
        "An equal number of female and male Wistar rats that were 5-6 months old, weighing 200-220 g were provided by the Chinese Academy of Military Medical Sciences, Beijing, China. The rats were divided into four groups, each containing 20 rats: the test group (AY), the control yeast group (NY), the positive control group (CK2) and negative control group (CK1). Each rat in the test, control yeast and negative control groups was administered twice daily 0.6 ml of the activated yeast composition, the control yeast composition, and saline, respectively, for 1 week. Each mouse in the positive group was administered twice daily 0.04 g/kg (body weight) of phenobarbital (dissolved in 0.6 ml saline) for 1 week.",
        "On day 7, 30 minutes after administering the last dosage of the above compositions, each group was administered by subcutaneous injection 70 mg/kg (body weight) of cardiazol (prepared as a 5% cardiazol solution in saline). The number of seizures occurred, incubation time (time between completion of injection and first seizure) and life span after injection was recorded immediately thereafter as shown in Table 3.",
        "TABLE 3\n\n\n\n\n\nGroup\nAnimal number\nincubation time (min)\nlife span (min)\n\n\n\n\n\n\n\nAY\n20\n11.82 ± 1.52 \n68.33 ± 16.26\n\n\nNY\n20\n2.52 ± 1.16\n8.23 ± 3.42\n\n\nCK2\n20\n7.23 ± 5.32\n22.76 ± 17.37\n\n\nCK1\n20\n2.60 ± 1.21\n7.62 ± 3.65",
        "As illustrated above, compared to the control yeast (NY), negative control groups (CK1), the test group (AY) shows a significant increase in the incubation time of the seizure and the life span of the rat after cardiazol injection. Further, compared to the positive control group (CK2), the test group shows that the incubation time of the seizure as well as the life span of the rat after cardiazol injection is much higher. Thus, the activated composition of this invention has an anti-seizure effect on rats treated with a seizure-inducing drug, cardiazol.",
        "While a number of embodiments of this invention have been set forth, it is apparent that the basic constructions may be altered to provide other embodiments which utilize the compositions and methods of this invention."
    ],
    "citations": [
        "2107830",
        "3150979",
        "3711392",
        "3870599",
        "3923279",
        "3939279",
        "3968254",
        "3997675",
        "4041182",
        "4081367",
        "4118512",
        "4183807",
        "4211645",
        "4348483",
        "4559305",
        "4816158",
        "5047250",
        "5075008",
        "5082662",
        "5082936",
        "5106594",
        "5158788",
        "5416010",
        "5476787",
        "5504079",
        "5567314",
        "5578486",
        "5665352",
        "5707524",
        "5866116",
        "5879928",
        "5952020",
        "5981219",
        "6036854",
        "6045834",
        "6143731",
        "6159510",
        "6197295",
        "6214337",
        "6391617",
        "6391618",
        "6391619",
        "6416982",
        "6416983",
        "6436695",
        "6440713",
        "6589994",
        "6596272",
        "6596273",
        "6649383",
        "6660508",
        "6699496",
        "6761886",
        "6800466",
        "6828131",
        "6828132",
        "2002/0099026",
        "2002/0123127",
        "2002/0123129",
        "2002/0123130",
        "2003/0230126",
        "2003/0230245",
        "2003/0232038",
        "2003/0232039",
        "2003/0232059",
        "2003/0235565",
        "2003/0235566",
        "2003/0235567",
        "2003/0235568",
        "2003/0235569",
        "2003/0235570",
        "2004/0001812",
        "2004/0001813",
        "2004/0001814",
        "2004/0001815",
        "2004/0001857",
        "2004/0001858",
        "2004/0001859",
        "2004/0001860",
        "2004/0001861",
        "2004/0005335",
        "2004/0005337",
        "2004/0005680",
        "2004/0168492",
        "2004/0253251",
        "2004/0253252",
        "2004/0253253",
        "2004/0253254",
        "2004/0253255",
        "2004/0253256",
        "2004/0253257",
        "2004/0253258",
        "2004/0253259",
        "2004/0253260",
        "2004/0253261",
        "2004/0253262",
        "2004/0253263",
        "2004/0253264",
        "2004/0253265",
        "2004/0253266",
        "2004/0253267",
        "2004/0253268",
        "2004/0265990",
        "1110317",
        "1207873",
        "1309175",
        "0041373",
        "553377",
        "1375652",
        "475500",
        "2222433",
        "1397873",
        "60028893",
        "1071637",
        "415983",
        "1722364",
        "1750570",
        "WO87/02705",
        "WO95/04814",
        "WO99/60142",
        "WO 02/20431",
        "WO 02/62981",
        "WO 02/62982",
        "WO 02/62983",
        "WO 02/62984",
        "WO 02/62985",
        "WO 02/070682",
        "WO02070436",
        "WO02070683",
        "WO2004108919"
    ],
    "us_classification": "4351731",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "12",
            "subclass": "N",
            "main_group": "1",
            "subgroup": "14"
        }
    ]
}