{
    "title": "Aluminosilicate compositions, preparation and use",
    "abstract": "A metalloaluminosilicate composition includes an aluminosilicate composition having an aluminosilicate framework and containing at least one metal, wherein a substantial portion of the metal is incorporated into the aluminosilicate framework. A higher concentration of the metal is incorporated into the framework of the catalyst than is present at the surface of the catalyst.",
    "inventors": [
        "Vitale-Rojas",
        "Quesada-Perez"
    ],
    "document_number": "07297319",
    "publication_date": "20071120",
    "assignees": [
        "Intevep, S.A."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for preparing a metalloaluminosilicate, comprising the steps of:",
            "components": [
                {
                    "component": "providing a solution containing a silica source;",
                    "subcomponents": []
                },
                {
                    "component": "providing a solution containing an alumina source;",
                    "subcomponents": []
                },
                {
                    "component": "providing an aqueous acid solution containing a metal other than silicon or aluminum;",
                    "subcomponents": []
                },
                {
                    "component": "mixing the silica source solution with the aqueous acid solution so as to form a silica source-metal containing mixture;",
                    "subcomponents": []
                },
                {
                    "component": "mixing the silica source-metal containing mixture with the alumina source solution so as to provide a gel mixture; and",
                    "subcomponents": []
                },
                {
                    "component": "hydrothermaly crystallizing the gel mixture so as to provide a metalloaluminosilicate material having an aluminosilicate framework and having the metal incorporated into the aluminosilicate framework, wherin the material exhibits a",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein said composition has a surface content of said metal and a bulk content of said metal, and wherein said bulk content is greater than said surface content.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , wherein the metal comprises at least one metal selected from the group consisting iron, zinc, zirconium, chromium, nickel, cobalt, magnesium, phosphorous, gallium and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein the metal is selected from the group consisting of iron, zinc and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 , wherein the gel mixture has a composition in molar ratios as follows:",
            "components": [
                {
                    "component": "SiO",
                    "subcomponents": []
                },
                {
                    "component": "SiO",
                    "subcomponents": []
                },
                {
                    "component": "SiO",
                    "subcomponents": []
                },
                {
                    "component": "Na",
                    "subcomponents": []
                },
                {
                    "component": "OH/SiO",
                    "subcomponents": []
                },
                {
                    "component": "H",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein the metalloaluminosilicate has a composition expressed in mole ratios of oxides according to an equation selected from the following:",
            "components": [
                {
                    "component": "1.—a(M",
                    "subcomponents": []
                },
                {
                    "component": "2.—a(M",
                    "subcomponents": []
                },
                {
                    "component": "3.—a(M",
                    "subcomponents": []
                },
                {
                    "component": "4.—a(M",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein the hydrothermally crystallizing step is carried out at a temperature of between about 150° C. and about 220° C. under autogenous pressure for a period of at least about 24 hours.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , wherein the hydrothermally crystallizing step is carried out at a temperature of between about 165° C. and about 185° C. under autogenous pressure for a period of at least about 24 hours.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 1 , wherein the step of hydrothermally crystallizing further comprises the steps of filtering and washing the metalloaluminosilicate material to provide a separated metalloaluminosilicate and drying the separated metalloaluminosilicate to provide a metalloaluminosilicate product.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 9 , wherein the drying step is carried out at a temperature of between about 80° C. and about 140° C.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 1 , wherein the step of providing the silica source solution comprises dissolving sodium silicate in distilled water.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 1 , wherein the step of providing the alumina source solution comprises dissolving sodium aluminate in distilled water.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 1 , wherein the step of providing the aqueous acid solution comprises the steps of providing an acid solution and dissolving a metal salt in the acid solution.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 13 , wherein the acid solution comprises an aqueous solution of an acid selected from the group consisting of sulfuric acid, nitric acid, hydrochloric acid and mixtures thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 1 , further comprising the step of mixing the gel mixture so as to provide a substantially homogeneous gel mixture, and hydrothermally crystallizing the substantially homogeneous gel mixture.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 1 , wherein the step of mixing the silica source solution with the aqueous acid solution is carried out under continuous mixing so as to provide a substantially homogeneous silica source-metal containing mixture and wherein the step of mixing the silica source-metal containing mixture is carried out under continuous mixing for a period of time sufficient to provide a substantially homogeneous gel mixture.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 1 , further comprising the step of converting the metalloaluminosilicate material to protonic form.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 17 , wherein the converting step is an ion exchange step.",
            "components": []
        }
    ],
    "description": [
        "This application is a divisional of application Ser. No. 10/634,478, filed Aug. 4, 2003 now U.S. Pat. No. 7,041,274 which in turn is a Continuation-in-Part of application Ser. No. 09/776,023 filed Feb. 2, 2001, now abandoned, which was a divisional application of application Ser. No. 09/425,500 filed Oct. 22, 1999, now U.S. Pat. No. 6,346,224.",
        "The history of zeolites began with the discovery of stilbite in 1756 by the Swedish mineralogist A. Cronsted. Zeolite means “boiling stone” and refers to the frothy mass which can result when a zeolite is fused in a blowpipe. Volatile zeolitic water forms bubbles within the melt.",
        "Zeolites are crystalline aluminosilicates having as a fundamental unit a tetrahedral complex consisting of Si4+ and Al3+ in tetrahedral coordination with four oxygens. Those tetrahedral units of [SiO4] and [AlO4]− are linked to each other by shared oxygens and in this way they form three-dimensional networks. The building of such networks produces channels and cavities of molecular dimensions. Water molecules and charged compensating cations are found inside the channels and cavities of the zeolitic networks.",
        "Even though there was much knowledge about zeolites and its properties, it was until the middle of this century that commercial preparation and use of zeolites was possible. This advance allowed more research into the synthesis and modification of zeolitic materials.",
        "The modification of the physical-chemical properties of zeolitic molecular sieve by the incorporation of other elements different from silicon and aluminum can be achieved through one of the following ways:",
        "1.—Incorporation through ion exchange",
        "2.—Incorporation through impregnation",
        "3.—Incorporation into the synthesis gel.",
        "The most common and well known form of introducing different elements in the channels and cavities of zeolitic molecular sieves is through ion exchanging. In this way, the compensating cation balancing the negative charge of the framework (usually sodium) is replaced by a new cation after ion exchange is done. In this case, the new cation is located inside the channels and cavities of the zeolite but, it is not coordinated with the silicon atoms throughout the oxygen atoms.",
        "The incorporation of other chemical elements in the zeolitic molecular sieve through impregnation is another common way of modifying the properties of zeolitic materials. For this case, most of the element incorporated in the zeolite is found in the surface of the crystallites of the zeolitic material.",
        "The incorporation into the synthesis gel of other chemical elements to produce zeolitic molecular sieves allowed an important advance in this area of research. This variation not only has modified the physical-chemical properties of the zeolitic materials of known structures, but also has given rise to the production of new structures unknown in the aluminosilicate frameworks.",
        "Patent and open literature have shown two important groups of zeolitic molecular sieve which incorporate other elements besides silicon and aluminum. These two main groups are the metallosilicates and the metalloaluminosphosphates. The metallosilicates are molecular sieves in which the aluminum is replaced by another element like gallium, iron, boron, titanium, zinc, etc. The metalloaluminophosphates are molecular sieves in which the aluminophosphate framework is modified by the incorporation of another element like magnesium, iron, cobalt, zinc, etc.",
        "Because the present invention is more related to metallosilicates than to metalloaluminophosphates, the metallosilicates are discussed in more detail. To choose an element to be incorporated into the molecular sieve framework, researchers take into account the possibility that the chosen element can attain tetrahedral coordination as well as the ionic ratio radius of such element. Table 1 shows the elements that can attain a tetrahedral coordination as well as the ionic ratio radius of such elements.",
        "Some of the elements indicated in Table 1 have been claimed to be incorporated into molecular sieve structures of the metallosilicate type. Some examples are: Ironsilicates or Ferrisilicates [U.S. Pat. Nos. 5,013,537; 5,077,026; 4,705,675; 4,851,602; 4,868,146 and 4,564,511], zincosilicates [U.S. Pat. Nos. 5,137,706; 4,670,617; 4,962,266; 4,329,328; 3,941,871 and 4,329,328], gallosilicates [U.S. Pat. Nos. 5,354,719; 5,365,002; 4,585,641; 5,064,793; 5,409,685; 4,968,650; 5,158,757; 5,133,951; 5,273,737; 5,466,432 and 5,035,868], zirconosilicates [Rakshe et al, Journal of Catalysis, 163: 501-505, 1996; Rakshe et al, Catalysis Letters, 45: 41-50, 1997; U.S. Pat. Nos. 4,935,561 and 5,338,527], chromosilicates [U.S. Pat. Nos. 4,299,808; 4,405,502; 4,431,748; 4,363,718; and 4,4534,365], magnesosilicates [U.S. Pat. Nos. 4,623,530 and 4,732,747] and titanosilicates [U.S. Pat. Nos. 5,466,835; 5,374,747; 4,827,068; 5,354,875 and 4,828,812].",
        "TABLE 1\n\n\n\n\n\n\n\nMetal ions that can attain tetrahedral coordination\n\n\nand their ionic crystal radii.\n\n\n\n\n\n\n\n\n\n\nMetal ion\nRadius (Å)\n\n\n\n\n\n\n\nAl3+\n0.530\n\n\n\nAs5+\n0.475\n\n\n\nB3+\n0.250\n\n\n\nBe2+\n0.410\n\n\n\nCo2+\n0.720\n\n\n\nCr4+\n0.550\n\n\n\nCr5+\n0.485\n\n\n\nFe2+\n0.770\n\n\n\nFe3+\n0.630\n\n\n\nGa3+\n0.610\n\n\n\nGe4+\n0.530\n\n\n\nHf4+\n0.720\n\n\n\nIn3+\n0.760\n\n\n\nMg2+\n0.710\n\n\n\nMn2+\n0.800\n\n\n\nMn4+\n0.530\n\n\n\nMn5+\n0.470\n\n\n\nMn6+\n0.395\n\n\n\nNi2+\n0.620\n\n\n\nP5+\n0.310\n\n\n\nSi4+\n0.400\n\n\n\nSn4+\n0.690\n\n\n\nTi4+\n0.560\n\n\n\nV5+\n0.495\n\n\n\nZn2+\n0.740\n\n\n\nZr4+\n0.730",
        "The conventional preparation of metallosilicates succeeds only if organic structure guiding compounds (“organic templates”) are added to the synthesis mixture. In general, tetraalkylamonium compounds, tertiary and secondary amines, alcohols, ethers, and heterocyclic compounds are used as organic templates.",
        "All these known methods of producing metallosilicates have a series of serious disadvantages if it is desired to produce them in a commercial scale. For instance, those organic templates used are toxic and easily flammable so, since the synthesis must be carried out under hydrothermal conditions and a high pressure in autoclaves, an escape of these templates into the atmosphere can never be completely prevented. Also, the use of templates increases the cost of production of the material because the template is expensive and because the effluent from the production of the metallosilicate also contains toxic materials which require expensive and careful disposal in order to prevent contamination of the environment.",
        "Adding to this, the metallosilicate obtained has organic material inside the channels and cavities so, to be useful as a catalysts or adsorbent, this organic material must be removed from the lattice. The removal of the organic template is carried out by combustion at high temperatures. The removal of the template can cause damage to the lattice structure of the metallosilicate molecular sieve and thus diminish its catalytic and adsorption properties.",
        "The metalloaluminosilicate is another group of zeolitic molecular sieves that can be prepared, however, research in this area is not as popular as it is with the metalloaluminophosphates and metallosilicates. In spite of that, in the patent literature it is possible to find some examples of this type of materials. The preparation of iron- titano- and galloaluminosilicates can be found in U.S. Pat. No. 5,176,817; U.S. Pat. No. 5,098,687, U.S. Pat. No. 4,892,720; U.S. Pat. No. 5,233,097; U.S. Pat. No. 4,804,647; and U.S. Pat. No. 5,057,203. For those cases, the preparation of the material is by a post synthesis treatment. An aluminosilicate zeolite is put in contact with a slurry of a fluoro salt of titanium or/and iron or a gallium salt and then some of the aluminum is replaced by titanium, iron or gallium. This methodology has some disadvantages because of the extra steps required to produce the material.",
        "The ideal thing to do would be to add the desired element into the synthesis gel and then through a hydrothermal process get the metalloaluminosilicate material. In the patent literature is possible to find some examples of this type of procedure. U.S. Pat. No. 5,648,558 teaches the preparation and use of metalloaluminosilicates of the BEA topology with chromium, zinc, iron, cobalt, gallium, tin, nickel, lead, indium, copper and boron. U.S. Pat. No. 4,670,474 teaches the preparation of ferrimetallosilicates with aluminum, titanium, and manganese. U.S. Pat. No. 4,994,250 teaches the preparation of a galloaluminosilicate material having the OFF topology. U.S. Pat. Nos. 4,761,511; 5,456,822; 5,281,566; 5,336,393; 4,994,254 teach the preparation of galloaluminosilicates of the MFI topology. U.S. Pat. No. 5,354,719 teaches the preparation of metalloaluminosilicates of the MFI topology with gallium and chromium. These examples of metalloaluminosilicates require the use of organic templates or seeding procedures so, these methods of preparation of metalloaluminosilicates have similar problems to those described above for metallosilicate methods of preparation.",
        "The invention presents a new method for obtaining a new family of aluminosilicate and metalloaluminosilicate materials of MFI topology, and their use in the FCC area.",
        "The synthetic metalloaluminosilicates produced with this inventive method have physical and chemical characteristics which make them clearly distinguishable from other products. The methodology does not use organic templates or seeding procedures. The preparation method developed in the invention allows the incorporation in the synthesis gel of other elements of the periodic table and they are interacted with the source of silicon in an acid medium. In this way, the elements are incorporated in the material prepared and those elements are not ion-exchangeable when the final material is obtained.",
        "The elements that can be incorporated into the aluminosilicate framework of the present invention include those elements from the Groups IIA, IIIB, IVB, VB, VIIB, VIIB, VIII, IB, IIB, IIIA, IVA, and VA (using the CAS version nomenclature) of the periodic table. Examples of these are shown in Table 1. The amount of such elements present in the aluminosilicate framework of the present invention may vary depending on the required amount of such element in said material. Also, it is possible to mix more than two elements in a given material of the present invention. However, for all compositions of the present invention, it is a characteristic that at least some of the incorporated elements are not ion-exchangeable by conventional techniques and are present in the aluminosilicate material. The new compositions exhibit X-ray diffraction diagrams which contains certain definable minimum lattice distances. Furthermore, the new metalloaluminosilicate materials show specific absorption bands in the infrared spectrum. Also, the new materials show specific bands in the NMR spectrum analysis.",
        "The method developed for preparing metalloaluminosilicate materials can also be used for preparing aluminosilicate material such as ST5 (U.S. Pat. No. 5,254,327) and other MFI type materials of higher Si/Al ratios given the right conditions.",
        "The materials of the present invention have a composition which may be expressed according to one of the formulas given below in terms of molar ratios of oxides:",
        "1.—a(M2/nO):b(Al2O3):c(E2O3):d(SiO2):e(H2O)",
        "2.—a(M2/nO):b(Al2O3):c(FO2):d(SiO2):e(H2O)",
        "3.—a(M2/nO):b(Al2O3):c(GO):d(SiO2):e(H2O)",
        "4.—a(M2/nO):b(Al2O3):c(H2O5):d(SiO2):e(H2O)",
        "where M is at least one ion-exchangeable cation having a valence of n; E is an element with valence 3+ which is not ion-exchangeable by conventional means; F is an element with valence 4+ which is not ion-exchangeable by conventional means; G is an element with valence 2+ which is not ion-exchangeable by conventional means; H is an element with valence 5+ which is not ion-exchangeable by conventional means; a/b>0; c/b>0; d/b>0; d/c>0; e/b>0; a/(b+c)>0; d/(b+c)>0; a is from >0 to 6, b is equal to 1, c is from >0 to 10, d is from 10 to 80 and e is from 0 to 100.",
        "The invention is not limited to such wet materials or oxide forms, rather its composition may be present in terms of oxides and on a wet basis (as in the above formulas) in order to provide a means for identifying some of the novel compositions. Furthermore, compositions of the present invention may also incorporate more than one element which are not ion-exchangeable and have different valences (mixtures of E, F, G and H). Other formulas may be written by those skilled in the art to identify particular subsets or embodiments of the present invention which comprises porous crystalline metalloaluminosilicates.",
        "Metalloaluminosilicates of the present invention have useful properties including catalytic activity. These novel compositions may be advantageously employed in known processes which presently use aluminosilicate zeolites. Aluminosilicate compositions of the present invention may be advantageously incorporated with binders, clays, aluminas, silicas, or other materials which are well-known in the art. They also can be modify with one or more elements or compounds by deposition, occlusion, ion-exchange or other techniques known to those skilled in the art to enhance, supplement or alter the properties or usefulness of the aluminosilicate compositions of the present invention. The metalloaluminosilicates of the present invention can be used as additive in the FCC area.",
        "The metalloaluminosilicates of the present invention are prepared by hydrothermal methods and, therefore, the elements incorporated in the aluminosilicate compositions are not ion-exchangeable and form part of the structure of the crystalline aluminosilicate composition.",
        "According to the invention, a method is provided for preparing a metalloaluminosilicate which includes the steps of: providing a solution containing a silica source; providing a solution containing an alumina source; providing an aqueous acid solution containing a metal other than silicon or aluminum; mixing the silica source solution with the aqueous acid solution so as to form a silica source-metal containing mixture; mixing the silica source-metal containing mixture with the alumina source solution so as to provide a gel mixture; and hydrothermally crystallizing the gel mixture so as to provide a metalloaluminosilicate material having an aluminosilicate framework and having a substantial portion of the metal incorporated into the aluminosilicate framework.",
        "A composition is also provided, which comprises an aluminosilicate composition having an aluminosilicate framework and containing at least one metal, wherein a substantial portion of said metal is incorporated into the aluminosilicate framework. Advantageously, a higher concentration of the metal is incorporated into said framework of the catalyst than is present at the surface of the catalyst.",
        "A detailed description of preferred embodiments of the invention follows, with reference to the attached drawings wherein:",
        "FIG. 1 is a Mossbauer spectrum of the product of Example 3.",
        "FIG. 2 is a 29Si NMR spectrum of a sample of silicalite. Silicalite is a silicate material with the MFI topology. In this material there is not aluminum or other element in the structure of the material, only silicon.",
        "FIG. 3 is a 29Si NMR spectrum of a sample of an aluminosilicate material with the MFI topology. The silica to alumina molar ratio SiO2/Al2O3 of this material is 54.",
        "FIG. 4 is a 29Si NMR spectrum of the ferrialuminosilicate product of Example 4.",
        "FIG. 5 is a 29Si NMR spectrum of the ferrialuminosilicate product of Example 5.",
        "FIG. 6 is a 29Si NMR spectrum of the zincoaluminosilicate product of Example 8.",
        "FIG. 7 is a 29Si NMR spectrum of the galloaluminosilicate product of Example 15.",
        "FIG. 8 is a 29Si NMR spectrum of the magnesoaluminosilicate product of Example 20.",
        "FIG. 9 is an infrared spectrum of the region 400-1500 cm−1 of the silicalite sample.",
        "FIG. 10 is an infrared spectrum of the region 400-1500 cm−1 of the MFI aluminosilicate material of SiO2/Al2O3 ratio of 54.",
        "FIG. 11 is an infrared spectrum of the region 400-1500 cm−1 of the ferrialuminosilicate product of example 4.",
        "FIG. 12 is an infrared spectrum of the region 400-1500 cm−1 of the ferrialuminosilicate product of Example 5.",
        "FIG. 13 is an infrared spectrum of the region 400-1500 cm−1 of the zincoaluminosilicate product of Example 7.",
        "FIG. 14 is an infrared spectrum of the region 400-1500 cm−1 of the zincoaluminosilicate product of Example 8.",
        "FIG. 15 is an infrared spectrum of the region 400-1500 cm−1 of the nickelaluminosilicate product of Example 12.",
        "FIG. 16 is an infrared spectrum of the region 400-1500 cm−1 of the galloaluminosilicate product of Example 15.",
        "FIG. 17 is an infrared spectrum of the region 400-1500 cm−1 of the galloaluminosilicate product of Example 16.",
        "FIG. 18 is an infrared spectrum of the region 400-1500 cm−1 of the chromoaluminosilicate product of Example 18.",
        "FIG. 19 is an infrared spectrum of the region 400-1500 cm−1 of the magnesoaluminosilicate product of Example 20.",
        "FIG. 20 is an X-ray diffraction diagram of the ferrialuminosilicate product of Example 4.",
        "FIG. 21 is an X-ray diffraction diagram of the zincoaluminosilicate product of Example 7.",
        "FIG. 22 is an X-ray diffraction diagram of the phosphoroaluminosilicate product of Example 9.",
        "FIG. 23 is an X-ray diffraction diagram of the nickelaluminosilicate product of Example 10.",
        "FIG. 24 is an X-ray diffraction diagram of the cobaltoaluminosilicate product of Example 13.",
        "FIG. 25 is an X-ray diffraction diagram of the galloaluminosilicate product of Example 15.",
        "FIG. 26 is an X-ray diffraction diagram of the chromoaluminosilicate product of Example 17.",
        "FIG. 27 is an X-ray diffraction diagram of the magnesoaluminosilicate product of Example 20.",
        "FIG. 28 is an XPS spectrum of the Mg2p region of the magnesoaluminosilicate product of Example 20.",
        "The invention relates to a method for obtaining a new family of matalloaluminosilicate materials of MFI topology and their use in the FCC area. The materials are produced with a simple and advantageously inorganic aqueous alkaline reaction mixture under mild hydrothermal conditions.",
        "The invention further relates to an ST-5 type metalloaluminosilicate and a method for preparing same. In accordance with the invention, the metalloaluminosilicate is advantageously prepared without the need for templating agents and/or seeding procedures. In addition, the method of the present invention advantageously results in a desired metal being located substantially in the crystalline structure or framework of the aluminosilicate material.",
        "As will be further discussed below, the method of the present invention provides a composition wherein the metal incorporated into the framework of the crystalline structure is present in the framework at a greater concentration than is present at the surface of the material. This is an advantageous characteristic which results from preparation in accordance with the method of the present invention, and further indicates a substantial portion of the metal being within the material in a manner which will not be removed through ion exchange and subsequent processes.",
        "The compositions are prepared from a synthesis gel which is provided in a sequential manner.",
        "The preparation of the synthesis gel is carried out by mixing three solutions: an acid solution of the salt of the element to be incorporated, a solution of a silica source and a solution of an alumina source.",
        "The salts of the elements to be incorporated are preferably nitrates, chlorides, sulfates, bromides, and the like.",
        "Acidification of the solution can be done with one or more of sulfuric acid, nitric acid, hydrochloric acid and the like.",
        "The preferred sources of silica are sodium silicate, sodium metalsilicate, colloidal silica and the like.",
        "The preferred sources of alumina are sodium aluminate, aluminum nitrate, aluminum sulfate, and so on.",
        "The solution of the element to be incorporated is preferably prepared by dissolving a weight of the salt in a volume of a diluted acid solution.",
        "The solution of the silica source is prepared by diluting or dissolving an amount of a soluble silica source in a volume of water.",
        "The solution of the alumina source is prepared by dissolving a weight of the aluminum salt in an amount of water.",
        "The metal to be incorporated into the metalloaluminosilicate according to the invention may suitably be one ore or metals from Groups IIA, IIIB, IVB, VB, VIIB, VIIB, VIII, IB, IIB, IIIA, IIA, IVA, and VA (CAS), more preferably iron, zinc, zirconium, chromium, nickel, cobalt, magnesium, phosphorous, gallium and mixtures thereof. Particularly desirable metals are iron, zinc and mixtures thereof.",
        "According to the invention, mixing is carried out in a sequential way. The preferred sequence of mixing is, first, to slowly add silica solution under vigorous stirring over the acid solution of the element to be incorporated. After homogenization of the mixture formed, the solution of alumina is added under vigorous stirring. The final mixture is allowed to homogenize for a given period of time.",
        "The gel composition for preparing these metalloaluminosilicate materials is given in the form of molar ratios of elements as follow:",
        "SiO2/Al2O3 from 5 to 80,",
        "SiO2/DOx from 10 to 1500,",
        "SiO2/(Al2O3+DOx) from 5 to 70,",
        "Na2O/SiO2 from 0.22 to 2.20,",
        "OH/SiO2 from 0.01 to 2.00,",
        "H2O/SiO2 from 14 to 40,",
        "where D is the element or elements incorporated into the gel.",
        "After homogenization is complete the gel is transferred to an autoclave where hydrothermal crystallization preferably is done. The temperature of the crystallization is preferably in the range of 150° C. to 220° C. with a more preferred range of 165° C. to 185° C. The agitation during crystallization is done with a speed preferably ranging between 40 RPM and 400 RPM, the preferred range is 80 RPM to 300 RPM. The crystallization time preferably ranges from 24 hours to 120 hours with a more preferred range between 36 hours and 76 hours. The crystallization is done at autogenous pressure. After the crystallization time is finished, the aluminosilicate composition is filtered, and washed with water preferably until reaching a pH close to 7. The filtered, washed material is then put to dry at a temperature preferably ranging from 80° C. to 140° C. for a period of about 12 hours.",
        "The metalloaluminosilicate materials obtained according to the invention preferably have a chemical composition which can be described in molar ratios using one of the following formulas:",
        "1.—a(M2/nO):b(Al2O3):c(E2O3):d(SiO2):e(H2O)",
        "2.—a(M2/nO):b(Al2O3):c(FO2):d(SiO2):e(H2O)",
        "3.—a(M2/nO):b(Al2O3):c(GO):d(SiO2):e(H2O)",
        "4.—a(M2/nO):b(Al2O3):c(H2O5):d(SiO2):e(H2O)",
        "where M is at least one ion-exchangeable cation having a valence of n, the preferred alkali cation is sodium, however, other alkali cations (lithium, potassium and the like) can be employed; E is an element with valence 3+ which is not ion-exchangeable by conventional means, suitable examples include iron, gallium, chromium, boron, indium and the like; F is an element with valence 4+ which is not ion-exchangeable by conventional means, suitable examples include titanium, zirconium, germanium, and the like; G is an element with valence 2+ which is not ion-exchangeable by conventional means, suitable examples include nickel, zinc, cobalt, magnesium, beryllium and the like; H is an element with valence 5+ which is not ion-exchangeable by conventional means, suitable examples include phosphorous, vanadium and the like; a is from >0 to 6; b is equal to 1, c is from >0 to 10; d is from 10 to 80; d/c is from 10 to 1500; e is from 0 to 100; a/(b+c) is from >0 to 5; and d/(b+c) is from 10 to 70.",
        "The invention is not limited to such wet materials or said oxide forms, rather its composition may be present in terms of oxides and on a wet basis (as in the above formulas) in order to provide a means for identifying some of the novel compositions. Furthermore, compositions of the present invention may also incorporate more than one element which are not ion-exchangeable and have different valences (mixtures of E, F, G and H). Other formulas may be written by those skilled in the art to identify particular subsets or embodiments of the present invention which comprises porous crystalline metalloaluminosilicates.",
        "The present invention advantageously provides a metalloaluminosilicate composition wherein the metal is incorporated into the aluminosilicate framework of the composition. As used herein, the term incorporated means the metal cannot be removed through ion exchange procedure.",
        "The composition of the present invention illustrates this substantial incorporation of metal into the framework through a higher concentration of the metal in the bulk or framework than is present in the surface of the material. This is a particularly advantageous feature of the catalyst composition of the present invention, and is in distinction to conventional catalysts prepared utilizing templating agents and the like, wherein the inverse is true, that is, catalyst metals are incorporated more at the surface than in the bulk or framework of the material.",
        "Content of the metal within the material, in the bulk or framework therein, can be determined for example using bulk chemical analysis, while metal present at the surface of the material can be determined for example using superficial XPS chemical analysis. This distinction between the present invention and that of the prior art is further illustrated in Example 21 below.",
        "In conjunction with the above chemical composition, the metalloaluminosilicates produced with the methodology of the present invention show an X-ray diffraction diagram which contains at least the lattice distances that are listed in Table 2 below.",
        "TABLE 2\n\n\n\n\n\nInterplanar spacing\nRelative intensity\n\n\n\n\n\n\n\n11.2 ± 0.4\nstrong\n\n\n10.0 ± 0.4\nstrong\n\n\n6.01 ± 0.2\nweak\n\n\n5.72 ± 0.2\nweak\n\n\n5.58 ± 0.2\nweak\n\n\n4.38 ± 0.1\nweak\n\n\n3.86 ± 0.1\nvery strong\n\n\n3.73 ± 0.1\nstrong\n\n\n3.65 ± 0.1\nstrong\n\n\n3.49 ± 0.1\nweak\n\n\n3.23 ± 0.1\nweak\n\n\n 3.06 ± 0.06\nweak\n\n\n 3.00 ± 0.06\nweak\n\n\n 2.00 ± 0.04\nweak",
        "In addition to the above chemical composition and lattice distances listed in Table 2, the metalloaluminosilicates produced according to this invention have absorption bands in the infrared spectrum and NMR spectra which make them different from other materials. Other techniques can be used in some specific cases like Mossbauer spectroscopy for iron, XPS for magnesium, etc.",
        "Infrared spectroscopy is a simple but powerful technique that can yield information concerning structural details of zeolitic materials. The region from 400 to 1500 cm−1 is important because in that region can be observed different sets of infrared vibrations related to zeolitic materials, for instance, the internal tetrahedral and external linkages. The infrared spectrum can be classified into two groups of vibrations: 1.—internal vibrations of the framework TO4, which are insensitive to structural vibrations; and 2.—vibrations related to the external linkage of the TO4 units in the structure. The latter are sensitive to structural variations. This technique has been employed to identify framework incorporation of other elements. Modifications and shift in the asymmetric and symmetric vibrations have been observed with successful incorporation of such new elements in the framework of the zeolitic material. For this reason this is an important characterization of the metalloaluminosilicate materials of the present invention.",
        "Another important characterization of the metalloaluminosilicates of the present invention is 29Si NMR spectroscopy. In silicate systems the Q-unit is used to indicate the different silicate atoms in a system. However, this notation is not sufficient to describe the basic building units in the zeolite or aluminosilicate frameworks. In the zeolite systems, the Q-units are always the Q4, where each silicate is surrounded by four silicate or aluminate units. Thus in zeolites, there are five possibilities, described by Q4 (nAl, ((4−n)Si), where n=0, 1, 2, 3, 4.",
        "Generally these are noted as Si(nAl) or Si((4−n)Si), indicating that each silicon atom is linked via the oxygen, to n aluminum and 4−n silicon neighbors. Thus the silicon with four aluminum neighbors would be indicated by Si(4Al). When one or more Si atoms at the Q4 unit position are replaced by Al atoms, a shift in the 29Si chemical shift occurs.",
        "In the case of the metalloaluminosilicate of the present invention, besides Al atoms there are other atoms incorporated into the structure of the material, so the shift in the chemical shifts are due to them, because for a material with a given silicon to aluminum molar ratio the shifts due to aluminum are fixed, so the modification in the 29Si NMR chemical shift is caused by the other element incorporated in the structure which is linked to the silicon through the oxygen atoms.",
        "Mossbauer spectroscopy was used to confirm the incorporation of iron into the aluminosilicate framework of the ferrimetalloaluminosilicate material of Example 3 below. The Mossbauer spectra of this material showed a broad singlet at room temperature indicative of iron in a tetrahedral coordination with oxygen.",
        "X-ray photoelectron spectroscopy is a technique that has been used in the characterization of the incorporation of magnesium into the framework of magnesoaluminophosphates (Zeolites 15: 583-590, 1995). When the magnesium is coordinated tetrahedrally with four oxygens as in the case of the magnesoaluminophosphate the value of the binding energy for the Mg2p signal is about 50.1 eV. For Example 20 below, this technique was used and the value of the binding energy of the signal Mg 2p was 49.8 which is close to the value found for magnesium in the magnesoaluminophosphate.",
        "The compositions of the present invention can be converted to protonic form, for example by ion exchange, with the help of a mineral acid, an ammonium compound, other proton suppliers, or with other cations. An important aspect of the invention is that the elements incorporated in the framework of the material are not ion-exchangeable, and therefore, they are not lost when ion exchange is done. The modified materials can be used in catalytic reactions as pure materials or in combination with other materials like clays, silicas, aluminas and other well known fillers.",
        "Metalloaluminosilicates of the present invention have useful properties including catalytic activity. These novel compositions may be advantageously employed in known processes which presently use aluminosilicate zeolites. Aluminosilicate compositions of the present invention may be advantageously incorporated with binders, clays, aluminas, silicas, or other materials which are well-known in the art. They also can be modified with one or more elements or compounds by deposition, occlusion, ion-exchange or other techniques known to those skilled in the art to enhance, supplement or alter the properties or usefulness of the aluminosilicate compositions of the present invention. The metalloaluminosilicates of the present invention can be used as additive in the FCC area.",
        "The metalloaluminosilicate compositions of the present invention are prepared by hydrothermal methods so, the elements incorporated in the aluminosilicate compositions are not ion-exchangeable and form part of the structure of the crystalline aluminosilicate compositions.",
        "In accordance with the present invention, a method is provided which is advantageous for preparing metalloaluminosilicate compositions, and which is also advantageous in preparing aluminosilicate compositions themselves.",
        "In preparation of aluminosilicate compositions, a composition such as that identified as ST5 aluminosilicate (U.S. Pat. No. 5,254,327) can be prepared through sequentially mixing three solutions as described above.",
        "In order to prepare an aluminosilicate composition, a first solution is prepared containing a silica source composition. A second solution is prepared containing an alumina source and a third aqueous acid solution is prepared. The silica source is then mixed with the aqueous acid solution so as to form a silica source-acid mixture, and the silica source-acid mixture is then preferably mixed with the alumina source solution so as to provide a gel mixture which can be hydrothermally crystallized so as to provide an aluminosilicate composition having an aluminosilicate framework. This composition is advantageously formed without the need for templating agents or seeding or other organic additives, and provides an aluminosilicate composition similar to ST5 which can advantageously be used for various catalytic applications. In this method, as with the method for preparing metalloaluminosilicates as discussed above, the sequence of first mixing silica source solution with acid or acid metal solution, followed by mixing with an alumina source solution to provide the desired gel mixture advantageously provides for formation of the desired aluminosilicate framework structure without the need for seeding or templating agents and, in the case of metalloaluminosilicates, advantageously incorporating the desired metal into the aluminosilicate framework.",
        "The new materials and their preparation methods will be better understood by reference to the following examples.",
        "The raw materials used in the examples are: commercial sodium silicate GLASSVEN (28.60 wt % SiO2, 10.76 wt % Na2O, 60.64 wt % H2O), commercial sodium silicate VENESIL (28.88 wt % SiO2, 8.85 wt % Na2O, 62.27 wt % H2O), Sulfuric acid from Fisher or Aldrich (98 wt %, d=1.836), Phosphoric acid from Aldrich (85 wt %), sodium aluminate LaPINE (49.1 wt % Al2O3, 27.2 wt % Na2O, 23.7 wt % H2O), the salts of the different elements to be incorporated are A.C.S reagent grade or Analytical grade from Aldrich.",
        "The first two examples are to demonstrate the use of the method of the present invention for preparation of aluminosilicates of MFI topology without seeding or templates. The rest of the examples demonstrate the preparation and use of the metalloaluminosilicate of the present invention. In connection with the Examples, comparative reference may be had to FIGS. 2, 3, 9, and 10. FIGS. 2, and 9 are a 29Si NMR spectrum and infrared spectrum (400-1500 cm−1) respectively of silicalite, which has a structure of silicon only. FIGS. 3 and 10 are a 29Si NMR spectrum (400-1500 cm−1) of an aluminosilicate material.",
        "Preparation of an aluminosilicate material of the ST5 type (SiO2/Al2O3 ratio of 20) is illustrated. A reaction batch consisting of the following solutions was prepared according to the method of the present invention described above:\n\n    \n    \n        Sulfuric acid solution: 6.4 ml of H2SO4 concentrated and 40 ml of distilled water.\n        Sodium silicate solution: 85 g of sodium silicate and 38 ml of distilled water.\n        Sodium aluminate solution: 4.2 g of sodium aluminate and 20 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\n\n\n\n\n\n\n\n20.18\n20.67\n0.10\n0.68\n0.34",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 48 hours. The dry material consisted of a pure aluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the product, expressed in molar ratios, is: 1.1Na2O:Al2O3:20.6SiO2:7H2O. The white material obtained in this way is similar to the aluminosilicate ST5 (U.S. Pat. No. 5,254,327).",
        "Preparation of an aluminosilicate material of the MFI type with a SiO2/Al2O3 ratio of 50 is illustrated. A reaction batch consisting of the following solutions was prepared according to the invention described above:\n\n    \n    \n        Sulfuric acid solution: 6.1 ml of H2SO4 concentrated and 40 ml of distilled water.\n        Sodium silicate solution: 79 g of sodium silicate and 40 ml of distilled water.\n        Sodium aluminate solution: 1.5 g of sodium aluminate and 20 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\n\n\n\n\n\n\n\n52.06\n21.89\n0.13\n0.76\n0.38",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 36 hours. The dry material consisted of a pure aluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the product, expressed in molar ratios, is: 1.0Na2O:Al2O3:50.2SiO2:16H2O.",
        "Preparation of a ferroaluminosilicate material of MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according to the present invention:\n\n    \n    \n        Acid solution of iron (III) nitrate: 12 g of Fe(NO3)3.9H2O, 38 ml of H2SO4 concentrate and 200 ml of distilled water.\n        Sodium silicate solution: 528 g of sodium silicate and 187 ml of distilled water.\n        Sodium aluminate solution: 23 g of sodium aluminate and 123 ml of distilled water",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na/\nNa2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nSiO2\nSiO2\nFe2O3\nSi/Fe\n\n\n\n\n\n\n\n22.69\n20.67\n0.13\n0.81\n0.40\n169.16\n84.58",
        "The hydrothermal crystallization was carried out in a stirred 2-liter autoclave to a reaction temperature of 170° C. for a period of 54 hours. The dry material consisted of a pure ferroaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 1.21Na2O:Al2O3:0.14Fe2O3:25.6SiO2:10.2H2O. The Mossbauer spectrum of this material is shown in FIG. 1. This type of spectrum is typical of iron (III) in tetrahedral coordination.",
        "Preparation of a ferrialuminosilicate material of the MFI type. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of iron(III) nitrate: 7 g of Fe(NO3)3.9H2O, 6 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 85 g of sodium silicate and 38 ml of distilled water.\n        Sodium aluminate solution: 1.7 g of sodium aluminate and 20 ml of distilled water",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na/\nNa2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nSiO2\nSiO2\nFe2O3\nSi/Fe\n\n\n\n\n\n\n\n49.42\n20.58\n0.18\n0.89\n0.445\n46.68\n23.34",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 72 hours. The dry material consisted of a pure ferrialuminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 3.73Na2O:Al2O3:1.59Fe2O3:74.4SiO2:15.7H2O. The 29Si NMR spectrum of this product is shown in FIG. 4. The SiO2/Al2O3 molar ratio of this material is 74.4. It is clear that the iron is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "The Infrared spectrum of this material is shown in FIG. 11. The SiO2/Al2O3 molar ratio of this material is 74.4. It is clear that the iron is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology. The X-ray diagram of this material is shown in FIG. 20.",
        "Preparation of a ferrialuminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of iron(III) nitrate: 4 g of Fe(NO3)3.9H2O, 6 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 85 g of sodium silicate and 38 ml of distilled water.\n        Sodium aluminate solution: 3.0 g of sodium aluminate and 20 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na/\nNa2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nSiO2\nSiO2\nFe2O3\nSi/Fe\n\n\n\n\n\n\n\n28.00\n20.62\n0.15\n0.84\n0.42\n81.70\n40.85",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 54 hours. The dry material consisted of a pure ferrialuminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 1.77Na2O:Al2O3:0.35Fe2O3:28.7SiO2:15.3H2O. The 29Si NMR spectrum of this product is shown in FIG. 5. The SiO2/Al2O3 molar ratio of this material is 28.7. It is clear that the iron is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "The Infrared spectrum of this material is shown in FIG. 12. The SiO2/Al2O3 molar ratio of this material is 28.66. It is clear that the iron is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "Preparation of a zincoaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of zinc(II) nitrate: 1.2 g of Zn(NO3)2.6H2O, 6.1 ml of H2SO4 concentrate and 33 ml of distilled water.\n        Sodium silicate solution: 79.2 g of sodium silicate and 40 ml of distilled water.\n        Sodium aluminate solution: 3.9 g of sodium aluminate, 0.5 g of NaOH and 24 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nNa/SiO2\nSiO2\nZnO\nSi/Zn\n\n\n\n\n\n\n\n20.07\n21.50\n0.14\n0.85\n0.43\n93.43\n93.43",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 36 hours. The dry material consisted of a pure zincoaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 1.13Na2O:Al2O3:0.21ZnO:22.7SiO2:6.7H2O.",
        "Preparation of a zincoaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of zinc(II) nitrate: 3.0 g of Zn(NO3)2.6H2O, 6.0 ml of H2SO4 concentrate and 38 ml of distilled water.\n        Sodium silicate solution: 79.2 g of sodium silicate and 40 ml of distilled water.\n        Sodium aluminate solution: 2.5 g of sodium aluminate, 1.0 g of NaOH and 19 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nNa/SiO2\nSiO2\nZnO\nSi/Zn\n\n\n\n\n\n\n\n31.31\n21.44\n0.15\n0.85\n0.43\n37.37\n37.37",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 72 hours. The dry material consisted of a pure zincoaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 1.40Na2O:Al2O3:0.86ZnO:33.9SiO2:21.4H2O. The Infrared spectrum of this material is shown in FIG. 13. The SiO2/Al2O3 molar ratio of this material is 33.9. It is clear that the zinc is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "The X-ray diagram of this material is shown in FIG. 21.",
        "Preparation of a zincoaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of zinc(II) nitrate: 3.0 g of Zn(NO3)2.6H2O, 6.0 ml of H2SO4 concentrate and 38 ml of distilled water.\n        Sodium silicate solution: 79.2 g of sodium silicate and 40 ml of distilled water.\n        Sodium aluminate solution: 1.6 g of sodium aluminate, 0.8 g of NaOH and 19 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nNa/SiO2\nSiO2\nZnO\nSi/Zn\n\n\n\n\n\n\n\n48.93\n21.41\n0.14\n0.82\n0.40\n37.38\n37.38",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 120 hours. The dry material consisted of a pure zincoaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 1.68Na2O :Al2O3:1.37ZnO:52.9SiO2:32.1H2O. The 29Si NMR spectrum of this product is shown in FIG. 6. The SiO2/Al2O3 molar ratio of this material is 52.9. It is clear that the zinc is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "The Infrared spectrum of this material is shown in FIG. 14. The SiO2/Al2O3 molar ratio of this material is 52.9. It is clear that the zinc is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "Preparation of a phosphoroaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of phosphoric acid: 0.82 g de H3PO4, 5.5 ml de H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 79.2 g of sodium silicate and 33 ml of distilled water.\n        Sodium aluminate solution: 3.9 g of sodium aluminate and 19 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nNa/SiO2\nSiO2\nP2O5\nSi/P\n\n\n\n\n\n\n\n20.60\n21.76\n0.13\n0.82\n0.41\n105.97\n52.98",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 72 hours. The dry material consisted of a pure phosphoroaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 1.07Na2O:Al2O3:0.25P2O5:24.3SiO2:3.3H2O. The X-ray diagram of this material is shown in FIG. 22.",
        "Preparation of a nickelaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of nickel (II) nitrate: 180 g of Ni(NO3)2.6H2O, 1000 ml of H2SO4 concentrate and 6000 ml of distilled water.\n        Sodium silicate solution: 14400 g of sodium silicate and 6000 ml of distilled water.\n        Sodium aluminate solution: 695 g sodium aluminate and 4800 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na/\nNa2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nSiO2\nSiO2\nNiO\nSi/Ni\n\n\n\n\n\n\n\n20.66\n20.82\n0.06\n0.68\n0.34\n111.70\n111.70",
        "The hydrothermal crystallization was carried out in a stirred 40-liter autoclave to a reaction temperature of 170° C. for a period of 54 hours. The dry material consisted of a pure nickelaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white to pale-green product, expressed in molar ratios, is: 1.03Na2O:Al2O3:0.18NiO:23.5SiO2:9.2H2O. The X-ray diagram of this material is shown in FIG. 23.",
        "Preparation of a nickelaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of nickel (II) nitrate: 16 g of Ni(NO3)2.6H2O, 36 ml of H2SO4 concentrate and 240 ml of distilled water.\n        Sodium silicate solution: 576 g of sodium silicate and 240 ml of distilled water.\n        Sodium aluminate solution: 27.8 g sodium aluminate and 192 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nNa/SiO2\nSiO2\nNiO\nSi/Ni\n\n\n\n\n\n\n\n20.66\n20.82\n0.11\n0.68\n0.34\n50.26\n50.26",
        "The hydrothermal crystallization was carried out in a stirred 40-liter autoclave to a reaction temperature of 170° C. for a period of 54 hours. The dry material consisted of a pure nickelaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white to pale-green product, expressed in molar ratios, is: 1.24Na2O:Al2O3:0.43NiO:23.2SiO2:10.1H2O.",
        "Preparation of a nickelaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of nickel (II) nitrate: 3.6 g of Ni(NO3)2.6H2O, 6 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 85 g of sodium silicate and 38 ml of distilled water.\n        Sodium aluminate solution: 2.0 g sodium aluminate, 0.4 g of NaOH and 20 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "Na2O/\nSiO2/\n\n\n\nSiO2/Al2O3\nH2O/SiO2\nOH/SiO2\nNa/SiO2\nSiO2\nNiO\nSi/Ni\n\n\n\n\n\n\n\n42.00\n20.58\n0.17\n0.80\n0.40\n32.68\n32.68",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 84 hours. The dry material consisted of a pure nickelaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white to pale-green product, expressed in molar ratios, is: 1.66Na2O:Al2O3:1.59NiO:53.7SiO2:38.6H2O. The Infrared spectrum of this material is shown in FIG. 15. The SiO2/Al2O3 molar ratio of this material is 53.7. It is clear that the nickel is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "Preparation of a cobaltoaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of cobalt (II) nitrate: 1.2 g of Co(NO3)2.6H2O, 6.1 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 79.2 g of sodium silicate and 33 ml of distilled water.\n        Sodium aluminate solution: 3.8 g of sodium aluminate and 19 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/\nH2O/\n\n\n\n\n\n\n\nAl2O3\nSiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\nSiO2/CoO\nSi/Co\n\n\n\n\n\n\n\n22.60\n20.76\n0.12\n0.82\n0.41\n113.07\n113.07",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 54 hours. The dry material consisted of a pure cobaltoaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white to pale-pink product, expressed in molar ratios, is: 1.15Na2O:Al2O3:0.21CoO:27.6SiO2:15.4H2O. The X-ray diagram of this material is shown in FIG. 24.",
        "Preparation of a zirconoaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of Zirconyl chloride: 1.2 g of ZrOCl2.8H2O, 6 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 79.4 g of sodium silicate and 33 ml of distilled water.\n        Sodium aluminate solution: 3.8 g of sodium aluminate and 19 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/\nH2O/\n\n\n\n\n\n\n\nAl2O3\nSiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\nSiO2/ZrO2\nSi/Zr\n\n\n\n\n\n\n\n20.65\n20.72\n0.12\n0.82\n0.41\n101.49\n101.49",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 96 hours. The dry material consisted of a pure zirconoaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 1.32Na2O:Al2O3:0.26ZrO2:23.9SiO2:17.2H2O.",
        "Preparation of a galloaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid suspension of gallium (III) oxide: 2 g of Ga2O3, 6.5 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 85 g of sodium silicate and 38 ml of distilled water.\n        Sodium aluminate solution: 1.5 g of sodium aluminate, 0.2 g de NaOH and 20 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/\nH2O/\n\n\n\n\n\n\n\nAl2O3\nSiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\nSiO2/Ga2O3\nSi/Ga\n\n\n\n\n\n\n\n56.01\n20.57\n0.149\n0.77\n0.39\n37.91\n18.96",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 72 hours. The dry material consisted of a pure galloaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 3.11Na2O:Al2O3:1.77Ga2O3:81.1SiO2:55.4H2O. The 29Si NMR spectrum of this product is shown in FIG. 7. The SiO2/Al2O3 molar ratio of this material is 81.1. It is clear that the gallium is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "The Infrared spectrum of this material is shown in FIG. 16. The SiO2/Al2O3 molar ratio of this material is 81.1. It is clear that the gallium is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology. The X-ray diagram of this material is shown in FIG. 25.",
        "Preparation of a galloaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid suspension of gallium (III) oxide: 2.8 g of Ga2O3, 6.5 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 85 g of sodium silicate and 38 ml of distilled water.\n        Sodium aluminate solution: 1.5 g of sodium aluminate, and 20 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/\nH2O/\n\n\n\n\n\n\n\nAl2O3\nSiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\nSiO2/Ga2O3\nSi/Ga\n\n\n\n\n\n\n\n56.01\n20.57\n0.14\n0.76\n0.38\n27.08\n13.54",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 96 hours. The dry material consisted of a pure galloaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 3.41Na2O:Al2O3:2.26Ga2O3:84.1SiO2:41.3H2O. The Infrared spectrum of this material is shown in FIG. 17. The SiO2/Al2O3 molar ratio of this material is 84.1. It is clear that the gallium is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "Preparation of a chromoaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of chromium (III) nitrate: 12 g of Cr(NO3)3.9H2O, 38 ml of H2SO4 concentrate and 287 ml of distilled water.\n        Sodium silicate solution: 528 g of sodium silicate and 200 ml of distilled water.\n        Sodium aluminate solution: 23 g of sodium aluminate and 123 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/\nH2O/\n\n\n\n\n\n\n\nAl2O3\nSiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\nSiO2/Cr2O3\nSi/Cr\n\n\n\n\n\n\n\n22.69\n20.67\n0.13\n0.81\n0.40\n167.55\n83.77",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 72 hours. The dry material consisted of a pure Chromoaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the pale-green product, expressed in molar ratios, is: 1.21Na2O:Al2O3:0.07Cr2O3:24.6SiO2:6.8H2O. The X-ray diagram of this material is shown in FIG. 26.",
        "Preparation of a chromoaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of chromium (III) nitrate: 5 g of Cr(NO3)3.9H2O, 6 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 85 g of sodium silicate and 38 ml of distilled water.\n        Sodium aluminate solution: 1.7 g of sodium aluminate, 1.6 g of NaOH and 20 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/\nH2O/\n\n\n\n\n\n\n\nAl2O3\nSiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\nSiO2/Cr2O3\nSi/Cr\n\n\n\n\n\n\n\n49.42\n20.56\n0.19\n0.86\n0.43\n64.74\n32.37",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 96 hours. The dry material consisted of a pure Chromoaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the pale-green product, expressed in molar ratios, is: 2.40Na2O:Al2O3:0.82Cr2O3:53.7SiO2:35.6H2O. The Infrared spectrum of this material is shown in FIG. 18. The SiO2/Al2O3 molar ratio of this material is 53.7. It is clear that the chromium is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "Preparation of a magnesoaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of magnesium (II) nitrate: 1.2 g of Mg(NO3)2.6H2O, 6.1 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 79.6 g of sodium silicate and 33 ml of water.\n        Sodium aluminate solution: 3.8 g of sodium aluminate solution and 19 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/\nH2O/\n\n\n\n\n\n\n\nAl2O3\nSiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\nSiO2/MgO\nSi/Mg\n\n\n\n\n\n\n\n20.70\n20.68\n0.10\n0.82\n0.41\n70.82\n70.82",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 96 hours. The dry material consisted of a pure magnesoaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 1.11Na2O:Al2O3:0.30MgO:22.1SiO2:10.6H2O.",
        "Preparation of a magnesoaluminosilicate material of the MFI type is illustrated. A reaction batch consisting of the following solutions was prepared according with the procedure described above:\n\n    \n    \n        Acid solution of magnesium (II) nitrate: 3.0 g of Mg(NO3)2.6H2O, 6.1 ml of H2SO4 concentrate and 40 ml of distilled water.\n        Sodium silicate solution: 79.2 g of sodium silicate and 38 ml of water.\n        Sodium aluminate solution: 2.0 g of sodium aluminate solution and 19 ml of distilled water.",
        "The gel composition in the form of molar ratios of oxides is given below:",
        "SiO2/\nH2O/\n\n\n\n\n\n\n\nAl2O3\nSiO2\nOH/SiO2\nNa/SiO2\nNa2O/SiO2\nSiO2/MgO\nSi/Mg\n\n\n\n\n\n\n\n39.14\n21.43\n0.14\n0.84\n0.42\n32.21\n32.21",
        "The hydrothermal crystallization was carried out in a stirred 300-ml autoclave to a reaction temperature of 170° C. for a period of 96 hours. The dry material consisted of a pure magnesoaluminosilicate phase with an X-ray diffraction spectrum with at least the d values listed in Table 2, above. The chemical composition of the white product, expressed in molar ratios, is: 2.56Na2O:Al2O3:1.77MgO:52.2SiO2:25.1H2O. The 29Si NMR spectrum of this product is shown in FIG. 8. The SiO2/Al2O3 molar ratio of this material is 52.2. It is clear that the magnesium is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "The Infrared spectrum of this material is shown in FIG. 19. The SiO2/Al2O3 molar ratio of this material is 52.2. It is clear that the magnesium is coordinated with the silicon and thus the spectrum is different from a simple silicate or aluminosilicate material of MFI topology.",
        "The X-ray diagram of this material is shown in FIG. 27. FIG. 28 shows the XPS spectrum of the Mg 2p region of this product.",
        "This comparative example demonstrations the difference in the structural composition between compositions prepared using organic templates as in the prior art, and compositions prepared in accordance with the method of the present invention. One example of a patent utilizing organic templates to prepare the catalyst is U.S. Pat. No. 4,208,305. Compositions were prepared according to the teaching from this patent, following the procedure outlined in the examples related to “silicate 3” of this patent.",
        "As this example does not indicate whether stirring was conducted during crystallization, two samples were prepared, namely, SILI3-A and SILI3-B, prepared without and with stirring, respectively. The resulting composition was subjected to bulk chemical analysis and superficial XPS chemical analysis to determine the iron content incorporated into the bulk or framework of the composition, as well as the amount of iron present at the surface of this composition. The results are show in Table 3, below:",
        "TABLE 3\n\n\n\n\n\n\n\n\n\nBULK chemical analysis\nXPS chemical analysis\n\n\n\n\n\n\n\n\n\n\n\n\n\nSAMPLE\nSi wt %\nAl wt %\nFe wt %\nSi wt %\nAl wt %\nFe wt %\n\n\n\n\n\nSILI3-A\n38.16\n0.80\n2.74\n42.47\n1.02\n3.50\n\n\nSILI3-B\n37.86\n0.84\n2.68\n41.60\n1.00\n3.41",
        "As illustrated in Table 3, the stirring does not substantially influence the properties of this material. Further, in each instance, iron is present to a greater extent at the surface of the material than it is in the bulk. This is believed to be due to the use of organic templating agents in the preparation of this material.",
        "A series of materials were also prepared in accordance with the present invention using different iron and aluminum contents, and prepared without organic templating agents in accordance with the methods of the present application. These materials, identified as IPZ-E-1, 2, 3 and 4, were then subjected to bulk chemical analysis and superficial XPS chemical analysis as was conducted in connection with the samples of prior art materials discussed above. Results are set forth in Table 4 below:",
        "TABLE 4\n\n\n\n\n\n\n\n\n\nBULK chemical analysis\nXPS chemical analysis\n\n\n\n\n\n\n\n\n\n\n\n\n\nSAMPLE\nSi wt %\nAl wt %\nFe wt %\nSi wt %\nAl wt %\nFe wt %\n\n\n\n\n\nIPZ-E-1\n37.81\n2.34\n0.83\n38.92\n2.17\n0.43\n\n\nIPZ-E-2\n39.17\n2.17\n1.39\n46.14\n1.92\n0.62\n\n\nIPZ-E-3\n39.77\n1.80\n2.53\n40.59\n1.65\n0.95\n\n\nIPZ-E-4\n37.85\n0.74\n2.86\n42.38\n0.64\n0.85",
        "As shown in Table 4, the iron incorporated into these materials prepared in accordance with the present invention is incorporated at a greater percentage within the bulk of the material than it is at the surface. This is indicative of a non-homogeneous incorporation of the metal into the material, with a substantial or preferential portion being incorporated into the bulk or framework of the material, which is desired so as to reduce potential for loss of the metal, for example during ion exchange processes and the like.",
        "This invention may be embodied in other forms or carried out in other ways without departing from the spirit or essential characteristics thereof. The present embodiment is therefore to be considered as in all respects illustrative and not restrictive, the scope of the invention being indicated by the appended claims, and all changes which come within the meaning and range of equivalency are intended to be embraced therein."
    ],
    "citations": [
        "1094033"
    ],
    "us_classification": "4233282",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "01",
            "subclass": "B",
            "main_group": "33",
            "subgroup": "26"
        }
    ]
}