{
    "title": "Si nanowire substrate, method of manufacturing the same, and method of manufacturing thin film transistor using the same",
    "abstract": "A silicon nanowire substrate having a structure in which a silicon nanowire film having a fine line-width is formed on a substrate, a method of manufacturing the same, and a method of manufacturing a thin film transistor using the same. The method of manufacturing the silicon nanowire substrate includes preparing a substrate, forming an insulating film on the substrate, forming a silicon film on the insulating film, patterning the insulating film and the silicon film into a strip shape, reducing the line-width of the insulating film by undercut etching at least one lateral side of the insulating film, and forming a self-aligned silicon nanowire film on an upper surface of the insulating film by melting and crystallizing the silicon film.",
    "inventors": [
        "Cho",
        "Noguchi",
        "Xianyu",
        "Kim",
        "Yin",
        "Zhang"
    ],
    "document_number": "07297615",
    "publication_date": "20071120",
    "assignees": [
        "Samsung Electronics, Co., Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of manufacturing a silicon nanowire substrate, comprising:",
            "components": [
                {
                    "component": "preparing a substrate;",
                    "subcomponents": []
                },
                {
                    "component": "forming an insulating film on the substrate;",
                    "subcomponents": []
                },
                {
                    "component": "forming a silicon film on the insulating film;",
                    "subcomponents": []
                },
                {
                    "component": "patterning the insulating film and the silicon film into a strip shape;",
                    "subcomponents": []
                },
                {
                    "component": "reducing the line-width of the insulating film by undercut etching at least one lateral side of the insulating film; and",
                    "subcomponents": []
                },
                {
                    "component": "forming a self-aligned silicon nanowire film on an upper surface of the insulating film by melting and crystallizing the silicon film.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein the patterning of the insulating film comprises patterning the insulating film and the silicon film to a line-width in the range of 20 to 300 nm.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , wherein the insulating film and the silicon film are patterned to the same line-width.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein the patterning of the insulating film and the silicon film is performed by reactive ion etching.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 , wherein the substrate is formed of one material selected from the group consisting of silicon, oxidized silicon, quartz, glass, sapphire, and plastic.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein the insulating film is formed of one selected from SiN or SiO",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein the lateral etching of the insulating film is performed by isotropic dry etching.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , wherein the silicon film is melted by laser annealing.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 1 , wherein in crystallizing the silicon film, the nucleation rate of crystallizing silicon is 1 event/μs or less.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 1 , wherein the line-width of the silicon nanowire film self-aligned on the insulating film is controlled by controlling the line-width of the insulating film.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 1 , wherein the silicon nanowire film has a line-width of 30 nm or less.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 1 , wherein the silicon nanowire film has a length in the range of 100 to 10000 nm.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 1 , wherein the silicon nanowire film is single crystalline silicon.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 1 , wherein",
            "components": [
                {
                    "component": "the substrate is a single crystalline silicon substrate and the insulating film is formed on the single crystalline silicon substrate, the method further comprising:",
                    "subcomponents": []
                },
                {
                    "component": "exposing the single crystalline silicon substrate by etching a region of the insulating film;",
                    "subcomponents": []
                },
                {
                    "component": "forming a silicon crystal seed on the exposed surface of the single crystalline silicon substrate by epitaxially growing silicon;",
                    "subcomponents": []
                },
                {
                    "component": "wherein",
                    "subcomponents": []
                },
                {
                    "component": "the silicon film is formed on the upper surface of the insulating film and the silicon crystal seed;",
                    "subcomponents": []
                },
                {
                    "component": "the insulating film and the silicon film are patterned formed on the insulating film into a strip shape of which one end part contacts the silicon crystal seed, the method further comprising:",
                    "subcomponents": []
                },
                {
                    "component": "melting the silicon film formed on the upper surface of the insulating film and the silicon crystal seed;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the self-aligned silicon nanowire film is formed on the upper surface of the insulating film by laterally crystallizing the silicon film from the silicon crystal seed.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 14 , wherein the exposing of the single crystalline silicon substrate by etching a region of the insulating film is performed by reactive ion etching.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 14 , wherein the insulating film comprises a SiO",
            "components": []
        }
    ],
    "description": [
        "This application claims the benefit of Korean Patent Application No. 10-2005-0040165, filed on May 13, 2005, in the Korean Intellectual Property Office, the disclosure of which is incorporated herein in its entirety by reference.",
        "1. Field of the Invention",
        "Example embodiments of the present invention relate to a method of manufacturing a silicon nanowire film, and more particularly, to a silicon nanowire substrate having a structure in which a silicon nanowire film having a fine line-width is formed on a substrate, and a method of manufacturing the same, and a method of manufacturing a thin film transistor using the same.",
        "2. Description of the Related Art",
        "Poly crystalline silicon (poly-Si) may be applied to various electronic devices, for example, flat display devices and solar cells, as a result of having a higher mobility than amorphous silicon (a-Si). However, poly crystalline silicon has lower mobility and uniformity than single crystalline silicon. Single crystalline silicon may be useful in a system on panel (SOP) structure in which a system is formed on the display panel itself, and may have a mobility of more than 300 cm2/Vs. Single crystalline silicon allows the manufacture of improved quality switching devices required for higher performance display devices.",
        "Recently, to comply with stricter miniaturization requirements and higher performance devices, nano scale devices have been developed. To manufacture nano scale devices, nanowire forming techniques have been developed. A nanowire may be defined as an ultra fine line having a cross-sectional diameter of a few nanometers to a few tens of nanometers. Nanowires may be utilized in many fields, for example, laser, transistors, memories and chemical detecting sensors. Naowire materials may include carbon nanotubes (CNT), CdTe, ZnO2, and/or SiGe.",
        "Methods of manufacturing nanowires may be difficult and complicated. A crystal growth inducing method may be used to grow nanowires, but this method may only provide nanowire crystals grown perpendicular to a substrate, and a nanowire grown by such a method may have many impurities. In some cases, location control of the nanowire is needed, which conventional methods may have difficulty providing. Unlike crystal growth inducing methods that uses a catalyst, a nanowire may also be manufactured by lithography, in order to control their horizontal location. However, the conventional lithographic resolution limit is approximately 30 nm. Therefore, the manufacture of a nanowire having a line-width of 30 nm or less is difficult.",
        "Example embodiments of the present invention provide a silicon nanowire substrate having a structure in which a silicon nanowire film having a line-width is formed on a substrate, a method of manufacturing the same, and a method of manufacturing a thin film transistor using the same.",
        "According to an example embodiment of the present invention, there is provided a silicon nanowire substrate including a substrate, an insulating film formed on the substrate in a strip shape, and a silicon nanowire film covering an upper surface of the insulating film.",
        "In an example embodiment, the insulating film and the silicon nanowire film may have the same line-width, which may be 30 nm or less. In an example embodiment, the silicon nanowire film may have a length in the range of 100 to 10000 nm. In an example embodiment, the substrate may be formed of at least one material selected from the group consisting of silicon, oxidized silicon, quartz, glass, sapphire, and plastic. In an example embodiment, the insulating film may be formed of at least one material selected from SiN or SiO2, and the silicon nanowire film may be single crystalline silicon.",
        "According to another example embodiment of the present invention, there is provided a silicon nanowire substrate including a single crystalline silicon substrate, an insulating film formed on the single crystalline silicon substrate in a strip shape, a silicon crystal seed which is epitaxially grown on the single crystalline silicon substrate and contacts one end of the insulating film, and a silicon nanowire film, which is laterally crystallized from the silicon crystal seed, covers the upper surface of the insulating film, and has an extension part which contacts the silicon crystal seed.",
        "In an example embodiment, the insulating film and the silicon nanowire film may have the same line-width, which may be 30 nm or less. In an example embodiment, the silicon nanowire film may have a length in the range of 100 to 10000 nm. In an example embodiment, the insulating film may be formed of at least one material selected from SiN and SiO2, and the insulating film may comprise a SiO2 film and a SiN film sequentially stacked on the single crystalline silicon substrate. In an example embodiment, the silicon nanowire film may be single crystalline silicon.",
        "According to an example embodiment of the present invention, there is provided a method of manufacturing a silicon nanowire substrate, including preparing a substrate, forming an insulating film on the substrate, forming a silicon film on the insulating film, patterning the insulating film and the silicon film into a strip shape, reducing the line-width of the insulating film by undercut etching at least one lateral side of the insulating film, and forming a self-aligned silicon nanowire film on the upper surface of the insulating film by melting and crystallizing the silicon film.",
        "In an example embodiment, the patterning of the insulating film may include patterning the insulating film and the silicon film to the same line-width, which may be in the range of 20 to 300 nm. In an example embodiment, the patterning of the insulating film and/or the silicon film may be performed by reactive ion etching.",
        "In an example embodiment, the substrate may be formed of at least one material selected from the group consisting of silicon, oxidized silicon, quartz, glass, sapphire, and plastic. In an example embodiment, the insulating film may be formed of at least one material selected from SiN or SiO2. In an example embodiment, the lateral etching of the insulating film may be performed by isotropic dry etching and/or the silicon film may be melted by laser annealing. In crystallizing the silicon film, the nucleation rate of crystallizing silicon may be 1 event/μs or less.",
        "In an example embodiment, the line-width of the silicon nanowire film self-aligned on the insulating film may be controlled by controlling the line-width of the insulating film, and the silicon nanowire film may have a line-width of 30 nm or less. In an example embodiment, the silicon nanowire film may have a length in the range of 100 to 10000 nm and the silicon nanowire film may be single crystalline silicon.",
        "According to another example embodiment of the present invention, there is provided a method of manufacturing a silicon nanowire substrate, including preparing a single crystalline silicon substrate, forming an insulating film on the single crystalline silicon substrate, exposing the single crystalline silicon substrate by etching a region of the insulating film, forming a silicon crystal seed on the exposed surface of the single crystalline silicon substrate by epitaxially growing silicon, forming a silicon film on the upper surface of the insulating film, patterning the insulating film and the silicon film formed on the insulating film into a strip shape of which one end part contacts the silicon crystal seed, reducing the line-width of the insulating film by undercut etching at least one lateral side of the insulating film and the silicon crystal seed; melting the silicon film formed on the upper surface of the insulating film and the silicon crystal seed, and forming a self-aligned silicon nanowire film on the upper surface of the insulating film by laterally crystallizing the silicon film from the silicon crystal seed.",
        "In an example embodiment, the patterning of the insulating film may include patterning the insulating film and the silicon film to have the same line-width, which may be in the range of 20 to 300 nm. In an example embodiment, the patterning of the insulating film and/or the silicon film may be performed by reactive ion etching. In an example embodiment, the exposing of the single crystalline silicon substrate by etching a region of the insulating film may be performed by reactive ion etching. In an example embodiment, the insulating film may be formed of at least one material selected from SiN or SiO2, and the insulating film may comprise a SiO2 film and a SiN film sequentially stacked on the single crystalline silicon substrate.",
        "In an example embodiment, the lateral etching of the insulating film may be performed by isotropic dry etching, and the silicon film may be melted by laser annealing. In crystallizing the silicon film, the nucleation rate of crystallizing silicon may be 1 event/μs or less.",
        "In an example embodiment, the line-width of the silicon nanowire film self-aligned on the insulating film may be controlled by controlling the line-width of the insulating film, and the silicon nanowire film may have a line-width of 30 nm or less. In an example embodiment, the silicon nanowire film may have a length in the range of 100 to 10000 nm, and the silicon nanowire film may be single crystalline silicon.",
        "According to an example embodiment of the present invention, there is provided a method of manufacturing a thin film transistor, including preparing a substrate, forming an insulating film on the substrate, forming a silicon film on the insulating film, patterning the insulating film and the silicon film into a strip shape, reducing the line-width of the insulating film by undercut etching at least one lateral side of the insulating film, forming a self-aligned silicon nanowire film on the upper surface of the insulating film by melting and crystallizing the silicon film, defining a source region, a drain region, and a channel region on the silicon nanowire film, sequentially forming a gate insulating film and a gate electrode on the channel region, and doping the source and drain regions with a conductive dopant.",
        "According to another example embodiment of the present invention, there is provided a method of manufacturing a thin film transistor, including preparing a single crystalline silicon substrate, forming an insulating film on the single crystalline silicon substrate, exposing the single crystalline silicon substrate by etching a region of the insulating film, forming a silicon crystal seed on the exposed surface of the single crystalline silicon substrate by epitaxially growing silicon, forming a silicon film on the upper surface of the insulating film and the silicon crystal seed, patterning the insulating film and the silicon film formed on the insulating film into a strip shape of which one end part contacts the silicon crystal seed, reducing the line-width of the insulating film by undercut etching at least one lateral side of the insulating film, melting the silicon film formed on the upper surface of the insulating film and the silicon crystal seed, and forming a self-aligned silicon nanowire film on the upper surface of the insulating film by laterally crystallizing the silicon film from the silicon crystal seed, cutting the silicon nanowire film to a desired length, defining a source region, a drain region, and a channel region on the silicon nanowire film, sequentially forming a gate insulating film and a gate electrode on the channel region, and doping the source and drain regions with a conductive dopant.",
        "In an example embodiment, the gate insulating film may be formed of at least one material selected from SiO2 and HfO2, and the gate electrode may be formed of a metal.",
        "In an example embodiment, the silicon nanowire film manufacturing process may be simpler, and the location of the silicon nanowire film can be readily controlled.",
        "The above and other features and advantages of example embodiments of the present invention will become more apparent by describing in detail exemplary embodiments thereof with reference to the attached drawings in which:",
        "FIG. 1 is a perspective view illustrating a silicon nanowire substrate according to an example embodiment of the present invention;",
        "FIG. 2 is a perspective view illustrating a silicon nanowire substrate according to another example embodiment of the present invention;",
        "FIGS. 3A through 3G are perspective views for explaining a method of manufacturing a silicon nanowire substrate according to an example embodiment of the present invention;",
        "FIGS. 4A through 4J are perspective views for explaining a method of manufacturing a silicon nanowire substrate according to another example embodiment of the present invention;",
        "FIGS. 5A through 5E are perspective views for explaining an example method of manufacturing a thin film transistor using the silicon nanowire substrate manufactured by the processes depicted in FIGS. 3A through 3G; and",
        "FIGS. 6A through 6E are perspective views for explaining a n example method of manufacturing a thin film transistor using the silicon nanowire substrate manufactured by the processes depicted in FIGS. 4A through 4J.",
        "The present invention will now be described more fully with reference to the accompanying drawings, in which exemplary embodiments of the invention are shown. In the drawings, the thicknesses of layers and regions are exaggerated for clarity.",
        "Detailed illustrative embodiments of the present invention are disclosed herein. However, specific structural and functional details disclosed herein are merely representative for purposes of describing example embodiments of the present invention. This invention may, however, may be embodied in many alternate forms and should not be construed as limited to only the embodiments set forth herein.",
        "Accordingly, while example embodiments of the invention are capable of various modifications and alternative forms, embodiments thereof are shown by way of example in the drawings and will herein be described in detail. It should be understood, however, that there is no intent to limit example embodiments of the invention to the particular forms disclosed, but on the contrary, example embodiments of the invention are to cover all modifications, equivalents, and alternatives falling within the scope of the invention. Like numbers refer to like elements throughout the description of the figures.",
        "It will be understood that, although the terms first, second, etc. may be used herein to describe various elements, these elements should not be limited by these terms. These terms are only used to distinguish one element from another. For example, a first element could be termed a second element, and, similarly, a second element could be termed a first element, without departing from the scope of example embodiments of the present invention. As used herein, the term “and/or” includes any and all combinations of one or more of the associated listed items.",
        "It will be understood that when an element is referred to as being “connected” or “coupled” to another element, it can be directly connected or coupled to the other element or intervening elements may be present. In contrast, when an element is referred to as being “directly connected” or “directly coupled” to another element, there are no intervening elements present. Other words used to describe the relationship between elements should be interpreted in a like fashion (e.g., “between” versus “directly between”, “adjacent” versus “directly adjacent”, etc.).",
        "The terminology used herein is for the purpose of describing particular embodiments only and is not intended to be limiting of example embodiments of the invention. As used herein, the singular forms “a”, “an” and “the” are intended to include the plural forms as well, unless the context clearly indicates otherwise. It will be further understood that the terms “comprises”, “comprising,”, “includes” and/or “including”, when used herein, specify the presence of stated features, integers, steps, operations, elements, and/or components, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, and/or groups thereof.",
        "It will be understood that when an element or layer is referred to as being “on”, “connected to” or “coupled to” another element or layer, it can be directly on, connected or coupled to the other element or layer or intervening elements or layers may be present. In contrast, when an element is referred to as being “directly on,” “directly connected to” or “directly coupled to” another element or layer, there are no intervening elements or layers present. Like numbers refer to like elements throughout. As used herein, the term “and/or” includes any and all combinations of one or more of the associated listed items.",
        "It will be understood that, although the terms first, second, third etc. may be used herein to describe various elements, components, regions, layers and/or sections, these elements, components, regions, layers and/or sections should not be limited by these terms. These terms are only used to distinguish one element, component, region, layer or section from another region, layer or section. Thus, a first element, component, region, layer or section discussed below could be termed a second element, component, region, layer or section without departing from the scope of example embodiments of the present invention.",
        "Spatially relative terms, such as “beneath”, “below”, “lower”, “above”, “upper” and the like, may be used herein for ease of description to describe one element or a feature's relationship to another element or feature as illustrated in the FIGS. It will be understood that the spatially relative terms are intended to encompass different orientations of the device in use or operation in addition to the orientation depicted in the FIGS. For example, if the device in the FIGS. is turned over, elements described as “below” or “beneath” other elements or features would then be oriented “above” the other elements or features. Thus, for example, the term “below” can encompass both an orientation which is above as well as below. The device may be otherwise oriented (rotated 90 degrees or viewed or referenced at other orientations) and the spatially relative descriptors used herein should be interpreted accordingly.",
        "The terminology used herein is for the purpose of describing particular embodiments only and is not intended to be limiting of example embodiments of the invention. As used herein, the singular forms “a”, “an” and “the” are intended to include the plural forms as well, unless the context clearly indicates otherwise. It will be further understood that the terms “comprises,” “comprising,” “includes” and/or “including,” when used in this specification, specify the presence of stated features, integers, steps, operations, elements, and/or components, but do not preclude the presence or addition of one or more other features, integers, steps, operations, elements, components, and/or groups thereof.",
        "Also, the use of the words “compound,” “compounds,” or “compound(s),” refer to either a single compound or to a plurality of compounds. These words are used to denote one or more compounds but may also just indicate a single compound.",
        "Example embodiments of the present invention are described herein with reference to cross-sectional illustrations that are schematic illustrations of idealized embodiments (and intermediate structures). As such, variations from the shapes of the illustrations as a result, for example, of manufacturing techniques and/or tolerances, may be expected. Thus, example embodiments of the invention should not be construed as limited to the particular shapes of regions illustrated herein but may include deviations in shapes that result, for example, from manufacturing. For example, an implanted region illustrated as a rectangle may have rounded or curved features and/or a gradient (e.g., of implant concentration) at its edges rather than an abrupt change from an implanted region to a non-implanted region. Likewise, a buried region formed by implantation may result in some implantation in the region between the buried region and the surface through which the implantation may take place. Thus, the regions illustrated in the figures are schematic in nature and their shapes do not necessarily illustrate the actual shape of a region of a device and do not limit the scope of the present invention.",
        "It should also be noted that in some alternative implementations, the functions/acts noted may occur out of the order noted in the FIGS. For example, two FIGS. shown in succession may in fact be executed substantially concurrently or may sometimes be executed in the reverse order, depending upon the functionality/acts involved.",
        "Unless otherwise defined, all terms (including technical and scientific terms) used herein have the same meaning as commonly understood by one of ordinary skill in the art to which example embodiments of the present invention belong. It will be further understood that terms, such as those defined in commonly used dictionaries, should be interpreted as having a meaning that is consistent with their meaning in the context of the relevant art and will not be interpreted in an idealized or overly formal sense unless expressly so defined herein.",
        "In order to more specifically describe example embodiments of the present invention, various aspects of the present invention will be described in detail with reference to the attached drawings. However, the present invention is not limited to the example embodiments described. In the figures, if a layer is formed on another layer or a substrate, it means that the layer is directly formed on another layer or a substrate, or that a third layer is interposed therebetween. In the following description, the same reference numerals denote the same elements.",
        "FIG. 1 is a perspective view illustrating a silicon nanowire substrate according to an example embodiment of the present invention.",
        "Referring to FIG. 1, a silicon nanowire substrate according to an example embodiment of the present invention may include a substrate 10, an insulating film 22 formed in a strip shape on the substrate 10, and/or a silicon nanowire film 34 covering the insulating film 22. In an example embodiment, the substrate 10 may be an oxidized Si substrate and the oxidized Si substrate 10 may include a Si wafer 10a and a SiO2 layer 10b formed on the Si wafer 10a. The insulating film 22 may be formed of SiN or SiO2, and the silicon nanowire film 34 may be single crystalline. In an example embodiment, the SiN insulating film 22 has high interface contact with the silicon nanowire film 34.",
        "In an example embodiment, the insulating film 22 and the silicon nanowire film 34 have the same line-width of 30 nm or less. In an example embodiment, the silicon nanowire film 34 has a length of 100-10000 nm.",
        "In an example embodiment, the substrate 10 may be formed of at least one material selected from the group consisting of silicon, oxidized silicon, quartz, glass, sapphire, and plastic.",
        "In an example embodiment, the silicon nanowire substrate having the above structure may readily provide a silicon nanowire film having a line-width of 30 nm or less, beyond the conventional lithographic resolution limit. In an example embodiment, the location of the silicon nanowire film on the substrate 10 may be readily controlled, and the silicon nanowire film can be used for a channel of a thin film transistor. In an example embodiment, a single crystalline silicon nanowire film has a smaller parasitic capacitance and/or a higher carrier mobility. Accordingly, a single crystalline silicon nanowire film may be used as a transistor channel of a next generation transistor having improved device characteristics.",
        "FIG. 2 is a perspective view illustrating a silicon nanowire substrate according to another example embodiment of the present invention.",
        "Referring to FIG. 2, a silicon nanowire substrate according to another example embodiment of the present invention may include a single crystalline silicon substrate 20, an insulating film 28 formed in a strip shape on the single crystalline silicon substrate 20, a silicon crystal seed 29 which may be epitaxially grown on the single crystalline silicon substrate 20 and contacts an end part of the insulating film 28, and/or a silicon nanowire film 36 that may cover the insulating film 28 and has an extension part which contacts the silicon crystal seed 29. In an example embodiment, the silicon nanowire film 36 is laterally crystallized from the silicon crystal seed 29. In an example embodiment, the silicon nanowire film 36 may be single crystalline.",
        "In an example embodiment, the insulating film 28 may be formed of SiN or SiO2. In an example embodiment, the insulating film 28 may include a SiO2 film 24 and a SiN film 26 sequentially formed on the single crystalline silicon substrate 20. In an example embodiment, the SiN film 26 has high interface contact with the silicon nanowire film 36.",
        "In an example embodiment, the insulating film 28 and the silicon nanowire film 36 have the same line-width of 30 nm or less. In an example embodiment, the silicon nanowire film 36 has a length of 100 to 10000 nm.",
        "In the silicon nanowire substrate having the above structure, the crystalline direction of the silicon crystal seed 29 epitaxially grown from the single crystalline silicon substrate 20 may be determined according to the crystalline direction of the single crystalline silicon substrate 20, and the crystalline direction of the silicon nanowire film 36 laterally crystallized from the silicon crystal seed 29 may be determined according to the crystalline direction of the silicon crystal seed 29. That is, the crystalline direction of the silicon nanowire film 36 may be controlled by controlling the crystalline direction of the silicon crystal seed 29, and the silicon nanowire film 36 can be provided with various characteristics depending on the crystalline direction.",
        "FIGS. 3A through 3G are perspective views for explaining a method of manufacturing a silicon nanowire substrate according to an example embodiment of the present invention. In example embodiment of the present invention, a thin film may be manufactured using methods well known in the art, for example, CVD, PVD, or MOCVD.",
        "Referring to FIG. 3A, the substrate 10 may be prepared. The substrate 10 may be formed of at least one material selected from the group consisting of silicon, oxidized silicon, quartz, glass, sapphire, and plastic. For example, the substrate 10 may be an oxidized Si substrate, and as depicted in FIG. 3A, may include a Si wafer 10a and a SiO2 layer 10b formed on the Si wafer 10a.",
        "Referring to FIGS. 3B and 3C, an insulating film 21 and a silicon film 33 may be sequentially formed on the substrate 10. The insulating film 21 may be formed of SiN or SiO2, and the silicon film 33 may be formed of poly crystalline silicon, poly-Si or amorphous silicon, a-Si. In an example embodiment, the insulating film 21 may be formed of SiN because SiN has high interface contact with the silicon film 33.",
        "Referring to FIG. 3D, the insulating film 21 and the silicon film 33 may be patterned into a strip shape having the same line-width in the range of 20 to 300 nm. In an example embodiment, the insulating film 21 and the silicon film 33 may have the same length, in the range of 100 to 10000 nm. In an example embodiment, the patterning may be performed by reactive ion etching.",
        "Referring to FIG. 3E, the line-width of the patterned insulating film 21a may be reduced by undercut etching both sides of the insulating film 21a. In an example embodiment, the lateral etching of the insulating film 21a may be performed by isotropic dry etching.",
        "Referring to FIGS. 3F and 3G, the silicon film 33a may be melted by laser annealing. In an example embodiment, the surface energy of the melted silicon film 33a may be reduced by melting the silicon film 33a, so that the surface width of the melted silicon film 33a is reduced to the width of the insulating film 22 thereunder; however, the thickness of the silicon film 33a increases according to the volume conservation rule. By the same principle, the melted silicon film 33a may crystallize by self-aligning on the upper surface of the etched insulating film 22. Accordingly, a fine silicon nanowire film 34 can be obtained on the upper surface of the insulating film 22. In an example embodiment, the silicon nanowire film 34 obtained in this manner may be narrower than a silicon nanowire film patterned by conventional lithography.",
        "In an example embodiment, the line-width of the silicon nanowire film 34 self aligned on the upper surface of the insulating film 22 may be finely controlled by finely controlling the line-width of the insulating film 22. In an example embodiment, the silicon nanowire film 34 may be formed with a line-width of 30 nm or less. In an example embodiment, when the nucleation rate of crystallizing silicon is controlled to 1 event/μs or less, the silicon nanowire film 34 may be single crystalline silicon. Accordingly, the single crystalline silicon nanowire film 34 may be used for a channel of a next generation transistor having improved device characteristics.",
        "The nucleation rate will now be described in more detail. Generally, the nucleation rate of one mole of silicon is 1011 event/ns. If the volume of the silicon nanowire film is 30 nm (width)×30 nm (thickness)×1000 nm (length)=9×10−22 m3, this corresponds to 7.5×10−15 moles. Accordingly, the nucleation rate is 7.5×10−15 moles×1011 event/ns, which is equivalent to 1 event/μs. Accordingly, a single crystalline silicon nanowire film may be formed by controlling the nucleation rate of the crystallizing silicon to 1 event/μs.",
        "In an example embodiment, the silicon nanowire substrate having the above structure may provide a silicon nanowire film having a line-width of 30 nm or less, beyond the conventional lithographic resolution limit. In an example embodiment, the method of manufacturing the silicon nanowire film is simpler and the location of the silicon nanowire film on the substrate 10 may be readily controlled.",
        "FIGS. 4A through 4J are perspective views for explaining a method of manufacturing a silicon nanowire substrate according to another embodiment of the present invention. In these processes, the thin film can be manufactured using methods well known in the art, such as CVD, PVD, or MOCVD.",
        "Referring to FIGS. 4A and 4B, after a single crystalline silicon substrate 20 is prepared, an insulating film 27 may be formed on the single crystalline silicon substrate 20. The insulating film 27 may be formed of SiN or SiO2. In an example embodiment, the insulating film 27 may be formed by sequentially forming a SiO2 film 23 and a SiN film 25 on the single crystalline silicon substrate 20. In an example embodiment, SiN has high interface contact with the silicon film.",
        "Referring to FIGS. 4C and 4D, a portion of the single crystalline silicon substrate 20 is exposed by etching a region of the insulating film 27. In an example embodiment, this process may be performed by reactive ion etching. Afterward, a silicon crystal seed 29 may be formed on the exposed surface of the single crystalline silicon substrate 20 by epitaxially growing silicon. In an example embodiment, the crystalline direction of the silicon crystal seed 29 epitaxially grown may vary according to the crystalline direction of the single crystalline silicon substrate 20, and the silicon crystal seed 29 may be formed to the same height as the etched insulating film 27a.",
        "Referring to FIGS. 4E and 4F, a silicon film 35 may be formed on the insulating film 27a and the silicon crystal seed 29. In an example embodiment, the insulating film 27a and the silicon film 35 stacked on the insulating film 27a may be patterned into a strip shape. In an example embodiment, one end of the patterned insulating film 27b may contact the silicon crystal seed 29.",
        "The insulating film 27b and the silicon film 35a stacked on the insulating film 27b may be patterned to have the same line-width in the range of 20 to 300 nm and/or the same length in the range of 100 to 10000 nm. The patterning can be performed by reactive ion etching.",
        "Referring to FIG. 4G, the line-width of the patterned insulating film 27b may be reduced by undercut etching both sides of the insulating film 27b. The lateral etching of the insulating film 27b may be performed by isotropic dry etching.",
        "Referring to FIGS. 4H and 4J, a silicon film 35a formed on the laterally etched insulating film 28 and the silicon crystal seed 29 may be melted by laser annealing.",
        "The surface energy of the melted silicon film 35a may be reduced by melting the silicon film 35a, because the surface width of the melted silicon film 35a is reduced to the width of the insulating film 28 thereunder; however, the thickness of the silicon film 35a increases according to the volume conservation rule. By the same principle, the melted silicon film 35a may crystallize while self-aligning on the upper surface of the etched insulating film 28. In an example embodiment, the melted silicon film 35a crystallizes from laterals, and a single crystalline silicon nanowire film 36 may be formed on the upper surface of the insulating film 28. In an example embodiment, in this process, the crystalline direction of the silicon nanowire film 36 may be controlled by controlling the crystalline direction of the silicon crystal seed 29, and the silicon nanowire film 36 may be provided various physical properties depending on the crystalline direction. Also, the crystalline direction of the silicon crystal seed 29 may be readily controlled according to the crystalline direction of the selected single crystalline silicon substrate.",
        "In an example embodiment, the silicon nanowire film 36 can be formed to have a line-width of 30 nm or less. In an example embodiment, when the nucleation rate of the crystallizing silicon is controlled to 1 event/μs or less, the silicon nanowire film 36 may be formed into single crystalline silicon. Accordingly, the single crystalline silicon nanowire film 36 may be used for a channel of a next generation transistor having improved device characteristics.",
        "The silicon nanowire film 36 obtained by the above method according to example embodiments of the present embodiment may be narrower than a silicon nanowire film patterned by conventional lithography. In example embodiments of the present invention, the line-width of the silicon nanowire film 36 self-aligned on the upper surface of the insulating film 28 may be controlled by controlling the line-width of the insulating film 28.",
        "FIGS. 5A through 5E are perspective views for explaining an example method of manufacturing a thin film transistor using the silicon nanowire substrate manufactured by the processes depicted in FIGS. 3A through 3G.",
        "Referring to FIG. 5A, a silicon nanowire substrate may be manufactured by the processes depicted in FIGS. 3A through 3G.",
        "Referring to FIG. 5B, a source 34S, a drain 34D, and a channel region 34C may be defined on a silicon nanowire film 34 formed on the substrate.",
        "Referring to FIG. 5C, a gate insulating film 41 and a gate electrode 42 may be sequentially formed on the channel region 34C. In an example embodiment, the gate insulating film 41 may be formed of SiO2 or HfO2. In an example embodiment, the gate electrode 42 may be formed of a metal, for example, Al or Cr.",
        "Referring to FIGS. 5D and 5E, a conductive dopant may be added to the source 34S and the drain 34D regions, to produce a thin film transistor that uses the silicon nanowire substrate according to an example embodiment of the present invention.",
        "FIGS. 6A through 6E are perspective views for explaining an example method of manufacturing a thin film transistor using the silicon nanowire substrate manufactured by the processes depicted in FIGS. 4A through 4J.",
        "Referring to FIG. 6A, a silicon nanowire substrate may be manufactured by the process depicted in FIGS. 4A through 4J. A silicon nanowire film 36 formed on the substrate may be cut to the desired size. For example, the silicon crystal seed 29 side may be cut and removed because the silicon crystal seed 29 is not needed for forming a thin film transistor.",
        "Referring to FIG. 6B, a source 36S, a drain 36D, and a channel region 36C may be defined on the silicon nanowire film 36 formed on the substrate.",
        "Referring to FIG. 6C, a gate insulating film 41 and a gate electrode 42 may be sequentially formed on the channel region 36C. In an example embodiment, the gate insulating film 41 may be formed of SiO2 or HfO2. In an example embodiment, the gate electrode 42 may be formed of a metal, for example, Al or Cr.",
        "Referring to FIGS. 6D and 6E, a conductive dopant may be added to the source 36S and the drain 36D regions, to produce a thin film transistor that uses the silicon nanowire substrate according to example embodiments of the present invention.",
        "According to example embodiments of the present invention, a silicon nanowire substrate having the above structure may provide a silicon nanowire film having a line-width of 30 nm or less, beyond the conventional lithographic resolution limit. The example processes for manufacturing the silicon nanowire film are simpler and the location of the silicon nanowire film on the substrate can be readily controlled. In example embodiments, the silicon nanowire film may be formed of single crystalline silicon by controlling the nucleation rate of the crystallizing silicon. A single crystalline silicon nanowire film has a smaller parasitic capacitance and/or higher carrier mobility. Accordingly, a single crystalline silicon nanowire film may be used as a transistor channel of a next generation transistor having improved device characteristics.",
        "While the present invention has been particularly shown and described with reference to example embodiments thereof, it will be understood by those of ordinary skill in the art that various changes in form and detail may be made therein without departing from the spirit and scope of the present invention as defined by the following claims."
    ],
    "citations": [
        "7109072",
        "2004/0005747"
    ],
    "us_classification": "438486",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "30",
            "subclass": "B",
            "main_group": "1",
            "subgroup": "02"
        }
    ]
}