{
    "title": "Draw resonance resistant multilayer films",
    "abstract": "Aspects of the invention are found in a multilayer film comprising a first polymer layer and a second polymer layer. The first polymer layer comprises a blend of a first fluoropolymer having a first average molecular weight and a second fluoropolymer having a second average molecular weight. The first average molecular weight is greater than the second average molecular weight.",
    "inventors": [
        "Hetzler",
        "Skatchkov",
        "Sharps, Jr."
    ],
    "document_number": "07297391",
    "publication_date": "20071120",
    "assignees": [
        "Saint-Gobain Performance Plastics Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A multilayer film comprising:",
            "components": [
                {
                    "component": "a first polymer layer forming an outer surface of the multilayer film and comprising 100% by weight fluoropolymer:",
                    "subcomponents": []
                },
                {
                    "component": "a second polymer layer comprising a blend of a first fluoropolymer having a first average molecular weight and a second fluoropolymer having a second average molecular weight, the first average molecular weight being at least about 25% greater than the second average molecular weight; and",
                    "subcomponents": []
                },
                {
                    "component": "a third polymer layer comprising greater than about 40% by weight fluoropolymer at not greater than about 40% by weight acrylic polymer.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The multilayer film of claim 1 , wherein the first fluoropolymer and the second fluoropolymer are derived from a common monomer.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The multilayer film of claim 1 , wherein the first fluoropolymer exhibits melt-phase tensile force that is at least about 50% greater than melt-phase tensile force exhibited by the second fluoropolymer in the melt phase at a draw ratio.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The multilayer film of claim 3 , wherein the draw ratio is between about 10:1 and about 30:1.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The multilayer film of claim 3 , wherein the draw ratio is between about 10:1 and about 15:1.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The multilayer film of claim 1 , wherein the second polymer layer comprises no more than about 30% by volume of the multilayer film.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The multilayer film of claim 1 , wherein the first fluoropolymer comprises at least about 60% by weight of the second polymer layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The multilayer film of claim 1 , wherein the second fluoropolymer comprises no more than about 40% by weight of the second polymer layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The multilayer film of claim 1 , wherein the first fluoropolymer comprises PVDF.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The multilayer film of claim 1 , wherein the second fluoropolymer comprises PVDF.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The multilayer film of claim 1 , wherein the third polymer layer comprises PVDF.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The multilayer film of claim 1 , wherein the fluoropolymer of the first and third polymer layers comprises PVDF.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The multilayer film of claim 1 , wherein the multilayer film is adapted to be drawn at a linespeed of at least about 50 ft/min.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The multilayer film of claim 13 , wherein the film thickness of the multilayer film varies no more than about 5%.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The multilayer film of claim 1 , wherein the first average molecular weight is at least about 50% greater than the second average molecular weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The multilayer film of claim 15 , wherein the first average molecular weight is at least about 60% greater than the second average molecular weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The multilayer film of claim 1 , further comprising a fourth polymer layer comprising the blend of the first fluoropolymer and the second fluoropolymer.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The multilayer film of claim 17 , further comprising a fifth polymer layer forming a second outer surface of the multilayer film.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The multilayer film of claim 18 , wherein the fifth polymer layer comprises an acrylic.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The multilayer film of claim 18 , wherein the fifth polymer layer comprises fluoropolymer.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The multilayer film of claim 20 , wherein the fifth polymer layer consists of fluoropolymer.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. A multilayer polymeric film comprising:",
            "components": [
                {
                    "component": "a first polymer layer comprising a first fluoropolymer having a bimodal molecular weight distribution, wherein a higher molecular weight peak in the bimodal molecular weight distribution is located at a molecular weight at least about 25% greater than the molecular weight at which a lower molecular weight peak of the bimodal molecular weight distribution is located;",
                    "subcomponents": []
                },
                {
                    "component": "a second polymer layer forming an interior layer of the multilayer polymeric film and comprising greater than about 40% by weight of a second fluoropolymer and not greater than 40% by weight acrylic; and",
                    "subcomponents": []
                },
                {
                    "component": "a third polymer layer forming an exterior surface of the multilayer polymer film consisting of the second fluoropolymer.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The multilayer film of claim 22 , wherein the first polymer layer has a melt-phase tensile strength at least about 50% greater than the melt-phase tensile strength of the second layer at the same draw ratio.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The multilayer film of claim 23 , wherein the draw ratio is between about 10:1 and about 30:1.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The multilayer film of claim 23 , wherein the draw ratio is between about 10:1 and about 15:1.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The multilayer film of claim 22 , wherein the first fluoropolymer comprises PVDF.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The multilayer film of claim 22 , wherein the second polymer layer comprises at least about 40% by volume of the multilayer film.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The multilayer film of claim 22 , wherein the higher molecular weight peak in the bimodal molecular weight distribution is located at a molecular weight at least about 50% greater than the molecular weight at which the lower molecular weight peak of the bimodal molecular weight distribution is located.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The multilayer film of claim 22 , wherein the second polymer layer comprises at least about 60% fluoropolymer.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The multilayer film of claim 29 , wherein the second polymer layer comprises acrylic.",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The multilayer film of claim 22 , wherein the multilayer film is adapted to be drawn at a linespeed of at least about 50 ft/min.",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. The multilayer film of claim 31 , wherein the film thickness of the multilayer film varies no more than about 5%.",
            "components": []
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. The multilayer film of claim 22 , further comprising a fourth layer comprising the first fluoropolymer.",
            "components": []
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The multilayer film of claim 33 , further comprising a fifth layer forming an exterior surface of the multilayer film.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. The multilayer film of claim 34 , wherein the fifth layer comprises acrylic polymer.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. The multilayer film of claim 34 , wherein the fifth layer comprises the second fluoropolymer.",
            "components": []
        },
        {
            "claim_number": "CLM-00037",
            "preamble": "37. A multilayer film comprising;",
            "components": [
                {
                    "component": "a first polymeric layer forming a first exterior surface;",
                    "subcomponents": []
                },
                {
                    "component": "a second polymeric layer underlying the first polymeric layer and comprising a first fluoropolymer having a first average molecular weight and a second fluoropolymer having a second average molecular weight, the first average molecular weight being at least about 25% greater than the second average molecular weight;",
                    "subcomponents": []
                },
                {
                    "component": "a third polymeric layer in direct contact with a major surface of the second polymeric layer, the third polymeric layer comprising greater than about 40% by weight fluoropolymer and not greater than about 40% by weight acrylic polymer;",
                    "subcomponents": []
                },
                {
                    "component": "a fourth polymeric layer in direct contact with a major surface of the third polymeric layer, fourth polymeric layer comprising the first and second fluoropolymers; and",
                    "subcomponents": []
                },
                {
                    "component": "a fifth polymeric layer forming a second exterior surface of the multilayer film;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the multilayer film is drawn at a linespeed of at least about 50 ft/min and the thickness of the multilayer film has a variance of no more than about 5%.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00038",
            "preamble": "38. The multilayer film of claim 37 , wherein the variance is no more than about 3%.",
            "components": []
        },
        {
            "claim_number": "CLM-00039",
            "preamble": "39. The multilayer film of claim 37 , wherein the first fluoropolymer and the second fluoropolymer are derived from a common monomer.",
            "components": []
        },
        {
            "claim_number": "CLM-00040",
            "preamble": "40. The multilayer film of claim 37 , wherein the first fluoropolymer is PVDF.",
            "components": []
        },
        {
            "claim_number": "CLM-00041",
            "preamble": "41. The multilayer film of claim 37 , wherein the second polymeric layer and the fourth polymeric layer comprise no more than about 30% by volume of the multilayer film.",
            "components": []
        },
        {
            "claim_number": "CLM-00042",
            "preamble": "42. The multilayer film of claim 37 , wherein the first average molecular weight is at least about 50% greater than the second average molecular weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00043",
            "preamble": "43. The multilayer film of claim 37 , wherein the second polymeric layer has a melt-phase tensile strength at least about 50% greater than the melt-phase tensile strength of the third polymeric layer at the same draw ratio.",
            "components": []
        }
    ],
    "description": [
        "The present application is a continuation-in-part and claims priority from U.S. Utility patent application Ser. No. 10/783,946, filed Feb. 20, 2004, now abandoned entitled “DRAW RESONANT RESISTANT MULTILAYER FILMS,” naming inventors Kevin G. Hetzler, Viktor Skatchkov, and Xixian Zhou, which application is incorporated by reference herein in its entirety.",
        "This disclosure, in general, relates to draw resonant resistant multilayer films, methods for manufacturing same and articles including same.",
        "Increasingly, manufacturers are turning to polymers to create surfaces that are resistant to chemical and environmental damage. For example, fluorinated polymers exhibit a resistance to damage caused by exposure to chemicals, such as methyl ethyl ketone (MEK), a resistance to stains, and a resistance to damage caused by exposure to environmental conditions. Such polymers have been used in applications such as airplane and train cargo hold liners, vinyl siding surface treatments, and photovoltaic protective coverings.",
        "However, processing of such films for use in these applications is difficult. Line speed in production is often limited by the appearance of draw resonance at relatively low line speeds, such as below 50 feet per minute. These processing limitations increase costs and reduce the availability of these beneficial films. As such, robust multilayer films having preferred mechanical and processing properties are generally desirable in the art.",
        "In one particular embodiment, the disclosure is directed to a multilayer film comprising a first polymer layer and a second polymer layer. The first polymer layer comprises a blend of a first fluoropolymer having a first average molecular weight and a second fluoropolymer having a second average molecular weight. The first average molecular weight is greater than the second average molecular weight.",
        "In a further embodiment, the disclosure is directed to a multilayer polymeric film comprising a first polymer layer and a second polymer layer. The first polymer layer comprises a fluoropolymer having a bimodal molecular weight distribution.",
        "In another embodiment, the disclosure is directed to a multilayer film comprising a polymeric layer including a first fluoropolymer having a first average molecular weight and a second fluoropolymer having a second average molecular weight. The first average molecular weight is greater than the second average molecular weight. The multilayer film is adapted to be drawn at a linespeed of at least about 50 ft/min with a thickness variance no more than about 5%.",
        "In a further embodiment, the disclosure is directed to a method of manufacturing a multilayer film. The method includes extruding a first polymer layer and extruding a second polymer layer. The first polymer layer comprises a blend of a first fluoropolymer having a first average molecular weight and a second fluoropolymer having a second average molecular weight. The first average molecular weight is greater than the second average molecular weight.",
        "Further aspects of the disclosure are found in a multilayer polymeric film comprising a first polymer layer and a second polymer layer. The first polymer layer comprises a fluoropolymer having a bimodal molecular weight distribution of molecules and the first polymer layer has a melt phase tensile strength at least about 50% greater than the melt phase tensile strength of the second layer.",
        "The present disclosure may be better understood, and its numerous objects, features, and advantages made apparent to those skilled in the art by referencing the accompanying drawings.",
        "FIGS. 1, 2 and 3 depict exemplary embodiments of multilayer films.",
        "FIG. 4 depicts extensional velocity data for exemplary film components.",
        "The use of the same reference symbols in different drawings indicates similar or identical items.",
        "In a particular embodiment, the disclosure is directed to a multilayer film typically including a layer having properties useful for the processing of the multilayer film and a layer having properties that provide mechanical properties in the resulting multilayer film. The multilayer film may further include a layer that provides desirable surface properties. These surface properties may include chemical resistance or adhesiveness. In one exemplary application, the multilayer film may be used in fluoropolymer processing.",
        "FIG. 1 depicts an exemplary multilayer film. The exemplary film 100 has two layers, 102 and 104. Layer 102 includes a polymer or polymer blend that provides processing characteristics and desired processing behaviors. Layer 104 includes a polymer or polymer blend that provides desired mechanical properties and behaviors exhibited in the resulting multilayer film.",
        "Layer 102 includes a polymer or polymer blend that exhibits desirable processing properties or behaviors in a melt phase. In one exemplary embodiment, the polymer or polymer blend may exhibit melt strain hardening behavior at a given draw ratio or within a given draw ratio domain. In another exemplary embodiment, a polymer or polymer blend may exhibit a higher melt-phase tensile force for a given draw ratio. In one particular embodiment, the polymer of layer 102 may include a melt stain hardening acrylic. In another exemplary embodiment, the polymer or polymer blend may include a polymer having a relatively high molecular weight distribution and exhibiting a relatively high melt-phase tensile force.",
        "Layer 102 may comprise a polymer component exhibiting melt strain hardening at processing conditions. Melt strain hardening is exhibited when the melt-phase tensile force smoothed slope relative to a draw ratio domain is significantly positive for a polymeric component. In one exemplary embodiment, the melt strain hardening component is a non-polyolefin polymer that exhibits melt strain hardening at draw ratios greater than 10:1. In another exemplary embodiment, the melt strain hardening component is a non-polyolefin polymer component exhibiting a melt-phase tensile force smoothed slope in the melt phase of greater than about 0.03 cN between the draw ratios of between 0 and greater than 30:1. For example, the melt-phase tensile force to draw ratio slope may be greater than about 0.04 cN in the draw ratio domain between about 10:1 to about 20:1 or about 10:1 to about 15:1. In another embodiment, the melt strain hardening component may exhibit increasing smoothed melt-phase tensile force in the draw ratio domain between about 5:1 and about 30:1, such as between about 10:1 and about 15:1 or between about 20:1 and about 30:1. In a further exemplary embodiment, the melt strain hardening polymer exhibits melt strain hardening in which the polymer exhibits a positive ratio of change in melt-phase tensile force to change in draw ratio in the draw ratio domain of between a first draw ratio and a second draw ratio, wherein the damage resistant polymer may exhibit a melt plateau in the same domain. According to a particular embodiment, the melt strain hardening polymer exhibits a melt-phase tensile force to draw ratio slope of greater than about 0.03 cN in the desired draw ratio domain. For example, the melt strain-hardening polymer may exhibit a slope of not less than about 0.03 cN over a specific draw ratio domain, such as not less than about 0.4 cN or not less than about 0.5 cN over a specific draw ratio domain. In contrast, a mechanical property or surface property polymer may exhibit a small slope or generally flat slope of less than about 0.03 cN, such as less than about 0.005 cN or substantially zero cN over the specific draw ratio domain. In a further exemplary embodiment, the melt strain hardening polymer exhibits a positive ratio change in melt-phase tensile force to change in draw ratio in the draw ratio domain of about 10:1 and about 15:1 during processing at about 230° C. The damage resistant polymer exhibits a generally flat slope in the same draw ratio domain under the same processing conditions. In a further exemplary embodiment, the melt strain hardening component may exhibit a greater melt-phase tensile force to draw ratio slope than the mechanical or surface components over a draw ratio domain, such as at least about 30%, at least about 50%, at least about 80%, at least about 100%, or at least about 300% greater slope.",
        "The processing property polymer may exhibit a higher melt-phase tensile force than the polymers of the mechanical layer 104 in a given draw ratio domain or at a given draw ratio. For example, an exemplary polymer or polymer blend may exhibit a melt-phase tensile force that is greater than the melt-phase tensile force exhibited by the polymer component of the mechanical layer 104 at a given draw ratio. In one exemplary embodiment, the higher melt-phase tensile force component exhibits a melt-phase tensile force that is at least about 50% greater than that of the mechanical property component in the draw ratio domain of 10:1 to 30:1. For example, a melt-phase tensile force exhibited by the melt properties polymer is at least about 66% higher than the melt-phase tensile force exhibited by the mechanical properties polymer in the range of draw ratios between about 10:1 and 20:1, or between about 10:1 and 15:1. For example, the melt-phase tensile force may be at least about 70% higher, at least about 90% higher, at least about 100% higher, or at least about 133% higher.",
        "The melt strain hardening or higher melt-phase tensile force polymer may, for example, be a non-polyolefin polymer such as acrylic and not polyethylene or polypropylene. In one exemplary embodiment, the non-polyolefin polymer may be a branched polymer. In another exemplary embodiment, the non-polyolefin polymer may be a linear polymer. An acrylic polymer may be formed from a monomer having an alkyl group having from 1-4 carbon atoms, a glycidyl group or a hydroxyalkyl group having from 1-4 carbon atoms. Representative acrylic polymers include polymethyl methacrylate, polyethyl methacrylate, polybutyl methacrylate, polyglycidyl methacrylate, polyhydroxyethyl methacrylate, polymethyl acrylate, polyethyl acrylate, polybutyl acrylate, polyglycidyl acrylate, polyhydroxyethyl acrylate and mixtures thereof.",
        "The acrylic polymer may, for example, be an impact grade or impact modified acrylic. Impact-modified acrylic polymers generally comprise a copolymer of monomers of acrylic monomers with an effective amount of suitable comonomer or graft moiety to produce the desired elastic modulus and impact resistance. An acrylic elastomer, sometimes referred to as acrylate rubber, polyacrylate rubber, polyacrylic elastomer or “ACM” and which is a composition based on a mixture of a polyacrylate and polymethacrylate, a polyacrylate and ethylene methacrylate copolymer (“EMAC”) (such as Chevron Chemicals EMAC 2260), or a polyacrylate and ethylene butylacrylate (“EBAC”) can be used. Alternatively, a thermoplastic impact-modified acrylic polymer can be a blend of a clear glassy acrylic polymer, such as a plastic copolymer of ethylene and a carboxylic acid compound selected from acrylic acid, methacrylic acid and mixtures thereof, with elastomeric components, for example.",
        "In one embodiment, the impact-modified acrylic polymer generally includes fine particles of the elastomer dispersed uniformly in the plastic copolymer. The impact grade acrylic may comprise transparent toughened thermoplastic blends prepared by blending 10 to 99 weight percent of a block copolymer; 0.1 to 1 weight percent of particulate rubber having a particle size from 0.1 to 10 microns; and the balance a clear glassy polymer. Another suitable technique for making impact-modified acrylic polymer employs the use of a so-called “core/shell” product, such as Atofina DR-101 resin. These generally are polymer particles that have a central core of one polymer surrounded by a shell of another polymer. The core can be either the plastic or elastomer component and the shell will be the opposite, i.e., elastomer or plastic component. The core/shell particles are fed to a melt mixing apparatus, such as a melt extruder in which the core and shell domains are blended in the melt phase to form a homogeneous blend on a much smaller scale and a film is formed from the extrudate of this homogeneous blend.",
        "In one particular embodiment, the melt strain hardening material may be a linear impact modified acrylic. In a further exemplary embodiment, the melt strain hardening acrylic may be a branched impact modified acrylic. Generally, linear acrylic polymers that are not impact modified, such as those used in adhesive layers, are not suitable. However, an acrylic exemplifying melt strain hardening behavior in the desired draw ratio domain is suitable. In another exemplary embodiment, an acrylic exemplifying higher melt-phase tensile force in the desired draw ratio domain may be suitable.",
        "In further exemplary embodiments, the layer 102 comprises a blend of melt strain hardening polymer and other components. For example, the layer 102 may comprise at least about 70% by weight of the melt strain hardening component, such as, impact grade acrylic. In an exemplary embodiment, the layer may comprise at least about 75%, at least about 80%, at least about 85%, or at least about 90% impact grade acrylic. Layer 102 may also include other components such as the damage resistant polymer. For example, the layer 102 may include no more than about 30% PVDF, PVDF copolymer or blend thereof by weight when the melt strain hardening component includes acrylic. In other exemplary embodiments layer 102 may include no more than about 25%, no more than about 20%, no more than about 15%, or no more than about 10% PVDF by weight. In one embodiment, layer 104 consists essentially of the melt-strain hardening component.",
        "In another exemplary embodiment, the melt strain hardening components or higher melt-phase tensile force component may include a higher average molecular weight polymer. For example, in fluoropolymer applications, layer 102 may include a blend of fluoropolymers that includes a low to medium average molecular weight fluoropolymer and a high average molecular weight fluoropolymer that exhibits melt strain hardening and higher melt-phase tensile force at a given draw ratio. In one particular embodiment, the lower average molecular weight polymer may include PVDF having a weight average molecular weight not greater than about 200 kg/mol, such as not greater than about 190 kg/mol or not greater than about 180 kg/mole. The higher average molecular weight polymer may include PVDF having a molecular weight at least about 200 kg/mole, such as at least about 250 kg/mole, at least about 285 kg/mole, or at least about 365 kg/mole. In alternative embodiments, the average molecular weight may be determined using number average molecular weight and z-average molecular weight methods. The higher average molecular weight polymer may have a molecular weight distribution that peaks at a molecular weight at least about 25% higher than the peak of the molecular weight distribution of the lower average molecular weight polymer. For example, the higher average molecular weight polymer distribution peak may be at least about 50%, at least about 60%, at least about 80% or at least about 90% higher than the peak of the lower average molecular weight polymer distribution. In an exemplary embodiment in which the fluoropolymers are derived from the same monomer, the resulting blend produces a bimodal molecular weight distribution of polymer molecules.",
        "Exemplary fluoropolymers include fluorine substituted olefin polymers and polymers comprising at least one monomer selected from the group consisting of vinylidene fluoride, vinylfluoride, tetrafluoroethylene, hexafluoropropylene, trifluoroethylene, chlorotrifluoroethylele, ethylene-chlorotrifluoroethylene, and mixtures of such fluoropolymers. The fluoropolymer polymers include polyvinylidene fluoride (PVDF) and PVDF copolymers, such as vinylidene fluoride/hexafluoropropylene copolymer. Many fluoropolymers are commercially available from suppliers in various grades. For example suppliers can supply multiple resins having nominally the same composition but different properties, such as different molecular weights to provide specific viscosity characteristics. Exemplary PVDF polymers include PVDF 1010 and PVDF 21510 by Solvay Solexis. Other examples include Kynar 720, Kynar 740, and Kynar 760 by Atofina. Kynar 760 has a higher average molecular weight than Kynar 720 and Kynar 740. It is contemplated that the polymer component of the layer 102 may include a melt blend of multiple fluoropolymers in place of one such polymer. Alloys of PVDF homopolymer and PVDF copolymer may provide the film with improved elastic modulus and gloss reduction. In one exemplary embodiment, the polymer may consist essentially of fluorinated polymer.",
        "In one particular embodiment, layer 102 includes a blend of the higher average molecular weight polymer and the low or moderate average molecular weight polymer. In a particular embodiment, the blend includes at least about 60% by weight of the high average molecular weight polymer. For example, the blend may include at least about 70%, at least about 75%, at least about 80%, at least about 85%, at least about 90%, or as high as 100% by weight of the high average molecular weight polymer. In another exemplary embodiment, the polymer blend may include not more than about 40% by weight of the low or moderate average molecular weight polymers. For example, the polymer blend may include not more than about 30%, not more than about 25%, not more than about 20%, not more than about 15% or not more than about 10% of the low or moderate average molecular weight polymer. In one particular embodiment, the high average molecular weight polymer is Kynar 760, the moderate average molecular weight polymer is Kynar 740, and the low average molecular weight polymer is Kynar 720.",
        "In addition, layer 102 may include inorganic fillers, organic fillers, antioxidants, UV additives, flame retardants, antidegradation additives, and adjuvants, among others. For example, layer 102 may include minor but significant fractions of antidegradation additives and adjuvants. The inorganic filler may, for example, include titanium dioxide, zinc oxide, iron oxide, calcium carbonate, carbon black, color pigments and clays.",
        "Layer 104 may include polymers or polymer blends that provide desired mechanical properties and behaviors in the resulting multilayer film. Such mechanical properties may include elongation, flexibility and drape. These properties may, for example, be similar to the properties of fluoropolymer film. In one exemplary embodiment, layer 104 comprises the damage resistant component in a blend of other components, such as a fluorinated polymer. In particular embodiment, layer 104 comprises greater than about 3% by weight of a fluorinated polymer, such as those fluorinated polymers listed above, for example, PVDF, such as Atofina PVDF 1010. Layer 104 may also include additional polymers, such as acrylics, such as either impact modified or non-impact modified acrylics. In one exemplary embodiment, layer 104 includes the melt strain-hardening component such as impact grade acrylic or the higher average molecular weight polymer in amounts no more than about 40% by weight of the layer, such as no more than about 30%, no more than about 25%, no more than about 20%, or no more than about 15% by weight. In addition, layer 104 may include inorganic fillers, organic fillers, antioxidants, UV additives, flame retardants, antidegradation additives, and adjuvants, among others. For example, layer 104 may include minor but significant fractions of antidegradation additives and adjuvants. The inorganic filler may, for example, include titanium dioxide, zinc oxide, iron oxide, calcium carbonate, carbon black, color pigments and clays. In one exemplary embodiment, layer 104 comprises greater than about 40% by weight PVDF, no more than about 50% impact grade acrylic, an inorganic filler, and antidegradation additive. For example, layer 104 comprises at least about 50%, at least about 60%, at least about 70%, or at least about 80% by weight PVDF.",
        "In one exemplary embodiment, layer 102 comprises no more that about 40% by volume of the multilayer film. For example, layer 102 may comprise not more than about 30% by volume, not more about 25% by volume, not more about 20% by volume, not more about 15% by volume, not more about 10% by volume, not more about 5% by volume or less of the multilayer film. In another exemplary embodiment, layer 104 may comprise at least about 40% by volume of the multilayer film. For example, layer 104 may comprise at least about 60% by volume, at least about 70% by volume, at least about 75% by volume, at least about 80% by volume, or at least about 90% by volume of the multilayer film.",
        "The multilayer film 100, may be formed with two or more layers. For example, the multilayer film 100 may be a three layer, four layer, or five layer film. In an alternate embodiment, a polymer may be selected such that a lower molecular weight polymer provides the mechanical properties and a higher molecular weight polymer provides the melt phase processing properties. In this particular embodiment, the bimodal molecular weight distribution of molecules formed from a common monomer provide for the processing properties and the mechanical properties. In this particular case, a single layer film may be formed that includes a polymer with a bimodal molecular weight distribution.",
        "FIG. 2 depicts an alternative embodiment including a three layer film 200. Layer 202 may provide surface properties to the multilayer film. Layer 204 may provide processing properties and behaviors in the melt phase and layer 206 may provide mechanical properties and behaviors in the resulting multilayer film.",
        "Layer 202 may include polymers or polymer blends that exhibit desired surface behaviors. For example, layer 202 may be formed of a chemical resistive polymer such as a fluoropolymer. In an alternate embodiment, layer 202 may be formed of an adhesive polymer such as an acrylic. Layer 204 may provide the desired processing properties and behaviors in the melt phase and may include polymers or polymer blends that exhibit the desired processing behaviors. For example, layer 204 may include melt strain hardening polymers or higher melt-phase tensile force polymers that exhibit desired processing behaviors within specified draw ratio domains or at specific draw ratios. In one exemplary embodiment, layer 204 may include acrylic or acrylic blends. In another exemplary embodiment, layer 204 may include a high average molecular weight polymer or a bimodal molecular weight distribution of molecules formed from a common monomer. Layer 206 may include a polymer or polymer blend that exhibits desired mechanical properties or behaviors in a resulting multilayer film. In one exemplary embodiment, layer 206 includes a fluoropolymer/acrylic blend. In an alternate embodiment, layer 204 and layer 206 may be interchanged.",
        "In an exemplary embodiment, layer 202 may form not more that about 30% by volume of the multilayer film. For example, layer 202 may comprise not more than about 20% by volume, not more than about 10% by volume, or not more than about 5% by volume of the multilayer film. In an embodiment, layer 204 may comprise not more than about 30% by volume of the multilayer film. For example, layer 204 may comprise not more than about 20% by volume, not more than about 10% by volume, or not more than about 5% by volume of the multilayer film. In a further exemplary embodiment, layer 206 may comprise at least about 40% by volume of the multilayer films. For example, layer 206 may comprise at least about 60% by volume, at least about 80% by volume, or at least about 90% by volume of the multilayer film.",
        "FIG. 3 depicts a further exemplary embodiment of a multilayer film. In this exemplary embodiment, the multilayer film 300 includes at least five layers. Layers 302 and 310 may provide surface qualities to the multilayer film. For example, layers 302 and 310 may include a chemically resistive polymer, such as a fluoropolymer. In an alternate embodiment, layers 302 and 310 may include an adhesive, such as an acrylic. In a further embodiment, layer 302 and 310 may exhibit differing behaviors. For example, layer 302 may exhibit chemical resistance and layer 310 may exhibit adhesive behaviors.",
        "In one exemplary embodiment, layers 304 and 308 may exhibit desired processing properties and behaviors in the melt phase. For example, layers 304 and 308 may include polymers that exhibit melt strain hardening and/or higher melt-phase tensile force in a given draw ratio domain. For example, layers 304 and 308 may include a melt strain hardening acrylic or a blend of polymers that includes a high average molecular weight polymer or exhibits higher melt-phase tensile force.",
        "Layer 306 may, for example, include polymers or polymer blends that exhibit desired mechanical properties or behaviors in a resulting multilayer film. For example, layer 306 may include a fluoropolymer or a blend of fluoropolymer and acrylic. In an alternate embodiment, the layer 306 may be divided and distributed as layers 304 and 308, and layers 304 and 308 may be combined as layer 306.",
        "In one embodiment, layers 302 and 310 formed of a damage resistant polymer component, together comprise not more than about 30% by volume of the multilayer film. For example, each layer 302 and 310 may comprise not more than about 10% by volume, or not more than about 5% by volume of the multilayer film. Layers 304 and 308 formed of the melt strain hardening component or higher melt-phase tensile force component, together may comprise not more than about 40% by volume of the multilayer film. For example, layers 304 and 308 may form not more than about 10% by volume each, or not more than 5% by volume each of the multilayer film. Layer 306, formed of a component having desirable mechanical properties, may comprise at least about 40% by volume of the multilayer film. For example, layer 306 may form at least about 60% of the multilayer film, or even at least about 80% of the multilayer film. In an alternate example, in which layer 306 is split into multiple layers, the combined layers provide at least about 40% by volume of the multilayer film.",
        "In one exemplary embodiment, the film structure may be A/C/B/C/A where each letter represents a different material extruded from a unique extruder. Layer A may, for example, be a 100% Solvay Solexis PVDF 1010 and may form about 10% by volume of the multilayer film. Layer B may be a PVDF/acrylic blend comprising at least about 60% by weight PVDF homopolymer and/or copolymer and not more than about 40% acrylic by weight. Layer B may form approximately 40% by volume of the multilayer film. Layers C may be formed of Atofina impact grade acrylic DR101, each of the C layers making up about 5% by volume of the multilayer film. Alternately, the C layers may be formed of a blend of a higher average molecular weight, high melt-phase tensile force component and a lower average molecular weight component, such as a blend of PVDF polymers.",
        "In another exemplary embodiment, the film structure may be A/C/B/C/D where each letter represents a different material extruded from a unique extruder. Layer A may, for example, be a 100% PVDF 1010 and may form about 10% by volume of the multilayer film. Layer B may be a PVDF/acrylic blend comprising greater than about 60% by weight PVDF and not more than about 40% acrylic by weight. Layer B may form approximately 40% by volume of the multilayer film. Layers C may be formed of Atofina impact grade acrylic DR101, each of the C layers making up about 5% by volume of the multilayer film. Alternately, the C layers may be formed of a blend of a higher average molecular weight, high melt-phase tensile force component and a lower average molecular weight component, such as a blend of PVDF polymers. Layer D may form approximately 30% by volume of the multilayer film. Layer D may comprise similar materials to Layer B. However, Layer D may be enhanced for custom properties, such as having a lower melting temperature (e.g. more acrylic) for heat sealing. Layer B may also be used exclusively for the addition of recycle and trim.",
        "In another exemplary embodiment, the film structure may be A/C/B/C/B. Layer A may be a 100% PVDF 1010 and may comprise about 10% by volume of the multilayer film. Layers B may comprise a PVDF/acrylic blend comprising greater than about 55% PVDF and no more than about 45% acrylic by weight. The B layers may, in combination, comprise about 70% by volume of the multilayer film. In one exemplary embodiment, the outside B layer may comprise between about 20% to 35% of the total film volume. The C layers may be an Atofina impact grade acrylic DR101. Alternately, the C layers may be formed of a blend of a high average molecular weight, high melt-phase tensile force component and a lower average molecular weight component, such as a blend of PVDF polymers. Each of the C layers may comprise about 5% by volume of the total film volume.",
        "In a further exemplary embodiment, the film structure may be A/B/C wherein layer A is 100% Solvay Solexis PVDF 1010 or Atofina Kynar 740, comprising about 5-10% by volume of the film. Layer B is a PVDF and acrylic blend comprising about 30-80 wt % PVDF, such as about 60 wt % PVDF, and about 40 wt % acrylic. Layer B comprises about 80-90% by volume of the film. Layer C is a PVDF and acrylic blend comprising about 55-100 wt % acrylic, such as about 60-70 wt % acrylic and about 30-40 wt % PVDF. Layer C comprises about 5-10% by volume of the film.",
        "Another exemplary structure may be an A/B or an A/B/A structure. For example, layer A may include a melt strain hardening polymer and fluorinated polymer, such as a PVDF/acrylic blend having 70% impact modified or melt strain hardening acrylic, and layer B may include a polymer blend of PVDF and acrylic polymers including at least about 70% PVDF. In another example, layer A includes a non-melt strain hardening fluoropolymer and layer B includes a blend of PVDF and acrylic including at least about 70% melt strain hardening polymer or bimodal molecular weight fluoropolymer.",
        "Another exemplary structure may be C/B/C in which layer C is a PVDF and acrylic blend comprising about 55-100 wt % acrylic, such as about 60-70% acrylic and about 30-40 wt % PVDF. Layer B is a PVDF and acrylic blend comprising about 30-80 wt % PVDF, such as about 60 wt % PVDF and about 40 wt % acrylic. Layer C comprises about 5-10% by volume and layer B comprises about 80-90% by volume of the film.",
        "A further exemplary embodiment includes at least 3 layers extruded via 3 extruders. A first layer includes a fluoropolymer. A second layer includes a melt strain hardening component and a third layer is an adhesive layer comprising greater than about 55 wt % acrylic, such as greater than about 70 wt % acrylic.",
        "Another exemplary embodiment includes at least 4 layers, such as 5 layers. Layer 1 includes a fluoropolymer. Layer 2 includes a melt strain hardening component or higher melt-phase tensile force component. Layer 3 includes between about 20 wt % and 80 wt % acrylic and between about 20 wt % and 80 wt % fluoropolymer. An optional layer 4 includes the melt strain hardening component or higher melt-phase tensile force component. Layer 5 is an adhesive layer. The 5-layer structure may be formed using 4 extruders.",
        "An alternate exemplary embodiment includes at least 4 layers, such as 5 layers. Layer 1 is an adhesive layer. Layer 2 includes a melt strain hardening component or higher melt-phase tensile force component. Layer 3 includes between about 20 wt % and 80 wt % acrylic and between about 20 wt % and 80 wt % fluoropolymer. An optional layer 4 includes the melt strain hardening component or higher melt-phase tensile force component. Layer 5 is an adhesive layer. The 5-layer structure may be formed using 4 extruders.",
        "In a further exemplary embodiment, a film includes a fluoropolymer blend having a bimodal molecular weight distribution of molecules derived from a common monomer. For example, the common monomer may be a fluorinated monomer, such as PVDF. The blend may be formed through mixing polymers having different average molecular weights.",
        "In another exemplary embodiment, a multilayer film may include a layer structure A/B/C/B/A. Layer A may be a surface properties layer, such as a PVDF layer or an acrylic layer. Layer B may include a polymer or polymer blend having a bimodal molecular weight distribution of molecules formed from a common monomer or a blend of two polymers, such as fluoropolymers having differing average molecular weight. Layer C may be formed with a PVDF/acrylic blend. Layers A may comprise no more than about 10% of the multilayer film each or no more than about 20% of the multilayer film in combination. Layers B may form no more than about 10% by volume of the multilayer film individually or in combination no more than about 20% by volume of the multilayer film. Layer C may comprise at least about 60% by volume of the multilayer film. In an alternate embodiment, layers B may be combined to form layer C and layer C may be divided to replace layers B.",
        "In a further exemplary embodiment, a two-layer film may include a first layer having a blend of high average molecular weight polymer and a low or moderate average molecular weight polymer. The blend may include greater than 60% by weight of the high average molecular weight polymer. In one particular embodiment, a 30/70 blend by weight of Kynar 720 and Kynar 760, respectively, may be used. The first layer may comprise no more than about 20% by volume of the multilayer film. The second layer may be formed of a fluoropolymer or fluoropolymer/acrylic blend and comprise at least about 80% by volume of the multilayer film.",
        "Such multilayer films may be manufactured by co-extruding the foregoing embodiments. In particular embodiments, the co-extruded film may be drawn at linespeeds of at least about 50 ft/min, such as at least about 60 ft/min or at least about 100 ft/min. The resulting multilayer film has a thickness variance of not more than about 5%, such as not more than about 4%, not more than about 3%, not more than about 2%, or not more than about 1%, and is substantially free of draw resonance. For example, the thickness may statistically vary from the average thickness by not more than about 5% of the average thickness.",
        "Melt-phase tensile force may be measured using a Geottfert Rheo-Tens apparatus. In one example, the parameters of the Georttfert Rheo-Tens apparatus include a wheel position approximately 110 mm below the die, piston speed of 0.06 mm/s, ambient wheel temperature, 12 mm barrel diameter, 180° die entry angle, 1 mm die inner diameter, 20 mm die length, 6 min dwell time, and a barrel temperature of 230° C. The take off unit may have a wheel gap of approximately 4 mm.",
        "FIG. 4 depicts the melt-phase tensile force of exemplary polymers and polymer blends over a draw ratio domain. An impact modified acrylic by Atofina (DR101) exhibits melt strain hardening in a desired range between draw ratios 10:1 and 20:1. Similarly, a high molecular weight PVDF such as Kynar 760 by Atofina exhibits melt strain hardening in the same draw ratio domain. Both of these polymers exhibit higher melt-phase tensile force than a PVDF polymer by Solvay Solexis (PVDF 1010). In addition, the graph shown in FIG. 4 depicts the melt-phase tensile force behavior of blends of the higher molecular weight Atofina Kynar 760 with a lower molecular weight Atofina Kynar 720. The blend results in a polymer blend having a bimodal molecular weight distribution of molecules formed from a common monomer such as, in this case, PVDF. Blends are depicted having ratios by weight of Kynar 720 and Kynar 760. As the quantity of Kynar 760 decreases. The exhibited melt-phase tensile force in the given draw ratio domain decreases. For example, a 20/80 blend of Kynar 720 and Kynar 760, respectively, exhibits a higher melt-phase tensile force than the 30/70 blend and the 30/70 blend exhibits a higher melt-phase tensile force than a 40/60 blend. Medium average molecular weight PVDF, Kynar 740, and lower molecular weight PVDF Kynar 720, are shown on the graph for comparison. A mechanical properties layer in the resulting film may, for example, be formed using the Solvay Solexis PVDF 1010 or a blend of the Solvay Solexis PVDF 1010 with acrylics, including linear non-impact modified acrylics. A processing layer may be formed utilizing the Atofina DR101 impact modified acrylic, a blend of the Atofina impact modified acrylic DR101 and PVDF such as a PVDF 1010 or the Kynar PVDF 720, or a blend of the Kynar 720 and Kynar 760 such as, for example, a 20/80 blend or a 30/70 blend.",
        "The above disclosed subject matter is to be considered illustrative, and not restrictive, and the appended claims are intended to cover all such modifications, enhancements, and other embodiments, which fall within the scope of the present invention. Thus, to the maximum extent allowed by law, the scope of the present invention is to be determined by the broadest permissible interpretation of the following claims and their equivalents, and shall not be restricted or limited by the foregoing detailed description."
    ],
    "citations": [
        "3253060",
        "4076929",
        "4317860",
        "4677017",
        "4743327",
        "4859379",
        "4871506",
        "4879345",
        "4948641",
        "5143761",
        "5242976",
        "5256472",
        "5284710",
        "5322899",
        "5395471",
        "5589028",
        "5756230",
        "6114441",
        "6117508",
        "6127478",
        "6136437",
        "6143415",
        "6284335",
        "6306503",
        "6436495",
        "6436533",
        "6444311",
        "6482522",
        "6524671",
        "6524686",
        "6576342",
        "6583222",
        "6593005",
        "6630047",
        "6635714",
        "6667101",
        "6685793",
        "6699798",
        "6706351",
        "6743865",
        "6753087",
        "6759129",
        "6767948",
        "6780935",
        "6790912",
        "6797781",
        "6811859",
        "6833043",
        "6838520",
        "6849314",
        "6855787",
        "2001/0051256",
        "2002/0040118",
        "2002/0061398",
        "2002/0068175",
        "2002/0074691",
        "2002/0150763",
        "2003/0035971",
        "2003/0041952",
        "2003/0104219",
        "2003/0114595",
        "2003/0145938",
        "2003/0198769",
        "2004/0023037",
        "2004/0054050",
        "2004/0086721",
        "2004/0137252"
    ],
    "us_classification": "428212",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "32",
            "subclass": "B",
            "main_group": "27",
            "subgroup": "08"
        }
    ]
}