{
    "title": "Debris collection container for a planer",
    "abstract": "A debris collection container for a planer comprising a receptacle for storage of debris generated by a planer during its planing action and a connector which connects the receptacle to a planer and through which debris can pass from the a planer to the receptacle during use wherein the receptacle comprises at least one resiliently deformable section which can be held compressed for reduce the size of the receptacle or released to allow deformable section to expand The receptacle comprises a first rigid section, a second rigid section connected to the first rigid section via a third resiliently deformable section wherein the first section can be releasably attached to the second section when the third section is compressed.",
    "inventors": [
        "Thomas"
    ],
    "document_number": "07296603",
    "publication_date": "20071120",
    "assignees": [
        "Black & Decker Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A debris collection container for a planer which employs a stream of air to remove debris generated by the planar, the debris collection container comprising:",
            "components": [
                {
                    "component": "a receptacle for storage of debris generated by the planer, the receptacle defining an aperture and including a first rigid section, a second rigid section, and a deformable section located between and connecting the first rigid section and the second rigid section, the deformable section manipulatable between a compressed condition and an expanded condition; and",
                    "subcomponents": []
                },
                {
                    "component": "a connector located between the planer and the receptacle and defining a path for debris passing from the planer to the receptacle and releasably attachable to the receptacle for sealing the aperture;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the first rigid section is releasably attached to the second rigid section when the deformable section is in a compressed condition and the first rigid section includes a front portion and a rear portion that define a lip and the connector is releasably attachable to the front portion, wherein the lip is between the front portion and the rear portion.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A debris collection container as claimed in claim 1 wherein, when the first rigid section is attached to the second rigid section, the two sections are adjacent to each other.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A debris collection container as claimed in claim 1 wherein the first section includes a loop and the second section includes a catch, and wherein the loop is engageable with the catch to releasably attach the first section to the second section.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A debris collection container as claimed in claim 1 wherein the deformable section includes a spring.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A debris collection container as claimed in claim 4 wherein the spring is a helical spring.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A debris collection container as claimed in claim 4 wherein the receptacle includes a wall and the spring forms a part of the wall of the receptacle.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A debris collection container as claimed in claim 1 wherein the aperture is defined by the first rigid section.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A debris collection container as claimed in claim 1 wherein the size of the aperture is fixed and relatively large.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A debris collection container as claimed in claim 1 wherein the connector is releasably connectable to the receptacle by means for connecting, the means for connecting comprising:",
            "components": [
                {
                    "component": "a first part including two pegs moveable between an inner position and an outer position, and a means for biasing to resiliently bias the pegs to the outer positions;",
                    "subcomponents": []
                },
                {
                    "component": "a second part including a T shaped slot, and the T-shaped slot defining an entrance at the bottom of the T shaped slot; and",
                    "subcomponents": []
                },
                {
                    "component": "wherein one of the first part and the second part is mounted on the receptacle and the other of the first part and the second part is mounted on the connector, and the first part and the second part are connectable to each other by insertion of the pegs into the entrance of the T shaped slot when the pegs are moved to their inner positions, sliding the pegs to top of the T shaped slot and allowing the biasing force of the means for biasing to move the pegs to their outer positions whilst located in the top section of the T shaped slot.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A debris collection container as claimed in claim 1 and further comprising a transparent window located in one of the connector and the receptacle.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A debris collection container as claimed in claim 1 wherein the connector includes a part spherical shaped section connectable to the receptacle, and the part spherical shaped section curves the path of the debris as it passes through the part spherical section.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A debris collection container as claimed in claim 11 wherein the part spherical section curves the path of the debris through ninety degrees.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A planer comprising:",
            "components": [
                {
                    "component": "a planer body;",
                    "subcomponents": []
                },
                {
                    "component": "a cutting drum rotatably mounted in the planer body;",
                    "subcomponents": []
                },
                {
                    "component": "a conduit within the housing for removal of debris generated by the planer and the conduit defining an exhaust aperture; and",
                    "subcomponents": []
                },
                {
                    "component": "a debris collection container including:",
                    "subcomponents": [
                        "a receptacle for storage of debris generated by the planer, the receptacle defining an aperture and including a first rigid section, a second rigid section, and a deformable section located between and connecting the first rigid section and the second rigid section, the deformable section manipulatable between a compressed condition and an expanded condition; and",
                        "a connector connectable between the exhaust aperture and the receptacle and defining a path for debris passing from the exhaust aperture to the receptacle and releasably attachable to the receptacle for sealing the aperture;",
                        "wherein the first rigid section is releasably attached to the second rigid section when the deformable section is in a compressed condition and the first rigid section includes a front portion and a rear portion that define a lip and the connector is releasably attachable to the front portion, wherein the lip is between the front portion and the rear portion."
                    ]
                },
                {
                    "component": "a receptacle for storage of debris generated by the planer, the receptacle defining an aperture and including a first rigid section, a second rigid section, and a deformable section located between and connecting the first rigid section and the second rigid section, the deformable section manipulatable between a compressed condition and an expanded condition; and",
                    "subcomponents": []
                },
                {
                    "component": "a connector connectable between the exhaust aperture and the receptacle and defining a path for debris passing from the exhaust aperture to the receptacle and releasably attachable to the receptacle for sealing the aperture;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the first rigid section is releasably attached to the second rigid section when the deformable section is in a compressed condition and the first rigid section includes a front portion and a rear portion that define a lip and the connector is releasably attachable to the front portion, wherein the lip is between the front portion and the rear portion.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "The present invention relates to a planer and in particular to debris collection containers for a planer and airflow and chip removal in a planer.",
        "Planers comprise a body mounted on a shoe. A rotatable cutting drum is mounted within the body which is rotatingly driven by an electric motor also mounted within the body. An aperture is formed through the shoe through which part of the periphery of the cutting drum extends. Cutting blades are mounted on the drum which, as the drum rotates, periodically pass through the aperture and below the shoe. In use, the shoe is located on a work piece and the drum is rotatingly driven by the motor. When the blades pass through the aperture and move below the shoe, the blades engage with the workpiece and remove a thin slice of the workpiece from the surface of the workpiece, producing shavings or chips. Due to the rotational movement of the drum, the shavings or chips are thrown in a generally forward and upward direction in relation to the planer. One problem is the removal of the shavings or chips from the cutting area of the planer. A second problem is the collection of the shavings or chips for disposal.",
        "In some designs of planer, the chips or shaving are directed using a deflector which directs the shavings or chips side ways from the planer. A fan or impeller mounted on the drive shaft of the motor can be used to generate an airflow which can be used to assist in the removal of the shavings or chips. DE19512262 discloses such a system. However, the problem with existing designs are that they are not efficient at mixing the air flow with the shavings or chips to entrain them for removal.",
        "In order to collect the chips or shavings, a debris collection container is attached to the aperture through which the chips or shavings are ejected from the body of the planer. Existing designs of debris collection containers comprise a metal wire frame which is covered by a cloth bag such as a canvas bag. A tubular connector is attached to the metal wire frame and cloth bag and which can be attached to the ejection aperture so that the chips or shavings can pass through the connector from the planer to the debris collection container. A zipper is sewn into the side of the cloth bag which, when opened forms an aperture through which the shavings or chips can be emptied from the cloth bag. A problem with this design is that the hole formed by the unopened zipper is narrow making emptying the bag difficult. Furthermore, it is difficult for an operator to insert a hand into the bag to assist in the removal of the shavings or chips. The zipper can also scratch the hand of the operator. The shavings or chips can further interfere with the operation of the zipper.",
        "Accordingly there is provided a debris collection container for a planer comprising a receptacle for storage of debris generated by a planer during its planing action and a connector which connects the receptacle to a planer and through which debris can pass from a planer to the receptacle during use wherein the receptacle comprises a first rigid section, connected to the connector, a second rigid section connected to the first rigid section via a third resiliently deformable section wherein the first section can be releasably attached to the second section when the third section is compressed to reduce the size of the receptacle or released to allow deformable section to expand to increase the separation of the first and second sections to enlarge the receptacle.",
        "A number of embodiments of the invention will now be described with reference to the following drawings of which:",
        "FIG. 1 shows a side view of the planer with the deflector removed;",
        "FIG. 2 shows a side view of the planer of FIG. 1 with deflector inserted in the planer;",
        "FIG. 3 shows the design of deflector for use in the planer of FIG. 1;",
        "FIG. 4 shows a lengthwise vertical cross section of the planer of FIG. 1 through the centre of the planer (excluding the motor and handle);",
        "FIG. 5 shows a lengthwise vertical cross section taken through the planer of FIG. 1 at the position indicated by dashed line Z in FIG. 2 (excluding the handle);",
        "FIG. 6 shows a perspective view of the first embodiment of a debris collection container;",
        "FIG. 7 shows an exploded view of the debris collection container of FIG. 6 excluding the cloth bag and circular end piece;",
        "FIG. 8 shows a perspective view of the debris collection container of FIG. 6 with the cap detached from the receptacle;",
        "FIG. 9 shows a side view of the second embodiment of the debris collection container;",
        "FIG. 10 shows a side view of the debris collection container of FIG. 9 with the cap detached;",
        "FIG. 11 shows a sketch of the connection mechanism of the debris collection container of FIG. 9;",
        "FIG. 12 shows a sketch of a top view of the planer of FIG. 1 with a debris collection container of FIG. 9 attached;",
        "FIG. 13 shows a lengthwise vertical cross section of the second embodiment of the planer through the centre of the planer (excluding the motor and handle);",
        "FIG. 14 shows a lengthwise vertical cross section taken through the planer of FIG. 13 (excluding the handle);",
        "FIG. 15 shows a second downward side view of the planer of FIG. 13 with the deflector inserted; and",
        "FIG. 16 shows a lengthwise vertical cross section taken through the third embodiment of the planer (excluding the handle).",
        "A first embodiment of the planer will now be described with reference to FIG. 1 to 5. The planer comprises a body 2 having a handle 4 attached to the top of the body 2. A cutting drum 6 is rotatingly mounted within a recess 50 in the body 2 of the planer. The body 2 of the planer is mounted on a shoe formed from two pieces 8, 10. The rear part 8 is mounted rearwardly of the drum 6. The forward part 10 is mounted forward of the drum 6. An aperture 18 in the shoe is formed by the front 10 and rear sections of the shoe through which part 20 of the periphery of the cutting drum extends. The height of the forward part 10 of the shoe can be adjusted in relation to the body 2 by the rotation of a knob 12 mounted on the front of the body 2 of the planer. The operation of the knob 12 is well known and will not therefore be discussed any further.",
        "Mounted within a cavity 14 of the body 2 of the planer is an electric motor (not shown). The electric motor rotatingly drives the cutting drum 6 via a drive belt (not shown). Cutting blades 16 are mounted within the cutting drum 6 and which cut the workpiece upon which the planer is mounted on the cutting drum rotates. The cutting blades, as the drum rotates, periodically pass through the aperture 18 and below the shoe to cut the workpiece in well known manner. The construction of the electric motor, the cutting drum 6, the cutting blades 16 and the belt drive system are well known in the art and are therefore not discussed any further.",
        "Formed through the full width of the body 2 of the planer is a tubular aperture 24. A deflector 26 which is described in more detail below can be inserted into the aperture 24 from either side. This enables the shavings or chips to be directed to either side of the planer. A plastic cap (not shown) is used to seal up the other aperture.",
        "Referring to FIG. 3, the deflector 26 in accordance with the present invention is shown. The deflector 26 comprises two sections 28, 30. The first outer section 28 is a tube of circular cross-section which, when the deflector 26 is inserted into the aperture 24 of the planer, projects from the body 2 of the planer as shown in FIG. 2. The second section 30 is a curved section. The curved section has a substantially U-shaped cross-section which forms a trough which curves over its length. The sides 32 of the U-shaped curved trough have been flattened as best seen in FIGS. 4 and 5. This results in a ridge 34 along the length of the curved section 30 where the flat surface 32 meets with a curved surface 36 of the U-shaped cross section. The shape of the cross-section of the curved section 30 of the deflector 26 is such that it fits snugly into the aperture 24 in the side wall of the body 2 of the planer in order to hold the deflector securely and prevent it from rotating within the aperture 24. Formed between the two sections 28, 30 is an annular rib 38 which surrounds the circumference of the deflector 26. The outer diameter of the annular rib 38 is greater than the diameter of the aperture 24 and thus prevents the deflector 26 from being inserted too far into the planer. When the deflector 26 is located within the body 2 of the planer, the rib 38 abuts against a side wall of the body 2 of a planer, the tubular section 28 remaining outside of the body. The rib 38 is angled as shown by axis 35 in relation to the longitudinal axis 33 of the tubular section 28 so that it is less than ninety degrees as shown in FIG. 3. This is to allow the tubular section to point upwards when located within the body of the planer. The deflector 26 is formed as a one-piece construction and is made from plastic molded into the appropriate shape.",
        "Mounted on the drive spindles of the motor is a fan (not shown) which generates an airflow. The air is directed into a cavity 40 formed in the body of the planer. The air then passes through a conduit 42 over the top wall 44 which forms the top wall of the aperture 24. The direction of the airflow is indicated by the Arrows W. The airflow is then directed downwardly to an area 46 in the body 2 forward of the wall 48 of the recess 50 in which the drum 6 is mounted. An expulsion aperture 52 is formed in the wall 48 of the recess 50 forward of the cutting drum 6 through which any debris created by the cutting action of the blades 16 would be thrown by the rotating blades 16. The airflow is directed with the body to a point below the expulsion aperture 52 in the wall of the recess and is directed to be blown across the aperture 52 within the body in a direction having an acute angle to the direction of travel of any debris (shown by Arrow T) in order to entrain the debris in the airflow within the body.",
        "The airflow and entrained debris is directed upwardly until it engages with the underside of the curved section 30 of the deflector 26 which is located within the aperture 24 when the planer is in use. The airflow and entrained debris is then directed out of the side of the planer through the tubular section 28 and into a debris collection container.",
        "A second embodiment of the planer will now be described with reference to FIGS. 13 to 15. Where the same features are shown in second embodiment as those in the first, the same reference numbers have been used. The second embodiment is exactly the same as the first embodiment except that the curved section 30 of the deflector forms the lower wall of the conduit 42 through which the airflow is directed over the deflector 26. The aperture has no upper wall within the body 2 of the planer.",
        "When the deflector 26 is located within the aperture 24, the flat side walls 32 of the deflector 26 engage with internal walls 54 of the body and form an air tight seal preventing air which is passing over the deflector 26 from traveling between the flat walls 32 of the deflector and the internal wall 54 of the body ensuring it travels forward and downward to the point 46 below the expulsion aperture 52 for entraining the debris.",
        "Because the deflector 26 is angled downwardly by the angle 35 of the rib 38 being non perpendicular to the longitudinal axis 33 of the deflector, a large cavity is formed above the deflector 26 allowing air to easily pass over the top of the deflector 26. FIG. 15 shows a planer according to the second embodiment. The curve section 30 can be seen through the entrance of the aperture 24.",
        "A third embodiment of the planer will now be described with reference to FIG. 16. Where the same features are shown in second embodiment as those in the first, the same reference numbers have been used. The second embodiment is exactly the same as the first embodiment except that a secondary vent 56 has been added within the body above the area 46 in the body 2 forward of the wall 48 of the recess 50 in which the drum 6 is mounted. The secondary vent 56 directs air into the path of the air with entrained debris at an acute angle approximately at the same height as the top of the expulsion aperture 52 formed in the wall 48 of the recess 52 forward of the cutting drum 6 through which any debris created by the cutting action of the blades 16 would be thrown by the rotating blades 16. It will be appreciated that the vent 56 can be located slightly lower down relative to the adjacent the aperture 52.",
        "FIGS. 6 to 8 show a first embodiment of a debris collection container which can be used with any of the three embodiments of planer previously described. The debris collection container comprises two sections, an end cap section 60 and the receptacle 70. The end cap section 60 is manufactured in a one-piece construction from transparent plastic. The end cap section 60 comprises a tubular connection section 62 which connects to the first tubular section 28 of the deflector 26. The tubular connection section 62 has a circular aperture (not shown) at one end whilst the other end meets with a dome shaped section or part spherical section 64. The dome shaped section 64 comprises a rim 66 which surrounds a large aperture formed in the base of the dome shape section 64. The rim 66 comprises an L-shaped slot 68 which forms part of a bayonet connection system for use in connecting the end cap section 60 to the receptacle 70. Air and entrained debris pass through the aperture in the end of the tubular connection section 62, through the tubular connection section 62 and into the dome shape section 64 before being expelled from the end cap section 60 through the large aperture in the base of the dome 64. The shape of the dome is such that it acts as a deflector, bending the air and entrained debris through ninety degrees so that the air and entrained debris are travelling perpendicular to the direction they were travelling in when they were passing through the tubular connection section 62. By constructing the dome shape section 64 in transparent plastic, the operator of the planer can look into the debris collection container to determine how full container is. Furthermore, as the planer is operating, the operator will be able to see the entrained debris passing through the tubular connection section 62 and pass through the dome section thereby enabling the operator to see that the planer is working correctly.",
        "The receptacle 70 comprises at one end an annular plastic ring 72 which surrounds a large circular aperture which forms of the entrance to the receptacle 70. The annular plastic ring 72 is divided lengthwise into two halves, a front half 74 having a diameter less than that of the in the diameter of the rim 66 of the dome shaped section 64 of the end cap section 60, and a second rear half 76 having a diameter equal to that of the outer diameter of the rim of the dome shape section 64 of the end cap section 60. A lip 78 is formed between the front and rear sections 74, 76 which abuts against the side of the rim of the dome shaped section 64 of the end cap section 60 when the end cap section is connected to the receptacle. Two pins 80 project radially outwardly from the surface of the front half. The pins are used as part of a bayonet connection to connect the end cap section to the receptacle by sliding into the L-shaped slot 68 formed in the rim 66 of the end cap section in connecting receptacle to the end cap section 60 in well known manner.",
        "Located at the other end of the receptacle is a circular end piece 82 formed from plastic. The circular end piece forms a base of the receptacle and can be manufactured from transparent plastic material to enable an operator to view inside the receptacle from the base. The circular end piece 82 has a diameter which is the same as that of the annular plastic ring 72. A helical spring 84 having the same diameter as that of the annular plastic ring 72 and the circular end piece 82 connects between the annular plastic ring 72 and the circular end piece 82 and holds the relative positions of the two parts. A tubular shaped cloth bag 86 connects between the plastic annular ring 72 and the circular end piece 82 and surrounds the helical spring. The spring acts to maintain the shape of the circular receptacle and to keep the circular cloth sheaf in shape.",
        "Formed on the annular plastic ring is a plastic catch 88. Formed on the circular end piece is a U-shaped plastic loop 90 which extends from that the circular end piece 82 towards the annular plastic ring 72. The location of the U-shaped plastic loop 90 results in that when that the helical spring 84 is compressed by moving the circular end piece 82 towards the annular plastic ring 72, the loop 90 engages with and attaches to the plastic catch 88. This is ideal for storage. During use, the U-shaped plastic loop 90 is released from the catch and allows the helical spring 84 to bias the circular end piece 82 away from the annular plastic ring 72 to maximize the volume of space within the receptacle 70. The helical spring maintains the shape of the receptacle the relative positions of the plastic annular is ring 72 and the circular end piece 82. However, due to the resilient nature of the helical spring 84, the structure allows some relative movements between the two enabling flexibility within the receptacle. However, when the receptacle is not in use, the helical spring 84 can be compressed so that the circular end piece 82 is moved towards the annular plastic ring 72 until the U-shaped plastic loop 90 engages with the plastic catch 88 to secure the circular end piece 82 to the annular ring 72 maintaining the helical spring 84 under compression and substantially reducing the volume of the space within the receptacle. This is ideal for storage purposes.",
        "In use, the tubular connection section of the end cap is connected to the deflector 26 on the planer. The receptacle 70 is connected to the end cap section by use of the bayonet connector. The circular end piece 82 is disconnected from the catch 88 on the annular plastic ring 72 to allow the helical spring 84 to bias the circular end piece 82 away from the plastic annular ring 72 generating the shape of the container.",
        "Referring to FIGS. 9 to 11, a second embodiment of the debris collection container is shown. The debris collection container comprises an end cap 100 and a receptacle 102 which is capable of being attached to the end cap 100. The end cap 100 is manufactured in a one-piece construction from transparent plastic. The end cap 100 comprises a tubular connection section 104 which connects to the first outer section 28 of the deflector 26. The tubular connection section 104 has a circular aperture at one end whilst the other end meets with a dome shaped or semi-spherical section 106. The dome shape section 106 is mounted on a rectangular base 108 which comprises a rectangular rim 110 which surrounds a large aperture formed in the base of the dome shape section 106. The rim 110 comprises a T-shaped slot 112 which forms part of a connection system for use in connecting the end cap 100 to the receptacle 102. Air and entrained debris pass through the aperture in the end of the tubular connection section 104, through the tubular connection section and into the dome shape section 106 before being expelled from the end cap 100 through the large aperture in the base 108 of the dome. The shape of the dome 106 is such that it acts as a deflector for the air and entrained debris and causes it to bend through ninety degrees so that the air and entrained debris are travelling perpendicular to the direction they were travelling in when they were passing through the tubular connection section 104. By constructing the end cap 100 in transparent plastic, the operator of the planer can look into the debris collection container to determine how full the container is. Furthermore, as the planer is operating, the operator will be able to see the entrained debris passing through the tubular connection section and pass through the dome section thereby enabling the operator to see that the planer is working correctly.",
        "The receptacle comprises a rectangular plastic frame 114 which acts as an entrance for the receptacle 102. Attached to the rectangular plastic frame 114 is a large rectangular metal frame (not shown) made from stiff metal wire which forms of the structure of the receptacle. Attached to the rectangular plastic frame 114 and covering the large rectangular metal frame is a bag 116 made from cloth. The use of a cloth bag covering a metal frame is well know whether such will not be discussed any further.",
        "Mounted within the rectangular plastic frame are two C shaped locking members 118 as shown in FIG. 11 which are used to lock the receptacle 102 to the end cap 100. The method of mounting is not shown. The two C shaped locking members 118 are mounted within the rectangular plastic frame 114 so that the ends 120 of each of the two arms of the C shaped locking members 118 face each other as shown in FIG. 11. Formed on the ends of the two arms of the two C shaped locking members 118 are pegs 122 which project outwardly. Helical springs 124 are mounted between the ends 120 of each pair of corresponding arms in order to bias the two C shaped locking members 118 outwardly away from each other as indicated by Arrows X. Rod 126 is mounted within the helical springs to keep the helical springs 124 in position. Holes are formed within the rectangular plastic frame to enable the fingers of an operator to engage with the two C shaped locking members to push them towards each other against the biasing force of the springs 124.",
        "In order to attach the receptacle 102 to the end cap 100, an operator would squeeze the two C shaped locking members 118 together against the biasing force of the springs 124 moving the pegs 122 formed on the ends 120 of the arms 118 of each of the two C shaped locking mechanisms 118 towards each other. Whilst held in this position, the pegs 122 are able to pass through the entrance of the T-shaped slot 112 in the end cap 100. The operator can then the push the end cap 100 towards the receptacle 102, the pegs 122 moving further into the T-shaped slot 112 until they become aligned with the top section of the T-shaped slot 112. The operator then releases the C shaped locking members 118 to allow them to move outwardly due to the biasing force of the springs 124 causing the pegs 122 to travel outwardly in the top section of the T-shaped slot 112 thus locking the receptacle 102 to the end cap 100.",
        "FIG. 12 shows they view of the second embodiment of the debris collection container attached to the planer. As can be seen, the debris collection container is located along side the planer and the longitudinal axis 132 of the debris container extends in parallel to the longitudinal axis 130 of the planer."
    ],
    "citations": [
        "0157369",
        "1281207",
        "1296911",
        "1792313",
        "2583637",
        "2600279",
        "2707028",
        "2707527",
        "2871897",
        "2991595",
        "3014516",
        "3180063",
        "3535829",
        "3566548",
        "3583821",
        "3902284",
        "3938283",
        "3952484",
        "4105420",
        "4118897",
        "4192104",
        "4334390",
        "4598500",
        "4601104",
        "4758023",
        "4967516",
        "5237781",
        "5341605",
        "5349752",
        "5383275",
        "5419737",
        "5463816",
        "5493398",
        "5518442",
        "5529202",
        "5595531",
        "5791977",
        "5815934",
        "5833524",
        "5878607",
        "5934985",
        "5960983",
        "5974626",
        "6047693",
        "6159085",
        "6224471",
        "6256832",
        "6481475",
        "6514131",
        "6520365",
        "D475594",
        "6601621",
        "6629548",
        "6688349",
        "6712106",
        "2002/0174774",
        "10 80 764",
        "31 13496",
        "31 26511",
        "34 06 728",
        "35 42 263",
        "35 42 466",
        "38 43 912",
        "39 15 084",
        "43 10 280",
        "19 535 248",
        "195 12 262",
        "195 30 542",
        "198 51 064",
        "298 12 699",
        "198 32 005",
        "100 35 437",
        "0 279 047",
        "0 558 253",
        "1 247 612",
        "249881",
        "2 137 896",
        "23 39 720",
        "2343393",
        "2 371 968",
        "03223002",
        "2002 326160",
        "WO95/34238"
    ],
    "us_classification": "1441141",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "27",
            "subclass": "C",
            "main_group": "1",
            "subgroup": "00"
        }
    ]
}