{
    "title": "Thulium-doped heavy metal oxide glasses for 2UM lasers",
    "abstract": "A heavy metal oxide glass selected from germanate, tellurite and bismuth oxide glasses provides a host for highly efficient Thulium doped 2 μm oxide glass and fiber lasers. The concentration of Thulium ions is high enough that energy transferred by the phenomenon of cross-relaxation will enhance laser emission at 2 μm and suppress emission at 1.5 μm so that 2 μm emission is dominant.",
    "inventors": [
        "Jiang"
    ],
    "document_number": "07298768",
    "publication_date": "20071120",
    "assignees": [
        "NP Photonics, Inc"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A laser glass comprising a heavy metal oxide glass host, a glass network modifier (MO) selected from K",
            "components": []
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The laser glass of claim 1 , wherein the glass host comprises one of germanium oxide (GeO",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The laser glass of claim 2 , wherein the glass host comprises germanium oxide (GeO",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The laser glass of claim 3 , wherein the glass host comprises germanium oxide (GeO",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The laser glass of claim 2 , wherein the glass host comprises tellurite oxide (TeO",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The laser glass of claim 5 , wherein the glass host comprises tellurite oxide (TeO",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The laser glass of claim 2 , wherein the glass host comprises bismuth oxide (Bi",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The laser glass of claim 7 , wherein the glass host comprises bismuth oxide (Bi",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The laser glass of claim 1 , wherein the concentration of Thulium ions is at least 2×10",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The laser glass of claim 9 , wherein the concentration of Thulium ions is at least 4×10",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The laser glass of claim 1 , wherein the Thulium ions are introduced into the host glass as Thulium oxide of at least 2% by weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The laser glass of claim 11 , wherein the Thulium oxide is at least 4% by weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The laser glass of claim 1 , wherein the concentration of Thulium ions is high enough that most energy will be transferred to the lasing up-level of",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The laser glass of claim 1 , wherein the concentration of Thulium ions is high enough to enhance laser emission on the",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A laser glass comprising a heavy metal oxide glass host doped with Thulium ions being responsive to pump light to emit laser light on the",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A laser, comprising:",
            "components": [
                {
                    "component": "a pump for emitting pump light; and",
                    "subcomponents": []
                },
                {
                    "component": "a laser cavity containing a laser glass formed of a thulium-doped heavy metal oxide glass host, said laser glass being responsive to the pump light to emit laser light on the 3F4 to 3H6 transition of the thulium ions and suppress emission on the 3H4→3F4 transition of the thulium ions,",
                    "subcomponents": []
                },
                {
                    "component": "wherein said laser glass further comprises a glass network modifier (MO) selected from K",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The laser of claim 16 , wherein the quantum efficiency of the laser is at least 150%.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The laser of claim 16 , wherein the laser glass is pulled into a fiber.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The laser of claim 16 , wherein the glass host comprises one of germanium oxide (GeO",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The laser of claim 16 , wherein the Thulium ions are introduced into the host glass as Thulium oxide of at least 2% by weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The laser of claim 20 , wherein the Thulium oxide is at least 4% by weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The fiber of claim 21 , wherein the glass host comprises one of germanium oxide (GeO",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The fiber of claim 21 , wherein the concentration of Thulium ions is at least 4×10",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The fiber of claim 21 , wherein the Thulium ions are introduced into the host glass as Thulium oxide of at least 4% by weight.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The fiber of claim 21 , wherein the concentration of Thulium ions is high enough to enhance laser emission on the",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. A laser, comprising:",
            "components": [
                {
                    "component": "a pump for emitting pump light; and",
                    "subcomponents": []
                },
                {
                    "component": "a laser cavity containing a laser glass formed of thulium-doped heavy metal oxide glass, said laser glass being responsive to the pump light to emit laser light on the",
                    "subcomponents": []
                },
                {
                    "component": "wherein said laser glass host comprises one of germanium oxide (GeO",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The laser of claim 16 , wherein the concentration of Thulium ions is at least 2×10",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The laser of claim 27 , wherein the concentration of Thulium ions is at least 4×10",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. A fiber, comprising:",
            "components": [
                {
                    "component": "a core formed from a heavy metal oxide glass host doped with Thulium ions, a glass network modifier (MO) selected from K",
                    "subcomponents": []
                },
                {
                    "component": "a cladding formed from the same heavy metal oxide glass host,",
                    "subcomponents": []
                },
                {
                    "component": "said fiber being responsive to pump light to emit laser light on the",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "The U.S. Government has a paid-up license in this invention and the right in limited circumstances to require the patent owner to license others on reasonable terms as provided for by the terms of Grant No. NNL04AB40P.",
        "This application claims benefit of priority under 35 U.S.C. 120 to U.S. application Ser. No. 10/783,480 entitled “Single-Frequency Narrow Linewidth 2 μm Fiber Laser” filed on Feb. 19, 2004 and issued as U.S. Pat. No. 7,106,762 on Sep. 12, 2006, the entire contents of which are incorporated by reference.",
        "1. Field of the Invention",
        "This invention relates to glasses and fibers for laser applications and more specifically to Thulium-doped heavy metal oxide glasses for near 2 μm lasers with high quantum efficiency.",
        "2. Description of the Related Art",
        "2 μm lasers are highly transmissive in air, relatively eye-safe, and highly absorptive in many natural substances such as organic tissue and water. Applications such as LIDAR, range finder, materials processing, and biomedical require low cost, robust and efficient 2 μm, e.g. typically 1.7-2.1 μm, lasers. As used herein the term “2 μm” laser refers to laser emission across the range of 1.7-2.1 μm.",
        "Most 2 μm Thulium doped lasers use a crystalline host material. Crystalline materials exhibit good mechanical strength and chemical durability and through a phenomenon known as “cross-relaxation” exhibit high quantum efficiency. Unfortunately crystalline materials are expensive and cannot be pulled into fibers, hence can only be used for free space solid-state lasers.",
        "Glass hosts, namely silica and fluoride glass, which can be pulled into fiber, have been developed for 2 μm fiber lasers. Unfortunately, neither glass is a good host for Thulium doped laser applications. Silica glass has high phonon energy, approximately 1100 cm−1, and can only support limited doping concentrations, and thus exhibits poor quantum efficiency. Although fluoride exhibits low phonon energy of about 700 cm−1 and accept high rare-earth doping concentrations, fluoride glass is physically weak and chemically not durable, which limits the output power of the laser and seriously restricts practical application.",
        "The present invention provides a host for highly efficient Thulium doped 2 μm oxide glass and fiber lasers.",
        "This is accomplished with a heavy metal oxide glass host selected from germanate, tellurite and bismuth oxide glasses. The host is heavily doped with Thulium ions, suitably at least 2×1020 ions/cm3, and preferably at least 4×1020 ions/cm3. Most typically, the Thulium ions will be introduced into the host glass as Thulium oxide of at least 2 wt. %, and preferably at least 4 wt. % to achieve the necessary ion concentrations and increase quantum efficiency. The concentration of Thulium ions is high enough that energy transferred by the phenomenon of cross-relaxation will enhance laser emission at 2 μm and suppress emission at 1.5 μm so that 2 μm emission is dominant. The quantum efficiency is preferably at least 100%, and most preferably at least 150%.",
        "In one embodiment, a germanate glass host comprises germanium oxide (GeO2) from 30% to 90% by weight, and preferably 40% to 80% by weight.",
        "In a second embodiment, a tellurite glass host comprises tellurite oxide (TeO2) from 30% to 90% by weight, and preferably 40% to 80% by weight.",
        "In a third embodiment, a bismuth glass host comprises bismuth oxide (Bi2O3) from 20% to 90% by weight, and preferably 30% to 70% by weight.",
        "In a fourth embodiment, the glass host further comprises a glass network modifier (MO) selected from K2O, Na2O, Li2O, BaO, CaO, MgO, ZnO, Y2O3, PbO, or combinations thereof from 1% to 60% by weight, and preferably 5% to 40%, and a glass network intermediator (XO) selected from Al2O3, B2O3, La2O3 or combinations thereof from 0% to 50%, by weight, and preferably 5% to 30%.",
        "FIG. 1 is an energy level diagram of Thulium ions illustrating the phenomenon of cross-relaxation;",
        "FIG. 2 is a table of Thulium doped heavy metal oxide glass compositions in accordance with the present invention;",
        "FIG. 3 is a table of Thulium doped germanate glasses;",
        "FIG. 4 is a table of Thulium doped tellurite glasses",
        "FIG. 5 is a normalized fluorescence spectra of a heavy metal oxide glass host doped with varying concentrations of Thulium ions;",
        "FIG. 6 is a plot of emission lifetime of Thulium ions at varying concentrations;",
        "FIG. 7 is a diagram of a Thulium doped 2 μm fiber laser; and",
        "FIG. 8 is a plot of output power versus absorbed pump power for a 4 wt. % Tm-doped germanate fiber laser.",
        "The present invention provides a host for highly efficient Thulium doped 2 μm oxide glass and fiber lasers.",
        "FIG. 1 shows a simplified energy level diagram 10 of triply ionized Thulium ions (Tm3+). 2 μm laser oscillation of Thulium ions originates from 3F4-3H6 transition. Typically Thulium ions are excited from a 3H6 level (ground state) to a 3H4 level by a pump beam, suitably 790 nm pump, and then decay to a 3F4 level. It was reported in crystalline materials that the so-called cross-relaxation phenomenon can increase the quantum efficiency significantly. Thulium cross-relaxation is a non-radiative process in which an excited Thulium in the 3H4 state (energy level around 12900 cm−1) decays to the 3F4 state (energy level around 6000 cm−1) and a neighboring ground-state Thulium ion is promoted to the 3F4 level, accompanied by the emission of phonons [L Esterowitz Optical Engineering, Vol. 29(6), 1990]. The advantage of this cross-relaxation process is that a single Thulium ion excited to the 3H4 level generates two Thulium ions in the 3F4 upper laser level. The quantum efficiency of pumping into the 3F4 state is nearly 200%. The probability of Tm3+ cross relaxation is negligible for concentrations less than approximately 2 wt % but approaches unity for concentrations greater than approximately 5 wt % in Tm3+ doped crystals.",
        "In accordance with the present invention, heavy metal oxide glasses and fibers are doped with a high concentration of Thulium ions. Heavy metal oxide glasses such as germanate, tellurite and bismuth oxide exhibit low phonon energy thereby providing a high quantum efficiency of 3F4 level of Thulium ions. Critically, Thulium can be highly doped into these heavy metal oxide glasses. At these high dopant concentrations, the cross-relaxation phenomenon dramatically improves the quantum efficiency. For instance, germanate glass exhibits phonon energy of 900 cm−1, which is much lower than silica glass of 1100 cm−1. The doping concentration of Thulium ions in germanate glass can be up to 15 weight percent. In addition to high quantum efficiency, these glasses exhibit good mechanical properties and can be pulled into fibers.",
        "As shown in FIG. 2, a heavy metal oxide glass host 12 selected from germanate glass 14, tellurite glass 16 and bismuth glass 18 is heavily doped with Thulium ions 20, suitably at least 2×1020 ions/cm3, and preferably at least 4×1020 ions/cm3 to increase quantum efficiency. The concentration of Thulium ions is high enough that most energy will be transferred to the lasing up-level of 3F4 by cross-relaxation energy transfer (3H4, 3H6→3F4, 3F4) instead of radiative decay (3H4→3F4) thereby enhancing laser emission at 2 μm and suppressing emission at 1.5 μm so that 2 μm emission is dominant. The quantum efficiency is preferably at least 100%, and most preferably at least 150%. Thulium ions can be introduced into glasses and fibers with Thulium oxide, Thulium fluoride or other format. Most typically the ions are introduced with Thulium oxide of least 2 wt. %, and preferably at least 4 wt. % to achieve the desired ion concentration.",
        "In one embodiment, germanate glass host 14 comprises germanium oxide (GeO2) from 30% to 90% by weight, and preferably 40% to 80% by weight.",
        "In a second embodiment, tellurite glass host 16 comprises tellurite oxide (TeO2) from 30% to 90% by weight, and preferably 40% to 80% by weight.",
        "In a third embodiment, bismuth glass host 18 comprises bismuth oxide (Bi2O3) from 20% to 90% by weight, and preferably 30% to 70% by weight.",
        "In each embodiment, the glass host further comprises a glass network modifier (MO) 22 selected from K2O, Na2O, Li2O, BaO, CaO, MgO, ZnO, Y2O3, PbO, or combinations thereof from 1% to 60% by weight, and preferably 5% to 40%, and a glass network intermediator (XO) 24 selected from Al2O3, B2O3, La2O3 or combinations thereof from 0% to 50%, by weight, and preferably 5% to 30%.",
        "FIGS. 3 and 4 are tables of Thulium doped germanate glasses 26 and tellurite glasses 28, respectively. In these samples, the Thulium ions are introduced with Thulium oxide (Tm2O3).",
        "The fluorescence properties of Thulium ions in the Thulium doped germanate glasses 26 are shown in FIG. 5. Two broad emission bands 30 at 1.49 μm and 32 at 1.8 μm in the fluorescence spectra 34 are due to 3H4→3F4 transition and 3F4→3H6 transition, respectively. To illustrate the relationship between doping concentration and relative fluorescence intensity of the “1.5 μm” and “2 μm” emission bands, the fluorescence spectra 34 at different doping concentrations from 0.5 to 10 wt. % were scaled so that the emission intensity at 1.8 μm was normalized to 1.",
        "At low dopant concentrations, such as 0.5 wt %, the normalized emission intensity 36 of 1.49 μm band is much stronger than the normalized emission intensity 38 of 1.8 μm band. At high dopant concentrations, especially higher than 2 wt %, the normalized emission intensity 38 of the 1.8 μm band is stronger than the normalized emission intensity 40 of the 1.49 μm band. Above 4 wt %, the 1.8 μm band emission dominates the fluorescence spectrum and the emission intensity 42 of the 1.49 μm band is highly suppressed.",
        "At low concentrations, the emission intensity of the 1.49 μm band is much stronger than the emission intensity of 1.8 μm band because of the high rate of non-radiative decay caused by high phonon energy. A high doping concentration enhances the 3F4→3H6 transition (1.8 μm) while suppressing the 3H4→3F4 transition (1.47 μm). The reason for this phenomenon is cross-relaxation: One Tm3+ ion at energy level of 3H4, jumps to the lower level of 3F4, by exciting another Tm3+ ion from the level of 3H6 to the level of 3F4 and generating one or two phonons. So two Tm3+ ions will be excited to the upper laser level by absorbing one pumping photon, which makes Tm3+ (under high concentration circumstance) have high quantum efficiency at 2 μm emission region.",
        "Since cross-relaxation transfer process is based on electric multipolar interaction mechanism, the distance between the Tm3+ ions (i.e. doping concentration) is very critical. FIG. 5 shows that there was almost no fluorescence of the 3H4→3F4 transition, when the doping concentration was higher than 4 wt %. That means the rate of cross-relaxation is much bigger than the spontaneous emission rate of 3H4→3F4 transition at high Tm3+ doping level. So when the Tm3+ doping level is higher than 4%, the cross-relaxation becomes the dominant channel to populate the upper level of a 2 μm laser (3F4) and the pumping efficiency is significantly improved.",
        "As shown in FIG. 6, the lifetime 50 of the 3F4 level of Tm3+ drops from 4.77 ms to 0.4 ms with the increase of doping concentration from 0.5 wt. % to 10 wt. %. Lifetime is defined as the time required for the fluorescence to decrease to 1/e of its initial intensity. One reason is that when the doping concentration increases, reverse energy transfer (3F4, 3F4→3H4, 3H6) will occur. When two excited Tm3+ ions at 3F4 level are close enough, they will interact. One ion will nonradiatively decay to the ground state while the other ion will be excited to the 3H4 level. Since this is a phonon-absorbing energy transfer process, its probability is much lesser than the probability of cross-relaxation which is a phonon-emitting process, because",
        "(\n      \n        \n          n\n          +\n          1\n        \n        n\n      \n      )\n    \n    N\n  \n  >>\n  1\n\n\n\n\nwhere n is the Bose-Einstein occupation number, n+1 and n are the probability of generating one phonon and absorbing one phonon. Another reason is that the emigration between ions at 3F4 level results in energy transfer to the glass defect. FIG. 6 shows that for low doping concentrations (less than 1%), the lifetime of 3F4 is only slightly reduced with increased doping. Therefore, at low doping levels both the glass defect and reverse energy transfer can be neglected. As the doping level continues to increase beyond 1%, the lifetime drops sharply. After the doping concentration is larger than 4%, the slope of decreasing the lifetime becomes smaller.",
        "As shown in FIG. 7, a 2 μm fiber laser 60 includes a gain fiber 62, single or multi mode, formed of a heavy metal oxide glass (germanate, tellurite, bismuth) host doped with triply ionized thulium oxide. Reflectors 64 and 66 are positioned at opposite ends of gain fiber 62 to form a resonant cavity that provides the feedback necessary to sustain laser emission 67. A free space laser can be similarly configured using a block of Tm-doped heavy metal oxide glass and free space reflectors.",
        "The reflectors may be formed by coating the ends of fibers 68,70 and butt-coupling them to gain fiber 62, as shown, or by using coated mirrors or fiber gratings in sections of passive fiber butt coupled or fused to the ends of gain fiber 62. The reflectivity of reflector 64 should be as close to 100% as possible to increase the efficiency of the laser. The reflectivity of reflector 66 is less than 100%, suitably 2-99% depending upon the pump power and target output power, such that power can be extracted from the cavity. Laser emission 67 can be either single and multi-transverse mode or single and multi-longitudinal mode depending upon the cavity design, e.g. length and gratings.",
        "A pump 72, e.g. a single-mode or multi-mode laser diode, illuminates gain fiber 62 at a wavelength, typically 800 nm, within the absorption band. The pump may be end-coupled, as shown, side-coupled or coupled at the output end via a WDM. The absorption band of triply ionized thulium occurs from 750 to 820 nm. Pumping of the doped glass populates the thulium upper level creating a population inversion. Spontaneous emission catalyzes the stimulated emission of the thulium ions in the upper level over a range of 1800 to 2000 nm. This emission is enhanced by the cross-relaxation effect as described above. The emission peak of thulium occurs at a wavelength of approximately 1800 nm.",
        "The output slope characteristic 80 (output power vs. absorbed pump power) for a 2 μm fiber laser is shown in FIG. 8. In this particular example, the gain fiber was a 2 cm long double-clad fiber having a core diameter of 7 μm designed for use with a commercially available multi-mode 804 nm diode pump laser. The core host and inner cladding glasses were similar in composition to the germanate glasses listed in FIG. 3. The core host was doped with 4 wt. % thulium-oxide.",
        "The inner cladding, which is matched to the core glass with a numerical aperture (NA) of 0.15 confines the 2 μm laser in the core. The outer cladding, which is matched to the inner cladding with a high NA, confines the pump laser in the inner cladding. A silicate glass was used as the outer cladding glass due to its low cost, low refractive index and better chemical and thermal stabilities. The fluorescence lifetime of the transition 3F4-3H6 (1.87 μm) was measured to be 1.6 ms.",
        "Two dielectric coated SMF-28 silica fibers were used as mirrors to form the fiber laser cavity. The reflectivities of the mirrors were 96.4% (high reflectivity) and 82% (partial reflectivity, output coupler), respectively, around 1.9 μm. The transmission of the HR mirror at the pumping wavelength is 93.9%. The propagation loss of the fiber was measured to be 0.05 dB/cm. The coupling loss between the Thulium doped fiber and coated SMF-28 was measured as 0.79 dB.",
        "As shown FIG. 8, the threshold absorbed power 82 was about 7.6 mW, which is quite low due to the high reflectivity of both cavity mirrors. The slope efficiency with respect to the absorbed pump power was 14.1%, which is quite high considering the high reflectivity of the output coupler.",
        "Koechaner's model for slope efficiency of 3-level laser systems was used to calculated the quantum efficiency of the material,",
        "σ\n    =\n    \n      \n        \n          P\n          out\n        \n        \n          P\n          absorbed\n        \n      \n      =\n      \n        \n          \n            \n              \n                (\n                \n                  1\n                  -\n                  \n                    L\n                    N\n                  \n                \n                )\n              \n              ⁢\n              \n                (\n                \n                  1\n                  -\n                  \n                    R\n                    PR\n                  \n                \n                )\n              \n            \n            \n              L\n              -\n              \n                ln\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  R\n                  PR\n                \n              \n            \n          \n          ⁢\n          \n            η\n            Q\n          \n          ⁢\n          \n            \n              λ\n              pump\n            \n            \n              λ\n              Laser\n            \n          \n          ⁢\n          \n            \n          \n          ⁢\n          \n            L\n            N\n          \n        \n        =\n        \n          \n            L\n            -\n            \n              ln\n              ⁢\n              \n                \n              \n              ⁢\n              \n                R\n                PR\n              \n            \n          \n          \n            2\n            ⁢\n            \n              α\n              0\n              l\n            \n          \n        \n      \n    \n  \n\n\n\n\n  \n    L\n    =\n    \n      \n        2\n        ⁢\n        α\n        ⁢\n        \n          \n        \n        ⁢\n        l\n      \n      -\n      \n        ln\n        ⁢\n        \n          \n        \n        ⁢\n        \n          R\n          HR\n        \n      \n    \n  \n\n\n\nσ is the slope efficiency. ηQ is the quantum efficiency, defined as number of emission photons generated by one pump laser photon. λpump, λLaser are the wavelength of the pump and laser. 2αl is used to describe the round trip loss of the laser cavity except for loss of two cavity mirrors. RHR, RPR are the reflectivity of the cavity mirror. In this experiment, both the HR mirror and PR mirror were positioned very close to the end of the gain fiber, so the only loss of the cavity results from the propagation loss, which is 0.054 dB/cm.",
        "According to Koechaner's model, the calculated value of quantum efficiency of the fiber laser is 170%, which means every absorbed pump photon will generate 1.7 emission photons. In a cross-relaxation process, the theoretical maximum quantum efficiency is 200% instead of the traditional value of 100%. Such a high quantum efficiency of 170% is due to the high cross-relaxation energy transfer rate, which primarily depends on the doping concentration of Tm3+ ions, and is the highest quantum efficiency reported in Tm3+-doped glasses. Another advantage of cross-relaxation is that the phenomenon does not generate a lot of phonons compared with other non-radiative decay processes. This is a very important feature especially for high power applications, in which thermal problems become the bottleneck on laser performance."
    ],
    "citations": [
        "4965803",
        "4969150",
        "5067134",
        "5291501",
        "5311532",
        "5381433",
        "5406410",
        "5457706",
        "5459745",
        "5640408",
        "5742632",
        "5796903",
        "6476960",
        "6589895"
    ],
    "us_classification": "372 40",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "S",
            "main_group": "3",
            "subgroup": "17"
        }
    ]
}