{
    "title": "Marine craft adapted for shallow water operation",
    "abstract": "A marine craft which includes a portable drive assembly temporarily attached to the transom, the portable drive assembly including an elongated drive housing enclosing an upper drive assembly and a lower driven assembly and a timing belt connecting the upper drive assembly to the lower driven assembly. The craft further includes an engine mounting plate attached externally to the drive housing adjacent the upper drive assembly perpendicular to the drive housing. The lower driven assembly also has a propeller shaft at least a portion of which is enclosed within a shaft housing attached to the drive housing adjacent the driven assembly, the shaft housing extending in excess of 18 inches beyond the drive housing, and a propeller attached to the propeller shaft.",
    "inventors": [
        "Broussard"
    ],
    "document_number": "07297035",
    "publication_date": "20071120",
    "assignees": [
        "Gator Tail, L.L.C."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A marine craft comprising",
            "components": [
                {
                    "component": "a hull comprising a transom; and",
                    "subcomponents": []
                },
                {
                    "component": "a portable drive assembly temporarily attached to the transom, the portable drive assembly comprising",
                    "subcomponents": [
                        "an elongated drive housing enclosing an upper drive assembly and a lower driven assembly and a timing belt connecting the upper drive assembly to the lower driven assembly; and",
                        "an engine mounting plate attached externally to the drive housing adjacent the upper drive assembly perpendicular to the drive housing;"
                    ]
                },
                {
                    "component": "an elongated drive housing enclosing an upper drive assembly and a lower driven assembly and a timing belt connecting the upper drive assembly to the lower driven assembly; and",
                    "subcomponents": []
                },
                {
                    "component": "an engine mounting plate attached externally to the drive housing adjacent the upper drive assembly perpendicular to the drive housing;",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The marine craft according to claim 1 , wherein the portable drive assembly further comprises a transmission mounted to the engine mounting plate coupled externally to the upper drive assembly.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The marine craft according to claim 1 , wherein the portable drive assembly further comprises steering and throttle controls.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The marine craft according to claim 1 , wherein the shaft housing comprises a rudder fin.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The marine craft according to claim 1 , wherein the upper drive assembly and the lower driven assembly further include respective timing pulleys compatible with the timing belt, the timing belt being unobstructed or acted upon by other bodies.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The marine craft according to claim 1 , further comprising a mounting bracket assembly for temporarily attaching the portable drive assembly to the transom, the mounting bracket assembly comprising a mounting bracket and a pivotal assembly for positioning the portable drive assembly in the horizontal plane.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The marine craft according to claim 1 further comprising a utility engine mounted on the engine mounting plate and coupled to the upper drive assembly.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The marine craft according to claim 7 , wherein the portable drive assembly further comprises a transmission mounted to the engine mounting plate coupled externally to the upper drive assembly.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The marine craft according to claim 7 , wherein the portable drive assembly further comprises steering and throttle controls.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The marine craft according to claim 7 , wherein the shaft housing comprises a rudder fin.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The marine craft according to claim 7 , wherein the upper drive assembly and the lower driven assembly further include respective timing pulleys compatible with the timing belt, the timing belt being unobstructed or acted upon by other bodies.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The marine craft according to claim 7 , further comprising a mounting bracket assembly for temporarily attaching the portable drive assembly to the transom, the mounting bracket assembly comprising a mounting bracket and a pivotal assembly for positioning the portable drive assembly in the horizontal plane.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The marine craft according to claim 12 , further comprising",
            "components": [
                {
                    "component": "a first pivoting assembly for positively positioning the elongated drive housing beyond vertical relative to the mounting bracket in the vertical plane.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The marine craft according to claim 13 , further comprising",
            "components": [
                {
                    "component": "a second pivoting assembly for negatively positioning the elongated drive housing beyond vertical relative to the mounting bracket in the vertical plane.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The marine craft according to claim 6 , further comprising",
            "components": [
                {
                    "component": "a first pivoting assembly for positively positioning the elongated drive housing beyond vertical relative to the mounting bracket in the vertical plane.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The marine craft according to claim 15 , further comprising",
            "components": [
                {
                    "component": "a second pivoting assembly for negatively positioning the elongated drive housing beyond vertical relative to the mounting bracket in the vertical plane.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This is a continuation or continuation-in-part of commonly owned and co-pending non-provisional application Ser. No. 10/844,192 filed May 4, 2004, now U.S. Pat. Ser. No. 7,048,600 issued May 23, 2006, and which is a continuation-in-part of application No. 10/662,487 filed Sep. 15, 2003, now U.S. Pat. Ser. No. 7,052,340 issued May 30, 2006, claiming priority to provisional application No. 60/411,701 filed Sep. 17, 2002. This is also a continuation or continuation-in-part of the aforesaid commonly owned and co-pending non-provisional application 10/662,487, now U.S. Pat. Ser. No. 7,052,340. All of the foregoing applications are fully incorporated herein by reference.",
        "This invention relates generally to transom-mounted outboard motors for small marine watercraft and more particularly to air-cooled engines having belt driven propeller shafts for shallow draft watercraft.",
        "Small marine craft operating primarily in shallow water are often referred to as mud boats. Such boats are usually shallow draft flat bottom boats powered by in-board air cooled engines with outboard drives adapted to pass through the hull or transom for coupling to the engine, as disclosed by U.S. Pat. Nos. 941,827, 3,752,111 and 4,726,796.",
        "In some cases small air cooled engines have been adapted for fixed attachment to a boat's transom for pivotal steering in the horizontal plane, with an extended drive shaft extending rearwardly to just below the water line at an angle of approximately 30 degrees as illustrated by Foreman in U.S. Pat. No. 6,302,750.",
        "Other patents, such as Carter, et al. in U.S. Des. 259,488 illustrate the use of an air cooled engine pivotally mountable to the boat's transom with the same elongated drive shaft extending to just below the waterline perhaps at a somewhat greater angle, depending on the height of the transom. In most cases the drives are designed not to extend below the bottom of the hull.",
        "Lais et al. and others disclose the use of electric motors in combination with a belt drive to maneuver small craft as is disclosed in U.S. Pat. Nos. 5,336,119 and 1,953,599. Obviously, such drives are not intended for high speed or for extended powering through mud or vegetation in shallow water.",
        "The use of air cooled or water cooled marine engines coupled by belt to a transom mounted drive unit are well known within the art as being a most efficient means for driving a propeller shaft thereby reducing friction and improving mechanical advantage over right angle gear drives. Therefore, the use of a belt drive in combination with an air cooled engines as disclosed by Pignata in U.S. Pat. No. 5,435,763 seems to be an obvious choice. However, Pignata utilizes a unique internal propeller arrangement and with a through the transom coupling for an inboard air-cooled engine with pivotal kick-up capability or over the top of the transom arrangement. However, Pignata fails to fully disclose how either such arrangement may be steered effectively. While the Pignata apparatus may be useful in open water, it is far from obvious that it could be adapted for use in shallow water marsh with heavy mud and vegetation. The internal propeller housing must be located below the boat hull for water to be drawn effectively through the internal propeller blades. Therefore, if the propeller housing were above the bottom of the boat's hull, water flow would be blocked, Shallow draft boats are known to create a depression at speed for some distance directly behind the transom. It is therefore essential that the propeller shaft extend below the boat hull or beyond the water depression to make sufficient contact with the water to provide thrust and prevent cavitations.",
        "Mud boats rely a great deal on propeller contact with the mud and the propeller's ability to cut the vegetation to help drive the boat. Hence the concept of having an elongated drive shaft extending at a shallow angle from above a boat's transom to just below the water surface has long been the excepted practice for mud boats. However, the use of a fixed inboard engine with a through transom coupling limits the apparatus to a particular boat and therefore may not be removed and mounted on another boat without extensive modifications. The use of a removable over the transom mounted air cooled engine with extended drive shaft is awkward and often limited to a relatively low horsepower engines. There is obviously a need to provide a relatively high horsepower air cooled engines adapted to an efficient belt drive for mounting to small, flat bottom boats in much the same manner as water cooled outboard engines. Such a driver must also be equipped with a foot that does not extend below the bottom of the boat but extends a sufficient distance behind the boat to insure the proper angle of attack when the propeller is in contact with mud and vegetation.",
        "The use of a wide variety of commercially available air-cooled engines with 50 horsepower or more presents a wide range of problems that must be addressed and that are not encountered by conventionally manufactured outboard engine manufactures. By not manufacturing the engine, the drive must be adaptable to multiple engine configurations and drive train configurations. The weight of the engines must be considered and balanced in regard to the drive. Unique pivotal adjustments are necessary to insure safety and proper angles of attack at various speeds. The use of transmissions and clutches must also be considered in an attempt to reduce weight and cost. Conventional drives are inadequate due the constant inter-reaction with debris and mud including stumps and rocks. Therefore, consideration must be given to special propellers and their couplings when used as solids conveying means. Contact with underwater objects is a serious safety problem with mud boat drives since the engine can kick up or sideways causing serious harm to the operator.",
        "It should be understood that a distinction should be made between air cooled engines utilizing a fully enclosed, self contained, circulating water system and water cooled marine engines that utilize the water in which they are submersed, for cooling. Some air cooled marine outboard engines have also been developed. However, for the purpose of this application air cooled engines used as an outboard drive are considered to be both air and self-contained water-cooled engines generally used for inboard drive engines or utility applications other than marine.",
        "A relatively high horsepower air-cooled engine in one embodiment of this invention is adapted to an efficient belt drive assembly capable of being transom mounted to small flat bottom boats in much the same manner as conventional outboard engines. The drive is equipped with a lower drive shaft that does not extend below the bottom of the boat but extends a sufficient distance behind the boat to insure contact with the water for conventional propulsion. A unique pivotal arrangement allows the engine and drive assembly to be positioned for proper angle of attack when the propeller is in contact with mud and vegetation below the bottom of the boat. This arrangement allows for a much shorter turning radius than can be achieved by the related prior art transom mounted mud motor systems. The engine mount includes incremental tilt positioning capability and a pivotal horizontal steering handle. The propeller is capable of providing propulsion when in contact with solids such as mud and vegetation, and provides relatively fast hull speed in deep water. A clutch is provided to disengage the engine from the drive and an electric drive motor is provided in contact with the belt drive for turning the drive in a reverse direction.",
        "The various embodiments and features of this invention will now become apparent from the following detailed description, the accompanying drawings and the appended claims.",
        "For a further understanding of the nature and objects of the present invention, reference should be made to the following detailed description taken in conjunction with the accompanying drawings, in which, like parts are given like reference numerals, and wherein:",
        "FIG. 1 is a side elevation view of the preferred embodiment in the conventional drive position;",
        "FIG. 2 is a side elevation view of the preferred embodiment in the mud engagement position;",
        "FIG. 3 is a side elevation view of the preferred embodiment in the tilt up position;",
        "FIG. 4 is an isometric view of the underside of the preferred embodiment with rotary actuator;",
        "FIG. 5 is a partial cross section view of the underside of the preferred embodiment shown in FIG. 4;",
        "FIG. 6 is a side elevation view of the embodiment with manual positioner in the conventional drive position;",
        "FIG. 7 is a side elevation view of the embodiment with manual positioner in the mud engagement position;",
        "FIG. 8 is an isometric view of the underside of the embodiment with manual positioner;",
        "FIG. 9 is a partial cross section view of the underside of the embodiment shown in FIG. 8;",
        "FIG. 10 is an exploded view of the pivotal assembly with actuator connection;",
        "FIG. 10a is an exploded view of the pivotal assembly with manual positioning connection;",
        "FIG. 11 is a top view of the drive assembly showing rotation in horizontal plane;",
        "FIG. 12 is side elevation view of the pivoting bracket assembly showing range of motion in the vertical plane;",
        "FIG. 13 is side elevation view of the pivoting bracket assembly in the kicked up position in the vertical plane;",
        "FIG. 14 is a side cross-section view of the drive shaft assembly;",
        "FIG. 15 is a partial isometric view of the drive shaft shown in FIG. 14; and",
        "FIG. 16 is side elevation view of the drive assembly showing the reverse drive motor.",
        "The preferred embodiment 10 of the portable outboard drive assembly 12 as shown in FIG. 1 utilizes a mounting bracket assembly comprising a conventional mounting bracket 14 for attaching the outboard drive assembly 12 to a boat's hull at transom 16. The drive assembly 12 consisting principally of any number of commercially available air-cooled or self-contained water cooled utility engine assemblies 18 adaptively mounted to the frame assembly 20 at engine mounting plate 19. The engines are connected by way of clutch and or transmission assemblies located within the transmission housing 22, to a timing belt and gear drive assembly, also referred to herein as the upper drive assembly and lower driven assembly, located within the elongated vertical housing 24, to which is connected the output drive shaft assembly located within the shaft housing 26 as previously discussed in at least our prior application Ser. No. 10/662,487, the disclosure of which is incorporated herein by reference. Shaft housing 26 extends in excess of 18 inches beyond vertical housing 24. The upper drive assembly and the lower driven assembly further include respective timing pulleys operatively connected to a timing belt unobstructed or acted upon by other bodies, the pulleys and belt together forming a timing belt drive gear, 104. In this case, the frame assembly 20 and vertical housing 24 are adaptively mounted in a pivotal and rotative manner to the pintle assembly 28. This allows the entire drive assembly 12 to be pivotal about the pin assembly 30 (also referenced herein as the “first pivoting assembly”) located at the base of the pintle assembly 28 further disclosed in FIG. 10. This pivoting motion also allows the angle “Φ” of the drive assembly 12 to be increased relative to the pintle assembly 28 as shown in FIGS. 1 and 2, thus placing the propeller 32 below hull level 34, while still allowing the drive assembly 12 to be rotated about the central axis 36 of the pintle assemble 28. In addition the pintle assembly 28 can still be pivoted upwards positioning the propeller clear of the water 38 or at selected positions established by the pull pin 39 relative to the transom 16 as shown in FIG. 3.",
        "As seen in FIG. 4, and in greater detail in FIG. 10, the lower pintle pin assembly 30 utilizes a pivot block 40 secured to the pintle assembly 28, in a rotative manner about the rod 42 and is pivotally attached to the vertical housing 24 by a pair of clevis pad eyes 44 and a pivoting pin 46 passing through the pad eyes 44 and the block 40.",
        "As shown in FIG. 5 and in more detail in FIGS. 9 and 10a an upper pintle block 48 is secured to the pintle assembly 28 in a rotative manner about and by the rod 42. The upper block 48 further includes the spreader plate 50 secured within the frame 20 by a pin 52 extending through slots 54 on each side of the frame 20 thus allowing the frame 20 to be pivotal relative to the pintle assembly 28.",
        "As shown in FIG. 10 the pintle assembly 28 (also referenced herein as the “pivotal assembly”) further includes a second pivoting assembly formed by the pintle sleeve assembly 51 that is pivotally connected to the transom bracket 14 and rotational about pintle pivot pin 55 secured by a fastener such as a nut 57. Further, the spreader plate 50 is pivotally secured to the pintle block 69 by a set of studs 59 when used with the manual positioner assembly 70 shown in FIGS. 8 and 9. However, an upper pintle block 48 is used in combination with rod clevis 67 pin 73 as seen in FIG. 10a when used with the linear actuator assembly 58 seen in FIG. 5.",
        "Generally, over the transom mud boat drive units are positioned by utilizing the extended handle 56 seen in FIGS. 1, 2 and 3. However, for safety and convenience the ability to pivot the handle as shown in FIG. 3 is a distinct advantage. However, to achieve this an alternative method must be provided for pivotally positioning the drive assembly 12 in the vertical plane while using the handle for positioning in the horizontal plane. Two possible methods are illustrated herein.",
        "The first being a linear actuator assembly 58 seen in FIGS. 1, 2, 3, 4, and 5. The actuator assembly 58 is essentially comprised of an electric motor 60 a gear reducer 62 and a linear positioner 64 as shown in FIG. 5 and better seen in detail in FIG. 10. In this arrangement, the base 66 of the actuator assembly 58 is fixed to the frame 20 while the rod 68 and its rod eye 67 member of the linear positioner 64 is pivotally attached to the pin 52.",
        "As illustrated in FIG. 1 the linear actuator assembly 58, when extended positions the drive shaft housing 26 in a neutral plane whereby the shaft housing is virtually perpendicular to the transom 16. Retraction of the positioner 64 pivots the shaft housing in a negative direction thus forcing the drive shaft 26 and propeller 32 below the bottom hull level 34 as shown in FIG. 2.",
        "The second positioner being a manual operated locking assembly 70 as shown in FIG. 6, FIG. 7, and FIG. 8 and in detail in FIG. 9. Looking first at FIG. 9 we see that the manually operated locking assembly 70 is simply a lever or handle passing through the frame assembly 20, with a ball 72 at one end and rotatably mounted at the opposite end 74 to the spreader bar pin 52 passing though the frame 20 and spreader plate 50 in a relatively loose manner. A spring 76 provides tension on the handle assembly 70 to insure indentation locking between the series of notches 78 adjacent the ball 72 and an edge of the frame 20.",
        "Looking back at FIG. 6 we see that laterally moving the handle assembly 70 away from the spring 76 releases the frame 20 by moving the notches 78 in the handle away from the frame 20. Therefore; by manually lifting the throttle handle 56 while holding the positioning handle 70 the drive assembly 12 can be easily tilted to a new position as shown in FIG. 7.",
        "As shown in FIG. 11 the overall length of the drive assembly 12 is considerably shorter than that of other drives used for this purpose and has a much smaller turning radius than that used by other mud boat drives.",
        "It is the dual pivoting provided by a first pivoting assembly at point 63 and the second pivoting assembly at point 61 as again shown in FIGS. 12 and 13 that provides the mounting bracket 14 with dual articulation of the drive 12 and thus allows the propeller 32 to be positioned in both a positive and negative draft angle by positioning the elongated drive housing either positively or negatively beyond vertical relative to the mounting bracket in the vertical plane.",
        "The pivotal handle 56 provides steering and throttle control for the engine assembly 18 and further utilizes a unique locking mechanism 80 that allows the handle to be locked in the down position as shown in FIGS. 1 and 2 and be tilted upwards as shown in FIG. 3.",
        "Generally, the propeller 32 is secured to the drive shaft assembly 12 as shown and discussed previously. However, in some cases it has been found that allowing the propeller to slip or shear a pin in the conventional manner to prevent damage to the propeller and or damage to the drive shaft is not acceptable when the propeller is required to engage solid materials such as mud and grass. As illustrated in FIG. 14 and FIG. 15 a more solid connection is recommended. As seen in FIG. 14 the shaft 81 may be modified as shown in FIG. 15 by utilizing a hexagonal shape 82 corresponding to a hexagonal hub located within the propeller 32. This prevents any possibility of shearing as a result of an encounter with immovable objects. However, the lower rutter fin 84 seen in FIG. 14 tends to keep such encounters to a minimum.",
        "Another important aspect of the air-cooled engine outboard drive assembly 12 is shown in FIG. 16. It has been found that in some cases it is advantageous not to use a transmission and simply utilize the high speed of the engine in a 1:1 ratio. However, this precludes the ability to reverse the drive. To still provide reverse capability, a clutch 100 is installed in the driveline between the engine output shaft 102 and the timing belt drive gear 104. A D.C. voltage drive motor 106 is then mounted externally to the drive belt housing 24 with a gear 108 meshing with the belt drive gear 104. This arrangement allows the belt drive gear 104 to be put into a neutral state when the clutch 100 is in engaged thus allowing the drive motor 106 to turn the belt drive in either direction as needed.",
        "Because many varying and different embodiments may be made within the scope of the inventive concept herein taught, and because many modifications may be made in the embodiments herein detailed in accordance with the descriptive requirement of the law, it is to be understood that the details herein are to be interpreted as illustrative and not in any limiting sense."
    ],
    "citations": [
        "941827",
        "1789415",
        "1953599",
        "2096223",
        "2096457",
        "2475115",
        "2722193",
        "2856883",
        "2996035",
        "3269351",
        "3269357",
        "3752111",
        "D259119",
        "D259488",
        "4645463",
        "4726796",
        "4869692",
        "4992066",
        "5032094",
        "5178566",
        "5336119",
        "5415576",
        "5435763",
        "5722866",
        "5989085",
        "6183320",
        "6302750",
        "6361388",
        "6468120",
        "6682374",
        "7048600",
        "7052340",
        "4368295",
        "5039088"
    ],
    "us_classification": "440 75",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "63",
            "subclass": "H",
            "main_group": "20",
            "subgroup": "14"
        }
    ]
}