{
    "title": "Compensation methods and systems for imaging detectors",
    "abstract": "Imaging arrays typically include thousands or millions of photodetectors that convert sensed light into corresponding electric signals, which are ultimately converted into digital image signals for recording or viewing. One problem with conventional imaging arrays concerns faulty photodetectors, which produce erroneous image signals that ultimately degrade the quality of resulting images. Accordingly, the present inventors devised new imaging arrays including redundant photodetectors to compensate for faulty ones. One exemplary embodiment includes photodetectors that are substantially smaller than conventional photodetectors and that are arranged into two or more groups, with the photodetectors in each group coupled to produce a single group image signal. If the group image signal for a group falls below some threshold level indicative of a defective or malfunctioning photodetector, the group image signal is amplified to compensate for the loss.",
    "inventors": [
        "McElroy",
        "Cloud"
    ],
    "document_number": "07297915",
    "publication_date": "20071120",
    "assignees": [
        "Micron Technology, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for compensating for defective or malfunctioning photodetectors in an imaging array, comprising:",
            "components": [
                {
                    "component": "aggregating N image signals from N image pixels to define an aggregate image signal, wherein N is two or more;",
                    "subcomponents": []
                },
                {
                    "component": "comparing the aggregate image signal to a reference to determine a number M of non-defective image pixels of the N image pixels; and",
                    "subcomponents": []
                },
                {
                    "component": "amplifying the aggregate image signal based on results of comparing the aggregate image signal to the reference, such that the amplifying is proportional to N/M.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 wherein the reference is a factory test image.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , wherein aggregating N image signals from N image pixels includes aggregating the N image signals from N photodiode-type sensor pixels.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 3 , wherein aggregating the N image signals from N photodiode-type sensor pixels includes coupling the N image signals to an analog-to-digital converter.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 , wherein aggregating N image signals from N image pixels includes aggregating with N equal to 4.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein comparing the aggregate image signal to a reference and amplifying the aggregate image signal includes using an automatic gain control coupled to a signal path of the aggregate image signal.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A method comprising:",
            "components": [
                {
                    "component": "aggregating N image signals from N image pixels to define an aggregate image signal, wherein N is two or more; and",
                    "subcomponents": []
                },
                {
                    "component": "determining a number M of non-defective image pixels of the N image pixels based on the aggregate image signal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 7 , wherein aggregating N image signals from N image pixels includes aggregating the N image signals from N photodiode-type sensor pixels.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 7 , wherein aggregating N image signals from N image pixels includes aggregating with N equal to 4.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A method comprising:",
            "components": [
                {
                    "component": "aggregating N image signals from N image pixels to define an aggregate image signal, wherein N is two or more;",
                    "subcomponents": []
                },
                {
                    "component": "determining a number M of non-defective image pixels of the N image pixels based on the aggregate image signal; and",
                    "subcomponents": []
                },
                {
                    "component": "amplifying the aggregate image signal based on the determined number of defective or non-defective pixels, such that the amplifying is proportional to N/M.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 10 , wherein aggregating N image signals from N image pixels includes aggregating the N image signals from N photodiode-type sensor pixels.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 10 , wherein aggregating N image signals from N image pixels includes aggregating with N equal to 4.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 10 , wherein amplifying the aggregate image signal includes applying an automatic gain control to an amplifier that amplifies the aggregate image signal.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. An image system comprising:",
            "components": [
                {
                    "component": "means for aggregating N image signals from N image pixels to define an aggregate image signal, wherein N is two or more;",
                    "subcomponents": []
                },
                {
                    "component": "means for determining a number M of non-defective image pixels of the N image pixels based on the aggregate image signal; and",
                    "subcomponents": []
                },
                {
                    "component": "means for amplifying the aggregate image signal based on the determined number of defective or non-defective pixels, such that the amplifying is proportional to N/M.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. An image system comprising:",
            "components": [
                {
                    "component": "means for aggregating N image signals from N image pixels to define an aggregate image signal, wherein N is two or more; and",
                    "subcomponents": []
                },
                {
                    "component": "means for determining a number M of non-defective image pixels of the N image pixels based on the aggregate image signal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. An image system comprising:",
            "components": [
                {
                    "component": "means for aggregating N image signals from N image pixels to define an aggregate image signal, wherein N is two or more;",
                    "subcomponents": []
                },
                {
                    "component": "means for comparing the aggregate image signal to a reference to determine a number M of non-defective image pixels of the N image pixels; and",
                    "subcomponents": []
                },
                {
                    "component": "means for amplifying the aggregate image signal based on results of comparing the aggregate image signal to the reference, such that the amplifying is proportional to N/M.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The image system of claim 16 wherein the reference is a factory test image.",
            "components": []
        }
    ],
    "description": [
        "This application is a Divisional of U.S. application Ser. No. 09/650,551, now U.S. Pat. No. 6,756,576, which was filed Aug. 30, 2000 and which is incorporated herein by reference.",
        "The present invention concerns imaging arrays and methods, particularly methods for correcting or compensating for defective or malfunctioning photodetectors in an imaging array.",
        "Imaging arrays are electronic devices that sense light and output electrical signals representative of the sensed light. The imaging arrays are generally coupled to a television screen, computer monitor, or digital camera, which displays or records an image based on the output electrical signals.",
        "An imaging array often includes a rectangular array or matrix of thousands or even millions of photodetectors, with each photodetector having a unique row and column position within the array which corresponds to a particular region, known as a pixel, of a displayed image. Each photodetector (or sensor pixel) converts sensed light into corresponding electric signals based on the intensity of the light. The electrical signals are converted into digital signals, comprising ones and zeros, which are processed by a digital-signal-processing circuit. This circuit ultimately outputs image signals to a device for recording or viewing.",
        "One problem with conventional imaging arrays concerns defective or malfunctioning photodetectors. Defective photodetectors typically result in erroneous image signals that ultimately degrade the quality of resulting images. For example, an image based on imaging signals from an imaging array having a defective photodetector can have a black or dark area at the image region corresponding to the defective photodetector.",
        "One limited solution to this problem has been to identify the defective photodetector and to generate a substitute image signal for the image signal of the defective photodetector, with the substitute image signal based on an average of the image signals from detectors surrounding it. See, for example, U.S. Pat. No. 5,854,655 (which is incorporated herein by reference). However, this solution suffers from the disadvantage that the substitute image signal introduces artifacts into the resulting image. The artifacts reflect the complete loss of information about the light actually striking the relatively large area corresponding to the defective photodetector.",
        "Accordingly, there is a need for other methods of handling defective photodetectors.",
        "FIG. 1 is a block diagram of an exemplary imaging array 100 incorporating the invention.",
        "FIG. 2 is a block diagram of an exemplary group-pixel circuit 200 incorporating the present invention.",
        "FIG. 3 is a block diagram of an exemplary pixel circuit 300.",
        "The following detailed description, which references and incorporates FIGS. 1-3, describes and illustrates one or more specific embodiments of the invention. These embodiments, offered not to limit but only to exemplify and teach, are shown and described in sufficient detail to enable those skilled in the art to implement or practice the invention. Thus, where appropriate to avoid obscuring the invention, the description may omit certain information known to those of skill in the art.",
        "The present inventor devised new imaging arrays and related methods for compensating for defective photodetectors. One exemplary embodiment of a new imaging array includes two or more group photodetectors, or “group pixels,” with each group pixel having two or more photodetectors coupled to produce a single group image signal. If the group image signal for a group pixel falls below some threshold level indicative of a defective or malfunctioning photodetector, the group image signal is amplified to compensate for the loss.",
        "Various embodiments implement the photodetectors as passive or active photodiode circuits, as photogate circuits, as logarithmic sensor pixel circuits, or as charge-modulation devices. Some embodiments also implement the photodetectors as smaller-than-conventional photodetectors, that is, photodetectors having photo-sensing elements smaller than conventional elements.",
        "FIG. 1 shows an exemplary imaging array 100 incorporating teachings of the present invention. Imaging array 100 includes group pixels 110, 112, 114, and 116, an address line 120, a drain line 130, a reset line 140, and a signal line 150. for controlling the group pixels. (For clarity, the figure omits conventional features, such as row-select logic, column-select logic, timing-and-control circuitry, and analog-to-digital converters.) In the exemplary embodiment, array 100 includes four group pixels; however, other embodiments include 256×256 arrays, 512×512 arrays, 1024×1024 arrays. Still larger arrays are also within the scope of the invention.",
        "Each of group pixels 110-116 includes two or more photodetectors, or sensor pixels. Group pixel 110 includes sensor pixels 110a, 110b, 110c, and 110d, and group pixels 112, 114, and 116 include respective sensor pixels 112a-112d, 114a-114d, and 116a-116d. Lines 120, 130, and 140, in the exemplary embodiment, control the group pixel in accord with known techniques for addressing and controlling conventional sensor pixels in imaging arrays. In some embodiments, each group pixels provides a particular output color, such as red, blue, or green.",
        "FIG. 2 shows a block diagram of an exemplary group-pixel circuit 200 applicable to each of group pixels 110-116 in FIG. 1. Circuit 200 includes N sensor pixels, of which sensor pixels 202, 204, 206, and 208 are representative, a summer 210, a variable-gain amplifier 212, and an automatic gain controller 214. The N pixels 202-206, which operate according to known principles, are coupled to an input of summer 208, either through direct connection or through a multiplexer (not shown). Some embodiments include one or more analog-to-digital converters coupled between the signal lines of the pixels and the summer, depending on whether summer 210 is analog or digital.",
        "Summer 210 aggregates the N responses of the N pixels 202-206 and outputs a first aggregate or group image signal to amplifier 212. (Some embodiments include an analog-to-digital converter 211 between the summer and the amplifier.) Amplifier 212, which in some embodiments is analog and in others is digital, amplifies or scales the first group image signal and outputs a second group image signal to automatic gain controller 214 as well as to conventional imaging processing and display circuitry (not shown.) See U.S. Pat. No. 5,854,655, which is incorporated herein by reference.",
        "Automatic gain controller 214, which is analog or digital, compares the second group image signal to an analog or digital reference current or voltage. If the comparison 215 indicates that the second group image signal differs from the reference 217, controller 212 proportionately changes, that is, increases or decreases, the gain of amplifier 210, assuming that one or more of the N pixels or related interconnective circuitry is faulty. In the exemplary embodiment, gain controller 214 sets the gain to a factor proportional to the ratio of N, the number of pixels comprising the group pixel to M, the number of correctly operating or non-faulty pixels in the group pixel.",
        "To determine the number of non-faulty pixels, some embodiments, check the performance of each pixel in each group pixel as a start-up diagnostic test and maintain a record of the number of faulty or non-faulty pixels in each group pixel. Other embodiments dynamically or periodically determine a difference between the first aggregate image signal and a reference, and then determine from the difference how many pixels are faulty. The reference in some embodiments is based on a factory test image.",
        "FIG. 3 shows an exemplary sensor pixel circuit 300 applicable to each of the pixels in FIGS. 1 and 2. Circuit 300, a photodiode-type active sensor pixel circuit, includes photodiode 310, a source-follower field-effect transistor SF, a row-select field-effect transistor SL, and a charge-reset field-effect transistor RS. (An n-channel load transistor for source-follower transistor SF is not shown.) Each field-effect transistor has respective gate, drain, and source nodes. The circuit further includes an address line 320, a drain line 330, a reset line 340, and a signal line 350.",
        "In operation, a voltage develops across photodiode 310 based on incident light. Application of appropriate control signals on the gate of transistor SL produces an image signal on signal line 350 based on the voltage across the photodiode. Signal line 350 couples the image signal to an input node of an analog-to-digital converter or summer, such as summer 210 in FIG. 2.",
        "Various embodiments implement the photodetectors as passive or active photodiode circuits, as photogate circuits, as logarithmic sensor pixel circuits, or as charge-modulation devices. (See, for example, Eric R. Fossum, CMOS Image Sensors: Electronic Camera-On-A-Chip, 1995 International Electron Devices Meeting Digest of Technical Papers, which is incorporated herein by reference.) Some embodiments each photodetector occupies a surface area less than 30 square microns, such as 15 or 25 square microns. Some of these embodiments have a fill factor greater than 30 percent. Thus, the present invention is not limited to any particular photodetector circuit or class of photodetector circuits.",
        "In furtherance of the art, the iventors have presented new imaging arrays and related methods for compensating for defective photodetectors. One exemplary embodiment of a new imaging array includes one or more group pixel circuits, each of which comprises two or more photodetectors that are substantially smaller than conventional photodetectors, for example about 15 or 25 square microns. Each group pixel circuit produces a single group image signal. The group image signal is then scaled or amplified to compensate for defective or malfunctioning photodetectors.",
        "The embodiments described above are intended only to illustrate and teach one or more ways of practicing or implementing the present invention, not to restrict its breadth or scope. The scope of the invention intended to encompass all ways of practicing or implementing the principles of the invention, is defined only by the following claims and their equivalents."
    ],
    "citations": [
        "3906389",
        "4481539",
        "4589028",
        "5291293",
        "5635700",
        "5854655",
        "5995675",
        "6133563",
        "6163619",
        "6184752",
        "6201234",
        "6219468",
        "RE37282",
        "6756576",
        "6806902",
        "7129457",
        "05-091419"
    ],
    "us_classification": "2502081",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "L",
            "main_group": "27",
            "subgroup": "00"
        }
    ]
}