{
    "title": "Fluid analysis apparatus",
    "abstract": "A fluid analysis apparatus for containing and analyzing a fluid sample includes a cell body assembly having a plurality of distinct portions in fluid communication with one another and with the distinct portions being hydraulically sealed to one another through the use of one or more resilient gaskets interposed between adjacent ones of the plurality of distinct portions of the cell body assembly. The one or more resilient gaskets enable both hydraulic sealing of adjacent distinct portions, as well as fluid coupling and routing through the fluid analysis apparatus.",
    "inventors": [
        "Gerner",
        "Sims",
        "Thompson"
    ],
    "document_number": "07298472",
    "publication_date": "20071120",
    "assignees": [
        "Rheodyne, LLC"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A fluid analysis apparatus for containing and analyzing a fluid sample, said fluid analysis apparatus comprising:",
            "components": [
                {
                    "component": "a cell body assembly having first and second distinct portions in fluid communication with one another, each of said first and second portions having respective first and second ends, with respective first ends of said first and second portions being operably disposed in spaced facing relationship with one another, said first portion including a fluid sample inlet bore, a first fluid sample outlet bore, and a radiant energy inlet bore, and said second portion including a fluid sample analysis chamber in axial operable alignment with said radiant energy inlet bore of said first portion, and a second fluid sample outlet bore in operable alignment with said first fluid sample outlet bore; and",
                    "subcomponents": []
                },
                {
                    "component": "a first resilient gasket interposed between said first ends of said first and second portions, said first resilient gasket including a first radiant energy aperture in operable alignment with said radiant energy inlet bore of said first portion and said fluid sample analysis chamber of said second portion, a second fluid sample outlet aperture in operable alignment with respective said first and second fluid sample outlet bores of said first and second portions, and a fluid sample transfer groove extending from a fluid sample inlet portion of said first resilient gasket that is in axial operable alignment with said fluid sample inlet bore of said first portion to said first radiant energy aperture.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A fluid analysis apparatus as in claim 1 wherein said first and second portions of said cell body assembly are axially aligned with one another.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A fluid analysis apparatus as in claim 1 , including a first radiant energy transmitting member disposed in said radiant energy inlet bore of said first portion.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A fluid analysis apparatus as in claim 1 wherein said fluid sample analysis chamber includes an open bore axially extending through said second portion from said first end to said second end thereof, and a radiant energy guiding member disposed in said bore radially about a central axis thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A fluid analysis apparatus as in claim 4 wherein said radiant energy guiding member has an index of refraction less than that of the fluid sample.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A fluid analysis apparatus as in claim 1 , including a unitary fluid sample outlet tube extending through said second fluid sample outlet bore and said first fluid sample outlet bore from said second end of said second portion to said second end of said first portion.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A fluid analysis apparatus as in claim 1 , including a third portion operably disposed adjacent to said second end of said second portion, said third portion being spaced from said second end of said second portion by a second resilient gasket interposed therebetween.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A fluid analysis apparatus as in claim 7 wherein said second resilient gasket includes a first radiant energy aperture in operable alignment with said fluid sample analysis chamber, and a second fluid sample outlet aperture in operable alignment with said second fluid sample outlet bore of said second portion, such that said fluid sample exiting said fluid sample analysis chamber is directed out from said cell assembly through said second fluid sample outlet aperture in said second resilient gasket, and through said fluid sample outlet tube.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A fluid analysis apparatus as in claim 7 wherein said third portion includes a radiant energy outlet bore in operable alignment with said fluid sample analysis chamber, and a second radiant energy transmitting member disposed in said radiant energy outlet bore of said third portion.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A fluid analysis apparatus as in claim 1 wherein said fluid sample transfer groove extends only partially through a thickness dimension of said first resilient gasket.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A fluid analysis apparatus as in claim 1 wherein said second fluid sample outlet aperture is at least about 0.010 inches in diameter.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A fluid analysis apparatus for containing and analyzing a fluid sample, said fluid analysis apparatus comprising:",
            "components": [
                {
                    "component": "a cell body assembly having first and second distinct portions in fluid communication with one another, each of said first and second portions having respective first and second ends, with respective first ends of said first and second portions being operably disposed in adjacent facing relationship with one another, said first and second portions being fabricated from a first metallic material;",
                    "subcomponents": []
                },
                {
                    "component": "a first compliant gasket interposed between said first and second portions in order to provide a hydraulic seal therebetween, said first compliant gasket being selected from Kapton® or coated metal substrates, with such coated metal substrates having coating materials selected from the group consisting of PTFE and fluorourethane;",
                    "subcomponents": []
                },
                {
                    "component": "an outer housing disposed at least partially about said cell body assembly and having a base portion disposed adjacent to and in facing relationship with said second end of said second portion; and",
                    "subcomponents": []
                },
                {
                    "component": "a second compliant gasket interposed between said second portion and said base portion in order to provide a hydraulic seal therebetween.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A fluid analysis apparatus as in claim 12 wherein said second compliant gasket is selected from Kapton® or coated metal substrates, with such coated metal substrates having coating materials selected from the group consisting of PTFE and fluorourethane.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A fluid analysis apparatus for containing and analyzing a fluid sample, said fluid analysis apparatus comprising:",
            "components": [
                {
                    "component": "a cell body assembly having first, second, and third distinct portions in fluid communication with one another, with a first end of said first portion being in spaced facing relationship with a first end of said second portion, and a first end of said third portion being in spaced facing relationship with a second end of said second portion, said first portion including a fluid sample inlet bore and a radiant energy inlet bore, said second portion including a fluid sample analysis chamber in axial operable alignment with said radiant energy inlet bore of said first portion, and said third portion including a radiant energy outlet bore in axial operable alignment with said fluid sample analysis chamber of said second portion and a fluid sample outlet bore;",
                    "subcomponents": []
                },
                {
                    "component": "a first resilient gasket interposed between said first ends of said first and second portions, said first resilient gasket including a first radiant energy aperture in operable alignment with said radiant energy inlet bore of said first portion and said fluid sample analysis chamber of said second portion, and a fluid sample transfer groove extending from a fluid sample inlet portion of said resilient gasket that is in operable alignment with said fluid sample inlet bore of said first portion to said first radiant energy aperture; and",
                    "subcomponents": []
                },
                {
                    "component": "a second resilient gasket interposed between said first end of said third portion and said second end of said second portion, said second resilient gasket including a first radiant energy aperture in operable alignment with said radiant energy outlet bore of said third portion and said fluid sample analysis chamber of said second portion, and a fluid sample transfer groove extending from a fluid sample outlet portion of said second resilient gasket that is in operable alignment with said fluid sample outlet bore of said third portion to said first radiant energy aperture.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A fluid analysis apparatus as in claim 14 wherein said first, second, and third portions of said cell body assembly are axially aligned with one another.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A fluid analysis apparatus as in claim 14 , including a first radiant energy transmitting member disposed in said radiant energy inlet bore of said first portion, and a second radiant energy transmitting member disposed in said radiant energy outlet bore of said third portion.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. A fluid analysis apparatus as in claim 14 wherein said fluid sample analysis chamber includes an open bore axially extending through said second portion from said first end to said second end thereof, and a radiant energy guiding member disposed in said bore radially about a central axis thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. A fluid analysis apparatus as in claim 17 wherein said radiant energy guiding member has an index of refraction less than that of the fluid sample.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. A fluid analysis apparatus as in claim 14 wherein said fluid sample transfer grooves of said first and second resilient gaskets extend only partially through a thickness dimension thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. A fluid analysis apparatus for containing and analyzing a fluid sample, said fluid analysis apparatus comprising:",
            "components": [
                {
                    "component": "a cell body assembly having first and second distinct portions in fluid communication with one another, each of said first and second portions having respective first and second ends, with respective first ends of said first and second portions being disposed in adjacently spaced facing relationship with one another, said first portion having a radiant energy inlet bore, and said second portion including a fluid sample analysis chamber in axial operable alignment with said radiant energy inlet bore; and",
                    "subcomponents": []
                },
                {
                    "component": "a first resilient gasket interposed between respective first ends of said first and second portions in order to provide a hydraulic seal therebetween, said first resilient gasket including a first radiant energy aperture in operable alignment with said radiant energy inlet bore of said first portion and said fluid sample analysis chamber of said second portion, such that radiant energy and said fluid sample are concurrently operably disposed within a transfer zone defined by a length and inner diameter of said first radiant energy aperture, said length of said first radiant energy aperture being defined by a predetermined thickness dimension of said first resilient gasket, said thickness dimension being calibrated so that radiant energy losses through said cell body assembly may be standardized among various fluid samples having distinct indexes of refraction.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "The present invention relates to fluid analysis assemblies generally, and more particularly to apparatus for analyzing fluids in analytical chemistry applications such as flow cells for use in spectrophotometry. This invention also relates to methods for fabricating such apparatus.",
        "A variety of fluid analysis cell assemblies have been designed and implemented for use in analyzing fluid samples, particularly in analytical chemistry applications. Such fluid cell assemblies may be constructed to statically hold a pre-designated volume of fluid to be analyzed, or may instead be configured as a flow cell, which are typically used to transport fluid samples through an analysis chamber.",
        "In flow cell arrangements, fluid samples are typically transported through a chamber disposed between a radiant energy source and a radiant energy detector, which detector measures the relevant radiant energy wavelength absorption or transmission through the fluid sample. An example of such a detector is a spectrophotometer. Various analytical instruments then utilize the absorbed versus transmitted radiant energy to determine the composition of the associated fluid sample.",
        "To efficiently pass the radiant energy through the fluid sample in the analysis chamber, however, the wall defining the fluid-containing chamber is preferably a material having an index of refraction that is less than that of the fluid sample. Such an index of refraction relationship between the fluid sample and the analysis chamber wall assists in internally reflecting, and thereby propagating the radiant energy waves through the fluid sample analysis chamber. Description of this phenomenon is found in U.S. Pat. Nos. 6,678,051 and 6,734,961, which are assigned to the same assignee in the present application, and which are herein incorporated by reference.",
        "In order to best utilize aqueous fluid samples, therefore, a material having an index of refraction less than that of water is needed to at least form a liner of the fluid analysis chamber wall. One such material is a fluorinated polymer product sold by E.I. du Pont de Nemours and Company of Wilmington, Delaware under the trade name Teflon AF®. It is therefore a desired aspect of the fluid analysis cells of the present invention to incorporate a layer of Teflon AF® or other low index of refraction material therewithin to allow efficient radiant energy propagation in spectrophotometry applications.",
        "While various such fluid sample analysis cells and assemblies are currently utilized in the field, certain operational and implementational deficiencies exist. For example, multi-unit flow cell assemblies have found difficulty in being hydraulically sealed to one another when relatively rigid materials such as stainless steel are desired in the fabrication of the bulk cell body parts. In addition, methods for installing radiant energy guiding elements into such flow cells, and particularly those manufactured from stainless steel, have been met with limited success, or are relatively inefficient and expensive to implement.",
        "It is therefore a principal object of the present invention to provide an improved fluid sample analysis apparatus having design features enabling the use of a plurality of distinct metallic cell bodies in fluid connection and hydraulically sealed with one another.",
        "It is another object of the present invention to provide an assembly methodology for installing a radiant energy guiding member into a fluid analysis cell body.",
        "It is a further object of the present invention to provide an outer housing for frictionally securing a multi-unit flow cell assembly in axial alignment therewithin.",
        "By means of the present invention, an improved fluid sample analysis apparatus is provided for simplifying construction and enhancing the reliability of mounting accuracy of radiant energy guiding members therewithin. Such enhanced accuracy and repeatability of fluid analysis cell construction correspondingly enhances the accuracy achievable in spectrophotometry of fluid samples being analyzed within such cells.",
        "In a particular embodiment, the fluid analysis apparatus of the present invention includes a cell body assembly having first and second distinct portions in fluid and optical communication with one another, with each of the first and second portions having respective first ends being operably disposed in adjacent facing relationship with one another. In order to enable hydraulic sealing between such distinct first and second portions, a first resilient gasket is interposed therebetween, and preferably is fabricated from a resilient combination of Kapton® or a coated metal substrate, with such metal substrates having a coating material selected from PTFE, fluorourethane, and combinations thereof.",
        "The first resilient gasket preferably includes a first radiant energy aperture that is in operable alignment with a radiant energy inlet of the first portion and a fluid sample analysis chamber of the second portion. The gasket further includes a second fluid sample outlet aperture that is in operable alignment with respective first and second fluid sample outlets of the first and second portions. Additionally, the gasket includes a fluid sample transfer groove extending from a fluid sample inlet portion of the gasket that is in operable alignment with a fluid sample inlet of the first portion to the first radiant energy aperture.",
        "In certain embodiments of the invention, and particularly in cell body assembly embodiments which are relatively long as measured along a central longitudinal axis, an outer housing is provided for at least partially enclosing the cell body assembly. The outer housing preferably includes a first base portion and a substantially cylindrical side wall that extends therefrom. The side wall preferably at least partially concentrically encloses the cell body assembly with an inner diameter of the side wall being specifically dimensioned to frictionally engage an outer periphery of the cell body assembly.",
        "FIG. 1 is an assembly cross-sectional view of a fluid analysis apparatus of the present invention;",
        "FIG. 2 is an isolation side cross-sectional view of a portion of the fluid analysis apparatus illustrated in FIG. 1;",
        "FIG. 3 is an isolation side cross-sectional view of a portion of the fluid analysis apparatus illustrated in FIG. 1;",
        "FIG. 4 is an isolation top view of a portion of the fluid analysis apparatus illustrated in FIG. 1;",
        "FIG. 4A is a cross-sectional view of the portion of the fluid analysis apparatus illustrated in FIG. 4, and taken along cutline 4A-4A;",
        "FIG. 4B is a cross-sectional of the portion of the fluid analysis apparatus illustrated in FIG. 4, and taken along cutline 4B-4B;",
        "FIG. 5 is an enlarged cross-sectional view of a portion of the fluid analysis apparatus illustrated in FIG. 1;",
        "FIG. 6 is a schematic cross-sectional view of a portion of the fluid analysis apparatus illustrated in FIG. 1 prior to assembly.",
        "FIG. 7 is an isolation top view of a portion of the fluid analysis apparatus illustrated in FIG. 1;",
        "FIG. 8 is a cross-sectional view of a fluid analysis apparatus of the present invention; and",
        "FIG. 9 is a cross-sectional view of a fluid analysis apparatus of the present invention.",
        "The objects and advantages enumerated above together with other objects, features, and advances represented by the present invention will now be presented in terms of detailed embodiments described with reference to the attached drawing figures which are intended to be representative of various possible configurations of the invention. Other embodiments and aspects of the invention are recognized as being within the grasp of those having ordinary skill in the art.",
        "With reference now to the drawing figures, and first to FIG. 1, a fluid analysis apparatus 10 of the present invention is shown in cross-section, and includes a cell body assembly 12 having first and second portions 15, 16 which are operably disposed in fluid and optical communication with one another. As illustrated in FIG. 1, first and second portions 15, 16 are preferably mutually independent units that are disposed in axially adjacent relationship with one another.",
        "First portion 15 includes a first end 22 and a substantially opposed second surface 24. In addition, second portion 16 includes a first end 32 and a second substantially opposed end 34, with first end 22 of first portion 15 being operably disposed in facing relationship with first end 32 of second portion 16.",
        "As best illustrated in the isolation view of FIG. 2, first portion 15 includes an inlet bore 26, a first outlet bore 28, and a radiant energy inlet bore 30. Inlet tube 42 is preferably disposed within inlet bore 26. Such tube 42 is preferably fabricated from an inert material such as PEEK, PTFE, and the like. Inlet tube 42 extends through an axial length “L1” of first portion 15 so as to direct fluid flowing therewithin to first end 22 of first portion 15.",
        "First outlet bore 28 preferably axially extends through length “L1” of first portion 15. Preferably, outlet tube 44 is a unitary piece of tubing extending from second end 34 of second portion 16 through first portion 15 via first outlet bore 28 and second outlet bore 38. Outlet tube 44 is preferably fabricated from an inert material such as PEEK, PTFE, and the like. Inlet tube 42 is preferably compressively friction fit within inlet bore 26 of first portion 15. Outlet tube 44 is preferably compressively friction fit within first outlet bore 28 at second portion 16, while preferably not being friction fit within first outlet bore 28 at first portion 15. Alternatively, however, the frictional fit of inlet and outlet tubes 42, 44 within respective bores of first and second portions 15, 16 may be enhanced through the utilization of adhesives, spot welds, and the like.",
        "Preferably, a radiant energy transmitting member 31 is operably disposed in radiant energy inlet bore 30 of first portion 15. Radiant energy transmitting member 31 is preferably a substantially transparent element that efficiently propagates radiant energy axially therethrough. Accordingly, radiant energy transmitting member 31 is preferably a fiber optic element secured within bore 30 extending axially through first portion 15 from first end 22 through second end 25. Radiant energy transmitting member 31 is preferably conventionally secured within such bore 30, such as through a friction fit, adhesive securement, combinations thereof, as well as other fixation methods. Radiant energy transmitting member 31 preferably receives radiant energy from a radiant energy source (not shown) and efficiently transmits such radiant energy axially through first portion 15. While a fiber optic element for radiant energy transmitting member 31 is preferred, other radiant energy transmitting materials may be alternatively utilized, as is recognized by those of ordinary skill in the art.",
        "As best illustrated in the isolation view of FIG. 3, second portion 16 preferably includes a second outlet bore 38 that is operably aligned with first outlet bore 28. As such, second outlet bore 38 axially extends through length “L2” of second portion 16. In such a manner, outlet tube 44 axially extends through respective first and second outlet bores 28, 38. In addition, second portion 16 preferably includes a fluid sample analysis chamber 46 which comprises a bore extending axially through second portion 16, and in axial operable alignment with radiant energy inlet bore 30 of first portion 15. In particular, a central axis 47 of fluid sample analysis chamber 46 is preferably substantially coincident with a central axis of the radiant energy inlet bore 30 in first portion 15. As such, radiant energy being transmitted through first portion 15 is delivered to first end 48 of fluid analysis chamber 46.",
        "Preferably, a radiant energy guiding member 52 is axially disposed within the axial bore defining fluid sample analysis chamber 46. As illustrated in FIG. 3, radiant energy guiding member 52 preferably forms a tube radially disposed about central axis 47 of fluid sample analysis chamber 46. In such a manner, radiant energy guiding member 52 concentrically surrounds an axis of radiant energy travel through radiant energy transmitting member 31 and through fluid sample analysis chamber 46, as defined by central axis 47. Radiant energy, therefore, is allowed to enter fluid sample analysis chamber 46 in a zone defined by inner diameter 53 of radiant energy guiding member 52.",
        "As described hereinabove, radiant energy guiding member 52 is preferably fabricated from a material selected for its optical properties, and specifically for radiant energy propagation characteristics. In applications such as those contemplated by the present invention wherein radiant energy is being operably propagated through a fluid field, it is desirable that the material forming the channel wall confining the fluid sample and radiant energy has an index of refraction less than that of the fluid sample being analyzed. Since, in certain applications, the fluid sample being analyzed by the apparatus of the present invention may be aqueous, radiant energy guiding member 52 is preferably fabricated from a material having index of refraction less than that of water. A particularly preferred example of such a material is a fluorinated polymer product manufactured and sold by E.I. du Pont de Nemours and Company under the trade name Teflon AF® 2400. Applicants have determined that a radiant energy guiding member 52 being fabricated from Teflon AF® 2400 provides desired radiant energy propagation characteristics in the apparatus of the present invention. Accordingly, radiant energy guiding member 52 may take the form of a tube radially disposed about central axis 47 and fabricated from Teflon AF® 2400.",
        "In some embodiments of the present invention, radiant energy guiding member 52 is at least partially coaxially contained within a sleeve member 56, which sleeve member 56 assists in centrally aligning radiant energy guiding member 52 within the bore defining fluid sample analysis chamber 46, as well as inserting radiant energy guiding member 52 into fluid sample analysis chamber 46. Preferably, sleeve member 56 is fabricated a relatively resilient polymeric material such as TEFZEL®, FEP, or PTFE. TEFZEL® is available from E.I. du Pont de Nemours and Company of Wilmington, Del.",
        "As noted above, radiant energy guiding member 52 preferably acts to propagate radiant energy through an internal channel defined by inner wall 53 thereof. Materials which are currently commercially available for use in radiant energy guiding member 52 are typically substantially transparent. Thus, radiant energy impinging upon, for example, first end 48 of radiant energy guiding member 52 may pass axially through a sidewall of radiant energy guiding member 52 to second end 50 thereof. The passage of such radiant energy is considered “stray light”, which can detrimentally affect the accuracy of spectrophoresis fluid analysis due to the fact that a certain portion of the radiant energy passing through fluid sample analysis chamber 46 has not passed through the fluid sample being analyzed. Accordingly, it is an important aspect of the fluid sample analysis chamber 46 of the present invention to effectively mask or otherwise prevent radiant energy from passing through fluid sample analysis chamber 46 without first passing through the fluid sample being analyzed. One method of masking such stray light is in fabricating and installing a physical masking element that is placed at first end 48 of fluid sample analysis chamber 46, with such masking element having an aperture disposed therein, and which aperture is operably aligned with the open channel defined by radiant energy guiding member 52, such that radiant energy is not allowed to enter into the sidewall of radiant energy guiding member 52. Another method for effectively preventing the transmission of stray light through fluid sample analysis chamber 46 is to render opaque at least a portion of radiant energy guiding member 52 and sleeve member 56. A method for blocking stray light through the use of an opaque radiant energy guiding member 52 is described in U.S. Pat. No. 6,734,961, which is assigned to the same assignee as in the present invention, and the contents of which are incorporated herein by reference.",
        "With reference back to FIG. 1, fluid analysis apparatus 10 preferably further includes a first resilient gasket 62 interposed between respective first ends 22, 32 of first and second portions 15, 16 of cell body assembly 12. Resilient gasket 62 preferably acts to fluidly couple and hydraulically seal first and second portions 15, 16 to one another. As best illustrated in the isolation top view of FIG. 4, resilient gasket 62 includes a first radiant energy aperture 64 that is mounted in fluid analysis apparatus 10 in operable alignment with radiant energy inlet bore 30 and fluid sample analysis chamber 46, and more particularly in operable alignment with radiant energy transmitting member 31 and the central channel defined by inner wall 53 of radiant energy guiding member 52. As such, radiant energy is allowed to pass through aperture 64 from radiant energy transmitting member 31 to within a channel defined by radiant energy guiding member 52. As described above, a particular aspect of the present invention is to prevent and otherwise mask radiant energy being delivered by radiant energy transmitting member 31 to enter into the sidewall of radiant energy guiding member 52. As such, first radiant energy aperture 64 in resilient gasket 62 may be of a dimensional tolerance allowing for a substantial diametrical match between first radiant energy aperture 64 and the channel defined by radiant energy guiding member 52. In such an embodiment, resilient gasket 62 is preferably fabricated from a substantially opaque material. Since alignment of resilient gasket 62 with fluid analysis apparatus 10 may be difficult where the diametrical size of first radiant energy aperture 64 is substantially equal to the channel defined by radiant energy guiding member 52, certain embodiments of the present invention provide for a first radiant energy aperture 64 having a diameter somewhat greater than the diameter of the channel defined by radiant energy guiding member 52, particularly where radiant energy guiding member 52 is made opaque in accordance with U.S. Pat. No. 6,734,961 referenced above so as not to permit passage of radiant energy through the sidewall of guiding member 52.",
        "Resilient gasket 62 preferably further includes a second fluid sample outlet aperture 66 that is preferably installed in fluid analysis apparatus 10 in operable alignment with respective first and second outlet bores 28, 38 of first and second portions 15, 16. As such, fluid sample outlet tube 44 preferably extends through second fluid sample outlet aperture 66 of first resilient gasket 62. As a consequence of fluid sample outlet tube 44 being unitary, the diametrical dimension of second fluid sample outlet aperture 66 may be larger than the respective diameters of the first and second fluid outlet bores 28, 38. In fact, it is a preferred aspect of the present invention to provide second fluid sample outlet aperture 66 with a diameter substantially greater than first and second outlet bores 28, 38 so as to facilitate placement and alignment of first resilient gasket 62 within fluid analysis apparatus 10. Second fluid sample aperture 66 is preferably at least about 0.010 inches in diameter, and more preferably between about 0.010 and 0.060 inches in diameter.",
        "As illustrated in FIG. 4, first resilient gasket 62 preferably further includes a fluid sample transfer groove 68 extending from a fluid sample inlet portion 70 to first radiant energy aperture 64. Fluid sample inlet portion 70 of first resilient gasket 62 is preferably installed in fluid analysis apparatus 10 in operable alignment with inlet bore 26 of first portion 15, and particularly in alignment with inlet tube 42 extending through inlet bore 26. As a result, fluid sample exiting from inlet tube 42 at first end 22 of first portion 15 is directed toward and to first radiant energy aperture 64 via fluid sample transfer groove 68. Inlet sample fluid then enters into fluid sample analysis chamber 46 through radiant energy aperture 64 of resilient gasket 62.",
        "In preferred embodiments of the present invention, fluid sample transfer groove 68 extends only partially through a thickness dimension of first resilient gasket 62, as illustrated in the cross-sectional end view of FIG. 4A. One purpose for extending groove 68 only partially through thickness dimension “T” of resilient gasket 62 is to maintain the opacity of resilient gasket 62 at all locations except for apertures 64 and 66, such that incoming radiant energy passing from radiant energy transmitting member 31 does not leak into the sidewall of radiant energy guiding member 52. In embodiments utilizing an opaque radiant energy guiding member 52, however, fluid sample transfer groove 68 extends completely through a thickness dimension “T” of first resilient gasket 62. Moreover, fluid sample inlet portion 70 may extend either partially or fully through thickness dimension “T” of first resilient gasket 62 as desired per application.",
        "In particularly preferred embodiments of the present invention, first and second portions 15, 16 of cell body assembly 12 are fabricated from an inert metallic material such as stainless steel. A deficiency in conventional fluid analysis systems that is addressed by the present invention is in the hydraulic sealing of distinct metallic components to one another, such as in the hydraulic sealing of first and second portions 15, 16 of cell body assembly 12. Conventional designs are unable to hydraulically seal metallic components such as first and second portions 15, 16 to one another in order to prevent fluid leakage when operating under relatively high internal fluid pressures. First resilient gasket 62, however, enables the hydraulic sealing of first and second portions 15, 16 to one another to a sufficient degree so as to maintain a hydraulic seal even under relatively high contemplated operating fluid pressures. In a like manner, second resilient gasket 92 enables the hydraulic sealing of second portion 16 to cell window 96. In order to enable such a hydraulic seal, gasket 62 is preferably fabricated from a resilient and compliant material, but which maintains its structural integrity and operational alignment characteristics when press-fit between first and second portions 14, 16. Example materials useful in gaskets 62 and 92 of the present invention include Kapton® or coated metal substrates, such as stainless steel metal substrates coated on one or both major surfaces 71, 72 with a resilient material such as PTFE or fluorourethane. Fluorourethane useful in topical coating applications of gaskets 62, 92 of the present invention are available from 21st Century Coatings of Vancouver, British Columbia, or by direct synthesis as described in “Fluoropolymers 1, Synthesis” by Hougham et al. 1999.",
        "Gasket 62 is preferably about 50 μm in thickness dimension “T”. In embodiments wherein gasket 62 is a coated metal substrate, the metal substrate is about 50 μm thick, while the resilient material coating is between about 1 and 40 μm thick on each major surface 71, 72.",
        "Where first or second gaskets 62, 92 are fabricated from non-opaque materials, or materials that do not render the finished gasket opaque due to the relatively small thickness thereof, radiant energy aperture 64 may preferably include, for example, a metalized coating radially disposed about a circumference thereof. Such a metalized coating preferably radially extends about aperture 64 to an extent sufficient to block stray light entering the sidewall of radiant energy guiding member 52. As such, the metalized coating extends between about 100 and 500 μm beyond an outer circumferential dimension of aperture 64. Alternatively, opaque coatings of non-metallic materials may be disposed about the perimeter of aperture 64. Such opaque coatings, however, are not necessary where radiant energy guiding member 52 includes a radiant energy blocking opaque portion, as described above.",
        "In a particular aspect of the present invention, the thickness dimension “T” of gaskets 62, 92 result in a known transfer zone length 65 of aperture 64 through which the sample fluid and radiant energy concurrently travel. In operation, sample fluid fills aperture 64 throughout transfer zone length 65, thereby resulting in calculatable radiant energy losses as the radiant energy passes through the fluid-filled transfer zone 65 which is absent radiant energy guiding member 52. As a result, radiant energy entering aperture 64 is allowed to disperse throughout the volume defined by transfer zone 65, causing partial diffusion or loss of the radiant energy. Fluids having relatively higher refractive indexes result in a greater degree of radiant energy loss in transfer zone 65 as compared to fluids having relatively lower refractive indexes. This relationship is described in U.S. Pat. No. 6,678,051, which is assigned to the same assignee as in the present application, and is incorporated herein by reference.",
        "Using such a relationship, a fabricator of cell body assembly 12 of the present invention may select an appropriate thickness dimension “T” for one or more of first and second gaskets 62, 92 to thereby define a desired transfer zone dimension 65 which corresponds to a calculatable amount of radiant energy loss in passing through aperture 64. Such a controllable variable allows the fabricator to install one or more gaskets 62, 92 of known thickness dimension “T” that effectively calibrate energy losses through apparatus 10 when utilized in connection with various fluids having different indexes of refraction. In such a manner, radiant energy losses through apparatus 10 may be standardized for use with various fluids by assigning gaskets 62, 92 of appropriate calibrating thickness, “T”.",
        "For example, a relatively high refractive index fluid being operably disposed within aperture 64 is preferably utilized in combination with one or more gaskets, 62, 92 having a relatively smaller thickness dimension “T” to offset the relatively higher degree of radiant energy loss caused by the relatively high refractive index fluid. Correspondingly, a relatively larger thickness dimension “T” for gasket 62, 92 may be employed where a relatively lower refractive index fluid is being utilized in apparatus 10. Through such a methodology, unique gasket combinations may be utilized as appropriate for the respective fluid being operably exposed to the radiant energy transmitted through apparatus 10.",
        "With reference back to FIG. 1, fluid analysis apparatus 10 preferably includes an outer housing 82 having a first base portion 84 and a substantially cylindrical sidewall 86 extending from base portion 84 so as to at least partially concentrically enclose cell body assembly 12 within a boundary defined by the combination of base portion 84 and sidewall 86. Preferably, inner diameter “D1” of sidewall 86 is specifically dimensioned to allow first and second portions 15, 16 to be inserted into the chamber defined by base portion 84 and sidewall 86 with a circumferential clearance of between about 5 and 20 μm. It has been determined by the Applicants that an operational advantage of accurate axial alignment among a plurality of distinct units making up cell body assembly 12 is facilitated through the incorporation of a distinct outer housing unit 82. As such, at least first and second portions 15, 16 are accurately axially aligned with one another simply by installing such first and second portions 15, 16 within the at least partial confines of outer housing 82.",
        "In the past, inefficient manual alignment of multiple distinct parts making up cell body assembly 12 was required in order to insure correct axial alignment among such distinct elements making up cell body assemblies 12. Outer housing 82 of the present invention eliminates this inefficient procedure by preparing a compartment of predetermined dimensions which closely secures cell body 12 therewithin. Such a utility is particularly applicable in cell body assemblies 12 having relatively longer total length “L3” dimensions. Preferably, cell body assembly 12, including nut 14, has a total length “L3” of between about 2 and about 100 mm, with particularly preferred embodiments of cell body assembly 12 being 3, 5, 10, 25, and 75 mm in total length “L3”.",
        "In some embodiments of the present invention, outer housing 82 includes an anti-rotation member 88 disposed in sidewall 86 for operable engagement with a correspondingly-configured notch 79 in first portion 15. Such notch 79, however, may instead be located in second portion 16. Moreover, more than one anti-rotation member/notch combinations may be incorporated into fluid analysis apparatus 10 of the present invention.",
        "As further illustrated in FIG. 1, a second resilient gasket 92 is preferably interposed between second end 34 of second portion 16 and base portion 84 of outer housing 82. Second resilient gasket 92 may preferably be identical to first resilient gasket 62, but with fluid sample inlet portion 70 of first resilient gasket 62 acting as a second fluid sample outlet portion in second resilient gasket 92. Accordingly, fluid sample inlet portion 70 may comprise an aperture extending through thickness dimension “T” for purposes of second resilient gasket 92. As so configured, second fluid sample outlet aperture 70 of second resilient gasket 92 is installed in fluid analysis apparatus 10 in operable alignment with second outlet bore 38 of second portion 16. In such a manner, fluid sample exiting from fluid sample analysis chamber 46 is directed into second outlet bore 38, and particularly into fluid sample outlet tube 44 via second fluid sample outlet aperture 70 in second resilient gasket 92.",
        "Second resilient gasket 92 is preferably provided at second end 34 of second portion 16 so as to provide a hydraulic seal between second portion 16 and a window 96 disposed in base portion 84 of outer housing 82. As is known in the art, window 96 may be fabricated from, for example, fused silica, diamond, sapphire, or other inert materials transparent to the radiant energy wavelength being utilized in apparatus 10, and is utilized to transmit radiant energy exiting from fluid sample analysis chamber 46 to a radiant energy detector (not shown). Second resilient gasket 92 is preferably fabricated from materials as described above with reference to first resilient gasket 62. Moreover, second resilient gasket 92 is preferably oriented such that transfer groove 68 is in operable facing relationship with window 96, thereby reducing fluidically unswept volume.",
        "Preferably, a third gasket 99 is operably disposed between window 96 and base portion 84 to thereby assist in ensuring proper alignment between second surface 34 of second portion 16 and window 96. Third gasket 99 is illustrated in FIG. 7 as having an aperture 101 of a dimension large enough to avoid blockage or interference of radiant energy exiting from window 96 through base portion 84. Third gasket 99 is preferably fabricated from a resilient material that operably compresses between window 96 and base portion 84 when pressure is applied to window 96 from second portion 16 as a result of nut 14 driving first and second portions 15, 16 toward base portion 84. Such a compressible third gasket 99 assists in allowing respective substantially planar surfaces, as between window 96 and second surface 34 of second portion 16 to become-parallely aligned with one another through the axial mounting of second portion 16 against window 96 via the tightening of nut 14 within outer body 82. Most preferably, third gasket 99 is fabricated from a transparent inert material such as FEP, TEFZEL®, or the like.",
        "In the embodiment of second portion 16 illustrated in FIG. 5, a first locking structure 112 is provided at fluid sample analysis chamber 46, and disposed adjacent to first end 48 of fluid sample analysis chamber 46. First locking structure 112 is preferably a design detail of second portion 16 of cell body assembly 12, and is specifically configured to operably and statically secure radiant energy guiding member 52 within fluid sample analysis chamber 46. First locking structure 112 acts to operably inhibit relative motion between the combination of radiant energy guiding member 52 and sleeve member 56 with respect to second portion 16. Such resistance to movement is developed through only the frictional resistance forces developed at the interface between first locking structure 112 and sleeve member 56, due to the fact that sleeve member 56 is securely compressively fit in fluid sample analysis chamber 46 against chamber wall 49. In addition, radiant energy guiding member 52 is frictionally secured to sleeve member 56 through a process described hereinbelow. First locking structure 112, therefore, provides a focal point for generating a relatively large degree of frictional resistance to relative motion between sleeve member 56 and second portion 16, thereby lockably retaining radiant energy guiding member 52 within fluid sample analysis chamber 46.",
        "Preferably, fluid sample analysis chamber 46 includes a first diameter dimension D2 extending through a first length x1 of fluid sample analysis chamber 46 and a second diameter dimension D3 extending through a second length x2 of fluid sample analysis chamber 46. As illustrated in FIG. 5, second diameter dimension D3 is preferably somewhat larger than first diameter dimension D2 by an amount sufficient to provide first locking structure 112 with an adequate focal point of frictional resistance to relative motion between sleeve member 56 and second portion 16. Preferably, second diameter dimension D3 is larger than first diameter dimension D2 by about 0.001 inches, with first diameter dimension D2 being about 0.03 inches. The change in diameter dimension of fluid sample analysis chamber 46 at first locking structure 112 forms a first transition segment 118 that is preferably angularly oriented to chamber wall 49.",
        "As shown in FIG. 5, second portion 16 may additionally include a second locking structure 114 having a second transition segment 120 formed therewith. The embodiment illustrated in FIG. 5 is representative of a variety of configurations for first and second locking structures 112, 114. For example, first and second transition segments 118, 120 may alternatively reflect a different configuration altogether. In addition, second diameter dimension D3 may alternatively be smaller than first diameter dimension D2, or may be alternated among first and second locking structures 112, 114. Furthermore, one or more of such locking structures 112, 114 may be incorporated into the apparatus of present invention while remaining within the scope contemplated by the Applicants. The embodiments shown and described herein merely represent examples of internal alterations in diameter dimension of fluid sample analysis chamber 46 so as to create one or more foci of frictional resistance between sleeve member 56 and chamber wall 49.",
        "A preferred method for securely installing radiant energy guiding member 52 within fluid sample analysis chamber 46 includes a sleeved compression technique that utilizes the resilient nature of sleeve member 56. Sleeve member 56, as described above, is preferably fabricated from a relatively resilient material such as TEFZEL® or the like, and is shaped as a tube having an unstressed outer diameter that is slightly larger than second diameter dimension D3 of fluid sample analysis chamber 46, and an inner diameter dimension that is substantially equal to but slightly larger than an outer diameter of radiant energy guiding member 52. Initially, radiant energy guiding member 52 is inserted into the channel defined by sleeve member 56, as is illustrated in FIG. 6. Sleeve member 56 is preferably initially somewhat longer than radiant energy guiding member 52 so as to provide a location at second end 51 for grasping and pulling sleeve member 56 into and through fluid sample analysis chamber 46.",
        "Sleeve member 56 is preferably operably elongated along direction “Y”, which elongation reduces both the inner and outer diameter of sleeve member 56 so as to be small enough to be fed through fluid sample analysis chamber 46. Such diameter reduction of sleeve member 56 further acts to tightly frictionally engage radiant energy guiding member 52 therewithin. However, the elastic limit of sleeve member 56 should not be exceeded during the installation procedure. Once the combination of sleeve number 56 and radiant energy guiding member 52 are in place within fluid sample analysis chamber 46, the combination is allowed to relax under its inherent resilient restorative forces to thereby frictionally engage and secure sleeve member 56 to chamber wall 49.",
        "To further enhance and assist the physical relaxation of sleeve number 56 and radiant energy guiding member 52 into the configuration illustrated in FIG. 5, one or more thermal treatment cycles are conducted on the installed combination of sleeve member 56 and radiant energy guiding member 52 within second portion 16. A thermal cycle represents elevating the temperature environment surrounding the combination to between about 80 and 100 degrees Celsius for a period of about 10 minutes. Though the ramp up and ramp down rates are not overly critical to the thermal cycle performance, it has been found that a preferred temperature ramp up rate of 10 degrees Celsius per minute, and a ramp down rate of 20 degrees Celsius per minute is preferred. In a particular embodiment of the invention, 4 cycles between ambient temperature and a maximum thermal treatment temperature of about 80 degrees Celsius are preformed on the combination to fully relax sleeve member 56 and radiant energy guiding member 52 into frictional engagement with chamber wall 49 consistent with the configuration illustrated in FIG. 5. Once the thermal cycles are complete, excess material extending out from fluid sample analysis chamber 46 is cleaved using, for example, a microtoming procedure.",
        "When radiant energy guiding member 52 is left as a substantially transparent body, sleeve member 56 may also be manufactured using semitransparent materials, as first gasket 62 is, in such embodiments, is configured to mask all stray light from entering both sleeve member 56 and light guiding member 52. In the circumstance where in radiant energy guiding member 52 is rendered opaque as described above, first gasket 62 need not mask stray light, so long as sleeve member 56 is also fabricated from opaque materials. In embodiments wherein both sleeve member 56 and radiant energy guiding member 52 are opaque to an extent necessary to prevent passage of stray light therethrough, first gasket 62 is merely required to serve as a fluid directing element, a spacing element, and a compliant sealing element between adjacent portions of cell body assembly 12.",
        "In another embodiment of the present invention, and as illustrated in FIG. 8, apparatus 210 includes a cell body assembly 212 operably disposed within outer body 282. Nut 214 is preferably threadably insertable within outer body 282, and operably presses against spring washers 213 in order to tightly install first, second, and third portions 215, 216, 217 within outer body 282. As shown in FIG. 8, cell body assembly 212 includes first portion 215, a second portion 216, and third portion 217. First portion 215 includes an inlet bore 226 in which inlet tubing 242 is operably disposed, but does not incorporate a first outlet bore as described with reference to numeral 28 in first portion 15 of apparatus 10. Instead, third portion 217 includes a fluid outlet bore 229 and outlet tubing 233 for operably enabling the removal of sample fluid from apparatus 210. Due to the inclusion of outlet bore 229 and outlet tubing 233 in third portion 217, second portion 216 preferably does not include an outlet bore disposed therein as described with reference to first outlet bore 38 in apparatus 10.",
        "Third portion 217 preferably further includes a radiant energy outlet bore 281 in which a fiber optic element 282 is operably disposed for transmitting radiant energy from fluid analysis chamber 246 to a radiant energy detector (not shown). In the embodiment illustrated in FIG. 8, therefore, third portion 217 replaces window 96 of apparatus 10 in transmitting radiant energy out from apparatus 210. Furthermore, cell body assembly 212 preferably utilizes first and second resilient gaskets 262, 292 as described above with reference to first and second resilient gaskets 62, 92. However, second resilient gasket 292 is preferably oriented to align transfer groove 268 between fluid analysis chamber 246 and outlet bore 229 of third portion 217, such that fluid exiting fluid analysis chamber 246 is operably directed to outlet tubing 233. A further aspect of the embodiment illustrated in FIG. 8 is that both first and third portions 215, 217 may be manufactured as substantially identically components, and need only be positioned within apparatus 210 in a reverse orientation with respect to one another in order to effectuate input and withdrawal of both fluid sample and radiant energy into and out from cell body assembly 212.",
        "A further embodiment of the present invention is illustrated in FIG. 9, wherein apparatus 310 includes a first portion 315 as described above with reference to first portion 15 of apparatus 10, a second portion 316 configured in accordance with second portion 16 of apparatus 10, and first and second resilient gaskets 362, 392 fabricated and configured in accordance with first and second resilient gaskets 62, 92 of apparatus 10. However, apparatus 310 preferably includes a third portion 317 functionally positioned in place of window 96 of apparatus 10, wherein third portion 317 includes a radiant energy outlet bore 381 having an outlet radiant energy transmitting member 383 disposed therein for operably transmitting radiant energy from fluid analysis chamber 346 to a radiant energy detector (not shown). Third portion 317 is preferably hydraulically sealed to second portion 316 through a compression fit with second resilient gasket 392 disposed therebetween.",
        "With reference back to FIG. 1, cell body assembly 12 is preferably radialy secured in place by outer housing 82. However, the plurality of distinct portions, such as first and second portions 15, 16 of cell body assembly 12 may additionally require fasteners, such as nut 14 for axially coupling first and second distinct portions 15, 16 to one another. Other means of securing respective components of cell body assembly 12 in place include, for example, clamping devices, adhesives, and the like. As is further illustrated in FIG. 1, base portion 84 is preferably operably secured to sidewall 86 of outer housing 82 via screws 128.",
        "The invention has been described herein in considerable detail in order to comply with the patent statutes, and to provide those skilled in the art with the information needed to apply the novel principles and to construct and use embodiments of the invention as required. However, it is to be understood that the invention can be carried out by specifically different devices and that various modifications can be accomplished without departing from the scope of the invention itself."
    ],
    "citations": [
        "3795450",
        "3954341",
        "4009382",
        "4260257",
        "4530569",
        "4571078",
        "4575424",
        "4690436",
        "4754009",
        "4802768",
        "4816123",
        "4867559",
        "4886356",
        "4889611",
        "4973142",
        "4975505",
        "4977025",
        "4999248",
        "5000547",
        "5006382",
        "5061024",
        "5076659",
        "5120129",
        "5140169",
        "5153679",
        "5184192",
        "5267341",
        "5404217",
        "5416879",
        "5444807",
        "5570447",
        "5604587",
        "5608517",
        "5822067",
        "5847835",
        "5854863",
        "5883721",
        "5917606",
        "6011882",
        "6016372",
        "6020207",
        "6188813",
        "6526188",
        "6542231",
        "6678051",
        "6734961"
    ],
    "us_classification": "356246",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "01",
            "subclass": "N",
            "main_group": "1",
            "subgroup": "10"
        }
    ]
}