{
    "title": "Convection oven and related air flow system",
    "abstract": "A convection oven includes a heat exchanger section and a product receiving section, the product receiving section including a door to provide access thereto. An air flow system includes at least one blower and an air flow path for enabling air to circulate from the heat exchanger section where it is heated, into the product receiving section for transferring heat to food products, and back to the heat exchanger section for further heating. The air flow path includes a passage providing flow communication between the heat exchanger section to the product receiving section, where the passage is located proximate to a wall and configured such that heated air from the heat exchanger section is directed along an internally facing surface of the wall so as to attach to and flow along the internally facing surface of the wall from one side of the product receiving section toward an opposite side of the product receiving section.",
    "inventors": [
        "Paller"
    ],
    "document_number": "07297904",
    "publication_date": "20071120",
    "assignees": [
        "Premark FEG LLC"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A rack oven, comprising:",
            "components": [
                {
                    "component": "a heat exchanger section and a rack receiving section, the rack receiving section including a door to provide access thereto; and",
                    "subcomponents": []
                },
                {
                    "component": "an air flow system including at least one blower and an air flow path for enabling air to circulate from the heat exchanger section where it is heated, into the rack receiving section for transferring heat to food products, and back to the heat exchanger section for further heating, wherein the air flow path includes at least one passage from the heat exchanger section to the rack receiving section, where the passage is located proximate to a wall that includes an internally facing surface exposed to a rack receiving location of the rack receiving section and configured such that heated air from the heat exchanger section is directed along the internally facing surface of the wall so as to attach to and flow along the internally facing surface of the wall from one side of the rack receiving section toward an opposite side of the rack receiving section;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the at least one passage comprises at least one vertically extending slot, wherein the vertically extending slot is formed adjacent the internally facing surface of the wall and includes a vane that overlaps with the internally facing surface of the wall;",
                    "subcomponents": []
                },
                {
                    "component": "wherein a distance of overlap of the vane and the internally facing surface of the wall is at least about two inches.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The rack oven of claim 1 wherein a spacing between the wall and the vane is in the range of about 0.25 inches to about 0.75 inches.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The rack oven of claim 1 further comprising an overhead rack rotating mechanism located within the rack receiving section.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The rack oven of claim 1 wherein the heated air from the heat exchanger section attaches to and flows along the internally facing surface of the wall for a travel distance of at least two-thirds of a total distance from the passage to the opposite side of the rack receiving section.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A rack oven, comprising:",
            "components": [
                {
                    "component": "a heat exchanger section and a rack receiving section, the rack receiving section including a door to provide access thereto;",
                    "subcomponents": []
                },
                {
                    "component": "an air flow system including at least one blower and an air flow path for enabling air to circulate from the heat exchanger section where it is heated, into the rack receiving section for transferring heat to food products, and back to the heat exchanger section for further heating, wherein the air flow path includes at least one passage from the heat exchanger section to the rack receiving section, where the passage is located proximate to a wall that includes an internally facing surface exposed to a rack receiving location of the rack receiving section and configured such that heated air from the heat exchanger section is directed along the internally facing surface of the wall so as to attach to and flow along the internally facing surface of the wall from one side of the rack receiving section toward an opposite side of the rack receiving section; and",
                    "subcomponents": []
                },
                {
                    "component": "an air deflector positioned toward the opposite side of the rack receiving section to direct the heated air off of the wall.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A rack oven, comprising:",
            "components": [
                {
                    "component": "a heat exchanger section and a rack receiving section, the rack receiving section including a door to provide access thereto;",
                    "subcomponents": []
                },
                {
                    "component": "an air flow system including at least one blower and an air flow path for enabling air to circulate from the heat exchanger section where it is heated, into the rack receiving section for transferring heat to food products, and back to the heat exchanger section for further heating, wherein the air flow path includes at least one passage from the heat exchanger section to the rack receiving section, where the passage is located proximate to a wall and configured such that heated air from the heat exchanger section is directed along an internally facing surface of the wall so as to attach to and flow along the internally facing surface of the wall from one side of the rack receiving section toward an opposite side of the rack receiving section; and",
                    "subcomponents": []
                },
                {
                    "component": "an air deflector positioned toward the opposite side of the rack receiving section to direct the heated air off of the wall, wherein the deflector comprises at least one adjustable deflector.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The rack oven of claim 6 wherein the deflector comprises a plurality of vertically distributed adjustable deflectors.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A rack oven, comprising:",
            "components": [
                {
                    "component": "a heat exchanger section and a rack receiving section, the rack receiving section including a door to provide access thereto;",
                    "subcomponents": []
                },
                {
                    "component": "an air flow system including at least one blower and an air flow path for enabling air to circulate from the heat exchanger section where it is heated, into the rack receiving section for transferring heat to food products, and back to the heat exchanger section for further heating, wherein the air flow path includes at least one passage from the heat exchanger section to the rack receiving section, where the passage is located proximate to a wall that includes an internally facing surface exposed to a rack receiving location of the rack receiving section and configured such that heated air from the heat exchanger section is directed along the internally facing surface of the wall so as to attach to and flow along the internally facing surface of the wall from one side of the rack receiving section toward an opposite side of the rack receiving section; and",
                    "subcomponents": []
                },
                {
                    "component": "a rack positioned within the rack receiving section, wherein the heated air from the heat exchanger section attaches to and flows along the internally facing surface of the wall and is deflected off of the wall by a deflector onto a portion of the rack spaced away from the passage.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The rack oven of claim 8 wherein the rack is integrated with the oven.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The rack oven of claim 8 wherein the rack comprises a wheeled rack that is capable of movement into and out of the oven.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A convection oven, comprising:",
            "components": [
                {
                    "component": "a heat exchanger section and a product receiving section, the product receiving section including a door to provide access thereto;",
                    "subcomponents": []
                },
                {
                    "component": "an air flow system including at least one blower and an air flow path for enabling air to circulate from the heat exchanger section where it is heated, into the product receiving section for transferring heat to food products, and back to the heat exchanger section for further heating, wherein the air flow path includes at least one passage providing flow communication between the heat exchanger section to the product receiving section, where the passage is located proximate to a wall that includes an internally facing surface exposed to a rack receiving location of the rack receiving section and configured such that heated air from the heat exchanger section is directed along the internally facing surface of the wall so as to attach to and flow along the internally facing surface of the wall from one side of the product receiving section toward an opposite side of the product receiving section; and",
                    "subcomponents": []
                },
                {
                    "component": "an air deflector positioned toward the opposite side of the product receiving section to direct the heated air away from the wall.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A convection oven, comprising:",
            "components": [
                {
                    "component": "a heat exchanger section and a product receiving section, the product receiving section including a door to provide access thereto;",
                    "subcomponents": []
                },
                {
                    "component": "an air flow system including at least one blower and an air flow path for enabling air to circulate from the heat exchanger section where it is heated, into the product receiving section for transferring heat to food products, and back to the heat exchanger section for further heating, wherein the air flow path includes a passage providing flow communication between the heat exchanger section to the product receiving section, where the passage is located proximate to a wall and configured such that heated air from the heat exchanger section is directed along an internally facing surface of the wall so as to attach to and flow along the internally facing surface of the wall from one side of the product receiving section toward an opposite side of the product receiving section; and",
                    "subcomponents": []
                },
                {
                    "component": "an air deflector positioned toward the opposite side of the product receiving section to direct the heated air away from the wall, wherein the deflector comprises at least one adjustable deflector.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The convection oven of claim 12 wherein the deflector comprises a plurality of vertically distributed adjustable deflectors.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. In a convection oven having a circulating air flow between a heat exchanger section and a product receiving section, the heat exchanger section located to one side of the product receiving section, a method comprising the steps of:",
            "components": [
                {
                    "component": "effecting a transfer of heated air from the heat exchanger section to a side of the product receiving section opposite the one side by directing heated air along an internally facing surface of a wall of the product receiving section such that the heated attaches to and flows along the internally facing surface of the wall from the one side to the side opposite the one side, where the internally facing surface of the wall is exposed to a rack receiving location of the rack receiving section; and",
                    "subcomponents": []
                },
                {
                    "component": "directing the heated air away from the wall when the heated air is near the side opposite the one side;",
                    "subcomponents": []
                },
                {
                    "component": "a deflector extends from the wall to direct the heated air off the wall.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. In a convection oven having a circulating air flow between a heat exchanger section and a product receiving section, the heat exchanger section located to one side of the product receiving section, a method comprising the steps of:",
            "components": [
                {
                    "component": "effecting a transfer of heated air from the heat exchanger section to a side of the product receiving section opposite the one side by directing heated air along an internally facing surface of a wall of the product receiving section such that the heated attaches to and flows along an internally facing surface of the wall from the one side to the side opposite the one side; and",
                    "subcomponents": []
                },
                {
                    "component": "directing the heated air away from the wall when the heated air is near the side opposite the one side;",
                    "subcomponents": []
                },
                {
                    "component": "a deflector extends from the wall to direct the heated air off the wall, including the further step of adjusting an orientation of the deflector relative to the wall.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "The present invention relates generally to convection ovens used for baking items such as bread and, more particularly, to a rack type convection oven having a air flow path that extends from an outlet of a heat exchanger area and along an internal wall of the baking chamber toward an opposite side of the baking chamber where it is then directed away from the internal wall.",
        "Rack ovens are generally equipped with a fuel-fed heating element and a fan for moving heated air throughout a baking chamber to provide a rapid distribution of hot air over the food product. Commercial ovens of this type include a baking chamber, which is sized to receive a wheeled rack, or hold an integrated rack, having multiple shelves containing products to be baked; a power driven, rotating mechanism to rotate the product as it is being cooked or baked; a heat exchanger such as one or more gas burners and an exhaust system to eliminate combustion gases or an electrical heating element; and a circulating system for directing hot air along a heated air flow path that passes through the baking chamber. Conventional rack ovens of the type for baking bread also generally include a steam generator for the introduction of steam into the oven for brief periods of time, usually at the beginning of the baking process, to impart a desired appearance to the baked food product.",
        "One embodiment of a convection oven is described in U.S. Pat. No. 5,617,839, where a rack oven includes a heat exchanger comprising a plurality of heat exchange tubes, and a plurality of gas fired in-shot burners, wherein each of the in-shot burners fires into a corresponding heat exchange tube. One or more blowers circulate air past the heat exchange tubes and to the oven baking chamber.",
        "FIGS. 4A and 4B illustrate another PRIOR ART rack oven construction 100 in which a heat exchanger section 102 is positioned alongside the baking chamber 104. The wall 106 separating the baking chamber 104 from the heat exchanger section 102 includes a single, centrally disposed opening 108 having an axial fan 109 positioned therein. The wall 106 also includes louvers 110 towards the sides thereof. The heat exchanger section 102 includes a plurality of horizontally extending, U-shaped exchange tubes 112, with tube segments 120 and 122, are arranged vertically one above the other. When the fan 109 is rotated, air flows from the baking chamber 104, through the opening 108 onto a central section of the heat exchange tubes and then splits in two lateral directions along the heat exchange tubes to be returned to the baking chamber via louvers 110 as best seen by the arrows in FIG. 4A. While the air flow system of the prior art oven of FIGS. 4A and 4B is quite effective, improvements are always sought.",
        "In one aspect, a rack oven includes a heat exchanger section and a rack receiving section, the rack receiving section including a door to provide access thereto. An air flow system includes at least one blower and an air flow path for enabling air to circulate from the heat exchanger section where it is heated, into the rack receiving section for transferring heat to food products, and back to the heat exchanger section for further heating. The air flow path includes at least one passage from the heat exchanger section to the rack receiving section, where the passage is located proximate to a wall and configured such that heated air from the heat exchanger section is directed along an internally facing surface of the wall so as to attach to and flow along the internally facing surface of the wall from one side of the rack receiving section toward an opposite side of the rack receiving section.",
        "In another aspect, a convection oven includes a heat exchanger section and a product receiving section, the product receiving section including a door to provide access thereto. An air flow system includes at least one blower and an air flow path for enabling air to circulate from the heat exchanger section where it is heated, into the product receiving section for transferring heat to food products, and back to the heat exchanger section for further heating. The air flow path includes a vertical louver system providing flow communication between the heat exchanger section to the product receiving section, where the vertical louver system is located proximate to a wall and configured such that heated air from the heat exchanger section is directed along an internally facing surface of the wall so as to attach to and flow along the internally facing surface of the wall from one side of the product receiving section toward an opposite side of the product receiving section.",
        "In yet another aspect, an a convection oven having a circulating air flow between a heat exchanger section and a product receiving section, the heat exchanger section located to one side of the product receiving section, a method comprises the steps of: effecting a transfer of heated air from the heat exchanger section to a side of the product receiving section opposite the one side by directing heated air along an internally facing surface of a wall of the product receiving section such that the heated attaches to and flows along the internally facing surface of the wall from the one side to the side opposite the one side; and directing the heated air off the wall when it is near the side opposite the one side.",
        "FIG. 1 is a top plan view of one embodiment of a convection oven;",
        "FIG. 2 is an elevation view along line 2-2 of FIG. 1;",
        "FIG. 3 is an elevation view along line 3-3 of FIG. 1;",
        "FIG. 4A is a top plan view of a prior art rack oven; and",
        "FIG. 4B is a partial side view along line 7B-7B of FIG. 7A.",
        "In a typical operation of a convection oven containing a steam generator, the oven is pre-heated to a predetermined temperature for a period of time to allow the steam generator to reach a peak temperature for vaporizing water into steam. In one embodiment, the bread or other goods to be baked are loaded onto a wheeled rack and placed in the oven chamber and the oven door is closed. The rack is then lifted off the floor by a lifting device and begins to rotate at a set speed. In another embodiment the rack is integrated with the oven and the goods are positioned on pans that then are loaded into the oven and onto the integrated rack. The steaming process is started by spraying water over the heat accumulating units to produce steam uniformly over the total height of the steam generator. The steam produced infiltrates the entire oven and condenses on the cool surface of the unbaked bread or other goods. At the end of the predetermined steaming period (usually about 10 to 30 seconds), the flow of water to the steam generator is discontinued as bake cycle continues. Prior to baking, a substantial portion of the steam may be exhausted from the baking chamber through a vent opening. During the bake period a fan continuously circulates the heated air throughout the entire system. For additional batches, the procedure is repeated except that it is generally not necessary to pre-heat the oven since the previous baking cycle provides sufficient heat.",
        "The oven 10 of FIG. 1 includes a heat exchanger section 12 alongside a rack receiving section 14, with doors 16 providing access to the rack receiving section 14 and enabling the rack 26 to be moved into and out of the oven. The rack receiving section 14 may be configured to enable a wheeled rack to be moved into and out of such section. Alternatively, the rack receiving section 14 may contain an integrated rack that is intended to remain in the oven, other than occasional removal for maintenance purposes. A wall or panel 20 separates the rack receiving section 14 from the heat exchanger section 12. The heat exchanger section 12 includes a heat exchanger 22, which may take the form of gas-fired heat exchange tubes, resistive heating elements or any other suitable source of heat over which air can be directed. An air flow system includes at least one blower and an air flow path enabling air to circulate from the heat exchanger section 12 where it is heated, into the rack receiving section 14 for transferring heat to food products (such as food products 24 shown on rack 26), and back to the heat exchanger section 12 for further heating. In the illustrated embodiment the blower takes the form of an axial fan 28 aligned with an opening 30 in wall 20. The air flow path includes at least one passage from the heat exchanger section 12 to the rack receiving section 14, such as illustrated passage 32, where the passage is located proximate to a wall 34 and configured such that heated air 36 from the heat exchanger section 12 is directed along an internally facing surface 38 of the wall so as to attach to and flow along the internally facing surface of the wall from one side 40 of the rack receiving section 14 toward an opposite side 42 of the rack receiving section. The mechanism by which the heated air 36 attaches to the wall is known as the Coanda effect, which can be broadly described as the entrainment of a stream of air along a surface in a manner that the stream tends to remain attached to the surface regardless of the curvature of the surface. The entrained air streams are sometimes referred to as Coanda air flows.",
        "One or more steam generators 43, such as one or more masses of iron, aluminum or other metal with an associated controllable water source may also be provided in the oven 10 if desired, for use as previously mentioned above. In some applications an overhead rack rotation mechanism 45 may be provided as known in the art, while in other applications the mechanism may be excluded.",
        "In the illustrated embodiment the wall 34 is a rear wall of the rack receiving section 14 and the flow of air is from a right side to a left side of the rack receiving section, but it is recognized that variations are possible. As used herein the term “wall” is intended to broadly encompass a boundary structure or combination of boundary structures defining a boundary of the rack receiving section 14. In the illustrated embodiment the wall 34 includes planar sections 44, 46 and 48 that are angled relative to each other. However, the wall could be entirely planar, entirely curved or could be configured with some combination of curved and planar sections.",
        "The purpose of employing the Coanda air flow in the oven along wall 34 is to prevent significant amounts of heated air from short circuiting from the passage 32 back to the opening 30, as it is desirable to assure that a suitable portion of the heated air from the heat exchanger section 12 reaches the far side 42 of the rack receiving section 14, and the far side of the rack 26, to provide more even baking of food products 24 on the rack 26. In one implementation, the heated air from the heat exchanger section attaches to and flows along the internally facing surface of the wall 34 for a travel distance of at least two-thirds of a total distance from the passage 32 to the far side 42 of the rack receiving section. A deflector 50 may be provided to direct the heated air off the wall 34 and toward the food product rack 26. In one implementation the deflector 50 is adjustable relative to the wall section 48 to vary the angle at which the heated air is directed on the rack 26. Referring to FIG. 2, the deflector may be formed by a plurality of vertically distributed adjustable deflectors 50A-50E, enabling different deflection directions to be utilized at different heights if needed for a more uniform baking of the food products. By way of example, the deflectors 50A-50E may be formed by bendable sheet metal panels or by sheet metal panels that are pivotally mounted to the wall section 48.",
        "Referring to FIGS. 1 and 3, in the illustrated embodiment the passage opening 32 is formed as a vertically oriented slot adjacent the wall 34. The slot is formed adjacent the internally facing surface of the wall 34 and includes a vane 52 that overlaps with the internally facing surface of the wall 5. A distance X of overlap of the vane and the internally facing surface of the wall may be at least one inch, and in one implementation is about two inches. In one implementation, a spacing between the wall 34 and the vane 52 may be in the range of about 0.25 inches to about 0.75 inches, although variations are possible. In one exemplary oven construction, the internal height of the rack receiving section of the oven is in a range of about 2.5 to 4 feet and air is moved through the oven by the blower at a rate in the range of about 400-600 cubic feet per minute, with approximately ½ of the air moved through the opening 32 and the other half through opening or passage 54 mentioned below. Variations in such dimensions and air flows are possible and contemplated.",
        "As shown in the illustrated embodiment, an additional passage 54 from the heat exchanger section 12 to the rack receiving section 14 may be located on the separating wall 20 toward a front part of the oven, and may include an adjustable shutter mechanism or mechanisms 56. Passage 54 may be a single vertical slot or multiple openings or slots.",
        "The above-mentioned oven structure provides a method comprising the steps of: effecting a transfer of heated air from a heat exchanger section to a side of a product receiving section opposite the one side by directing heated air along an internally facing surface of a wall of the product receiving section (e.g., the rack receiving section in the case of a rack oven) such that the heated air attaches to and flows along the internally facing surface of the wall from the one side to the side opposite the one side; and directing the heated air off the wall when it is near the side opposite the one side",
        "It is to be clearly understood that the above description is intended by way of illustration and example only and is not intended to be taken by way of limitation. For example, while the illustrated embodiment directs the Coanda air flow along the wall at the rear side of the oven, such a flow could be directed at other locations, such as any one of the right, left, front, top or bottom sides of the oven. Various other changes and modifications could be made."
    ],
    "citations": [
        "3698377",
        "3861378",
        "4062983",
        "4322204",
        "4357522",
        "4387841",
        "4426923",
        "4597193",
        "4722683",
        "4771163",
        "4779604",
        "4813398",
        "4941824",
        "4984557",
        "5228385",
        "5497760",
        "5617839",
        "5801362",
        "5816234",
        "6049995",
        "6195909",
        "6399930",
        "6564699",
        "6576030",
        "6593549",
        "6854457",
        "6894252",
        "2004/0026401",
        "2004/0040950",
        "2004/0200823",
        "4155178",
        "2557867",
        "4007198"
    ],
    "us_classification": "219400",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "21",
            "subclass": "B",
            "main_group": "1",
            "subgroup": "26"
        }
    ]
}