{
    "title": "Device for measuring width by light attenuation difference",
    "abstract": "A device for measuring the width L of a mail item on the fly in a mail handling machine in which mail items are caused to move parallel to a reference wall, the device comprising: a detector device rendered active when the presence of a mail item passing over a plurality of levers is detected, said levers being disposed at a determined set pitch perpendicularly to said reference wall; an emitter device for emitting a light ray, which emitter device is disposed facing a first lever of said plurality; a receiver device for receiving said light ray; a measurement device for measuring the light intensity of the light ray received at said receiver device; and a processor device for computing a determined number y of levers activated by said mail item going past, on the basis of a comparison between said measurement of the received light intensity and an initial measurement of the light intensity of the light ray received at said receiver device when no mail items pass over said plurality of levers, the width L of a mail item being determined on the basis of the number y of levers activated by the mail item going past.",
    "inventors": [
        "Defosse"
    ],
    "document_number": "07297930",
    "publication_date": "20071120",
    "assignees": [
        "Neopost Technologies"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A device for measuring the width L of a mail item on the fly in a mail handling machine in which mail items are caused to move parallel to a reference wall;",
            "components": [
                {
                    "component": "said device comprising: a detector device rendered active when the presence of a mail item passing over a plurality of levers is detected, said levers being disposed at a determined set pitch perpendicularly to said reference wall; an emitter device for emitting a light ray, which emitter device is disposed facing a first lever of said plurality; a receiver device for receiving said light ray; a measurement device for measuring the light intensity of the light ray received at said receiver device; and a processor device for computing a determined number y of levers activated by said mail item going past, on the basis of a comparison between said measurement of the received light intensity and an initial measurement of the light intensity of the light ray received at said receiver device when no mail items pass over said plurality of levers.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A device according to claim 1 , further comprising a device for determining the width L of a mail item on the basis of said determined number y of levers activated by said mail item going past.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A device according to claim 1 , wherein said measurement device for measuring the light intensity determines a ratio between the received light intensity and a predetermined initial light intensity.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A device according to claim 1 , wherein each lever is hinged to a common shaft mounted transversely relative to the direction of movement of the mail items and secured at both of its ends to a frame of the mail handling machine.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A device according to claim 4 , wherein each hinged lever has a first end portion designed to pass through an opening in a deck of the mail handling machine, and a second end portion that, in a rest position corresponding to no mail items passing over said plurality of levers, is designed to find itself in the path of the light ray transmitted between said emitter device and said receiver device.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A device according to claim 5 , wherein a first end of a resilient element is fastened between said second end portion and said pivot axis, the other end of said resilient element being secured to the frame.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A mail handling machine including a measurement device according to claim 1 for measuring the width L of a mail item on the fly.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A method of measuring the width L of a mail item in a mail handling machine through which the mail items are caused to travel parallel to a reference wall;",
            "components": [
                {
                    "component": "said method comprising the following steps: detecting the presence of a mail item passing over a plurality of levers disposed at a determined set pitch perpendicularly to said reference wall; detecting at a receiver reception of a light ray emitted by an emitter disposed facing a first lever of said plurality; measuring the light intensity of the light ray received at said receiver; and computing a determined number y of levers activated by said mail item going past, on the basis of a comparison between said measurement of the received light intensity and an initial measurement of the light intensity of the light ray received at said receiver device when no mail items pass over said plurality of levers.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A method according to claim 8 , wherein said detection of the presence of a mail item is performed by continuously computing the light intensity received at said receiver, the variation of said intensity relative to a reference intensity being characteristic of the presence of a mail item.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A method according to claim 8 , wherein the width L of a mail item is determined on the basis of said determined number y of levers activated by said mail item going past.",
            "components": []
        }
    ],
    "description": [
        "The present invention relates to the field of mail handling. It relates more particularly to a device for measuring the width of a mail item conveyed through a franking or postage meter system.",
        "A mail handling machine that is provided with a dimensional rating capability for postage pricing purposes is already known, e.g. from Document U.S. Pat. No. 6,006,210 (Pitney Bowes). In that machine, the width of the mail item is actually measured by means of strips of diodes. That apparently simple solution is however extremely costly in practice because it assumes that a plurality of very long strips are used.",
        "A system for determining the dimensions of the mail item being conveyed in order to assign a precise amount of postage to it is also known from Patent Document U.S. Pat. No. 6,169,978 (Siemens) but that system is sophisticated.",
        "An object of the present invention is thus to remedy the above-mentioned drawbacks and to make it possible to measure the width L of a mail item for franking purposes, without it being necessary to use complex or costly technical systems for taking such a measurement. An object of the invention is also to perform such measurement on the fly, i.e. while the mail item is being conveyed through the franking system and without said franking system being stopped.",
        "These objects are achieved in accordance with the invention by means of a device for measuring the width L of a mail item on the fly in a mail handling machine in which mail items are caused to move parallel to a reference wall;",
        "said device comprising: a detector device rendered active when the presence of a mail item passing over a plurality of levers is detected, said levers being disposed at a determined set pitch perpendicularly to said reference wall; an emitter device for emitting a light ray, which emitter device is disposed facing a first lever of said plurality; a receiver device for receiving said light ray; a measurement device for measuring the light intensity of the light ray received at said receiver device; and a processor device for computing a determined number y of levers activated by said mail item going past, on the basis of a comparison between said measurement of the received light intensity and an initial measurement of the light intensity of the light ray received at said receiver device when no mail items are passing over said plurality of levers.",
        "Thus, a single emitter/receiver combination suffices for this structure that is formed around a plurality of mechanical levers in order to determine the width of a mail item with sufficient accuracy and, whenever its weight and optionally its length and its thickness are known, in order to compute the amount of postage with which it should be franked.",
        "The device further comprises a device for determining the width L of a mail item on the basis of said determined number y of levers activated by said mail item going past.",
        "Preferably, said measurement device for measuring the light intensity determines a ratio between the received light intensity and a predetermined initial light intensity.",
        "Preferably, each lever is hinged to a common shaft mounted transversely relative to the direction of movement of the mail items and secured at both of its ends to a frame of the mail handling machine.",
        "Preferably, each hinged lever has a first end portion designed to pass through an opening in a deck of the mail handling machine, and a second end portion that, in a rest position corresponding to no mail items passing over said plurality of levers, is designed to find itself in the path of the light ray transmitted between said emitter device and said receiver device.",
        "A first end of a resilient element is fastened between said second end portion and said pivot axis, the other end of said resilient element being secured to the frame.",
        "The present invention also provides a method of measuring the width L of a mail item in a mail handling machine through which the mail items are caused to travel parallel to a reference wall;",
        "said method comprising the following steps: detecting the presence of a mail item passing over a plurality of levers disposed at a determined set pitch perpendicularly to said reference wall; detecting at a receiver reception of a light ray emitted by an emitter disposed facing a first lever of said plurality; measuring the light intensity of the light ray received at said receiver; and computing a determined number y of levers activated by said mail item going past, on the basis of a comparison between said measurement of the received light intensity and an initial measurement of the light intensity of the light ray received at said receiver device when no mail items pass over said plurality of levers.",
        "In an advantageous implementation, said detection of the presence of a mail item is performed by continuously computing the light intensity received at said receiver, the variation of said intensity relative to a reference intensity being characteristic of the presence of a mail item.",
        "The width L of a mail item is then determined on the basis of said determined number y of levers activated by said mail item going past.",
        "The present invention also provides any mail handling machine including a measurement device as mentioned above for measuring the width L of a mail item on the fly.",
        "Other characteristics and advantages of the present invention appear from the following description of particular embodiments given by way of example and with reference to the accompanying drawings, in which:",
        "FIG. 1 is a perspective view of a mail handling machine incorporating a device of the invention for measuring the width of a mail item;",
        "FIG. 2 is a detail view of the measurement device of FIG. 1;",
        "FIGS. 3 and 4 are diagrammatic views of the device of FIG. 2 in two different embodiments, respectively in a rest position and in an activation position;",
        "FIG. 5 is a block diagram showing the main elements of an example of a processing circuit that can be incorporated into the device of the invention; and",
        "FIG. 6 is a flow chart showing an example of various steps implemented for measuring the width of a mail item on the fly in accordance with the invention.",
        "Mail items are rated for postage pricing purposes on the basis of mail item weight and of mail item size (thickness, envelope length, and envelope width). It is a question either of verifying that the dimensions of the envelope are greater than thresholds, or of verifying that the envelope length to envelope width ratio lies within two limits (e.g. 1.3<R<2.5 for the USA, and R<square root of 2 for Germany).",
        "In order to assign the appropriate postage price to each mail item in a non-uniform batch, a measurement device that measures the weight and the dimensions of each envelope and that transmits the resulting information to a postage price computer is disposed upstream from the franking module of a mail handling machine, in general at the feed module or “feeder” thereof. The mail item can also be weighed separately by means of an independent weigh module disposed on the path along which the envelopes are conveyed, e.g. between the feeder and the franking module.",
        "FIG. 1 shows a mail handling machine incorporating a mechanical device of the invention for measuring the width L of a mail item. The mail handling machine conventionally comprises, from upstream to downstream (in the direction in which the mail items travel through the machine): a feed module 10 provided with a deck 12 on which the mail items to be franked are placed in a compact stack that can be uniform or non-uniform (depending on whether or not the mail items are of the same size); drive rollers 14 and jogger means (advantageously side jogger means 16 and/or back jogger means) for jogging the mail items against a reference wall or “envelope guide” 18; a selector module (of which only the bottom rollers 20 are shown) for extracting the mail items to be franked one by one from the bottom of the stack; and a franking module 22 for printing a postage imprint on the mail item selected in this way.",
        "In accordance with the invention, the machine further comprises a device 24 for measuring the width of each mail item, which device is advantageously disposed at the outlet of the selector module, and comprises a plurality of retractable members 26 distributed uniformly along a line perpendicular to the reference wall 18 and preferably over the entire width of the mail handling machine. Each retractable member is in the form of a lever 26 hinged to a common shaft 28 mounted transversely relative to the direction of movement of the mail items and secured at both of its ends to the frame of the mail handling machine, and preferably to the deck of the feed module as shown in FIG. 2.",
        "Each hinged lever can, for example, be generally swan-neck shaped and has a first end portion that is, for example, triangular 26A designed to pass through an opening 12A in the deck 12, and a second end portion 26B that is opposite to the first end portion about the pivot axis of the common shaft 28, said second end portion being designed so that, in a rest position corresponding to absence of any mail item, it intercepts light rays, i.e. it lies in the path of the light rays transmitted from a light emitter device (emitter 30A), typically a light-emitting diode, to a light receiver device 30B for receiving the transmitted light rays.",
        "A first end of at least one resilient element 32 is fastened between said second end portion and the pivot axis along which the common shaft extends, the other end of said at least one resilient element being secured to the frame, e.g. by being fastened to a support bar 34 mounted transversely in the frame. The resilient element, e.g. a spring, is adjusted so that it does not hinder movement of the mail items through the machine, and thus so as to enable the lever 26 both to retract merely under the weight of a mail item going past it and also to return to its initial position once the mail item has gone past.",
        "The levers are spaced apart at an identical, set pitch determined such that it is possible to discriminate, with no possible error, between the various postal formats handled by the mail handling machine. With reference to the postal standards applicable in Europe, a spacing of 10 millimeters (mm), for example, makes it possible to separate, with no difficulty, the formats C6, B6, and E6 whose envelope widths are respectively 114 mm, 125 mm, and 140 mm. Since the mean width of a mail handling machine in Europe is commonly 250 mm (in order to enable envelopes of C4 format to pass through in landscape mode or envelopes of C5 format to pass through in portrait mode), it is decided, in this example, to dispose 25 levers across the machine. Naturally, these numbers and widths are given merely by way of illustration, and any other combination can naturally be imagined depending on the type of mail handled or on the type of postal standards implemented, e.g. American postal standards.",
        "FIG. 3 diagrammatically shows how the levers 26 are disposed in their initial, rest positions when no mail items are going past, and in a preferred embodiment of the invention. In this embodiment, measurement of the width of a mail item is based on the attenuation of the intensity of the emitted light as a function of the medium through which said light passes, the light propagating in a direct line from the emitter 30A to the receiver 30B.",
        "Each lever is made of the same material which has a determined damping coefficient μdrap that is preferably very different from the damping coefficient of air μair, and presents a determined width ddrap. The distance between two levers dair is known and set on constructing the machine as a function of the applicable postal standards and of the characteristics of the envelopes handled. A first lever 26p is disposed at the distance dair from the reference wall 18. Similarly, the distance dE between the emitter 30A and the first lever 26p and the distance d4 between the last lever 26d and the receiver are set by construction.",
        "If Ie0 is the constant light intensity emitted by the emitter, it is possible to determine the light intensity received at the receiver Ir0 after it has passed through all of the levers, the determined number of which is x. The following equation is easily obtained:\n\nIr0=Ie0*exp[−dEμair]*exp[−xddrapμdrap]*exp[(x−1)dairμair]*exp[−dRμair]",
        "While it is going through the mail handling machine, a mail item necessarily goes past the line of levers, and thus activates, as it goes past, a determined number y of levers corresponding to its width. FIG. 4 shows how the levers are disposed facing the emitter and the receiver after some of them have been activated by a mail item 36.",
        "The light intensity received at the receiver Iry after passing through the non-activated levers only is thus given by the following equation:\n\nIry=Ie0*exp[−dEμair]*exp[−ddrapμdrap(x−y))*exp[−ddrapμairy]*exp[−dairμair(x−1)]*exp[−dRμair]",
        "i.e.:\n\nIry=Ir0*exp[y(μdrap−μair)ddrap]",
        "from which it is possible to extract the number y of levers activated by the mail item in question:\n\ny=[In(Iry/Ir0]/[ddrap(μdrap−μair)]",
        "It can be noted that dE, dR and dair are not involved in the computation of y, thereby facilitating determination of the width L of the mail item (the dimensional tolerances on those values are not taken into consideration for the result of the computation), said width then being given by the following inequality:\n\n(y−2)*ddrap+(y−1)*dair<L≦y*ddrap+(y+1)*dair",
        "The width L of a mail item is thus known ±1 pitch step-size (pitch step-size=ddrap+dair)",
        "It should also be noted that it is not necessary to jog the mail item against the reference wall 18. It is merely necessary for said mail item to go along said wall perpendicularly thereto.",
        "With reference to FIG. 5, a description is given below of an example of a processing circuit that can be implemented for the measurement device of the invention.",
        "Firstly, it is a question of detecting the presence of a mail item ready for franking. For this purpose, the device can include a mail item leading edge detector device 40 disposed on the mail item conveyor path, preferably slightly downstream from the line or levers in order to guarantee that, when they are activated by a mail item, a front portion of said mail item must have already crossed said line and has thus necessarily activated some of the levers 26. The term “activation” is used herein to designate the state of the detector device when a mail item passes in the vicinity thereof and, for example, for an optical sensor, when a mail item interrupts a light beam emitted by the sensor.",
        "It should however be noted that the detector device for detecting the presence of a mail item 40 can also be of the software type and can consist, for example, in continuously computing the light intensity received at the receiver Iry, the variation in said intensity relative to the light intensity Ir0 received at the receiver in the absence of activation of the levers necessarily indicating that the levers have been activated and thus that a mail item is present at the inlet of the franking module.",
        "When the sensor 40 is of the mechanical type or of the optical type, activating it switches on the emitter 30A to which it is connected. Said emitter and the receiver 30B are also connected to a light intensity module 42 which measures the light intensity received after said activation and determines the ratio between said received light intensity and an initial light intensity received without any mail items going past and determined previously (in practice, during construction of the machine or while the machine is being calibrated), which intensity ratio is the intensity ratio from which, in accordance with the above-mentioned equation, a processor module 44, which is advantageously a microprocessor and which is connected to the outlet of the measurement module makes it possible inter alia to compute the number y of activated levers and to deduce therefrom the width L of the mail item. Depending on the hardware configuration imagined, the receiver might or might not incorporate the measurement module for measuring the received light intensity, and the ratio of the light intensities can be determined by hardware in said measurement module or by software in the processor module.",
        "An example of data-processing implemented in the above-mentioned circuit is explained below with reference to the flow chart in FIG. 6.",
        "A test 100 examines whether a mail item is present (because, for example, the sensor 40 is activated). If the presence of a mail item is not detected, the processing returns to the inlet of said test 100. If the presence is confirmed, the processing goes to the step 102 for triggering the emitter 30A (naturally this step does not exist when presence is detected continuously, the emitter having been triggered much earlier). When a test 104 detects that a light signal has been received by the receiver 30B, the processing goes successively to the step 106 for measuring the received light intensity, to the step 108 for determining the ratio between said received light intensity and a predetermined initial intensity, and then to the step 110 of determining the number y of levers activated and the value L of the mail item. The process can then be started again for a new mail item with the emitter 30A being stopped or not being stopped after each measurement, depending on the type of the device implemented for performing the presence detection.",
        "In order to overcome any measurement errors or slight skewing of the mail item, it should be noted that the measurement can be reiterated several times while the mail item is passing, a mean of the results then being taken after discarding the extreme values."
    ],
    "citations": [
        "5236072",
        "5581628",
        "6005212",
        "6006210",
        "6169978",
        "6364306",
        "6650397"
    ],
    "us_classification": "2502221",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "01",
            "subclass": "V",
            "main_group": "8",
            "subgroup": "10"
        }
    ]
}