{
    "title": "Agitator with improved blade configuration",
    "abstract": "An agitator, in particular for dispersing gases in liquids, includes a plurality of blades, with each blade being constructed to have a blade portion bent forwards in a rotation direction. The blade has a trailing end region, which defines a blade portion bent forwards in a rotation direction, and a leading end region, which is bent inwards at an angle in a direction toward the blade portion.",
    "inventors": [
        "Himmelsbach",
        "Houlton"
    ],
    "document_number": "07296925",
    "publication_date": "20071120",
    "assignees": [
        "Ekato Rühr- und Mischtechnik GmbH"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An agitator, comprising:",
            "components": [
                {
                    "component": "a plurality of blades, with each blade having a trailing end region, which defines a blade portion bent forwards in a rotation direction, and a leading end region, which is bent inwards at an angle in a direction toward the blade portion; and",
                    "subcomponents": []
                },
                {
                    "component": "a hub for attachment of the blades and rotation of the blades in the rotation direction,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the blade portion is constructed to have a flat section, which extends in a parallel relationship to a surface of the hub, and an end section which extends at an angle to the flat section and is directed outwards away from the leading end region.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The agitator of claim 1 for application in the dispersion of gases in liquids.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The agitator of claim 1 , wherein the blade portion is positioned at a radially outer zone of the blade.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The agitator of claim 1 , wherein the blade portion has a radial length, and the blade has a radial length, wherein a ratio of the radial length of the blade portion to the radial length of the blade is in a range of about 0.2 to 1.0.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The agitator of claim 1 , wherein the blade portion has a radial length, and the blade has a radial length, wherein a ratio of the radial length of the blade portion to the radial length of the blade is in a range of about 0.4 to 0.6.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The agitator of claim 1 , wherein the blade portion has a width, and the blade has a width, wherein a ratio of the width of the blade portion to the width of the blade is in a range of about 0.1 to 1.0, as viewed in circumferential direction.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The agitator of claim 1 , wherein the blade portion has a width, and the blade has a width, wherein a ratio of the width of the blade portion to the width of the blade is in a range of about 0.15 to 0.4, as viewed in circumferential direction.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The agitator of claim 1 , wherein the blade portion has a radius of curvature, and the blade has an outer radius, wherein a ratio of the radius of curvature of the blade portion to the outer radius of the blade is in a range of about 0 to 0.3.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The agitator of claim 1 , wherein the blade portion has a radius of curvature, and the blade has an outer radius, wherein a ratio of the radius of curvature of the blade portion to the outer radius of the blade is in a range of about 0.01 to 0.15.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The agitator of claim 1 , wherein the end section is substantially triangular in shape.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The agitator of claim 1 , wherein the angle ranges from about 0° to 45°.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The agitator of claim 1 , wherein the angle ranges from about 10° to 30°.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The agitator of claim 1 , wherein the end section has a radial length, and the blade portion has a radial length, wherein a ratio of the radial length of the end section to the radial length of the blade portion is about 0 to 1.0.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The agitator of claim 1 , wherein the end section has a radial length, and the blade portion has a radial length, wherein a ratio of the radial length of the end section to the radial length of the blade portion is about 0.5 to 1.0.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The agitator of claim 1 , wherein the end section has a width, and the blade portion has a width, wherein a ratio of the width of the end section to the width of the blade portion is about 0.05 to 0.75.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The agitator of claim 1 , wherein the end section has a width, and the blade portion has a width, wherein a ratio of the width of the end section to the width of the blade portion is about 0.2 to 0.6.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The agitator of claim 1 , wherein the blade extends in relation to a rotation plane at an angle in a range of about 10° to 45°.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The agitator of claim 1 , wherein the blade extends in relation to a rotation plane at an angle in a range of about 20° to 30°.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The agitator of claim 1 , wherein the blade portion extends in relation to the blade at an angle in a range of about 10° to 45°.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The agitator of claim 1 , wherein the blade portion extends in relation to the blade at an angle in a range of about 20° to 30°.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The agitator of claim 1 , wherein the angle ranges from about 0° to +/−40°.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The agitator of claim 1 , wherein the angle ranges from about 0° to +/−15°.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The agitator of claim 1 , wherein the leading end region has a width, and the blade has a width, wherein a ratio of the width of the leading end region to the width of the blade is about 0 to 0.5.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The agitator of claim 1 , wherein the leading end region has a width, and the blade has a width, wherein a ratio of the width of the leading end region to the width of the blade is about 0.1 to 0.3.",
            "components": []
        }
    ],
    "description": [
        "This application claims the priority of German Patent Application, Serial No. 203 07 199.0, filed May 8, 2003, pursuant to 35 U.S.C. 119(a)-(d), the disclosure of which is incorporated herein by reference.",
        "The present invention relates, in general, to an agitator, in particular to an agitator for dispersing gases in liquids.",
        "Agitators of a type involved here are used to disperse gas, supplied to a liquid being stirred, in smallest possible bubbles to create a large surface for a material transfer between gas and liquid.",
        "It would be desirable and advantageous to provide an improved agitator which is constructed to shorten a mixing time while still keeping a drop in power to a minimum.",
        "According to one aspect of the present invention, an agitator, in particular for dispersing gases in liquids, includes a plurality of blades, with each blade being constructed to have a blade portion bent forwards in a rotation direction. Suitably, the blade portion may be positioned at a trailing end of the blade, as viewed in rotation direction.",
        "According to another feature of the present invention, the blade portion may be positioned at a radially outer zone of the blade.",
        "According to another feature of the present invention, the ratio of the radial length of the blade portion to the radial length of the blade may be in a range of about 0.2 to 1.0, preferably about 0.4 to 0.6.",
        "According to another feature of the present invention, the ratio of the width of the blade portion to the width of the blade may be in a range of about 0.1 to 1.0, as viewed in circumferential direction, preferably about 0.15 to 0.4, as viewed in circumferential direction.",
        "According to another feature of the present invention, the ratio of the radius of curvature of the blade portion to the outer radius of the blade may be in a range of about 0 to 0.3, preferably about 0.01 to 0.15.",
        "According to another feature of the present invention, the blade portion may have a leading end region, as viewed in the rotation direction, with the end region being constructed to have a flat section and an end section which extends at an angle of about 0° to 45°, preferably about 10° to 30°, to the flat section and is directed away from the blade. Suitably, the end section is substantially triangular in shape. Advantageously, the end section has a radial length, and the blade portion has a radial length, wherein the ratio of the radial length of the end section to the radial length of the blade portion is about 0 to 1.0, preferably about 0.5 to 1.0. Also, the ratio of the width of the end section to the width of the blade portion may be about 0.05 to 0.75, preferably about 0.2 to 0.6.",
        "According to another feature of the present invention, the blade may extend in relation to a rotation plane at an angle in a range of about 10° to 45°, preferably in a range of about 20° to 30°. Suitably, the blade portion extends in relation to the blade at an angle in a range of about 10° to 45°, preferably about 20° to 30°.",
        "According to another feature of the present invention, the blade may have a leading end portion, as viewed in the rotation direction, with the end portion extending at an angle of about 0° to +/−40°, preferably about 0° to +/−15°, to the blade, and being bent to a plane of the blade portion. Suitably, the ratio of the width of the end portion to the width of the blade is about 0 to 0.5, preferably about 0.1 to 0.3.",
        "Other features and advantages of the present invention will be more readily apparent upon reading the following description of currently preferred exemplified embodiments of the invention with reference to the accompanying drawing, in which:",
        "FIG. 1 is a plan view of an agitator according to the present invention; and",
        "FIG. 2 is a side view of the agitator.",
        "Throughout all the Figures, same or corresponding elements are generally indicated by same reference numerals. These depicted embodiments are to be understood as illustrative of the invention and not as limiting in any way. It should also be understood that the drawings are not necessarily to scale and that the embodiments are sometimes illustrated by graphic symbols, phantom lines, diagrammatic representations and fragmentary views. In certain instances, details which are not necessary for an understanding of the present invention or which render other details difficult to perceive may have been omitted.",
        "Turning now to the drawing, and in particular to FIG. 1, there is shown a plan view of an agitator according to the present invention, generally designated by reference numeral 10 and including a hub 12 for attaching the agitator 10 to an agitator shaft (not shown). Three mountings 16 are securely fixed about the outer periphery of the hub 12 at an angular distance of 120° for attachment of three blades 14, which extend essentially radially outwardly. Of course, the blades 14 may also be directly mounted to the agitator shaft. In operation, the agitator 10 turns clockwise in a rotation direction of arrow P around an axis 18 which is defined by the agitator shaft. The mountings 16 may extend transversely to the axis 18 or may extend inclined at an acute or obtuse angle in relation to the axis 18.",
        "It will be understood by persons skilled in the art that the illustration of three blades 14 mounted to the hub 12 is by way of example only, as two or more than three blades may, of course, be provided as well.",
        "Reference character R2 designates an outer radius of each blade 14, while reference character L2 designates a total radial length of each blade 14, and reference character B2 designates a total width of each blade 14.",
        "Each blade 14 has in rotation direction a trailing end region which is provided with a blade portion 20 bent forwards in rotation direction and extending radially at a radial length L1 over part of the radial length L2 of the blade 14. The ratio of the radial length L1 of the blade portion 20 to the radial length L2 of the blade 14 is, for example, in a range of about 0.2 to 1.0, preferably in a range of about 0.4 to 0.6. The blade portion 20 has a width B1, whereby the ratio of the width B1, as viewed in circumferential direction, to the width B2 of the blade 14 is, for example, in a range of about 0.1 to 1.0, preferably in a range of about 0.15 to 0.4.",
        "The blade portion 20 is comprised of a curved member 26 having a radius of curvature R1 and terminating in a flat member 28 which, optionally, may also be curved in shape. The ratio of the radius of curvature R1 to the outer radius R2 of the blade 14 is, for example, in a range of about 0 to 0.3, preferably in a range of about 0.01 to 0.15. The blade portion 20 extends from the blade 14 in relation to the vertical rotation axis 18 upwards and then continues substantially forwards in rotation direction of the agitator 10.",
        "The blade portion 20 of each blade 14 has in rotation direction a leading end region with an end section 22 that may be triangular in shape, as shown by way of example in FIG. 2, and extends at an angle γ to the flat member 28 of the blade portion 20, away from the blade 14. The angle γ may suitably range from about 0° to 45°, preferably, from about 10° to 30°. The triangular end section 22 has a radial length L3 and a width B3 and is configured to have a tip 23, which is directed radially outwards, as shown in FIG. 2. Of course, the tip 23 may also be directed radially inwards. The ratio of the radial length L3 of the triangular end section 22 to the radial length L4 of the blade portion 20 is in the range of about 0 to 1.0, preferably about 0.5 to 1.0. The ratio of the width B3 of the end section 22 to the width B1 of the blade portion 20 is in the range of about 0.05 to 0.75, preferably about 0.2 to 0.6.",
        "As shown in FIG. 2, the blade 14 extends in relation to the rotation plane D at an angle α in the range of about 10° to 45°, preferably, from about 20° to 30°. The flat member 28 of the blade portion 20 extends in relation to the blade 14 at an angle β in the range of about 10° to 45°, preferably about 20° to 30°. As further shown in FIG. 2, the flat member 28 extends in a parallel relationship to a surface of the hub.",
        "Each blade 14 has in rotation direction a leading end which may be configured to have an end portion 24 which is bent at an angle δ in relation to the remainder of the blade 14 to extend in a direction of the plane of the flat member 28 of the blade portion 20. The angle δ may hereby range from about 0° to +/−40°, preferably, from about 0° to +/−15°. The end portion 24 has a width B4, whereby the ratio of the width B4 of the end portion 24 to the total width B2 of the blade 14 ranges suitably from about 0 to 0.5, preferably about 0.1 to 0.3.",
        "The bending line between the blade 14 and the end portion 24 extends in the non-limiting example of the drawing, transversely to the outer edge of the blade 14. Of course, the bending line between the blade 14 and the end portion 24 may, however, extend also at a different angle to the outer edge of the blade 14. The end portion 24 has a front side, as viewed in rotation direction P, which may be rounded and/or beveled, whereby the bevel may suitably be configured in the radially outer zone of the blade 14.",
        "The agitator 10 according to the present invention attains a much shorter mixing time, while still maintaining superior dispersion quality and experiencing little loss in power. As a consequence of the larger area of the blades 14 in relation to the area of the blade portion 20, the radial pump effect is eccentric and has an axial component. The combination of axial and radial flow patterns results is significantly shorter mixing times in the agitator vessel. In view of the substantially box-shaped configuration of the blade portion 20, formation of gas cushions behind the blades 14 is substantially prevented so that power losses during dispersion of gases are reduced. Moreover, compared to axial flow, the implementation of a strong radial flow results in a better heat transport. Thus, the agitator 10 according to the present invention combines the advantages of radially pumping and axially pumping agitators.",
        "While the invention has been illustrated and described in connection with currently preferred embodiments shown and described in detail, it is not intended to be limited to the details shown since various modifications and structural changes may be made without departing in any way from the spirit of the present invention. The embodiments were chosen and described in order to best explain the principles of the invention and practical application to thereby enable a person skilled in the art to best utilize the invention and various embodiments with various modifications as are suited to the particular use contemplated."
    ],
    "citations": [
        "1011259",
        "1473066",
        "1597175",
        "1827225",
        "2003073",
        "2028413",
        "2384952",
        "3030083",
        "3147958",
        "3166303",
        "4479721",
        "4544281",
        "4779990",
        "4896971",
        "5090816",
        "5198156",
        "5246289",
        "5316443",
        "5791780",
        "5988604",
        "6190033",
        "6715912",
        "6827555",
        "6860631",
        "6866414",
        "6877959",
        "6896246",
        "6986507",
        "7172337",
        "2004/0113290",
        "2004/0174769",
        "2004/0228210",
        "2249144",
        "7-275681"
    ],
    "us_classification": "3663303",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "01",
            "subclass": "F",
            "main_group": "7",
            "subgroup": "22"
        }
    ]
}