{
    "title": "Method and apparatus for data transmission using multiple transmit antennas",
    "abstract": "A method and apparatus for increasing the data rate and providing antenna diversity using multiple transmit antennas is disclosed. A set of bits of a digital signal are used to generate a codeword. Codewords are provided according to a channel code. Delay elements may be provided in antenna output channels, or with suitable code construction delay may be omitted. n signals represent n symbols of a codeword are transmitted with n different transmit antennas. At the receiver MLSE or other decoding is used to decode the noisy received sequence. The parallel transmission and channel coding enables an increase the data rate over previous techniques, and recovery even under fading conditions. The channel coding may be concatenated with error correction codes under appropriate conditions.",
    "inventors": [
        "Calderbank",
        "Naguib",
        "Seshadri",
        "Tarokh"
    ],
    "document_number": "07298794",
    "publication_date": "20071120",
    "assignees": [
        "AT&T Corp."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method comprising the steps of:",
            "components": [
                {
                    "component": "accepting a stream of information bits,",
                    "subcomponents": []
                },
                {
                    "component": "handling said information bits in as a sequence of M",
                    "subcomponents": []
                },
                {
                    "component": "transmitting the two mapped sequence of n symbol, each over a different one of two antennas;",
                    "subcomponents": []
                },
                {
                    "component": "where the bits from which a symbol that is transmitted over one of the two antennas in a time slot is derived differs from the bits from which another symbol is derived that is transmitted the other of the two antennas in said time slot.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 where the M",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 where each of the two sequences of M",
            "components": []
        }
    ],
    "description": [
        "This application claims priority from U.S. Provisional Application Ser. Nos. 60/017,046 filed Apr. 26, 1996 and 60/030,571 filed Nov. 7, 1996. This application is also a continuation application of U.S. patent application Ser. No. 09/545,791, filed Apr. 7, 2000, issued as U.S. Pat. No. 6,889,355, which was a continuation of U.S. patent application Ser. No. 08/847,635, filed Apr. 25, 1997 issued as U.S. Pat. No. 6,115,427.",
        "1. Field of Invention",
        "The present invention relates generally to the field of communications systems, and particularly to the field of wireless communications, such as cellular radio.",
        "2. Description of Related Art",
        "Antenna diversity is a technique used in communication systems, including mobile cellular radio, to reduce the effects of multi-path distortion fading. Antenna diversity may be obtained by providing a receiver with two or more (n≧2) antennas. These n antennas, when properly positioned, imply n channels which suffer fading in different manners. When one channel is in deep fade—that is, suffering severe amplitude and phase loss due to the destructive effects of multi-path interference, another of these channels is unlikely to be suffering from the same effect simultaneously. The redundancy provided by these independent channels enables a receiver to often avoid the detrimental effects of fading.",
        "Alternatively, antenna diversity benefit can be provided to a mobile receiver by providing multiple transmitting antennas at a base or transmitting station, rather than at the receiver. The receiver can therefore use a single antenna, saving cost and complexity at that side of the transmission chain.",
        "Multiple transmit antennas can be provided at the base station in a variety of ways. A schematic diagram of certain possible known techniques is illustrated in FIG. 1. Perhaps most simply, as schematically illustrated in FIG. 1(a) two antennas can be provided at the output stage, and the information signal dk can be switched between two matched antenna elements, without overlap in time or frequency. Of course this has the drawback that the transmitter requires feedback from the receiver about the channels corresponding to each transmit antenna. This scheme does not perform well when the channel is rapidly changing.",
        "In a variant described in U.S. Pat. No. 5,479,448 and schematically illustrated in FIG. 1(b), the above mentioned drawbacks of switch diversity are removed by using a channel code to provide diversity benefit. Maximum diversity is upper-bounded by the number of antenna elements at the base station, and is equal to the minimum Hamming distance of the channel code used, provided that the receiver is equipped with one antenna. The system described in that patent is applicable to both FDD (frequency division duplex) and TDD (time division duplex)-based systems.",
        "Illustrative embodiments of the system of U.S. Pat. No. 5,479,448 comprise a base station which employs a channel code of length n≧2 symbols (n being the number of antennas used by the transmitter), and a minimum Hamming distance 2≦dmin≦n. This channel code is used to encode a group of k information bits. The n antennas of the base station transmitter are separated by a few wavelengths, as is conventional to provide the diversity reception with the n antennas. The channel code symbol ci is transmitted with the ith antenna to represent these k bits. At a receiver, a conventional maximum likelihood channel code decoder provides a diversity advantage of dmin.",
        "In the preferred embodiment of U.S. Pat. No. 5,479,448, the transmitted signals from different antennas are separated in time. This results in data rate reduction, sacrificing bandwidth. The reduction in data rate is equal to the number of antennas (or length of the code).",
        "Transmit bandwidth can be improved over the diversity arrangement of FIG. 1(b), by splitting the information signal into two paths to the two antennas, the second of which has a delay element or tap as disclosed in A. Wittneben, “Base Station Modulation Diversity for Digital SIMULCAST,” 41st IEEE Vehicular Technology Society Conference Proceedings, pp. 848-853 and shown in FIG. 1(c). The signal appearing at antenna B at any given instant of time is therefore the same signal as appeared at antenna A the preceding instant of time. The two signals are transmitted simultaneously, reconstructed at the receiving station, and processed to isolate the desired information signal.",
        "The invention improving on these and other communication techniques in one aspect relates to a system and method for data transmission using multiple transmit antennas.",
        "The invention in one aspect relates to a system and method for data transmission which increases effective utilization of available channel bandwidth, without great increases in transmitter or receiver complexity or cost.",
        "The invention in another aspect relates to a system and method for data transmission which utilizes channel-codes to transmit data, reducing the chance of error and increasing reception robustness.",
        "The invention in another aspect relates to a system and method for data transmission which can include concatenated error correcting codes, even further increasing BER and other transmission performance.",
        "The invention in another aspect relates to a system and method for data transmission which can include multilevel coding, and decreases decoding complexity.",
        "The invention in another aspect relates to a system and method for data transmission which preserves diversity benefit from multiple antenna arrangements, under a wide range of conditions.",
        "In the present invention, among other advantages the time separation described in U.S. Pat. No. 5,749,448 is removed, and coded data is transmitted in parallel, simultaneously from different transmit antennas, with or without delay. Increased data rate as well as diversity are achieved.",
        "By way of comparison, the codes described in U.S. Pat. No. 5,749,448 (col. 6, lines 21-29; col. 7, lines 35-44 and 63-67; col. 8, lines 1-16) provide a diversity 2 using 2 transmit antennas and 1 receive antenna. The bandwidth efficiencies for these disclosed codes are 1 bit/symbol, 1.5 bits/symbol and 2 bits/symbol respectively.",
        "Using the present invention as described below, applying the same codes but a new transmission arrangement, the bandwidth efficiency doubles to 2, 3 and 4 bits/symbol respectively. Moreover, in another embodiment of the present invention when coding is done taking into account diversity and other criteria, no delay element on the antenna line is necessary to implement the invention and further coding gain is obtained.",
        "FIGS. 1(a), 1(b) and 1(c) illustrate a schematic diagram of certain prior approaches to multiple transmit antennas at base stations;",
        "FIGS. 2(a) and 2(b) illustrate a schematic block diagram of first and second embodiments of multiple transmit antenna base stations, according to the invention;",
        "FIG. 3 illustrates a schematic block diagram of a wireless communication system constructed according to the illustrative first embodiment of the invention;",
        "FIG. 4 illustrates signal constellations used in implementations of the invention;",
        "FIG. 5 illustrates a schematic block diagram of a receiver constructed in conjunction with the first illustrative embodiment of the invention;",
        "FIG. 6 illustrates a schematic block diagram of decoding circuitry used in the receiver constructed according to the first illustrative embodiment of the invention;",
        "FIG. 7 illustrates a schematic block diagram of a receiver like that shown in FIG. 5, but adapted to use two antenna elements;",
        "FIG. 8 illustrates a schematic block diagram of a wireless communication system constructed according to a second illustrative embodiment of the invention;",
        "FIG. 9 illustrates a 4-PSK code, used in implementation of the second illustrative embodiment of the invention;",
        "FIG. 10 illustrates a schematic block diagram of decoding circuitry used in a receiver constructed according to the second illustrative embodiment of the invention;",
        "FIG. 11 illustrates an 8-PSK code, used in implementation of the second illustrative embodiment of the invention;",
        "FIG. 12 illustrates a 4-PSK code with 8 and 16 states, used in implementation of the second illustrative embodiment of the invention;",
        "FIG. 13 illustrates a 4-PSK code with 32 states, used in implementation of the second illustrative embodiment of the invention;",
        "FIG. 14 illustrates a 2-Space-Time QAM code with 16 and 16 states, used in implementation of the second illustrative embodiment of the invention;",
        "FIG. 15 illustrates data demonstrating transmission performance of transmission according to the second illustrative embodiment of the invention; and",
        "FIG. 16 illustrates a time slot structure related to channel probing techniques used in connection with the invention;",
        "FIG. 17 illustrates a schematic diagram of a transmitter that employs space-time coding with 2 transmit antennas;",
        "FIG. 18 illustrates a schematic diagram of the receiver with space-time vector Viterbi decoder;",
        "FIG. 19 illustrates the frame-error-rate performance of the basic modem structure;",
        "FIG. 20 shows the estimated distribution of the number of symbol errors per frame at Doppler frequency 170 Hz;",
        "FIG. 21 illustrates a schematic diagram for the transmitter with concatenated space-time coding according to a third illustrative embodiment of the invention;",
        "FIG. 22 illustrates a schematic diagram for the receiver with space-time vector Viterbi decoder concatenated with a Reed-Solomon decoder according to the third illustrative embodiment;",
        "FIG. 23 illustrates the performance of the concatenated space-time code of the third illustrative embodiment of the invention;",
        "FIG. 24 describes set partitioning of a 16 QAM constellation to be used in an example of multi-level space-time codes according to the fourth illustrative embodiment of the invention;",
        "FIG. 25 describes example of encoders for different levels of multi-level space-time code;",
        "FIG. 26 describes an equivalent space-time code for an example of a multi-level space-time code constructed according to the fourth illustrative embodiment of the invention; and",
        "FIGS. 27(a) and 27(b) respectively illustrate smart greedy codes constructed using the BPSK and 4-PSK constellations, according to a fifth illustrative embodiment of the invention.",
        "A. Incorporation by Reference",
        "Various concepts of digital signal processing referred to in this application are well known in, for example, the digital communication and other arts, and thus they need not be described in detail herein. These concepts include, without limitation, combined modulation and coding, and maximum-likelihood decoding. These concepts are described for instance in U.S. Pat. No. 4,457,004, issued Jun. 26, 1984 to A. Gersho et al.; U.S. Pat. No. 4,489,418, issued Dec. 18, 1984 to J. E. Mazo; U.S. Pat. No. 4,520,490, issued May 28, 1985 to L. Wei; U.S. Pat. No. 4,597,090, issued Jun. 24, 1986 to G. D. Forney, Jr.; U.S. Pat. No. 5,029,185 issued Jul. 2, 1991 to L. Wei; in A. Wittneben, “Base Station Modulation Diversity for Digital SIMULCAST,” 41st IEEE Vehicular Technology Society Conference Proceedings, pp. 848-853; and U.S. Pat. No. 5,479,448 to Seshadri, all of which are incorporated by reference.",
        "B. Illustrative Hardware Used in Embodiments",
        "For clarity of explanation, illustrative embodiments of the present invention are presented as comprising individual functional blocks. As known in the art, the functions these blocks represent may be provided through the use of either shared or dedicated hardware (processors), including, but not limited to, hardware capable of executing software. Illustrative embodiments may comprise digital signal processor (DSP) hardware, and software performing the operations discussed below. Very large scale integration (VLSI) hardware embodiments of the present invention, as well as hybrid DSP/VLSI embodiments, may also be constructed.",
        "C. Introduction to Illustrative Embodiments",
        "The central idea of conventional antenna diversity reception is that with high probability, a signal received at different antennas undergoes fading at different moments in time. Thus, a receiver can combine or select different receive signals to reconstruct the transmitted signal with little distortion.",
        "The present invention provides the benefit of diversity by taking advantage of multiple antennas at a transmitter, with or without delay. A first illustrative embodiment shown in FIGS. 2(a) and 3 maps the information sequence of length M1 to a two code sequence of length M2. In particular every group of k input bits (assume k divides M1) are mapped to first and second code symbols. The two code symbols are used to form two code sequences where each sequence is of length M1/k=M2 where the first code sequence is comprised of the first code symbol while the second one is comprised of the second code symbol. These two code sequences are then used to phase modulate a carrier using conventional phase shift keying, as is well known in the art, and in that process two modulated signals are generated. Alternatively, quadrature amplitude modulation, or any other modulation scheme can be used.",
        "The two modulated signals are then transmitted using two transmit antennas. In the first illustrative embodiment, a timing offset of one symbol interval (delay element or tap, of period T) is introduced between the two signals. The receiver receives a sum of faded versions of the transmitted signals from the two antennas, perturbed by noise. In the second illustrative embodiment, the use of a delay in one of the antenna channels is eliminated.",
        "Because the two coded signals are transmitted simultaneously, no bandwidth penalty is incurred. However intersymbol interference is created which is resolved at the receiver using maximum likelihood sequence detection or other techniques that are known in the art. As noted, the introduction of delay to provide diversity is known in the art. However the use of coding as an integral part of the delay diversity arrangement is not known, nor is elimination of any delay element using codes which adhere to diversity and other criteria.",
        "Prior to proceeding with a description of illustrative embodiments of the present invention, concepts related to a channel model for the first illustrative embodiment and embodiment error performance will be presented.",
        "D. Channel Model Transmission Format:",
        "Analysis in First Illustrative Embodiment",
        "The overall transmission environment in which the first illustrative embodiment of the invention operates may be viewed as comprising. n distinct channels, each illustratively undergoing independent slow (static) Rayleigh fading (it should be understood that the principles of the present invention are applicable to other classes of fading channels as well). The impulse response for the ith channel is given by\n\nhi(t)=αiδ(t)ejω0t, 1≦i≦N  (1)\n\nwhere ω0 is the angular carrier frequency and zi is the static complex fade value whose phase is a random variable that is uniformly distributed over [−π, π] and whose magnitude is Rayleigh distributed with\n\nP(|αi|)=2|αi|e−|αi|2, αi≧0  (2)\n\nThe information sequence I is grouped into sub-sequences of k information bits,",
        "I\n  =\n  \n    (\n    \n      \n        \n          \n            I\n            0\n            1\n          \n          ,\n          \n            I\n            1\n            1\n          \n          ,\n          \n            I\n            2\n            1\n          \n          ,\n          …\n          ⁢\n          \n            \n          \n          ,\n          \n            I\n            \n              k\n              -\n              1\n            \n            1\n          \n        \n        \n          ︸\n          \n            1\n            ⁢\n            st\n            ⁢\n            \n              \n            \n            ⁢\n            sub\n            ⁢\n            \n              -\n            \n            ⁢\n            sequence\n          \n        \n      \n      ,\n      \n        \n          \n            I\n            0\n            2\n          \n          ,\n          …\n          ⁢\n          \n            \n          \n          ,\n          \n            I\n            \n              k\n              -\n              1\n            \n            2\n          \n        \n        \n          ︸\n          \n            2\n            ⁢\n            nd\n            ⁢\n            \n              \n            \n            ⁢\n            sub\n            ⁢\n            \n              -\n            \n            ⁢\n            sequence\n          \n        \n      \n      ,\n      …\n    \n    ⁢\n    \n      \n    \n    )\n  \n\n\n\n\nwhere the superscript is the sub-sequence number. Each sub-sequence is mapped into n channel symbols of the channel constellation using a channel code. Some of the illustrative signal constellations are shown in FIG. 4. The signal constellation mapped code sequence is",
        "c\n  =\n  \n    \n      (\n      \n        \n          \n            \n              c\n              0\n              1\n            \n            ,\n            …\n            ⁢\n            \n              \n            \n            ,\n            \n              c\n              \n                n\n                -\n                1\n              \n              1\n            \n          \n          \n            ︸\n            \n              \n                code\n                ⁢\n                \n                  \n                \n                ⁢\n                sequence\n                ⁢\n                \n                  \n                \n                ⁢\n                for\n              \n              \n                1\n                ⁢\n                st\n                ⁢\n                \n                  \n                \n                ⁢\n                sub\n                ⁢\n                \n                  -\n                \n                ⁢\n                sequence\n              \n            \n          \n        \n        ,\n        \n          \n            \n              c\n              0\n              2\n            \n            ,\n            …\n            ⁢\n            \n              \n            \n            ,\n            \n              c\n              \n                n\n                -\n                1\n              \n              2\n            \n          \n          \n            ︸\n            \n              \n                code\n                ⁢\n                \n                  \n                \n                ⁢\n                sequence\n                ⁢\n                \n                  \n                \n                ⁢\n                for\n              \n              \n                2\n                ⁢\n                nd\n                ⁢\n                \n                  \n                \n                ⁢\n                sub\n                ⁢\n                \n                  -\n                \n                ⁢\n                sequence\n              \n            \n          \n        \n        ,\n        …\n      \n      ⁢\n      \n        \n      \n      )\n    \n    .\n  \n\n\n\n\nHence each element cij is a point belonging to a signal constellation. The code sequence is arranged in a matrix as shown below",
        "[\n    \n      \n        \n          \n            c\n            0\n            1\n          \n        \n        \n          \n            c\n            0\n            2\n          \n        \n        \n          \n            c\n            0\n            3\n          \n        \n        \n          ⋯\n        \n      \n      \n        \n          \n            c\n            1\n            1\n          \n        \n        \n          \n            c\n            1\n            2\n          \n        \n        \n          \n            c\n            1\n            3\n          \n        \n        \n          \n            \n          \n        \n      \n      \n        \n          ⋮\n        \n        \n          \n            \n          \n        \n        \n          \n            \n          \n        \n        \n          \n            \n          \n        \n      \n      \n        \n          \n            c\n            \n              n\n              -\n              1\n            \n            1\n          \n        \n        \n          \n            c\n            \n              n\n              -\n              1\n            \n            2\n          \n        \n        \n          \n            c\n            \n              n\n              -\n              1\n            \n            3\n          \n        \n        \n          ⋯\n        \n      \n    \n    ]\n  \n   \n\n\n\n\nThe first row of the matrix is pulse shaped using square-root Nyquist filter p(t), modulated and transmitted using antenna 1. The second row of the matrix is pulse shaped using square-root Nyquist filter p(t−T) (p(t) delayed by one symbol interval). The ith row of the matrix is transmitted using square root Nyquist filter p(t−(i−1)T) (p(t) delayed by (i−1) symbol intervals). At the receiver, the received signal, following demodulation, receiver filtering and sampling as is well known in the art, is given by\n\nri=α0c0i+α1c1i−1+α2c2i−2+ . . . +αn−jcn−ji−(n−1)+ηi\n\nwhere ηi is the extraneous noise which is modeled as additive white Gaussian.",
        "Decoding is done in a conventional manner using maximum likelihood decoding techniques or suboptimum variants thereof, which are well known in the art.",
        "E. First Illustrative Embodiment",
        "FIG. 3 presents an illustrative apparatus of a digital wireless communication system transmitter according to a first illustrative embodiment of the present invention. The transmitter receives an analog speech signal from speech signal source 101, and processes this signal for transmission on antennas 116a,b. The transmitter comprises a source encoder 104, a channel encoder 106, constellation mappers 108a,b, temporary storage buffers 110a,b, pulse shapers 112a and b, and modulators 114a,b. Power amplification associated with the transmission of radio signals has been omitted from FIG. 3 for clarity.",
        "The speech signal source 101 provides an analog speech signal to be encoded and transmitted for instance to a mobile receiver. This speech signal is converted to a digital signal by conventional analog-to-digital conversion by source encoder 104. Source encoder 104 provides a digital signal representative of the analog speech signal as output to channel encoder 106. Source encoder 104 may be realized with any of the conventional speech encoders.",
        "The channel encoder 106 receives the PCM (Pulse Code Modulated) digital signal comprising a plurality of bits from the source encoder 104. Channel encoder 106 codes the PCM digital signal using a conventional channel code. Any channel code may be employed for this purpose, as long as it is appropriately constructed.",
        "The code constructed for the first illustrative embodiment of the present invention assumes that the number of antennas at the base station is two. The following illustrative code of length n=2 complex symbols (2 symbols×2 components (in-phase and quadrature) per symbol equals 4 dimensions (4-D)), has a minimum Hamming distance dmin=2.",
        "Channel Code\n\n\n\n\n\n\n\n\n\nInformation Bits\nSymbol 1\nSymbol 2\n\n\n\n\n\n00\n0\n0\n\n\n01\n1\n2\n\n\n11\n2\n1\n\n\n10\n3\n3",
        "Using this code, encoder 106 codes two information bits at a time to generate one of four codewords. Each generated codeword comprises two symbols (see columns labeled Symbol 1 and Symbol 2, above). Each symbol belongs to the 4-PSK constellation presented in FIG. 4(a). Thus, a coding rate of one information bit per code symbol is provided by this code. Symbol 1 is transmitted with antenna 116a and symbol 2 with antenna 116b, as discussed below.",
        "The first symbol of each codeword generated by encoder 106 is provided as input to constellation mapper 108a, and the second symbol of the codeword is provided to mapper 108b.",
        "Constellation mappers 108a, b produce a complex valued output corresponding to a symbol received from encoder 106. The real part of this output determines an in-phase component of a modulated signal transmitted at antennas 116a,b. Similarly, the imaginary part of the output determines a quadrature component of the modulated signal. The constellation mapper 108a,b are conventional mappers known in the art. They may be realized as a look-up table or as a straightforward combination of logic elements. Mappers 108a,b operate on the first and second symbol of each received codeword, respectively, and provide complex valued output to buffers 110a and b.",
        "Buffers 110a and b provide temporary storage for the complex values received form mappers 108a, b, and illustratively store 100 of such values. The complex entries in buffer 110a are pulse shaped using conventional square-root Nyquist transmit filter (see 112a) while those in buffer 110b are pulse shaped using the same square-root Nyquist transmit filter but whose impulse response is delayed by one symbol interval (see 112b). The pulse shaped outputs are then modulated by modulators 114a and 114b and transmitted using antennas 116a and 116b. Additional filtering and power amplification stages are not shown for clarity.",
        "F. Further Channel Codes for First Illustrative_Embodiment",
        "The first embodiment described above may employ other channel codes than the one first developed, to enhance coding efficiency. For example, the following code length 2, dmin=2, is formed from an 8-PSK constellation shown in FIG. 4(b). This code has efficiency of 3 bits/symbol:",
        "Information Data\nSymbol 1\nSymbol 2\n\n\n\n\n\n\n\n000\n0\n0\n\n\n001\n1\n5\n\n\n011\n2\n2\n\n\n111\n3\n7\n\n\n100\n4\n4\n\n\n101\n5\n1\n\n\n110\n6\n6\n\n\n111\n7\n3\n\n\n\n\n\n\n\n\n\nA distinct pair of codewords differ in at least two positions.",
        "In another coding implementation, a coding efficiency of 4.0 bits/symbol is provided. In order to achieve dmin=2 and stay within the constraint that the block length of the code equal two, it is necessary to have at least 16 codewords. Hence, 16-PSK (see FIG. 4(c)) is the smallest constellation with which a diversity benefit of 2 can be provided. The 4D-16 PSK code is shown below:",
        "Information Data\nSymbol 1\nSymbol 2\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n000\n0\n0\n\n\n001\n1\n5\n\n\n010\n2\n2\n\n\n011\n3\n7\n\n\n100\n4\n4\n\n\n101\n5\n1\n\n\n110\n6\n6\n\n\n111\n7\n3\n\n\n\n\n\n\n\n\n\nG. An Illustrative Decoder for Embodiments",
        "FIG. 5 presents an illustrative receiver 300 according to the foregoing first illustrative embodiment of the present invention. Receiver 300 receives transmitted signals from antenna 301, and produces analog speech as output. Receiver 300 comprises an RF-to-baseband from end 305, receive buffer 307, channel decoder 310, and speech decoder 320.",
        "The RF-to-baseband front end 305 provides conventional demodulated output (i.e., received symbols) to the receive buffers 307. Front end 305 includes, e.g., conventional RF to IF conversion, receive filtering, and tinting and carrier recovery circuits.",
        "Receive buffer 307 store received symbols from front end 305. Buffer 307 analogous to buffers 110a, b of the illustrative transmitter described in Section D and present in FIG. 3 except that since the receiver receives a superposition of data in buffers 110a, b only one buffer is needed. Channel decoder 210 receives the demodulated symbol output from buffer 307, and provides decoded information bits to speech decoder 320. The illustrative decoder 310 operates in accordance with the flow diagram presented in FIG. 6.",
        "As shown in FIG. 6, symbols from receive buffer 307 are used in computing distances with all possible valid codewords stored in memories 311a, b. For example the first codeword from buffer 311a taken together with the first codeword from 311b, but delayed by one unit symbol interval are linearly combined with channel gains α1 and α2 respectively. The distance between this combined output and the received symbols in buffer 307 is computed. This is done for every codeword in buffers 311a and 311b (see 312). The legal codeword pair is the one which most closely match the received sequence (see 313). The decoded codeword pair is then mapped to a string of bits which comprises coded information (see 314). This exhaustive search can be implemented efficiently using the Viterbi algorithm or variants thereof, known to persons skilled in the art.",
        "Speech decoder 320 is a conventional device providing a mapping of digital speech information to analog speech. Decoder 320 provides an inverse operation to source encoder 104 discussed above with respect to FIG. 5.",
        "In light of the discussion above, it is to be understood that the diversity benefit of the present invention using one antenna may be enhanced by use of multiple receive antennas. This advantage may be realized by combination of a front end and receive buffer for each receiver antenna.",
        "FIG. 7 presents an illustrative decoder in accordance with this enhancement for two receiving antennas 301a, b. As shown in the figure, received symbols from the first and second buffers associated with each antenna are provided directly to channel decoder. These are processed in a manner similar to the one described above by the decoder and a decision on the transmitted signal is made.",
        "H. Second Illustrative Embodiment: Introduction",
        "In the present invention, the foregoing first illustrative embodiment of the invention and its coding implementations rely upon coding technique and a delay element in the antenna transmission line, to preserve diversity and achieve additional coding gain over the simpler known delay diversity schemes. However, that illustrative embodiment can be further improved by removing the restriction that delays be introduced between different coded streams.",
        "In particular, in the second illustrative embodiment of the invention, the inventors derive criteria for maximizing the performance when n transmit antennas are used to transmit n parallel data streams that are created by encoding information data with a channel code. In particular, it is shown that the code's performance is determined by the rank and determinant of certain matrices. These matrices in turn are constructed from codewords of the given channel code. These matrix based criteria are used to design channel codes for high data rate wireless communications. These codes are called space-time codes, and are easy to encode because they have a trellis structure. These codes can be easily decoded using maximum likelihood sequence criterion. Examples of 4PSK, 8PSK and 16QAM based codes are given that have been constructed for operation with 2 and 4 transmit antennas. Performance results are shown to verify the performance.",
        "I. Channel Model Transmission Format: Analysis for Second Illustrative Embodiment",
        "The overall transmission channel in which the second illustrative embodiment and its coding implementation operates may be viewed as comprising n distinct channels, each illustratively undergoing independent slow (static) Rayleigh or Rician fading (it should again be understood that the principles of the present invention and this embodiment are applicable to other classes or fading channels as well), having impulse response, fade and other characteristics generally as described above for the first illustrative embodiment.",
        "J. Second Illustrative Embodiment",
        "FIG. 8 presents a communication system constructed according to the second illustrative of the present invention. The system shown is generally similar to that of the first illustrative embodiment shown in FIG. 3, and elements in common with the previous embodiment are labeled with similar numbers, including signal source 101, antennas 116a,b, encoder 104 and channel encoder 106, and constellation mappers 108a,b. It may be noted that pulse shaper 112b′ in the second illustrative embodiment is not constructed to apply a delay of T, but is the same as pulse shaper 112a′.",
        "The channel encoder 106 receives the PCM digital signal comprising a plurality of bits from the source encoder 104. Channel encoder 106 codes the PCM digital signal using a channel code that has been constructed to meet the design criteria elucidated below.",
        "The code constructed for the second illustrative embodiment assumes that the number of antennas at the base station is two. The 4-PSK trellis code with a transmission rate of 2 bits/sec/Hz is provided for illustrative purposes in FIG. 9. Using this code, encoder 106 codes two information bits at a time to generate the label of a branch in the trellis diagram. The branch depends on the state of the encoder and the input data and determines the new state of the encoder as well. For example, suppose that the encoder is in state 3 of FIG. 9. Then upon input bits, 00, 01, 10, and 11, the respective branch labels are respectively 30, 31, 32, and 33. The new state of the encoder is then respectively 0, 1, 2, and 3. Each branch label comprises two symbols (see branch labels, above). Each symbol belongs to the 4-PSK constellation presented in FIG. 4(a). Thus for instance corresponding to output 31, phase values 3π/2 and π/2 radians are used to phase modulate the carrier. Therefore, a coding rate of two information bits per channel used is provided by this code. Symbol 1 is transmitted with antenna 116a and symbol 2 with antenna 116b, as discussed below.",
        "The first symbol of each codeword generated by encoder 106 is provided as input to constellation mapper 108a, and the second symbol of the codeword is provided to mapper 108b, generally as discussed above for the first illustrative embodiment.",
        "K. Further Illustrative Channel Codes in Second Illustrative Embodiment",
        "The second illustrative embodiment described above may employ other channel codes to enhance coding efficiency. These codes are designed according to a performance criteria computed later in the sequel. For illustration, examples are provided. One can improve on the performance of these codes by constructing encoders with more states. The inventors have designed codes (using the criteria established) with different numbers of states. Simulation results for the case of 4-PSK and 8-PSK are included demonstrating that the performance of these codes for two and one receive antenna is excellent.",
        "L. Decoding in Second Illustrative Embodiment",
        "The second illustrative embodiment makes use of receiver 300 and related decoder circuitry illustrated in FIG. 10, generally similar to that shown in FIG. 5 described for the first illustrative embodiment. As illustrated in FIG. 10, the circuitry constructed to receive symbols from buffer 307 is adapted to account for the non-delayed coding of the second embodiment. For instance, since no delay is applied, the delay element 315 shown in FIG. 6 is not incorporated when decoding according to the second illustrative embodiment.",
        "M. Performance Criteria for Second Illustrative Embodiment",
        "In this section, performance criteria for the design of the codes used in the second illustrative embodiment are established.",
        "Consider a mobile communication system such that the base station is equipped with n antennas and the mobile unit is equipped with m antennas. Data is encoded by the encoder. The encoded data goes through a serial to parallel device and is divided into n streams of data. Each stream of data is used as the input to a pulse shaper. The output of each shaper is then modulated using a modulator. At each time the output of modulator i is a signal that is transmitted using transmit antenna (Tx antenna) i for 1≦i≦n.",
        "It is again assumed that the n signals are transmitted simultaneously each from a different transmit antenna and that all these signals have the same transmission period T. The signal at each receive antenna is a noisy version of the superposition of the faded version of the n transmitted signals.",
        "At the receiver, the demodulator makes a decision statistic based on the received signals at each receive antenna 1≦j≦m. Assuming that the transmitted symbol from the i-th antenna at transmission interval t is cti, and the receive word at time interval t at the receive antenna j is dti, then",
        "d\n          t\n          j\n        \n        =\n        \n          \n            \n              ∑\n              \n                i\n                =\n                1\n              \n              n\n            \n            ⁢\n            \n              \n                α\n                i\n                j\n              \n              ⁢\n              \n                c\n                t\n                i\n              \n            \n          \n          +\n          \n            η\n            t\n            j\n          \n        \n      \n    \n    \n      \n        (\n        3\n        )\n      \n    \n  \n\n\n\n\nThe coefficients αij are first modeled as independent samples of a stationary complex Gaussian stochastic process with mean Eαij=pij+qijj and variance 0.5 per dimension with Kij=|Eαij|2, where j=√{square root over (−1)}. This is equivalent to the assumption that signals transmitted from different antennas undergo independent fades (The case when αij are dependent will be treated later). Also, ηtj are independent samples of a zero mean complex white Gaussian process with two sided power spectral density N0/2 per dimension. It is assumed that αij are constant during a frame and vary from one frame to another (flat fading).",
        "The inventors have derived a design criterion for constructing codes under this transmission scenario. Mathematical background required and the notation used for this task is first reviewed. Let x=(x1, x2, . . . , xk) and y=(y1, y2, . . . , yk) be complex vectors in the k dimensional complex space Ck. The inner product x and y is given by",
        "x\n    ·\n    y\n  \n  =\n  \n    \n      ∑\n      \n        i\n        =\n        1\n      \n      k\n    \n    ⁢\n    \n      \n        x\n        i\n      \n      ⁢\n      \n        \n      \n      ⁢\n      \n        \n          y\n          _\n        \n        i\n      \n    \n  \n\n\n\n\nwhere yi denotes the complex conjugate of yi. For any matrix A, let A* denote the Hermitian (transpose conjugate) of A.",
        "From known linear algebra an n×n matrix A is Hermitian if and only if A=A*. A is non-negative definite if xAx*≧0 for any 1×n complex vector x. An n×n matrix V is unitary if and only if VV*=I where I is the identity matrix. A n×1 matrix B is a square root of an n×n matrix A if BB*=A. The following results from linear algebra are also made use of.\n\n    \n    \n        An eigenvector v of an n×n matrix A corresponding to eigenvalue λ is a 1×n vector of unit Euclidean length such that vA=λv for some complex number λ. The number of eigenvectors of A corresponding to the eigenvalue zero is n−r, where r is the rank of A.\n        Any matrix A with a square root B is non-negative definite.\n        For any non-negative definite Hermitian matrix A, there exists a lower triangular square matrix B such that BB*=A.\n        Given a Hermitian matrix A, the eigenvectors of A span Cn, the complex space of n dimensions and it is easy to construct an orthonormal basis of Cn consisting of eigenvectors A.\n        There exists a unitary matrix V and a real diagonal matrix D such that VAV*=D. The rows of V are an orthonormal basis of Cn given by eigenvectors of A.\n        The diagonal elements of D are the eigenvalues λi, i=1, 2, . . . , n of A counting multiplicities.\n        The eigenvalues of a Hermitian matrix are real.\n        The eigenvalues of a non-negative definite Hermitian matrix are non-negative.",
        "i. The Case of Independent Fade Coefficients",
        "Assume that each element of signal constellation is contracted by a scale factor √{square root over (Es)} chosen so that the average energy of the constellation element is 1. Thus the design criterion is not constellation dependent and applies equally to 4-PSK, 8-PSK and 16-QAM.",
        "Consider the probability that the receiver decides erroneously in favor of a signal",
        "e\n  =\n  \n    \n      e\n      1\n      1\n    \n    ⁢\n    \n      e\n      1\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      e\n      1\n      n\n    \n    ⁢\n    \n      e\n      2\n      1\n    \n    ⁢\n    \n      e\n      2\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      e\n      2\n      n\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      e\n      l\n      1\n    \n    ⁢\n    \n      e\n      l\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      e\n      l\n      n\n    \n  \n\n\n\n\nassuming that",
        "c\n  =\n  \n    \n      c\n      1\n      1\n    \n    ⁢\n    \n      c\n      1\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      c\n      1\n      n\n    \n    ⁢\n    \n      c\n      2\n      1\n    \n    ⁢\n    \n      c\n      2\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      c\n      2\n      n\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      c\n      l\n      1\n    \n    ⁢\n    \n      c\n      l\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      c\n      l\n      n\n    \n  \n\n\n\n\nwas transmitted.",
        "Assuming ideal channel state information (CSI), the probability of transmitting c and deciding in favor of e at the decoder is well approximated by\n\nP(c→e|αij, i=1, 2, . . . , n, j=1, 2 . . . , m)≦exp(−d2(c,e)Es/4N0)  (4)\n\nwhere",
        "d\n            2\n          \n          ⁡\n          \n            (\n            \n              c\n              ,\n              e\n            \n            )\n          \n        \n        =\n        \n          \n            ∑\n            \n              j\n              =\n              1\n            \n            m\n          \n          ⁢\n          \n            \n              ∑\n              \n                t\n                =\n                1\n              \n              l\n            \n            ⁢\n            \n              \n                \n                  \n                  \n                    \n                      ∑\n                      \n                        i\n                        =\n                        1\n                      \n                      n\n                    \n                    ⁢\n                    \n                      \n                        α\n                        i\n                        j\n                      \n                      ⁡\n                      \n                        (\n                        \n                          \n                            c\n                            t\n                            i\n                          \n                          -\n                          \n                            e\n                            t\n                            i\n                          \n                        \n                        )\n                      \n                    \n                  \n                  \n                \n                2\n              \n              .\n            \n          \n        \n      \n    \n    \n      \n        (\n        5\n        )",
        "This is just the standard approximation to the Gaussian tail function.",
        "Setting Ωj=(α1j, . . . , αnj, (5) is rewritten as",
        "d\n            2\n          \n          ⁡\n          \n            (\n            \n              c\n              ,\n              e\n            \n            )\n          \n        \n        =\n        \n          \n            ∑\n            \n              j\n              =\n              1\n            \n            m\n          \n          ⁢\n          \n            \n              Ω\n              j\n            \n            ⁢\n            \n              \n            \n            ⁢\n            \n              A\n              ⁡\n              \n                (\n                \n                  c\n                  ,\n                  e\n                \n                )\n              \n            \n            ⁢\n            \n              \n            \n            ⁢\n            \n              Ω\n              j\n              *\n            \n          \n        \n      \n    \n    \n      \n        (\n        6\n        )\n      \n    \n  \n\n\n\n\nwhere the pq in element of A(c,e) is Apq=xp·xq and xp=(c1p−e1p, c2p−e2p, . . . , c1p−e1p) for 1≦p, q≦n. Thus,",
        "P\n          ⁡\n          \n            (\n            \n              \n                \n                  c\n                  →\n                  e\n                \n                |\n                \n                  α\n                  i\n                  j\n                \n              \n              ,\n              \n                i\n                =\n                1\n              \n              ,\n              2\n              ,\n              ⋯\n              ⁢\n              \n                \n              \n              ,\n              n\n              ,\n              \n                j\n                =\n                1\n              \n              ,\n              2\n              ,\n              ⋯\n              ⁢\n              \n                \n              \n              ,\n              m\n            \n            )\n          \n        \n        ≤\n        \n          \n            ∏\n            \n              j\n              =\n              1\n            \n            m\n          \n          ⁢\n          \n            exp\n            ⁡\n            \n              (\n              \n                \n                  -\n                  \n                    Ω\n                    j\n                  \n                \n                ⁢\n                \n                  A\n                  ⁡\n                  \n                    (\n                    \n                      c\n                      ,\n                      e\n                    \n                    )\n                  \n                \n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  Ω\n                  j\n                  *\n                \n                ⁢\n                \n                  \n                    E\n                    s\n                  \n                  /\n                  4\n                \n                ⁢\n                \n                  N\n                  o\n                \n              \n              )\n            \n          \n        \n      \n    \n    \n      \n        (\n        7\n        )\n      \n    \n  \n\n\n\n\nSince A(c,e) is Hermitian, there exists a unitary matrix V and a real diagonal matrix D such that VA(c,e)V*=D. The rows of V are a complete orthonormal basis of Cn given by eigenvectors of A. Furthermore, the diagonal elements of D are the eigenvalues λi, i=1, 2, . . . , n of A counting multiplicities. The matrix",
        "B\n          ⁡\n          \n            (\n            \n              c\n              ,\n              e\n            \n            )\n          \n        \n        =\n        \n          (\n          \n            \n              \n                \n                  \n                    e\n                    1\n                    1\n                  \n                  -\n                  \n                    c\n                    1\n                    1\n                  \n                \n              \n              \n                \n                  \n                    e\n                    2\n                    1\n                  \n                  -\n                  \n                    c\n                    2\n                    1\n                  \n                \n              \n              \n                ⋯\n              \n              \n                ⋯\n              \n              \n                \n                  \n                    e\n                    l\n                    1\n                  \n                  -\n                  \n                    c\n                    l\n                    1\n                  \n                \n              \n            \n            \n              \n                \n                  \n                    e\n                    1\n                    2\n                  \n                  -\n                  \n                    c\n                    1\n                    2\n                  \n                \n              \n              \n                \n                  \n                    e\n                    2\n                    2\n                  \n                  -\n                  \n                    c\n                    2\n                    2\n                  \n                \n              \n              \n                ⋯\n              \n              \n                ⋯\n              \n              \n                \n                  \n                    e\n                    l\n                    2\n                  \n                  -\n                  \n                    c\n                    l\n                    2\n                  \n                \n              \n            \n            \n              \n                \n                  \n                    e\n                    1\n                    3\n                  \n                  -\n                  \n                    c\n                    1\n                    3\n                  \n                \n              \n              \n                \n                  \n                    e\n                    2\n                    3\n                  \n                  -\n                  \n                    c\n                    2\n                    3\n                  \n                \n              \n              \n                ⋰\n              \n              \n                ⋮\n              \n              \n                \n                  \n                    e\n                    l\n                    3\n                  \n                  -\n                  \n                    c\n                    l\n                    3\n                  \n                \n              \n            \n            \n              \n                ⋮\n              \n              \n                ⋮\n              \n              \n                ⋰\n              \n              \n                ⋰\n              \n              \n                ⋮\n              \n            \n            \n              \n                \n                  \n                    e\n                    1\n                    n\n                  \n                  -\n                  \n                    c\n                    1\n                    n\n                  \n                \n              \n              \n                \n                  \n                    e\n                    2\n                    n\n                  \n                  -\n                  \n                    c\n                    2\n                    n\n                  \n                \n              \n              \n                ⋯\n              \n              \n                ⋯\n              \n              \n                \n                  \n                    e\n                    l\n                    n\n                  \n                  -\n                  \n                    c\n                    l\n                    n\n                  \n                \n              \n            \n          \n          )\n        \n      \n    \n    \n      \n        (\n        8\n        )\n      \n    \n  \n\n\n\n\nis clearly a square root of A(c, e). Thus, the eigenvalues of A(c, e) are non-negative real numbers. Let ωj=ΩjV* and ωj=β1j, . . . , βnj, then",
        "Ω\n            j\n          \n          ⁢\n          \n            A\n            ⁡\n            \n              (\n              \n                c\n                ,\n                e\n              \n              )\n            \n          \n          ⁢\n          \n            \n          \n          ⁢\n          \n            Ω\n            j\n            *\n          \n        \n        =\n        \n          \n            ∑\n            \n              i\n              =\n              1\n            \n            n\n          \n          ⁢\n          \n            \n              λ\n              i\n            \n            ⁢\n            \n              \n            \n            ⁢\n            \n              \n                \n                  \n                  \n                    β\n                    j\n                    i\n                  \n                  \n                \n                2\n              \n              .\n            \n          \n        \n      \n    \n    \n      \n        (\n        9\n        )",
        "Next, recall that αij are i.i.d. samples of a complex Gaussian process with mean Eαij with Kij=|Eαij|2. Let Kj=Eα1j, . . . , Eαnj), and let vw denote the w-th row of V.",
        "Since V is unitary, {v1, v2, . . . , vn} is an orthonormal basis of Cn and βij are independent complex Gaussian random variables with variance 0.5 per dimension and mean Kj·vi. Let Ki,j=|Eβij|2=|Kj·vi|2. Thus |βij| are independent Rician distributions with pdf\n\np(|βij|)=2|βij|exp(−|βij|2−Ki,j)I0(2|βij|√{square root over (Ki,j)}),\n\nfor |βij|≧0, where I0(·) is the zero-order modified Bessel function of the first kind.",
        "Thus, to compute an upper bound on the average probability of error, simply average",
        "∏\n      \n        j\n        =\n        1\n      \n      m\n    \n    ⁢\n    \n      \n        exp\n        ⁡\n        \n          (\n          \n            \n              \n                E\n                s\n              \n              /\n              4\n            \n            ⁢\n            \n              N\n              0\n            \n          \n          )\n        \n      \n      ⁢\n      \n        \n      \n      ⁢\n      \n        \n          ∑\n          \n            i\n            =\n            1\n          \n          n\n        \n        ⁢\n        \n          \n            λ\n            i\n          \n          ⁢\n          \n            \n          \n          ⁢\n          \n            \n              \n              \n                β\n                j\n                i\n              \n              \n            \n            2\n          \n        \n      \n    \n  \n  )\n\n\n\n\nwith respect to independent Rician distributions of |βij| to arrive at",
        "P\n          ⁡\n          \n            (\n            \n              c\n              →\n              e\n            \n            )\n          \n        \n        ≤\n        \n          \n            ∏\n            \n              j\n              =\n              1\n            \n            m\n          \n          ⁢\n          \n            (\n            \n              \n                ∏\n                \n                  i\n                  =\n                  1\n                \n                n\n              \n              ⁢\n              \n                \n                  1\n                  \n                    1\n                    +\n                    \n                      \n                        \n                          E\n                          s\n                        \n                        \n                          4\n                          ⁢\n                          \n                            N\n                            0\n                          \n                        \n                      \n                      ⁢\n                      \n                        λ\n                        i\n                      \n                    \n                  \n                \n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  exp\n                  ⁡\n                  \n                    (\n                    \n                      -\n                      \n                        \n                          \n                            K\n                            \n                              i\n                              ,\n                              j\n                            \n                          \n                          ⁢\n                          \n                            \n                              E\n                              s\n                            \n                            \n                              4\n                              ⁢\n                              \n                                N\n                                0\n                              \n                            \n                          \n                          ⁢\n                          \n                            λ\n                            i\n                          \n                        \n                        \n                          1\n                          +\n                          \n                            \n                              \n                                E\n                                s\n                              \n                              \n                                4\n                                ⁢\n                                \n                                  N\n                                  0\n                                \n                              \n                            \n                            ⁢\n                            \n                              λ\n                              i\n                            \n                          \n                        \n                      \n                    \n                    )\n                  \n                \n              \n            \n            )\n          \n        \n      \n    \n    \n      \n        (\n        10\n        )\n      \n    \n  \n\n\n\n\nSome special cases are next examined.",
        "The Case of Rayleigh Fading: In this case Kij=0 and as a fortiori Ki,j=0 for all i and j. Then the inequality (10) can be written as",
        "P\n          ⁡\n          \n            (\n            \n              c\n              →\n              e\n            \n            )\n          \n        \n        ≤\n        \n          \n            \n              (\n              \n                1\n                \n                  \n                    ∏\n                    \n                      i\n                      =\n                      1\n                    \n                    n\n                  \n                  ⁢\n                  \n                    (\n                    \n                      1\n                      +\n                      \n                        \n                          λ\n                          i\n                        \n                        ⁢\n                        \n                          \n                            E\n                            s\n                          \n                          /\n                          4\n                        \n                        ⁢\n                        \n                          N\n                          0\n                        \n                      \n                    \n                    )\n                  \n                \n              \n              )\n            \n            m\n          \n          .\n        \n      \n    \n    \n      \n        (\n        11\n        )\n      \n    \n  \n\n\n\n\nLet r denote the rank of matrix A, then the kernel of A has dimension n−r and exactly n−r eigenvalues of A are zero. Say the nonzero eigenvalues of A are λ1, λ2, . . . , λr, then it follows from inequality (11) that",
        "P\n          ⁡\n          \n            (\n            \n              c\n              →\n              e\n            \n            )\n          \n        \n        ≤\n        \n          \n            \n              (\n              \n                \n                  ∏\n                  \n                    i\n                    =\n                    1\n                  \n                  r\n                \n                ⁢\n                \n                  λ\n                  i\n                \n              \n              )\n            \n            \n              -\n              m\n            \n          \n          ⁢\n          \n            \n              \n                (\n                \n                  \n                    \n                      E\n                      s\n                    \n                    /\n                    4\n                  \n                  ⁢\n                  \n                    N\n                    0\n                  \n                \n                )\n              \n              \n                -\n                rm\n              \n            \n            .\n          \n        \n      \n    \n    \n      \n        (\n        12\n        )",
        "Thus a diversity of mr and a gain of (λ1λ2 . . . λr)1/r is achieved. Recall that λ1λ2 . . . λr is the absolute value of the sum of determinants of all the principle r×r cofactors of A. Moreover, the ranks of A(c,e) and B(c,e) are equal. Thus from the above analysis, the following design criterion are arrived at.",
        "Design Criteria For Rayleigh Space-Time Codes:\n\n    \n    \n        The Rank Criterion: In order to achieve the maximum diversity mn, the matrix B(c,e) has to be full rank for any codewords c and e. If B(c,e) has minimum rank r over the set of two tuples of distinct codewords, then a diversity of rm is achieved.\n        The Determinant Criterion: Suppose that a diversity benefit of rm is our target. The minimum of r-th roots of the sum of determinants of all r×r principle cofactors of A(c,e)=B(c,e)B*(c,e) taken over all pairs of distinct codewords e and c corresponds to the coding gain, where r is the rank of A(c,e). Special attention in the design must be paid to this quantity for any codewords e and c. The design target is making this sum as large as possible. If a diversity of nm is the design target, then the minimum of the determinant of A(c,e) taken over all pairs of distinct codewords e and c must be maximized.\n\nAt sufficiently high signal to noise ratios, one can approximate the right hand side of inequality (10) by",
        "P\n          ⁡\n          \n            (\n            \n              c\n              →\n              e\n            \n            )\n          \n        \n        ≤\n        \n          \n            \n              (\n              \n                \n                  E\n                  s\n                \n                \n                  4\n                  ⁢\n                  \n                    N\n                    0\n                  \n                \n              \n              )\n            \n            \n              -\n              rm\n            \n          \n          ⁢\n          \n            \n              \n                \n                  (\n                  \n                    \n                      ∏\n                      \n                        i\n                        =\n                        1\n                      \n                      r\n                    \n                    ⁢\n                    \n                      λ\n                      i\n                    \n                  \n                  )\n                \n                \n                  -\n                  m\n                \n              \n              [\n              \n                \n                  ∏\n                  \n                    j\n                    =\n                    1\n                  \n                  m\n                \n                ⁢\n                \n                  \n                    ∏\n                    \n                      i\n                      =\n                      1\n                    \n                    r\n                  \n                  ⁢\n                  \n                    exp\n                    ⁡\n                    \n                      (\n                      \n                        -\n                        \n                          K\n                          \n                            i\n                            ,\n                            j\n                          \n                        \n                      \n                      )\n                    \n                  \n                \n              \n              ]\n            \n            .\n          \n        \n      \n    \n    \n      \n        (\n        14\n        )\n      \n    \n  \n\n\n\n\nThus a diversity of rm and a gain of",
        "(\n        \n          \n            λ\n            1\n          \n          ⁢\n          \n            λ\n            2\n          \n          ⁢\n          \n            \n          \n          ⁢\n          ⋯\n          ⁢\n          \n            \n          \n          ⁢\n          \n            λ\n            r\n          \n        \n        )\n      \n      \n        1\n        /\n        r\n      \n    \n    ⁢\n    \n      \n    \n    [\n    \n      \n        ∏\n        \n          j\n          =\n          1\n        \n        m\n      \n      ⁢\n      \n        \n          ∏\n          \n            i\n            =\n            1\n          \n          r\n        \n        ⁢\n        \n          exp\n          ⁡\n          \n            (\n            \n              \n                \n                  -\n                  K\n                \n                ⁢\n                \n                  \n                \n                ⁢\n                i\n              \n              ,\n              j\n            \n            )\n          \n        \n      \n    \n    ]\n  \n  \n    1\n    /\n    rm\n  \n\n\n\n\nis achieved. Thus, the following design criteria is valid for the Rician space-time codes for large signal to noise ratios.",
        "Design Criteria For The Rician Space-Time Codes:\n\n    \n    \n        The Rank Criterion: This criterion is the same as that given for the Rayleigh channel.\n        The Gain Criterion: Let Λ(c,e) denote the sum of all the determinants of r×r principal co-factors of A(c,e), where r is the rank of A(c,e). The minimum of the products",
        "Λ\n        ⁡\n        \n          (\n          \n            c\n            ,\n            e\n          \n          )\n        \n      \n      \n        1\n        /\n        r\n      \n    \n    [\n    \n      \n        ∏\n        \n          j\n          =\n          1\n        \n        m\n      \n      ⁢\n      \n        \n          ∏\n          \n            i\n            =\n            1\n          \n          r\n        \n        ⁢\n        \n          exp\n          ⁡\n          \n            (\n            \n              -\n              \n                K\n                \n                  i\n                  ,\n                  j\n                \n              \n            \n            )\n          \n        \n      \n    \n    ]\n  \n  \n    1\n    /\n    rm\n  \n\n\n\n\nTaken over distinct codewords c and e have to be maximized.\n\n    \n    \n        Note that it has been shown that, one could still use the gain criterion for the Rayleigh space-time codes as well, since the performance will be at least as good as the right side of inequality (11).",
        "ii. The Case of Dependent Fade Coefficients:",
        "Next, the case when the fade coefficients are dependent is studied. Only Rayleigh fading is considered, as the Rician case can be treated in a similar manner. To this end, consider the mn×mn matrix",
        "Y\n      ⁡\n      \n        (\n        \n          c\n          ,\n          e\n        \n        )\n      \n    \n    =\n    \n      \n        \n          \n            A\n            ⁡\n            \n              (\n              \n                c\n                ,\n                e\n              \n              )\n            \n          \n        \n        \n          0\n        \n        \n          …\n        \n        \n          …\n        \n        \n          0\n        \n        \n          0\n        \n      \n      \n        \n          0\n        \n        \n          \n            A\n            ⁡\n            \n              (\n              \n                c\n                ,\n                e\n              \n              )\n            \n          \n        \n        \n          …\n        \n        \n          …\n        \n        \n          0\n        \n        \n          0\n        \n      \n      \n        \n          0\n        \n        \n          0\n        \n        \n          \n            A\n            ⁡\n            \n              (\n              \n                c\n                ,\n                e\n              \n              )\n            \n          \n        \n        \n          ⋰\n        \n        \n          ⋮\n        \n        \n          0\n        \n      \n      \n        \n          ⋮\n        \n        \n          ⋮\n        \n        \n          ⋰\n        \n        \n          ⋰\n        \n        \n          ⋮\n        \n        \n          ⋮\n        \n      \n      \n        \n          0\n        \n        \n          0\n        \n        \n          0\n        \n        \n          …\n        \n        \n          0\n        \n        \n          \n            A\n            ⁡\n            \n              (\n              \n                c\n                ,\n                e\n              \n              )\n            \n          \n        \n      \n    \n  \n  ,\n\n\n\n\nwhere 0 denote the all zero n×n matrix. Let Ω=(Ω1, . . . , Ωm), then (7) can be written as\n\nP(c→e|αij, i=1, 2, . . . n, j=1, 2, . . . , m)≦exp(−ΩY(c,e)Ω*Es/4NO).  (15)\n\nLet Θ denote the correlation of Ω. Assume that Θ is full rank (this is a physically acceptable assumption). The matrix Θ being a non-negative definite square Hermitian matrix has a full rank nm×nm lower triangular matrix C as it's square root. The diagonal elements of Θ are unity, so that the rows of C are of length one. Define",
        "v\n  =\n  \n    (\n    \n      \n        ɛ\n        1\n        1\n      \n      ,\n      ⋯\n      ⁢\n      \n        \n      \n      ,\n      \n        ɛ\n        n\n        1\n      \n      ,\n      \n        ɛ\n        1\n        2\n      \n      ,\n      ⋯\n      ⁢\n      \n        \n      \n      ,\n      \n        ɛ\n        n\n        2\n      \n      ,\n      ⋯\n      ⁢\n      \n        \n      \n      ,\n      \n        ⋯\n        ⁢\n        \n          \n        \n        ⁢\n        \n          ɛ\n          1\n          m\n        \n      \n      ,\n      ⋯\n      ⁢\n      \n        \n      \n      ,\n      \n        ɛ\n        n\n        m\n      \n    \n    )\n  \n\n\n\n\nBy Ω=vC*, then it is easy to see that the components of v are uncorrelated complex Gaussian random variables with variance 0.5 per dimension. The mean of the components of v can be easily computed from the means of αij and the matrix C. In particular of the αij are of mean zero, so are the εij.",
        "By (15), the conclusion is arrived at that\n\nP(c→e|αij, i=1, 2, . . . , n, j=1, 2, . . . , m)≦exp(−γC*Y(c,e)Cγ*Es/4NO)  (16)\n\nThe same argument can be followed as the case of independent fades with A(c,e) replaced by C*Y(c,e)C. It follows that the rank of C*Y(c,e)C has to be maximized. Since C is full rank, this amounts to maximizing rank [Y(c,e)]=m rank [A(c,e)]. Thus the rank criterion given for the independent fade coefficients holds in this case as well.",
        "Since aij are zero mean, so are εij. Thus by a similar argument to that of the case of independent fade coefficients, the conclusion that the determinant of C*Y (c,e)C must be maximized is arrived at. This is equal to det(Θ)det(Y(c,e))=det(Θ)[det(A(c,e))]m. In this light the determinant criterion given in the case of independent fade coefficients holds as well.",
        "It follows from a similar argument that the rank criterion is also valid for the Rician case and that any code designed for Rician channel performs well for Rayleigh channel even if the fade coefficients are dependent. To obtain the gain criterion, one has to compute the mean of εij and apply the gain criterion given in the case of independent Rician fade coefficients. As appreciated by persons skilled in the art, this is a straightforward but tedious computation.",
        "N. Space-Time Code Construction",
        "In this section, the results of the previous section are used to design codes for a wireless communication system that employs n transmit antennas and (optional) receive antenna diversity, according to the second embodiment of the present invention.",
        "The designed codes can be either trellis codes, or block codes having a trellis representation. Examples are provided of trellis codes, as generalization to block codes is straightforward, to persons skilled in the art.",
        "i. Trellis Codes",
        "In the design of the codes to be applied in the second illustrative embodiment, reference is made to those having the property that each transition branch at time t is labeled with a sequence qt1qt2 . . . qtn of n symbols from the constellation alphabet Q for all 1≦t≦1. Any time that the encoder's path goes through such a transition branch, the symbol qti is sent via antenna i for all 1≦i≦n.",
        "The encoding for trellis codes is straightforward, with the exception that it is required that at the beginning and the end of each frame, the encoder be in known states. A method of decoding is illustrated next. Assuming channel estimates {circumflex over (α)}ij of αij, i=1, 2, . . . , n, j=1, 2, . . . , m are available to the decoder. Assuming that rti is the received signal at receive antenna i at time t, the decoder computes for any transition branch at time t having the label qt1qt2 . . . qtn, the branch metric",
        "∑\n    \n      j\n      =\n      1\n    \n    m\n  \n  ⁢\n  \n    \n      \n        \n        \n          \n            r\n            t\n            j\n          \n          -\n          \n            \n              ∑\n              \n                i\n                =\n                1\n              \n              n\n            \n            ⁢\n            \n              \n                \n                  α\n                  ^\n                \n                i\n                j\n              \n              ⁢\n              \n                q\n                t\n                i\n              \n            \n          \n        \n        \n      \n      2\n    \n    .\n  \n\n\n\n\nThe Viterbi algorithm is then used to compute the path with lowest accumulated metric.",
        "The aforementioned trellis codes are called Space-Time codes, as they combine spatial and temporal diversity techniques. Furthermore, if the Space-Time code guarantee a diversity gain of rm for the multiple antenna communication systems discussed above, it is said that it is an r-Space-Time code.",
        "A 4-state code for the 4-PSK constellation is given in FIG. 9. For further illustration, there is also provided an 8-state code for the 8-PSK constellation in FIGS. 11, and 8, 16, and 32-state codes for the 4-PSK constellation in FIGS. 12(a), 12(b), and 13, respectively. Also provided is a 16-state code for 16-QAM constellation in FIG. 14.",
        "The design rules that guarantee diversity for all the codes in FIGS. 11, 12(a), 12(b), 13, and 14 are:\n\n    Transitions departing from the same state differ in the second symbol.\n    Transitions arriving at the same state differ in the first symbol.",
        "r-space-times for r≧2: As an illustration, a 4-space-time code for a 4 transmit antenna mobile communication systems is constructed. The input to the encoder is a block of length 2 of binary numbers corresponding to an integer i in Z4={0, 1, 2, 3}. The states of the trellis correspond to set of all three tuples (s1, s2, s3) with si in Z4 for 1<=i<=3. At state (s1, s2, s3) upon receipt of input data i, the encoder outputs (i, s1, s2, s3) elements of 4-PSK constellation (see FIG. 4(a)) and moves to state (i, s1, s2). The performance of this code for 1 and 2 receive antennas is given in FIG. 15.",
        "O. Channel Estimation and Interpolation",
        "In both foregoing illustrated embodiments of the invention, it was assumed that the channel state information which is needed for decoding is known. However, in reality the receiver must estimate the channel state information. Also, the receiver must update this information as the channel varies. As illustrated in FIG. 16, this may be accomplished by the periodic transmission of a probe or pilot symbol P, whose identity is known at the transmitting and the receiving sides of the communication apparatus.",
        "During the transmission of the pilot symbols, the receiver derives estimate of the fade coefficients. The receiver estimates the channel state over the whole frame of data using a channel interpolation scheme. The results of interpolation are used by the space-time decoder using decoding techniques known to the persons skilled in the art.",
        "The inventors have observed that in high mobility environments inaccuracies in channel estimation and interpolation causes only a small number of errors in frames of data output by the space-time decoder. These few errors can be corrected using any outer block codes as are well-known in the art.",
        "Here is described an implementation for a wireless modem that employs the use of space-time codes according to the invention, along with a coding strategy called concatenated space-time coding.",
        "P. Basic Modem Architecture",
        "In this section the basic functions of a modem based on space-time coded modulation according to the invention are described. For the purpose of illustration, the channelization of the North American digital cellular standard IS-136 is assumed. However, the same modem architecture can be easily adopted to other channelization and/or any other application with minor modifications known to people skilled in the art.",
        "A brief overview of the frame structure in IS-136 is as follows. On each 30 kHz wireless channel, the IS-136 standard defines 25 frames of data per second, each of which is then further subdivided into 6 time slots. Each time slot is of a 6.667 ms duration and carries 162 modulation symbols (modulation symbol rate is 24,300 symbols/sec).",
        "i). Transmitter",
        "FIG. 17 shows a block diagram for a transmitter that employs space-time coding and is equipped with 2 transmit antennas (the extension of the same architecture to more than 2 transmit antennas is straightforward). A bit stream from the information source (either speech or data) is fed to the space-time encoder. The space-time encoder groups each b information bits into one modulation symbol, where the number of bits b per modulation symbols will depend on the constellation used, which is assumed to be either M-QAM or M-PSK constellation. The space-time encoder uses a space-time code constructed according to criterion mentioned above.",
        "Each group of b information bits generates two modulation symbols at the output of the space-time encoder. Each stream of modulation symbols is interleaved using a block interleaver. It is assumed that both bursts are interleaved in a similar way. Overhead, synchronization, and pilot symbols are then added to the output of each interleaver to build a burst. Each burst is then pulse-shaped using any suitable pulse shape known to persons skilled in the art, and transmitted from its corresponding antenna.",
        "ii). Time Slot Structure",
        "For the purpose of illustration, FIG. 16 shows a slot structure for the case when the transmitter is equipped with two transmit antennas and follows IS-136 channelization. As mentioned, this slot structure can be easily extended to conform to other channelization and any number of transmit antennas.",
        "In each time slot, two bursts are transmitted, one from each antenna. As in IS-136 North American Digital Cellular Standard, it is assumed that the modulation symbol rate is 24,300 symbols/sec and each burst consists of 162 symbols. Each burst starts with a 14 symbol synchronization sequence S1 and S2 that is used for timing and frequency synchronization at the receiver. In addition, the transmitter inserts 6 two-symbol pilot sequences P1 and P2 that will be used at the receiver to estimate the channel. The signal received at the receiver is the superposition of the two transmitted bursts, and in order to separate the two bursts at the receiver, it is necessary to define the two sequences S1 and S2 as well as the pilot sequences P1 and P2 as orthogonal sequences. It is assumed that the synchronization and pilot symbols have the same energy per symbol as the information symbols. In addition, for the synchronization and pilot sequences π/4-shifted DQPSK modulation is used. Each burst will then have 136 symbols of information. The block interleaver will be then a 17×8 block interleaver.",
        "iii). Receiver",
        "FIG. 18 shows the corresponding block diagram for a mobile receiver equipped with two receive antennas according to this embodiment. For each receiver antenna, after matched filtering, the receiver splits the output samples into two streams.",
        "The first stream contains the received samples that correspond to the information symbols. The second stream contains the received samples corresponding to the pilot symbols. These samples are first correlated with the pilot sequence for bursts transmitted from transmit antenna 1 to get an estimate for the channel (at the pilot positions) from transmit antenna 1 to the corresponding receive antenna. Also, the same set of samples are correlated with the pilot sequence for bursts transmitted from transmit antenna 2 to get an estimate for the channel (at the pilot positions) from transmit antenna 2 to the corresponding receive antenna. These estimates are then interpolated to form an estimate for channel state information needed for maximum likelihood decoding according to the metric previously defined. The interpolation filter can be designed in many ways known to persons skilled in the art. For optimum interpolation, a different interpolation filter should be used for every value of Doppler spread fd, frequency offset fo, and signal to noise ratio SNR. However this approach will be of great complexity for any practical implementation. Various approaches are proposed here. The first is to use a robust filter that will cover all possible range of operation, although this will lead to a slight degradation in performance at low Doppler and/or frequency offset values.",
        "The second approach is to divide the range of operation into different regions, and for every region design an optimum interpolator for some operating point in that region and use that filter for the whole. By observing the channel correlation from the channel estimates or by observing the symbol error rate, the receiver can decide which filter to use for interpolation.",
        "In addition, in estimating the channel over any burst, the pilot symbols in that burst are only used. This will minimize the overall system delay by avoiding the need to wait for future bursts in order to estimate the channel. Both data streams are then deinterleaved and fed to a vector Viterbi decoder.",
        "iv). Basic Modem Performance",
        "In this section, simulation results for the basic modem and time slot structure described above are presented. In addition, the pulse shape that was used is a square-root raised-cosine Nyquist pulse with roll-off factor of 0.35. At the receiver an oversampling factor of 8 is assumed.",
        "FIG. 19 shows the frame error rate (FER) PF performance of the above modem for different values of Doppler spread fd assuming perfect timing and frequency synchronization. For the static case, perfect knowledge of the CSI for comparison, is assumed. Plotted is PF versus SNR (or symbol energy to noise ratio) Es/NO. For the ideal CSI, it can be seen that a FER of 0.1 at Es/NO of 14.75 dB. However, for a Doppler spread fd of 170 Hz, which corresponds to a vehicle speed of 60 mph, the 0.1 FER is achieved t 20.5 dB Es/NO. For fd=120 Hz, this number drops to 17.1 dB. It can also be noticed that FER floors at high Es/NO. In general, this increase in the required Es/NO as compared to the case with ideal CSI and the FER flooring are due to the errors in channel estimation.",
        "Q. Third Illustrative Embodiment—Concatenated Space-Time Coding",
        "FIG. 20 shows the distribution of the number of symbol errors per frame for the fd=170 Hz for different values of Es/NO. For relatively high values of Es/NO (>15 dB), approximately 90% of the frames that are in error, the error is due to 5 symbol errors or less. Most of these errors can be recovered from, by concatenating the space-time code with any block code known to the persons skilled in the art, such as a Reed Solomon (RS) code. This overall coding strategy is designated concatenated space-time coding and is shown in FIGS. 21 and 22. Depending on the desired error correction capability and rate of the code and the type of constellation used, the dimension of the block code used should be such to produce an integer multiple of modulation symbols for each RS symbol. In this way, it will be possible to decode a burst immediately without the need to wait for other bursts and, thereby, minimize decoding delay. In addition, in this way, any symbol error at the output of the ST decoder will affect only one RS code symbol.",
        "R. Modem Performance With Concatenated Space-Time Coding",
        "The inventors simulated the above-described modem with the space-time code concatenated with a Reed-Solomon code. Three different shortened RS codes over GF(28) were used in the simulation. The first code, referred to as RS, is a shortened (68, 66) code that corrects single byte errors. The 66 GF(28) symbols are first created by partitioning the bit stream into 66 groups of 8 bits each. The output 68 GF(28) symbols are then partitioned into 136 16-QAM symbols, 2 channel symbols per one Reed-Solomon symbol, which are then fed to the ST encoder. The second code, referred to as RS3, is a shortened (68, 62) code that corrects three byte errors, and the third code, referred to as RS5, is a shortened (68, 58) code that corrects 5 byte errors. In this simulation, a timing error of ±T/16 and a frequency offset fo of 200 Hz are assumed.",
        "FIG. 23 shows the FER performance with concatenated space-time coding and in the presence of timing error and frequency offset for fd=170 Hz. From this figure, it can be seen that in the case of the ST code alone a Es/NO of 23 dB is required to achieve PF of 0.1. However, when the ST code is concatenated with RS3, for example, the required Es/NO is 17.5 dB, i.e., a 5.5 dB gain over the ST code alone. However, in this case, the net bit rate (per 30 kHz channel) will be reduced from 81.6 kbits/sec to 74.4 kbits/sec. If RS5 is used, the required Es/NO for PF=0.1 will drop to 16.5 dB, which is only 1.75 dB higher than the case when ideal CSI are available. In this case, the net bit rate will be 69.6 kbits/sec.",
        "S. Fourth Illustrative Embodiment—Multi Level Structured Space Time Codes",
        "Some of the space-time codes described in the second embodiment of this invention may have multilevel structure. On occasions, it may be desirable to take advantage of this structure in practical communication systems, particularly when the number of transmit antennas is high. This has the significant advantage of reducing decoding complexity. Multilevel code structures and associated decoding techniques are known in the art. They can be combined with space-time coding, giving rise to the invention of a novel technique called multi-level space-time coding.",
        "Without loss of generality, assume that the signal constellation Q0 consists of sb0 signal points. Assume that f-levels of coding is used. Associated with this f-levels of coding, a partition based on subsets\n\nQf−1⊂Qf−2⊂ . . . ⊂Q0\n\nis chosen with the number of elements of Qj equal to 2bj for all 0≦j≦f−1. By such a partitioning, it is meant that Q0 is the union 2b0−b1 disjoint sets called cosets of Q1 in Q0, each having 2b1 elements such that one of these cosets is Q1. Having the cosets of Q1 in Q0 at hand, each coset is then divided into 2b1-b2 disjoint sets each having 2b2 elements. The 2b1-b2 subsets of Q1 are called cosets of Q2 in Q0. The set of cosets of Q2 in Q1 must include Q2. Thus there are 2b0-b2 subsets of Q0 with 2b2 elements called the cosets of Q2 in Q0. The set of cosets of Q2 includes Q2. This procedure is repeated until cosets of Qj in Qk for all 0≦k<j≦f−1 are arrived at. Let rf−1=bf−1 and rj=bj−bj+1 for j=0, 1, . . . f−2. Then Qj contains 2rj cosets of Qj+1 for all j=0, 1, . . . , f−2.",
        "Every K=K0+ . . . +Kf−1 bits of input data is encoded using encoders 0, 1, . . . , f−1 corresponding to the f levels. It is required that all the encoders have a trellis representation. At each time t depending on the state of the j-th encoder and the input data, a branch of the trellis of the j-th encoder is chosen which is labeled with n blocks of rj bits denoted by Bt1(j), Bt2(j), . . . , Btn(j. The blocks Bti(0), . . . , Bti(f−1 then choose a point of the signal constellation in the following way.",
        "The block Bti(0 chooses a coset Q′1 of Q1 in Q0. The block Bti(1 chooses a coset Q′2 of Q2 in Q1 and so forth. Finally the block Bti(f−1 chooses a point of Q′f−1 a coset of Qf−1 chosen in the last step. The chosen point is then transmitted using the i-th antenna for 1≦i≦n. Multilevel decoding can be done in a manner known to those skilled in the art.",
        "Suppose that the encoder of the j-th level has 2Sj states at time t. One can view the multi-level code described above as a space-time code C with 2(S0+ . . . +Sf−1) states at time t. The states of C correspond f-tuples st0, st1, . . . , stf−1 of states of encoders 0, 1, . . . , f−1. The branch labels between states st0, st1, . . . , stf−1 and st+10, st+11, . . . , st+1f−1 is the set of symbols that are sent via antennas 1, 2, . . . , n if each encoder j goes from states stj to the state st+1j for 0≦j≦f−1. In this way, one can view a multi-level space-time code as a regular space-time code with a multi-level structure that allows simplified decoding. The penalty for this simplified decoding is a loss in performance. Also, the design criterion derived previously could be applied to the space-time code C. Alternatively the design criteria can instead be applied to the trellis of each encoder 0≦j≦f−1 providing different diversities at each level.",
        "The discussion of the illustrative embodiment above is illustrated with an example. Consider the transmission of 4-bits/sec/HZ using the 16-QAM constellation and the set partitioning of FIG. 24. At each time input bits are grouped into two blocks of two bits. The first and second blocks of two bits input data are respectively the input to the first and second encoder whose trellis is given in FIG. 25. Each branch of this trellis is labeled with two blocks of two bits of data. These two bits are represented with numbers 0, 1, 2 and 3. Upon the choice of branches with respective labels a1a2 and b1b2 by the zero-th and the first encoders, the signal points 4a1+b1 and 4a2+b2 are sent via antennas 1 and 2. The equivalent 16-state space-time trellis code is given in FIG. 26.",
        "T. Fifth Illustrative Embodiment: Smart-Greedy Codes",
        "Smart greedy codes are a class of space-time codes of particular interest in the implementation of the invention. These codes are able to take special advantage of possible rapid changes in the channel without any feedback from the receiver. The idea is to construct codes using a hybrid criteria such that possible rapid changes in the channel is taken into account by the design criteria. In this light, an analysis is provided for the case of rapidly fading channels as well.",
        "i) Analysis of Rapid Fading",
        "In this connection, the model of a mobile communication system having n antennas at the base and m antennas at the mobile station is refined. Data is encoded using a channel code. As in other embodiments, the encoded data goes through a serial to parallel device and is divided into n streams of data. Each stream of data is used as the input to a pulse shaper. The output of each shaper is then modulated using a modulator. At each time the output of modulator i is a signal that is transmitted using transmit antenna (Tx antenna) i for 1≦i≦n. Again, the n signals are transmitted simultaneously each from a different transmit antenna and all these signals have the same transmission period T. The signal at each receive antenna is a noisy version of the superposition of the faded versions of the n transmitted signals. Assume that each element of the signal constellation is contracted by a scale factor √{square root over (Es)} chosen so that the average energy of the constellation elements is 1.",
        "At the receiver, the demodulator makes decision statistic based on the received signals at each receive antenna 1≦j≦m. Let cti denote the transmitted symbol from the i-th transmit antenna at transmission interval t and dtj be the receive word at the receive antenna j. Then,",
        "d\n          t\n          j\n        \n        =\n        \n          \n            \n              ∑\n              \n                i\n                =\n                1\n              \n              n\n            \n            ⁢\n            \n              \n                \n                  α\n                  i\n                  j\n                \n                ⁡\n                \n                  (\n                  t\n                  )\n                \n              \n              ⁢\n              \n                \n              \n              ⁢\n              \n                c\n                t\n                i\n              \n              ⁢\n              \n                \n                  E\n                  s\n                \n              \n            \n          \n          +\n          \n            \n              η\n              t\n              i\n            \n            .\n          \n        \n      \n    \n    \n      \n        (\n        18\n        )\n      \n    \n  \n\n\n\n\nThis is equivalent to the assumption that signals transmitted from different antennas undergo independent fades. The coefficients αij(t are modeled as samples of a stationary complex Gaussian stochastic process with mean zero and variance 0.5 per dimension. Also, ηij are independent samples of a zero mean complex white Gaussian process with two sided power spectral density N0/2 per dimension. For the static fading case, suppose that αij(t are constant during a frame and are independent from one frame to another and a design criterion was established. When the fading is rapid, the coefficients αij(t, t=1, 2, . . . , l, i=1, 2, . . . , n, j=1, 2, . . . , m are modeled as independent samples of a complex Gaussian process with mean zero and variance 0.5 per dimension, and another design criteria is established as follows.",
        "Assuming that the coefficients αij(t for t=1, 2, . . . , l, i=1, 2, . . . , n, j=1, 2, . . . , m are known to the decoder, the probability of transmitting",
        "c\n  =\n  \n    \n      c\n      1\n      1\n    \n    ⁢\n    \n      c\n      1\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      c\n      1\n      n\n    \n    ⁢\n    \n      c\n      2\n      1\n    \n    ⁢\n    \n      c\n      2\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      c\n      2\n      n\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      c\n      1\n      1\n    \n    ⁢\n    \n      c\n      1\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      c\n      1\n      n\n    \n  \n\n\n\n\nand deciding in favor of",
        "e\n  =\n  \n    \n      e\n      1\n      1\n    \n    ⁢\n    \n      e\n      1\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      e\n      1\n      n\n    \n    ⁢\n    \n      e\n      2\n      1\n    \n    ⁢\n    \n      e\n      2\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      e\n      2\n      n\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      e\n      1\n      1\n    \n    ⁢\n    \n      e\n      1\n      2\n    \n    ⁢\n    \n      \n    \n    ⁢\n    ⋯\n    ⁢\n    \n      \n    \n    ⁢\n    \n      e\n      1\n      n\n    \n  \n\n\n\n\nat the decoder is well approximated by\n\nP(c→e|αij, i=1, 2 . . . , n, j=1, 2, . . . , m, t=1, 2, . . . , l)≦exp(−d2(c,e)Es/4NO)\n\nwhere",
        "d\n            2\n          \n          ⁡\n          \n            (\n            \n              c\n              ,\n              e\n            \n            )\n          \n        \n        =\n        \n          \n            ∑\n            \n              j\n              =\n              1\n            \n            m\n          \n          ⁢\n          \n            \n              ∑\n              \n                t\n                =\n                1\n              \n              l\n            \n            ⁢\n            \n              \n                \n                \n                  \n                    ∑\n                    \n                      i\n                      =\n                      1\n                    \n                    n\n                  \n                  ⁢\n                  \n                    \n                      \n                        α\n                        i\n                        j\n                      \n                      ⁡\n                      \n                        (\n                        t\n                        )\n                      \n                    \n                    ⁢\n                    \n                      \n                    \n                    ⁢\n                    \n                      (\n                      \n                        \n                          c\n                          t\n                          i\n                        \n                        -\n                        \n                          e\n                          t\n                          i\n                        \n                      \n                      )\n                    \n                  \n                \n                \n              \n              2\n            \n          \n        \n      \n    \n    \n      \n        (\n        19\n        )\n      \n    \n  \n\n\n\n\nThis is the standard approximation to the Gaussian tail function.",
        "Let",
        "Ω\n      j\n    \n    ⁡\n    \n      (\n      t\n      )\n    \n  \n  =\n  \n    (\n    \n      \n        \n          α\n          1\n          j\n        \n        ⁡\n        \n          (\n          t\n          )\n        \n      \n      ,\n      \n        \n          α\n          2\n          j\n        \n        ⁡\n        \n          (\n          t\n          )\n        \n      \n      ,\n      ⋯\n      ⁢\n      \n        \n      \n      ,\n      \n        \n          α\n          n\n          j\n        \n        ⁡\n        \n          (\n          t\n          )\n        \n      \n    \n    )\n  \n\n\n\n\nand C(t) denote the n×n matrix with the element at p-th row and q-th column equal to ctp−etp) ( ctq−ētq. Then it can be seen that",
        "d\n            2\n          \n          ⁡\n          \n            (\n            \n              c\n              ,\n              e\n            \n            )\n          \n        \n        =\n        \n          \n            ∑\n            \n              j\n              =\n              1\n            \n            m\n          \n          ⁢\n          \n            \n              ∑\n              \n                t\n                =\n                1\n              \n              l\n            \n            ⁢\n            \n              \n                \n                  Ω\n                  j\n                \n                ⁡\n                \n                  (\n                  t\n                  )\n                \n              \n              ⁢\n              \n                \n              \n              ⁢\n              \n                C\n                ⁡\n                \n                  (\n                  t\n                  )\n                \n              \n              ⁢\n              \n                \n              \n              ⁢\n              \n                \n                  Ω\n                  j\n                  *\n                \n                (\n                t\n              \n            \n          \n        \n      \n    \n    \n      \n        (\n        20\n        )\n      \n    \n  \n\n\n\n\nThe matrix C(t) is Hermitian, thus there exist a unitary matrix V(t) and a diagonal matrix D(t) such that C(t)=V(t)D(t)V*(t). The diagonal elements of D(t), denoted here by Dii(t), 1≦i≦n, are the eigenvalues of C(t) counting multiplicities. Since C(t) is Hermitian, these eigenvalues are real numbers. Let\n\nΛj(t)=Ωj(t)V(t)=(λ1j(t), . . . , λnj(t))\n\nthen λij(t for i=1, 2, . . . , n, j=1, 2, . . . , m, t=1, 2, . . . , l are independent complex Gaussian variables with mean zero and variance 0.5 per dimension and",
        "Ω\n        j\n      \n      ⁡\n      \n        (\n        t\n        )\n      \n    \n    ⁢\n    \n      \n    \n    ⁢\n    \n      C\n      ⁡\n      \n        (\n        t\n        )\n      \n    \n    ⁢\n    \n      \n    \n    ⁢\n    \n      \n        Ω\n        j\n        *\n      \n      ⁡\n      \n        (\n        t\n        )\n      \n    \n  \n  =\n  \n    \n      ∑\n      \n        i\n        =\n        1\n      \n      n\n    \n    ⁢\n    \n      \n        \n          \n          \n            \n              λ\n              i\n              j\n            \n            ⁡\n            \n              (\n              t\n              )\n            \n          \n          \n        \n        2\n      \n      ⁢\n      \n        \n      \n      ⁢\n      \n        \n          D\n          \n            i\n            ⁢\n            \n              \n            \n            ⁢\n            i\n          \n        \n        ⁡\n        \n          (\n          t\n          )\n        \n      \n    \n  \n\n\n\n\nBy combining this with (19) and (20) and averaging with respect to the Rayleigh distribution of |λij(t|, the following is arrived at",
        "P\n          ⁡\n          \n            (\n            \n              c\n              →\n              e\n            \n            )\n          \n        \n        ≤\n        \n          \n            ∏\n            \n              i\n              ,\n              t\n            \n          \n          ⁢\n          \n            \n              \n                (\n                \n                  1\n                  +\n                  \n                    \n                      \n                        D\n                        \n                          i\n                          ⁢\n                          \n                            \n                          \n                          ⁢\n                          i\n                        \n                      \n                      ⁡\n                      \n                        (\n                        t\n                        )\n                      \n                    \n                    ⁢\n                    \n                      \n                    \n                    ⁢\n                    \n                      \n                        E\n                        s\n                      \n                      \n                        4\n                        ⁢\n                        \n                          N\n                          0\n                        \n                      \n                    \n                  \n                \n                )\n              \n              \n                -\n                m\n              \n            \n            .\n          \n        \n      \n    \n    \n      \n        (\n        21\n        )\n      \n    \n  \n\n\n\n\nThe matrix C(t) is next examined. The columns of C(t) are all different multiples of",
        "c\n      t\n    \n    -\n    \n      e\n      t\n    \n  \n  =\n  \n    (\n    \n      \n        \n          c\n          t\n          1\n        \n        -\n        \n          e\n          \n            t\n            ⁢\n            \n              \n            \n          \n          1\n        \n      \n      ,\n      \n        \n          c\n          t\n          2\n        \n        -\n        \n          e\n          t\n          2\n        \n      \n      ,\n      …\n      ⁢\n      \n        \n      \n      ,\n      \n        \n          c\n          t\n          n\n        \n        -\n        \n          e\n          t\n          n\n        \n      \n    \n    )\n  \n\n\n\n\nThus, C(t) has rank 1 if ct1ct2 . . . ctn≠et1et2 . . . etn and r otherwise. It follows that n−1 elements in the list\n\nD11(t), D22(t), . . . , Dnn(t)\n\nare zeros and the only possible nonzero element in this list is |ct−et|2. By (21), it can now be concluded that",
        "P\n          ⁡\n          \n            (\n            \n              c\n              ->\n              e\n            \n            )\n          \n        \n        ≤\n        \n          \n            ∏\n            \n              t\n              -\n              1\n            \n            1\n          \n          ⁢\n          \n            \n              (\n              \n                1\n                +\n                \n                  \n                    \n                    \n                      \n                        c\n                        t\n                      \n                      -\n                      \n                        e\n                        t\n                      \n                    \n                    \n                  \n                  ⁢\n                  \n                    \n                      E\n                      s\n                    \n                    \n                      4\n                      ⁢\n                      \n                        N\n                        0\n                      \n                    \n                  \n                \n              \n              )\n            \n            \n              -\n              m\n            \n          \n        \n      \n    \n    \n      \n        (\n        22\n        )\n      \n    \n  \n\n\n\n\nLet V(c,e) denote the set of time instances 1≦t≦l such that |ct−et|≠0 and let |V(c,e)| denote the number of elements of v(c,e). Then it follows from (22) that",
        "P\n          ⁡\n          \n            (\n            \n              c\n              ->\n              e\n            \n            )\n          \n        \n        ≤\n        \n          \n            ∏\n            \n              l\n              ∈\n              \n                v\n                ⁡\n                \n                  (\n                  \n                    c\n                    ,\n                    e\n                  \n                  )\n                \n              \n            \n          \n          ⁢\n          \n            \n              (\n              \n                \n                  \n                    \n                    \n                      \n                        c\n                        t\n                      \n                      -\n                      \n                        e\n                        t\n                      \n                    \n                    \n                  \n                  2\n                \n                ⁢\n                \n                  \n                    E\n                    s\n                  \n                  \n                    4\n                    ⁢\n                    \n                      N\n                      0\n                    \n                  \n                \n              \n              )\n            \n            \n              -\n              m\n            \n          \n        \n      \n    \n    \n      \n        (\n        23\n        )\n      \n    \n  \n\n\n\n\nIt follows that a diversity of m|V(c,e)| is achieved. Examining the coefficient of (Es/4N0)−mV(c,e) leads to the desired design criterion. Below, this criterion is combined with that of static flat fading case given before to arrive at a hybrid criteria.\n\nU. A Hybrid Design Criteria for for Smart Greedy Space-Time Codes:",
        "The Distance/Rank Criterion: In order to achieve the diversity υm in a rapid fading environment, for any two codewords c and e the strings ct1ct2 . . . ctn and et1et2 . . . etn must be different at least for υ values of 1≦t≦n. Furthermore, let",
        "B\n    ⁡\n    \n      (\n      \n        c\n        ,\n        e\n      \n      )\n    \n  \n  =\n  \n    (\n    \n      \n        \n          \n            \n              e\n              1\n              1\n            \n            -\n            \n              c\n              1\n              1\n            \n          \n        \n        \n          \n            \n              e\n              2\n              1\n            \n            -\n            \n              c\n              2\n              1\n            \n          \n        \n        \n          …\n        \n        \n          …\n        \n        \n          \n            \n              e\n              1\n              1\n            \n            -\n            \n              c\n              1\n              1\n            \n          \n        \n      \n      \n        \n          \n            \n              e\n              1\n              2\n            \n            -\n            \n              c\n              1\n              2\n            \n          \n        \n        \n          \n            \n              e\n              2\n              2\n            \n            -\n            \n              c\n              2\n              2\n            \n          \n        \n        \n          …\n        \n        \n          …\n        \n        \n          \n            \n              e\n              t\n              2\n            \n            -\n            \n              c\n              t\n              2\n            \n          \n        \n      \n      \n        \n          \n            \n              e\n              1\n              3\n            \n            -\n            \n              c\n              1\n              3\n            \n          \n        \n        \n          \n            \n              e\n              2\n              3\n            \n            -\n            \n              c\n              2\n              3\n            \n          \n        \n        \n          ⋰\n        \n        \n          …\n        \n        \n          \n            \n              e\n              t\n              3\n            \n            -\n            \n              c\n              t\n              3\n            \n          \n        \n      \n      \n        \n          ⋮\n        \n        \n          ⋮\n        \n        \n          ⋰\n        \n        \n          ⋰\n        \n        \n          ⋮\n        \n      \n      \n        \n          \n            \n              e\n              1\n              n\n            \n            -\n            \n              c\n              1\n              n\n            \n          \n        \n        \n          \n            \n              e\n              2\n              n\n            \n            -\n            \n              c\n              n\n              n\n            \n          \n        \n        \n          …\n        \n        \n          …\n        \n        \n          \n            \n              e\n              t\n              n\n            \n            -\n            \n              c\n              t\n              n\n            \n          \n        \n      \n    \n    )\n  \n\n\n\n\nIf B(c,e) has minimum rank r over the set of pairs of distinct codeword, then a diversity of rm is achieved in static flat fading environments.",
        "The Product/Determinant Criterion: Let V(c,e) denote the set of time instances 1≦t≦l such that ct1ct2 . . . ctn≠et1et2 . . . etn and let",
        "\n      \n        \n          c\n          t\n        \n        -\n        \n          e\n          t\n        \n      \n      \n    \n    2\n  \n  =\n  \n    \n      ∑\n      \n        i\n        =\n        1\n      \n      n\n    \n    ⁢\n    \n      \n        \n          \n          \n            \n              c\n              t\n              i\n            \n            -\n            \n              e\n              t\n              i\n            \n          \n          \n        \n        2\n      \n      .\n    \n  \n\n\n\n\nThen to achieve the most coding gain in a rapid fading environment, the minimum of the products",
        "∏\n    \n      t\n      ∈\n      \n        v\n        ⁡\n        \n          (\n          \n            c\n            ,\n            e\n          \n          )\n        \n      \n    \n  \n  ⁢\n  \n    \n      \n      \n        \n          c\n          t\n        \n        -\n        \n          e\n          t\n        \n      \n      \n    \n    2\n  \n\n\n\n\ntaken over distinct codewords e and c must be maximized. For the case of a static fading channel, the minimum of r-th roots of the sum of determinants of all r×r principal cofactors of A(c,e)=B(c,e)B*(c,e) taken over all pairs of distinct codewords e and c corresponds to the coding gain, where r is the rank of A(c,e).",
        "The construction of illustrative implementations of smart greedy codes according to this embodiment of the invention is illustrated with some examples. It will be assumed that at the beginning and the end of the frame, the encoder is in the zero state.",
        "Suppose that a transmission rate of 0.5 bits/sec/Hz is required. In this example and as illustrated in FIG. 27(a), the BPSK constellation is used, with 0 denoting √{square root over (Es)} and 1 denoting −√{square root over (Es)}. The objective is to guarantee diversity gains 2 and 4 respectively in slow and rapid flat fading environments. The following code using M-TCM construction guarantees these diversity gains. At any time 2k+1, k=0, 1, 2, . . . depending on the state of the encoder and the input bit a branch is chosen by the encoder and the first coordinate and second coordinates of the labels are sent simultaneously from Tx antennas at times 2k+1 and 2k+2. For instance at time 1, if the branch label 10 11 is chosen, symbols 1,0 and 1,1 are sent respectively from transmit antennas one and two at times one and two.",
        "Here a transmission rate of 1 bits/sec/Hz and diversity gains of 2 and 3 respectively in static and rapid flat fading environments are desired. In this example, illustrated in FIG. 27(b), the 4-PSK constellation is used instead. The objective is to guarantee diversity gains 2 and 3 respectively in slow and rapid flat fading environments. The following code using M-TCM construction guarantees these diversity gains. At times t=3k, k=0, 1, 2, . . . , three bits of data arrive at the encoder. The first bit choose a branch depending on the state of the encoder and the rest of two bits choose one of the 4 labels of that branch such as bt1bt2bt+11bt+12bt+21bt+22. Then bt1, bt+11 and bt+21 are sent via antenna 1 respectively at times t, t+1 and t+2. Similarly, bt2, bt+12 and bt+22 are sent via antenna 2 respectively at time t, t+1 and t+2.",
        "As before, the inventors have simulated the performance of communication systems designed based on the above code. Excellent results have been confirmed in both fast and slow fading environments.",
        "The foregoing description of the system and method of the invention is illustrative, and variations in construction and implementation will occur to persons skilled in the art. For example, although the present invention is described in the time domain, frequency domain analogs or variants of it easily occur to those skilled in the art. For instance, space-time codes presented in the second illustrative embodiment can be easily applied to DS-CDMA communication systems. To illustrate, assume that user X is provided with two transmit antennas (with generalization to n antennas being trivial to those skilled in the art). User X chooses a space-time code designed to be used with two transmit antennas. User X can use a similar PN sequence for data transmission from both antennas. At the receiver side, correlation with the aforementioned sequence gives a sum of faded versions of the signals transmitted from each antenna. In this light, decoding of the space-time code can be carried out in a manner similar to those described in the second embodiment of this work as well.",
        "Alternatively, user X can use distinct PN sequences for transmission from both transmit antennas. If the PN sequences used to transmit from both antennas are orthogonal to each other, at the receiver correlation with the first or second sequence gives respectively noisy versions of the transmitted signals from antennas one or two, which can be used for decoding at the receiver. This has a penalty in terms of bandwidth expansion but can be used to increase the data rate and/or provide diversity advantage.",
        "In general, it is also possible to choose two arbitrary PN sequences for two transmit antennas. Correlation with these sequences at the receiver side gives sums of faded versions of multiples of the transmitted signals that can be used for decoding.",
        "The above discussion demonstrates a DS-CDMA analog of the space-time coding. Analogs of the embodiments of the present invention in frequency domain also can easily be obtained, but are not discussed here.",
        "For further instance, while mobile cellular implementations have been described, the invention could be applied to other communication environments. The invention is accordingly intended to be limited only by the following claims."
    ],
    "citations": [
        "3633107",
        "4489418",
        "4520490",
        "4597090",
        "4945549",
        "5029185",
        "5305353",
        "5396518",
        "5406585",
        "5418798",
        "5479448",
        "5659578",
        "5737365",
        "5796788",
        "5844951",
        "5867478",
        "WO 99/14871"
    ],
    "us_classification": "375299",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "04",
            "subclass": "L",
            "main_group": "27",
            "subgroup": "04"
        }
    ]
}