{
    "title": "Shoulder prosthesis",
    "abstract": "A system and method for installing a shoulder prosthesis. The method includes removing the original humeral head and shaping the proximal end of the humerus with one or more implements to prepare the humerus to receive the shoulder prosthesis.",
    "inventors": [
        "Huebner"
    ],
    "document_number": "07297163",
    "publication_date": "20071120",
    "assignees": [
        "Acumed LLC"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An apparatus for repairing a fractured humeral bone, comprising:",
            "components": [
                {
                    "component": "a shoulder prosthesis having a head for placement outside the humeral bone and a shaft that is positionable within the medullary canal of the humeral bone, the shaft having one or more holes; and",
                    "subcomponents": []
                },
                {
                    "component": "a positioning jig for positioning the shoulder prosthesis at an adjustable height in the medullary canal of the humeral bone, the positioning jig including",
                    "subcomponents": [
                        "a first mechanism configured to engage a broken or cut surface of the humeral bone, and",
                        "a second mechanism coupled to the first mechanism and configured to engage and hold the shoulder prosthesis at the adjustable height relative to the first mechanism engaged with the broken or cut surface of the humeral bone,"
                    ]
                },
                {
                    "component": "a first mechanism configured to engage a broken or cut surface of the humeral bone, and",
                    "subcomponents": []
                },
                {
                    "component": "a second mechanism coupled to the first mechanism and configured to engage and hold the shoulder prosthesis at the adjustable height relative to the first mechanism engaged with the broken or cut surface of the humeral bone,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the positioning jig is configured to target one or more locations on the humeral bone corresponding to the one or more holes, so that a fastener may be inserted through the humeral bone and at least one of the one or more holes.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The apparatus of claim 1 , wherein the first mechanism is configured to restrict movement of the shoulder prosthesis farther into the medullary canal, when the first mechanism engages the broken or cut surface of the humeral bone, while allowing such movement out of the medullary canal.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The apparatus of claim 1 , wherein the second mechanism is coupled slidably to the first mechanism to allow the height of the shoulder prosthesis to be adjusted in relation to the broken or cut surface of the humeral bone.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The apparatus of claim 1 , wherein the shaft includes one or more spaced markings to facilitate positioning of the shoulder prosthesis at a desired height.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The apparatus of claim 1 , wherein the positioning jig further includes a third mechanism coupled to at least one of the first and second mechanisms and configured to allow the shoulder prosthesis to be positioned with a desired retroversion in the humeral bone.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The apparatus of claim 5 , wherein the third mechanism includes an alignment rod coupled to the second mechanism at a predetermined angle relative to the shoulder prosthesis.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. An apparatus for repairing a fractured humeral bone, comprising:",
            "components": [
                {
                    "component": "a shoulder prosthesis having a head for placement outside the humeral bone and a shaft positionable within the medullary canal of the humeral bone, the shaft including a plurality of spaced reference marks, the reference marks being disposed along the shaft and configured for measuring height; and",
                    "subcomponents": []
                },
                {
                    "component": "a positioning jig for positioning the shoulder prosthesis at a desired height in the medullary canal, the positioning jig including",
                    "subcomponents": [
                        "a first mechanism configured to engage a portion of the upper arm, and",
                        "a second mechanism coupled to the first mechanism and configured to engage and hold the shoulder prosthesis at the desired height relative to the first mechanism engaged with the portion of the upper arm."
                    ]
                },
                {
                    "component": "a first mechanism configured to engage a portion of the upper arm, and",
                    "subcomponents": []
                },
                {
                    "component": "a second mechanism coupled to the first mechanism and configured to engage and hold the shoulder prosthesis at the desired height relative to the first mechanism engaged with the portion of the upper arm.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The apparatus of claim 7 , wherein the first mechanism is configured to engage an exposed portion of the humeral bone.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The apparatus of claim 8 , wherein the shaft is configured so that at least one of the reference marks is visible adjacent an exposed portion of the humeral bone when the shoulder prosthesis is positioned at the desired height.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The apparatus of claim 8 , wherein the first mechanism is movable relative to the second mechanism to position different ones of the reference marks most proximate to an exposed portion of the humeral bone.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The apparatus of claim 7 , wherein the first mechanism is configured to engage a broken or cut surface of the humeral bone.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The apparatus of claim 7 , wherein the first mechanism is configured to restrict movement of the shoulder prosthesis farther into the medullary canal, when the first mechanism engages the portion of the upper arm, while allowing such movement out of the medullary canal.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The apparatus of claim 7 , wherein the second mechanism is coupled slidably to the first mechanism to allow the height of the shoulder prosthesis to be adjusted in relation to the portion of the upper arm.",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation of U.S. patent application Ser. No. 09/507,564, filed Feb. 18, 2000 now U.S. Pat. No. 6,494,913, which is a continuation-in-part of U.S. patent application Ser. No. 09/191,928, filed Nov. 13, 1998, now U.S. Pat. No. 6,102,953, which is a continuation-in-part of U.S. patent application Ser. No. 09/165,475, filed Oct. 2, 1998, now U.S. Pat. No. 6,193,758, and U.S. patent application Ser. No. 09/040,504, filed Mar. 17, 1998, now U.S. Pat. No. 5,961,555. These priority applications are each incorporated herein by reference in their entirety for all purposes.",
        "This invention relates generally to bone prostheses and more particularly to a system for facilitating installation of a shoulder prosthesis.",
        "When a joint, such as the hip or shoulder, becomes impaired due to arthritis, disease or trauma, it is sometimes necessary to replace all or part of the joint with a prosthesis to restore function. For instance, hip replacement, where a prosthesis is provided to replace the femoral head and in some cases all or part of the acetabulum, has become a common procedure to treat femoral head fractures and arthritis in elderly patients. As a result of anatomical constraints and challenges in the shoulder, shoulder implants have historically been much less successful and less common than hip replacements. Recently, however, shoulder arthroplasty has emerged as an accepted treatment for severe arthritis and humeral head fractures.",
        "As a consequence of the increasing acceptance of shoulder prostheses, many different devices have been developed to address various problems that have arisen and to offer additional benefits and features. In the simplest form, a shoulder prosthesis is formed as a single piece with a head to articulate with the glenoid cavity, and a stem to extend down the medullary canal of the humerus and support the head. While simple to construct, unitary implants do not offer any adjustability to accommodate the natural variations in size and geometry that occur among joints of different patients. To accommodate these variations, a large stock of devices must be manufactured and maintained to insure that an adequate match can be achieved during an operation. Stocking the large number of devices is a significant expense with one-piece designs, and in some cases a surgeon may not be provided with sufficient flexibility to achieve an ideal fit to the patient.",
        "To avoid the expense of maintaining a large stock of single-piece prosthetics and to provide increased flexibility to surgeons, many shoulder implant makers have gone to a modular design that is assembled during the operation from two or three pieces. These pieces include a head to articulate with the glenoid and a stem structure on which the head is mounted and secured to the bone. In some cases, the stem includes a separate body portion disposed between the head and an intermedullary portion of the stem that extends down the medullary canal. By utilizing a modular design, a wide variety of devices can be assembled from only a few pieces, thus providing increased flexibility to accommodate anatomical variation and eliminating much of the cost associated with maintaining a large selection of one-piece devices.",
        "Existing modular shoulder designs most commonly rely on a taper lock mechanism to secure the head to the rest of the implant. In at least some devices the portion of the taper lock on the head is offset to compensate for anatomical posterior offset of the humeral head. For instance, the taper lock portion on the head may be offset by 2-4 millimeters. By rotating the head, any offset between plus and minus the 2-4 millimeters can be achieved. Unfortunately, rotating an offset head can introduce a medial/lateral and/or superior/inferior offset at the same time the anterior/posterior positioning is adjusted. Furthermore, the offset between the center of the taper lock and the geometrical center of the head creates a torque which tends to rotate the head relative to the remainder of the implant, thereby increasing the chance of loosening of the head. As the offset increases, the resultant torque increases as well, making this a greater problem for larger offsets. Although such problems are incumbent in existing offset head designs, a posterior offset is generally desirable to better match the natural anatomy.",
        "In addition to the specific drawbacks associated with various existing implant designs, there are a number of general problems inherent in shoulder replacements. In particular, it is generally difficult to establish the proper position and orientation for the implant in the humerus. One of the more important variables is the rotational position, or retroversion, of the head on the humerus. Anatomically, the average retroversion between a plane defined by the perimeter of the anatomical head and the axis of the flexed forearm is approximately 30-degrees. Unfortunately, with existing implants and techniques for their installation, it has been very difficult to reliably reproduce desired retroversion. Establishing correct retroversion is important because incorrect retroversion can lead to problems with subsequent dislocation.",
        "In addition to the retroversion of the implant, it is necessary to establish the correct height of the implant on the humeral shaft. With existing designs, the surgeon slips the stem into the medullary canal and makes an educated guess at the proper height. Excess height may create too much tension in the deltoid, while inserting the implant too far down the humerus can result in deltoid lag. Similarly, the offset of the face of the head relative to the stem must be established correctly or excess or insufficient tension in the rotator cuff may be created. Unfortunately, with existing designs there is no way to evaluate implant height or head offset prior to final installation, after which correction is difficult.",
        "When an implant is used as treatment for an arthritic shoulder joint, it is necessary to remove the existing humeral head and prepare the proximal end of the humeral shaft to receive the implant. It is important that the humeral preparation be accurate so that the position of the implant, which is determined in part by the configuration of the proximal end of the humerus, replicates the original anatomic position of the humeral head.",
        "The present invention is a system and method for installing a shoulder prosthesis having a head and an elongate stem portion including a proximal end connected to the head, a distal section for insertion into a medullary canal of a humeral bone. The method includes removing the original humeral head and shaping the proximal end of the humerus with one or more implements to prepare the humerus to receive the shoulder prosthesis.",
        "FIG. 1 is an exploded isometric view of a modular shoulder implant constructed according to the present invention.",
        "FIG. 2 shows a modular shoulder implant kit constructed according to the present invention.",
        "FIG. 3 is a cross-sectional view of a shaft of the implant of FIG. 1.",
        "FIGS. 4-9 are various views of a body portion of the implant of FIG. 1.",
        "FIGS. 10-13 are various views of a head portion of the implant of FIG. 1.",
        "FIG. 14 is an isometric view of the backside of the head of FIGS. 10-13.",
        "FIG. 15 is an isometric view of the head partially installed on the body.",
        "FIG. 16 is a cross-sectional view of the implant along line 8-8 of FIG. 3.",
        "FIG. 17 is a medial elevational view of the implant of FIG. 1.",
        "FIG. 18 is an isometric view of a targeting/installation instrument according to the present invention.",
        "FIG. 19 is a lateral elevational view of the targeting/installation instrument of FIG. 18.",
        "FIG. 20 is an elevational view from above of the targeting installation instrument of FIG. 18.",
        "FIG. 21 is an isometric view of the implant of FIG. 1 in an assembled configuration.",
        "FIG. 22 is a side elevational view of an implant showing reference marks.",
        "FIG. 23 is a side elevational view of a body constructed according to the present invention.",
        "FIG. 24 is an elevational view of the rear surface of a head constructed according to the present invention.",
        "FIG. 25 is an elevational view along line 25-25 in FIG. 23.",
        "FIG. 26 is a side elevational view of a reamer disposed within the medullary canal.",
        "FIG. 27 is an isometric view of the reamer of FIG. 26 and showing a cutting guide attached to the reamer and an alignment structure attached to the cutting guide.",
        "FIG. 28 is a top plan view of the reamer of FIG. 27, showing alignment of the alignment structure with the patient's forearm.",
        "FIG. 29 is a side elevational view of the reamer of FIG. 26 and showing a counter-bore cutting instrument and a counter-bore bushing installed in the cutting guide.",
        "FIG. 30 is an isometric view of the counter-bore cutting instrument and counter-bore bushing of FIG. 29.",
        "FIG. 31 is a side elevational view of the reamer of FIG. 26 and showing a chisel cutting instrument and a chisel bushing installed in the cutting guide. The chisel cutting instrument, chisel bushing, and a portion of the cutting guide are shown in cross-section.",
        "FIG. 32 is an isometric view of the chisel cutting instrument and chisel bushing of FIG. 31.",
        "A shoulder implant constructed according to the present invention is shown generally at 10 in FIG. 1. Implant 10 includes a head 12 and a stem 14. The stem preferably includes a distal shaft 16 and a body 18. The components making up implant 10 are preferably chosen from a kit 20 of interchangeable shafts, bodies and heads, as shown in FIG. 2. By selecting an appropriate shaft, body and head from kit 20, a surgeon is able to create an implant that is sized properly for almost any patient. Positional references such as anterior/posterior, medial/lateral and proximal/distal used herein are made with reference to an implant as it would be positioned in a patient.",
        "Shaft 16 is shown in greater detail in FIG. 3 and includes a proximal tapered end 30 extending distally to a shoulder 32 which tapers smoothly into a cylindrical medial region 34 with distal locking holes 36, 38. As can be seen in FIG. 2, the shaft can have a medial region of varying diameter and/or varying length. Generally speaking, the longer shafts are used where there is a mid-shaft fracture in addition to the proximal trauma. The varying diameter short shafts are used to accommodate size variations in the proximal end of the humerus. Either or both of holes 36, 38 may be elongated to allow for movement of the medial region over the locking screws. This is normally desirable when the implant is used to treat a combined mid-shaft fracture.",
        "A rounded and tapered distal tip 40 is formed on the end of medial region 34. Shaft 16 preferably includes a central canulation 42 which can be used to guide the implant into the humerus with the aid of a guide wire. As best shown in FIG. 1, an alignment notch 44 is formed in shoulder 32 to aid in establishing the correct orientation of the body on the shaft, as will be described below. A threaded hole 46 is formed in tapered end 30 to receive a screw 50 which is used to draw the body firmly onto the tapered end. A wiring hole 48 is provided just distal of shoulder 32 to allow tension band wiring to be secured through the implant. In addition, when the implant is to be cemented in place, a K-wire can be driven through humerus and hole 48 to fix the position of the implant while the cement cures.",
        "As indicated in FIG. 1, body 18 mounts to the top of shaft 16. Referring to FIGS. 4-9, body 18 has a distal end 54 with a cylindrical tapering socket 56 extending upwardly therefrom into the body. Socket 56 is sized to receive tapered end 30 of shaft 16 and taper-lock thereto to allow the body to be securely mounted to the shaft. A proximal bore 58 extends from the socket to the top of the body to the previously discussed screw to engage the top of the shaft to draw it into the socket. A small rib 60 is provided in the bore to engage against the head of the screw.",
        "A small finger 62 projects down from the distal end of body 18 adjacent the socket to engage alignment notch 44 as the body is installed on the shaft. See FIGS. 1 and 17. This ensures the proper rotational positioning of the body on the shaft so that the various holes in the shaft are oriented correctly. Body 18 further includes a lateral rib 64 with three suture holes 66 which aid in securing the fracture fragments to the implant. Upper and lower medial suture holes 68, 70 are also provided in body 18 to offer additional options in securing the fragments. A medially positioned, anteriorly oriented threaded hole 72 is formed in body 18 to receive a screw for securing the head to the body. Hole 72 also serves as a mounting point for a targeting/installation instrument used with the implant. A recess 74 is located at the top of the hole and includes a keying notch 76 for orienting the targeting/installation instrument. See FIGS. 1 and 4. The recess allows the screw head to install substantially flush with the surface of the body to minimize the amount of bone removal required to insert the stem into the humerus.",
        "Body 18 includes a medially facing inclined mounting surface 80 at the proximal end onto which head 12 is mounted. Head 12 is secured to body 18 by coupling structure 82 which includes a fitting in the form of a pedestal or dovetail 84 located on mounting surface 80. As shown in FIGS. 6 and 8, dovetail 84 is tapered from anterior to posterior to establish a taperlock with the head, as will be described below. Because the dovetail is tapered, the body has a left or right orientation depending on which shoulder is to be replaced. Thus, as shown in FIG. 2, the kit will preferably include two or more bodies. Additional bodies, over and above one left and one right, may be provided to accommodate different stem diameters or head angles, etc.",
        "Head 12, which is preferably formed as a unitary member, as opposed to being assembled from two or more components, includes a generally semi-spherical articulation surface 90 which is adapted to engage the glenoid cavity in the shoulder. See FIGS. 10-13. Because the glenoid cavity does not define a close fitting socket, such as found in the acetabulum in the hip joint, the articulation surface only needs to be sufficiently spherical to allow smooth articulation in the glenoid cavity.",
        "As best shown in FIG. 14, articulation surface 90 is bounded by an articular margin 92 which defines an articular plane 94 generally normal to a head axis 96. In the preferred embodiment, where the head is substantially spherical, the head axis represents a central axis of rotational symmetry for the articulation surface and a center of curvature 98 lies on the head axis. See FIG. 11. As shown by the dotted lines in FIG. 13, the various heads are preferably formed with the same radius, but simply represent larger portions of a sphere. It is believed that this best reflects the actual anatomical characteristics.",
        "In the most commonly occurring fracture pattern, the anatomic head fractures generally through the articular margin and plane. The articular plane defines generally the distal extent of head 12. This is important when it is necessary to remove the head as part of a revision procedure, because the present invention allows the head to be removed from an anterior direction without dislocation of the joint and the associated trauma. This is not the case with existing implant heads, which cannot be separated from the body for removal without first dislocating the joint. It is desirable, although not required, that the head not project substantially beyond the articular plane in the present invention so that it is possible to slide the head out of the joint in an anterior direction without disruption of the surrounding bone. Because the remainder of the humerus is distal to the articulation plane, the head may be slid out in that plane without disruption of the surrounding bone as long as the head does not project substantially beyond the articular plane. Thus, the coupling structure is adapted to allow the head to be installed on and removed from the stem without dislocating the shoulder after the implant has been installed in the shoulder.",
        "Head 12 includes a mounting surface or backside 100 disposed opposite the articulation surface and separated from the articulation surface by the articular margin. Backside 100 includes a portion of coupling structure 82 in the form of a transverse track or undercut channel 102. Channel 102 is cut to match the cross-sectional shape and taper of dovetail 84 and includes an open end 104 and an inner end 106. A cylindrical recess 108 extends from the perimeter of the head past the inner end of the channel and to a stop 110. A groove 112 is formed in recess 108 near the edge of the head.",
        "The channel is sized so that the head is guided onto the body and the dovetail taperlocks in the channel when the head is properly positioned. See FIG. 10. The taperlock connection is important because it rigidly secures the components and prevents them from fretting against each other and generating debris over time. The coupling structure of the present invention may also be described as a transversely acting taper lock, with a portion of the taper lock being disposed on the head and a portion disposed on the body. The taper lock of the present invention is transverse acting in that it does not rely on motion along the axis of the head to lock, contrary to existing designs. In fact, it can be seen that, when the head is engaged on the stem, the coupling structure mechanically interlocks the head against motion transverse to the articular plane. This is in contrast to existing designs, which simply rely on a frictional interconnection in the direction transverse to the articular plane.",
        "A locking member in the form of a screw 114 is provided to draw the head firmly onto the body to properly seat the taperlock. In particular, after head 12 is initially positioned on the body, as shown in FIG. 15, it is slid generally into position and screw 114 is installed into hole 72 with the head of the screw fitting closely into cylindrical recess 108. See FIG. 16. As the screw is driven in, the head of the screw engages stop 110 to pull head 12 firmly onto body 18. Screw 114 also serves as a backup interlock to insure that the head does not become dislodged. The head of the screw not seat completely against the body because some space must be left to accommodate machining tolerances in the coupling structure so that the taper lock may be drawn tight in all cases.",
        "When it is necessary to remove the head, as in a revision, a tool 120 with a flange 122 secured near the tip of the tool is utilized. See FIG. 16. The tip of the tool is initially installed in the screw head from a slight angle away from the head and then the tool is rotated toward the head to engage the flange with taper breaking surface in the form of a groove 112 formed in recess 108. As the screw is backed out, the flange pulls against the head to dislodge the taperlock. Thus, the head can be removed with application of external force to the implant, as has been required with prior designs. This reduces the chance that the entire implant will be loosened when only the head needs to be removed.",
        "Installation of the implant of the present invention is facilitated by a targeting/installation instrument, shown generally at 130 in FIG. 18. Instrument 130 includes a template member 132 to which are mounted a mounting bar 134, a height adjusting mechanism 136 and a retroversion guide 138. Mounting bar 134 serves to join template member 132 to implant 10. In particular, bar 134 is hollow and includes a tab 140 (not shown) at the free end. The bar receives a bolt 142 with a head 144 and a threaded end 146. To attach the instrument to the implant, the free end of the bar is placed in recess 74 and aligned so that tab 140 fits into keying notch 76. This establishes the correct alignment between the template and the implant. The threaded end of the bolt is then screwed into hole 72 to secure the instrument to the implant. The bar includes a flat 148 to allow the bar to reach body 18 without engaging head 12. In addition, the screw that secures the head to the body is not installed until after the instrument is removed.",
        "Once the instrument is mounted to the implant, the stem is inserted into the shaft of the humerus. In the typical fracture pattern, the head and greater and lesser tubercles are separated from the remainder of the humerus, leaving a pipe-like upper shaft. As a result, there is no remaining reference for the correct height of the implant head relative to the top of the humeral shaft. It is important to position the head at the correct height relative to the humeral shaft to avoid excess tension on the deltoid muscle by having the head too high or deltoid lag where the head is too low and the deltoid must undergo some contraction prior to starting to move the arm.",
        "The height adjusting mechanism allows the surgeon to temporarily set the height of the head and then evaluate the deltoid tension. In particular, as shown in FIGS. 18 and 19, height adjusting mechanism 136 includes a guide bar 150 which is movably mounted to a carriage 152, which is driven up and down along a threaded rod 154. With the implant in a humeral shaft 156, the guide bar is positioned to sit on top 158 of the humeral shaft. The surgeon can then adjust the implant up or down by turning the threaded rod. The guide bar establishes a predetermined height, which can be maintained while retroversion is set and even if the implant is removed and reinserted, as when bone cement is used.",
        "After establishing the correct height the surgeon can use the retroversion guide to set correct retroversion, as shown in FIG. 20. The retroversion guide includes an L-shaped rod 160 with a lower sighting arm 162. Rod 160 is pivotally and slidably mounted to template 132 to allow the height and angular orientation of the sighting arm to be adjusted. A set screw 164 allows the position of the rod to be fixed once it is in the desired orientation. In use, the sighting arm is set for a predetermined retroversion angle relative to the head axis, for instance 30-degrees. This can be accomplished before attachment to the implant using a protractor jig (not shown). With the sighting arm set to the correct orientation, the patient's forearm is flexed to approximately 90-degrees to the humerus. The surgeon then rotates the implant to align the sight arm with the axis of the forearm, thereby easily and accurately establishing the desired retroversion.",
        "Once the correct height and retroversion is established, a cannulated drill guide 170 is inserted through guide holes 172 provided in the distal end of the template member. See FIG. 18. Guide holes 172 are oriented to target locking holes 36 in the end of the stem. A drill 174 is inserted though the drill guide to bore through the bone over the locking holes. One or two screws are installed through the humerus and locking holes to secure the implant in place.",
        "As shown by the dotted lines in FIG. 19, it is possible to attach the greater tubercle 159 to the implant prior to final securing of the head. This allows the surgeon to evaluate the tension in the rotator cuff and make corrections, if necessary, by moving to a smaller or larger head. One other feature of the present invention is the provision of suture supports 180, shown in FIG. 21, which serve to distribute the force of the suture over the bone. Particularly in trauma cases, the bone is very soft and without supports 180, the sutures will sometimes pull through the bone. By utilizing the supports, the surgeon can obtain the desired suture tension without risk of the suture pulling through the surface of the bone.",
        "The targeting/installation instrument is provided in left and right versions, although it would also be possible to make mounting bar 134 reversible or symmetric to accommodate left and right bodies. In addition, a longer template member would be used with the longer shafts used to treat mid-shaft fractures.",
        "Installation and alignment of the implant can also be facilitated by placing indications or reference marks on the implant, as shown at 200 in FIG. 22. Reference marks 200 are placed in an alignment section 202 of the stem, generally in the area of the stem, which will lie adjacent the top of the humeral shaft when installed. Preferably, the reference marks include one or more angular marks such as angular indication 204 and multiple vertically spaced gradations 206, allowing both height and angular orientation to be monitored. A plurality of indicia such as letters 208 are applied to the vertically spaced gradations marks at intervals to make identifying a particular gradation easier. The marks can be laser marked on the surface of the implant, etched into the implant or applied via any other standard marking process. The marks and indicia would normally be viewed from the anterior direction and are therefore preferably placed on that side. In the case of implants that can be placed on either the left or right side, the marks and indicia would preferably be formed on both sides of the implant so that they were visible in either case.",
        "In use, the surgeon first installs one or more trial prostheses to obtain proper fit and positioning in the fashion described above. The trial prostheses are typically identical to the actual prosthesis, but are assembled from a kit of components that are reused from operation to operation. The trial prostheses are equipped with reference marks at the same locations as the actual prosthesis. Once the correct fit and positioning are established, the surgeon notes which gradation is positioned adjacent to the top of the humeral shaft. The surgeon then marks the bone with a methylene blue dye marker at the top of the shaft in line with the angular indication. The surgeon can then take the actual implant and place it in the bone and replicate the trial position, which includes an angular orientation and a depth component, by aligning the previously noted marks on the actual implant with the previously determined location on the bone.",
        "The alignment marks may be implemented on a modular or unitary implant and may be used alone or in conjunction with the above-described targeting instrument. Moreover, such marks are beneficial, even when used without a trial device, to verify that an implant has not moved after the desired position has been established.",
        "Another embodiment of a body for use with a shoulder implant according to the present invention is shown at 218 in FIG. 23. Body 218 is similar in construction to body 18, but includes a tapered stud 222 formed on an upper mounting surface 280. A head 212 is adapted to be mounted to body 218 by mounting on stud 222. More specifically, the head includes a tapered bore 226 which fits over stud 222 and is sized to form a taper lock therewith, thus securing the head to the body. See FIG. 24. A collar 224 forms the lower boundary of mounting surface 280. The collar serves to prevent the body from subsiding down into the humerus and creating an outward pressure on the head tending to loosen the taper lock.",
        "As best seen in FIG. 25, the axis of the tapered stud is offset from an anterior/posterior plane 228 of the body and stem. In the disclosed embodiment, the offset, indicated at 229, is approximately two millimeters in the posterior direction, as implanted. Generally, suitable offset could be between approximately 1 and 5 millimeters. As a result of the offset, the bodies are provided in left and right versions, which are mirror images of each other.",
        "In the disclosed embodiment, the tapered bore is positioned approximately 1 millimeter offset from the center of the head as depicted at 227 in FIG. 24. This offset allows the surgeon to rotate the head to achieve any desired offset between 1 and 3 millimeters. By offsetting the tapered stud from the anterior/posterior plane, the surgeon is able to achieve a range of posterior offsets without introducing excessive superior/inferior offsets. Although the head is shown with an offset, it is possible that the head might not have any offset, thus eliminating any superior/inferior offset. One of the benefits of eliminating head offset is that it is possible to introduce the desired anterior/posterior offset via the body without introducing other perturbations into the positioning of the head. It is generally desirable to keep the head offset to a minimum to reduce the torque created by the offset.",
        "In addition to providing the body in left and right versions, it may be desirable to provide multiple left and right bodies with various offsets. Because heads are substantially more costly to produce than bodies, providing multiple bodies offers a more economical approach to achieving a wide variety of anatomical offsets. The body can be manufactured by machining from bar stock or may be cast. Another benefit of providing side-specific bodies is that the size of the body can be kept to a minimum in comparison to adjustable bodies. Minimizing the size of the body reduces the amount of bone that must be removed to install the implant.",
        "The anterior/posterior offset described in the context of a cylindrical taper lock may also be implemented on the dovetail taper lock previously described by simply offsetting the taper lock in the head or on the body or both.",
        "When one of the implants describe above is used as treatment for arthritis rather than fracture repair, it is necessary to resect the humeral head. It is important that the resection process leaves a surface at the top of the humeral shaft with a correct retroversion, inclination and height because the resection-surface supports and orients the prosthesis. The first step in this process according to a preferred embodiment of the present system is to make a coarse resection of the head. The coarse resection can be accomplished with a saw, osteotome or other tool.",
        "Once the initial, coarse resection is complete, a reamer, such as shown at 300 in FIG. 26, is used to form a bore down the medullary canal of the humerus. Typically, one or more reamers of increasing size are used until the desired fit is obtained. The final size will depend on the size of the patient and the anatomy of the humerus. The final size should result in a relatively snug fit of the reamer in the medullary canal, which will translate to a correspondingly good fit of a distal portion of a stem with a size matching the reamer.",
        "Reamer 300 includes a distal fluted section 302 and a proximal ratchet drive handle 304. A clearance notch 306 is located just below a depth line 308 or other suitable reference indicia. The reamer is driven in until the depth line is aligned with the top of the greater tuberosity. This depth is chosen to locate the head of the implant at the correct height in the subsequent steps. When the final reamer is driven so that the depth line is aligned with the top of the tuberosity, it is relatively stable and is used as a reference for the remaining steps. Use of a single reference structure for several or all of the preparation steps increases the accuracy and ease of preparing the humerus. It will be appreciated that while the resection method described herein includes using the reamer as a reference structure, it is within the scope of the invention to remove the reamer from the medullary canal after the bore is formed and install any suitable device as the reference structure.",
        "A cutting guide 310 is attached to reamer 300 at a neck 312. See FIG. 27. The cutting guide is the same thickness as the length of the neck and includes a notch 314 that fits over the neck. A screw 316 is tightened to secure the cutting guide on the reamer. The cutting guide includes a guide platform 318 with a central opening 320. The platform replicates the angle of the head of the implant. The central opening projects along a direction generally perpendicular to the desired resection-surface, down to the position of the head on the humerus.",
        "The cutting guide includes mounting holes 322 on each side (see FIGS. 29 and 31) for mounting a retroversion alignment structure 324. In particular, alignment structure 324 includes a bracket 326 disposed at one end with a screw 327 that fits into one of holes 322. The bracket holds the sighting arm with a predetermined orientation to the cutting guide. An indexed pivot coupling 328 connects a distal sighting arm 330 to the remainder of the cutting guide.",
        "The indexed pivot coupling allows the sighting arm to be rotated incrementally, in intervals of ten degrees for instance. The pivot is marked so that the surgeon can select the desired retroversion angle indicated by the alignment structure, i.e., 30-degrees, and then rotate the cutting guide until the sighting arm is aligned with the forearm. See FIG. 28. As with the sighting arm used on the previously described positioning jig, the location of the sighting arm near the forearm rather that near the shoulder, although not required, allows the retroversion angle to be set more accurately and reliably. The reamer can be rotated with the cutting guide to achieve the correct retroversion.",
        "Once the retroversion is set, the cutting guide defines the height, inclination angle and retroversion angle of the resection-surface by guiding one or more cutting instruments used to form the resection-surface. Since cutting guide 310 is attached to the reamer, the resection-surface is defined relative to the medullary canal, thus providing a customized fit to the humerus. Cutting guide 310 defines the resection-surface and guides the cutting instruments without requiring attachment to the humeral head. Thus, cutting guide 310 provides a simplified resection procedure over cutting guides which must be attached (e.g., by screws, etc.) to the humeral-head, and then removed after the head has been resected.",
        "Exemplary cutting instruments are illustrated in FIGS. 29-32. Focusing first on FIGS. 29-30, a counter-bore bushing 336 is installed in the cutting guide. A counter-bore cutter 338 fits closely through the bushing and is aimed at the proper location on the humerus to counterbore a recess adapted to receive the prosthesis collar and/or the back side of the head. The cutter includes cutting edges 340 at the front end that remove bone in a flat circular area. The cutter is twisted to remove bone along a direction generally perpendicular to the resection-surface, until a shoulder 342 at the rear end of the cutter reaches the cutting guide. By this operation, a flat platform at the correct height, retroversion and inclination is created. Notch 306 allows the cutter to reach the full depth without striking the reamer. If necessary or desired, the bone material around the periphery of the recess platform may be removed or reduced by any suitable means.",
        "Once the platform is properly shaped, a chisel bushing 343 is installed in the cutting guide, as shown in FIGS. 31-32. The chisel bushing has a key 344 to insure that bushing is installed in the guide in the correct orientation. The bushing includes a central opening 346 that is shaped to receive a hollow rectangular chisel 348. The bushing guides the chisel into the humerus at the proper location to form a recess adapted to receive the medial portion of the body. As with counter-bore cutter 338, cutting guide 310 guides chisel 348 along a direction generally perpendicular to the desired resection-surface. A shoulder 350 prevents the chisel from cutting too deeply into the bone. Once the recess for the implant body has been formed, the reamer and cutting guide may be removed from the humerus.",
        "The result of the above steps is that humerus will fit very closely around the shoulder implant, without significant vertical, lateral or rotational play. This close fit leads to a more secure connection of the implant in the humerus and better surgical results.",
        "It is believed that the disclosure set forth above encompasses multiple distinct inventions with independent utility. While each of these inventions has been disclosed in its preferred form, the specific embodiments thereof as disclosed and illustrated herein are not to be considered in a limiting sense as numerous variations are possible. The subject matter of the inventions includes all novel and non-obvious combinations and subcombinations of the various elements, features, functions and/or properties disclosed herein. No single feature, function, element or property of the disclosed embodiments is essential to all of the disclosed inventions. Similarly, where the claims recite “a” or “a first” element or the equivalent thereof, such claims should be understood to include incorporation of one or more such elements, neither requiring nor excluding two or more such elements.",
        "It is believed that the following claims particularly point out certain combinations and subcombinations that are directed to one of the disclosed inventions and are novel and non-obvious. Inventions embodied in other combinations and subcombinations of features, functions, elements and/or properties may be claimed through amendment of the present claims or presentation of new claims in this or a related application. Such amended or new claims, whether they are directed to a different invention or directed to the same invention, whether different, broader, narrower or equal in scope to the original claims, are also regarded as included within the subject matter of the inventions of the present disclosure."
    ],
    "citations": [
        "2531734",
        "2570465",
        "2682265",
        "2719522",
        "2765787",
        "2781758",
        "2785673",
        "3064645",
        "3067740",
        "3102536",
        "3334624",
        "3506982",
        "3554192",
        "3658056",
        "3670724",
        "3694820",
        "3708805",
        "3763855",
        "3765034",
        "3781918",
        "3782373",
        "3803641",
        "3806957",
        "3814089",
        "3818512",
        "3859669",
        "3863273",
        "3874003",
        "3879767",
        "3892232",
        "3906550",
        "3916451",
        "3918441",
        "3974527",
        "3977398",
        "3979778",
        "3987499",
        "4004300",
        "4030143",
        "4040131",
        "4042980",
        "4045825",
        "4051559",
        "4115875",
        "4129902",
        "4194250",
        "4199824",
        "4205400",
        "4212294",
        "4242758",
        "4261062",
        "4287617",
        "4293963",
        "4332037",
        "4357716",
        "4378607",
        "4383337",
        "4404691",
        "4404692",
        "4406023",
        "4430761",
        "4459708",
        "4474177",
        "4487203",
        "4488319",
        "4524467",
        "4532660",
        "4538306",
        "4550450",
        "4574794",
        "4578081",
        "4608055",
        "4624674",
        "4628923",
        "4645506",
        "4655778",
        "4667664",
        "4676797",
        "4686971",
        "4693723",
        "4693724",
        "4697585",
        "4698063",
        "4703751",
        "4718414",
        "4736737",
        "4795468",
        "4822370",
        "4840632",
        "4842606",
        "4846841",
        "4865605",
        "4865609",
        "4875475",
        "4892546",
        "4893619",
        "4895572",
        "4903691",
        "4904266",
        "4905679",
        "4908032",
        "4913137",
        "4919669",
        "4919670",
        "4932974",
        "4936854",
        "4952213",
        "4959066",
        "4963155",
        "4964865",
        "4986833",
        "4988351",
        "4995883",
        "5002545",
        "5002580",
        "5002581",
        "5007933",
        "5030234",
        "5030237",
        "5032130",
        "5032132",
        "5047061",
        "5061287",
        "5071420",
        "5074879",
        "5078746",
        "5080676",
        "5080685",
        "5100407",
        "5108396",
        "5108437",
        "5108452",
        "5116379",
        "5133760",
        "5135529",
        "5154717",
        "5163961",
        "5169401",
        "5171288",
        "5171324",
        "5181928",
        "5207682",
        "5236432",
        "5248313",
        "5250055",
        "5261915",
        "5282865",
        "5286260",
        "5314479",
        "5314486",
        "5336268",
        "5342363",
        "5342366",
        "5344458",
        "5358526",
        "5364398",
        "5370706",
        "5387239",
        "5389107",
        "5403319",
        "5405403",
        "5433718",
        "5433720",
        "5472444",
        "5480402",
        "5489309",
        "5507817",
        "5507818",
        "5507830",
        "5509935",
        "5514143",
        "5549609",
        "5549682",
        "5569263",
        "5571203",
        "5580352",
        "5586985",
        "5591233",
        "5645548",
        "5645607",
        "5649930",
        "5658340",
        "5658349",
        "5658352",
        "5662651",
        "5665090",
        "5690635",
        "5702447",
        "5702457",
        "5702460",
        "5702469",
        "5702472",
        "5702486",
        "5713901",
        "5725595",
        "5728161",
        "5741335",
        "5776194",
        "5776204",
        "5779705",
        "5779709",
        "5782923",
        "5788700",
        "5792143",
        "5800560",
        "5814047",
        "5860982",
        "5879395",
        "5885297",
        "5888245",
        "5910171",
        "5951564",
        "5961555",
        "5976149",
        "5989259",
        "6015437",
        "6019761",
        "6033439",
        "6045582",
        "6102953",
        "6110179",
        "6120507",
        "6120542",
        "6120544",
        "6123708",
        "6156069",
        "6165177",
        "6165224",
        "6168267",
        "6168268",
        "6168627",
        "6168628",
        "6171341",
        "6193758",
        "6197062",
        "6197063",
        "6206925",
        "6217616",
        "6228119",
        "6228120",
        "6267785",
        "6277123",
        "6283999",
        "6336941",
        "6379391",
        "6395004",
        "6398812",
        "6402753",
        "6494913",
        "6508820",
        "6517541",
        "6533788",
        "6579294",
        "6652529",
        "6692496",
        "6706046",
        "6719799",
        "6730090",
        "6793659",
        "2001/0001120",
        "2001/0008981",
        "2001/0049561",
        "2001/0053935",
        "2002/0042654",
        "2002/0095217",
        "2002/0128720",
        "2002/0151982",
        "619132",
        "2015324",
        "2246274",
        "2400650",
        "3023354",
        "3329978",
        "3415934",
        "4331282",
        "4320086",
        "19548154",
        "29805703",
        "19858889",
        "0000549",
        "0017743",
        "0098224",
        "0132284",
        "0145939",
        "0163121",
        "0190981",
        "0198163",
        "0201407",
        "0118778",
        "0243298",
        "0145666",
        "0278807",
        "0339530",
        "0393608",
        "0501207",
        "0581667",
        "0607749",
        "0611225",
        "0617934",
        "0622062",
        "0634154",
        "0639359",
        "0679375",
        "0715836",
        "0679375",
        "0712617",
        "0776636",
        "1064890",
        "1080702",
        "1143867",
        "0664108",
        "1013246",
        "2225141",
        "2378505",
        "2567019",
        "2574283",
        "2576793",
        "2578162",
        "2579454",
        "2606273",
        "2619502",
        "2634371",
        "2652498",
        "2663838",
        "2664809",
        "2670108",
        "2683142",
        "2689756",
        "2689757",
        "2689758",
        "2695313",
        "2699400",
        "2704747",
        "2705558",
        "2737107",
        "2755847",
        "2770128",
        "747876",
        "1443470",
        "1593440",
        "1521679",
        "1531487",
        "1537479",
        "2070939",
        "2094639",
        "2223172",
        "2297257",
        "2297257",
        "2334890",
        "63-73951",
        "3-500978",
        "7-501001",
        "7313524",
        "2003-517337",
        "2003-517337",
        "171292",
        "2119307",
        "1279629",
        "1734727",
        "WO83/02555",
        "WO91/18559",
        "WO 93/09733",
        "WO 94/04085",
        "WO94/15551",
        "WO 94/29701",
        "WO 96/17553",
        "WO96/41597",
        "WO96/41597",
        "WO 97/27828",
        "WO 98/07393",
        "WO 98/15241",
        "WO98/46172",
        "WO 00/36984",
        "WO 00/41653",
        "WO 01/19264",
        "WO 01/19268",
        "WO 02/17822"
    ],
    "us_classification": "623 1911",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "61",
            "subclass": "F",
            "main_group": "2",
            "subgroup": "40"
        }
    ]
}