{
    "title": "Polycarbonate compositions",
    "abstract": "This invention relates to polycarbonate compositions comprising:",
    "inventors": [
        "Pearson",
        "McWilliams",
        "Irick, Jr.",
        "Weaver"
    ],
    "document_number": "07297735",
    "publication_date": "20071120",
    "assignees": [
        "Eastman Chemical Company"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A polymer composition comprising:",
            "components": [
                {
                    "component": "(A) at least one polycarbonate; and",
                    "subcomponents": []
                },
                {
                    "component": "(B) at least one salt prepared by the reaction of one or more acidic phosphorus-containing compounds with one or more hindered amine light stabilizers.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A polymer composition according to claim 1 wherein the acidic phosphorus compounds are selected from the compounds having the formulas:",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A polymer composition comprising: claim 2 .",
            "components": [
                {
                    "component": "(A) at least one polycarbonate; and",
                    "subcomponents": []
                },
                {
                    "component": "(B) about 0.01 to about 0.25 weight percent based on the total weight of the polycarbonate composition of at least one salt prepared by the reaction of one or more acidic phosphorus-containing compounds selected from phosphorous acid, phosphoric acid and polyphosphoric acid with one or more hinder light amine stabilizers of",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A composition according to claim 3 wherein component B comprises about 0.05 to about 0.15 weight percent based on the total weight of the polycarbonate composition of at least one said salt wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A polymer composition comprising:",
            "components": [
                {
                    "component": "(A) at least one polycarbonate; and",
                    "subcomponents": []
                },
                {
                    "component": "(B) about 0.01 to about 0.25 weight percent based on the total weight of the composition of at least one salt prepared by the reaction of phosphorous acid with one or more hindered amine light stabilizers of the formulas:",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A polymer composition comprising:",
            "components": [
                {
                    "component": "(A) at least one polycarbonate; and",
                    "subcomponents": []
                },
                {
                    "component": "(B) about 0.01 to about 0.25 weight percent based on the total weight of the composition of at least one salt prepared by the reaction of phosphorous acid with a hindered amine light stabilizer having the formula:",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A composition according to claim 6 wherein component (B) comprises about 0.05 to about 0.15 weight percent based on the total weight of the composition of said salt wherein R",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A composition according to claim 7 wherein component (B) comprises about 0.05 to about 0.15 weight percent based on the total weight of the composition of at least one said salt wherein the ratio of the number of phosphorus atoms in the phosphorous acid to number of basic nitrogen atoms in the hindered amine light stabilizer is about 0.25 to about 0.6.",
            "components": []
        }
    ],
    "description": [
        "This invention relates to a polymer composition comprising (A) at least one polycarbonate; and (B) one or more salts composed of at least one suitable phosphorus-containing acid and at least one suitable hindered amine light stabilizer.",
        "Hydrolytic stability is a physical characteristic commonly sought in polymers. It is therefore desirable to find methods for providing polymer compositions with greater hydrolytic stability and that are less detrimental to process equipment.",
        "U.S. Pat. No. 4,619,956 discloses the combination of 2,2,6,6-tetraalkylpiperidine hindered amine light stabilizers (HALS) and/or their addition salts with triazine ultraviolet absorbers for stabilizing thermoset acrylic and alkyd coatings. U.S. Pat. No. 5,714,530 discloses the utility of combining non-polymeric 2,2,6,6,-tetraalkylpiperidine HALS salts and/or their acid addition salts with triazine ultraviolet light absorbers for stabilizing certain polymer compositions. U.S. Pat. No. 6,051,164 discloses the use of a polymer stabilizing system comprising from about 50 to about 5,000 ppm of at least one ortho hydroxyl tris-aryl triazine light absorber and from about 500 ppm to about 1.25 percent of at least one oligomer, polymeric or high molecular weight HALS having a molecular weight of at least about 500, wherein the weight ratio of HALS to triazine light absorber is from about 3:1 to about 20:1.",
        "The detrimental effect of phosphorus-containing additives on the hydrolytic stability of polycarbonate and polycarbonate-polyester blends is disclosed in U.S. Pat. Nos. 4,456,717, 5,354,791, 5,744,526, 6,103,796, 4,393,158, and 6,107,375. Improved hydrolytic stability for polycarbonates stabilized with phosphorus-containing compounds and siloxanes containing oxetane groups are disclosed in U.S. Pat. No. 4,456,717. Improved hydrolytic stability for polycarbonates stabilized with phosphorus-containing compounds and an oligomer or polymer containing at least one pendant cyclic iminoether group per molecule is disclosed in U.S. Pat. No. 6,107,375. Improved hydrolytic stability for polycarbonates stabilized with phosphorus-containing compounds and an epoxy compound is disclosed in U.S. Pat. No. 4,393,158. Improved hydrolytic stability for polycarbonate-polyester blends stabilized with phosphorus-containing compounds and a polyester having epoxy functionality is disclosed in U.S. Pat. No. 5,354,791. Improved hydrolytic stability for polycarbonates stabilized with phosphorus-containing compounds and hexamethylene tetra amine is disclosed in U.S. Pat. No. 5,744,526. Specifically, U.S. Pat. No. 5,744,526 teaches the addition of the amine to stabilize the phosphite against hydrolysis and consequently improving the hydrolytic stability of the polycarbonate composition.",
        "This present invention relates to polycarbonates and the unexpected improvements in hydrolytic stability for polycarbonates containing an acidic phosphorous compound and a hindered amine light stabilizers (HALS).",
        "We have discovered that the presence of certain salts in polycarbonates result in polymer compositions that exhibit improved hydrolytic stability and that are less detrimental to process equipment. The salts useful in the present invention are reaction products of a suitable inorganic acid, such as a phosphorous acid, with a suitable hindered amine light stabilizers (HALS).",
        "Thus, the present invention provides a polymer composition comprising:\n\n    (A) at least one polycarbonate; and\n    (B) at least one salt prepared by the reaction of one or more acidic phosphorus-containing compounds with one or more hindered amine light stabilizers.",
        "Another embodiment of the present invention is a polymer concentrate comprising:\n\n    (A) at least one polycarbonate; and\n    (B) up to about 10 weight percent, preferably about 5 to 10 weight percent based on the total weight of the polycarbonate of at least one salt prepared by the reaction of one or more acidic phosphorus-containing compounds and one or more hindered amine light stabilizers.",
        "The present invention provides a polymer composition comprising:\n\n    (A) at least one polycarbonate; and\n    (B) a salt prepared by the reaction of one or more acidic phosphorus-containing compounds with one or more hindered amine light stabilizers, wherein the phosphorus-containing compounds are selected from compounds having the formula:",
        "wherein",
        "R1 and R2 are independently selected from hydrogen, C1–C22-alkyl, substituted C1–C22-alkyl, C3–C8-cycloalkyl, substituted C3–C8-cycloalkyl, heteroaryl, and aryl;",
        "n is 2 to 500; and",
        "X is selected from hydrogen and hydroxy; and wherein the hindered amine light stabilizers (HALS) selected from compounds having the formulas:",
        "wherein",
        "R3, R4, R5, and R6 are independently selected from hydrogen, C1–C22-alkyl, substituted C1–C22-alkyl, C3–C8-cycloalkyl, substituted C3–C8-cycloalkyl, heteroaryl, aryl;",
        "R7 is selected from hydrogen, —OR6, C1–C22-alkyl, substituted C1–C22-alkyl, C3–C8-cycloalkyl, substituted C3–C8-cycloalkyl;",
        "R8 is selected from hydrogen; C1–C22-alkyl, substituted C1–C22-alkyl, C3–C8-cycloalkyl, substituted C3–C8-cycloalkyl, heteroaryl, aryl, —Y1—R1 or a succinimido group having the formula",
        "",
        "R9 and R10 are independently selected from hydrogen, C1–C22-alkyl, substituted C1–C22-alkyl, C3–C8-cycloalkyl, and substituted C3–C8-cycloalkyl; R9 and R10 may collectively represent a divalent group forming a ring with the nitrogen atom to which they are attached, e.g., morpholino, piperidino and the like;",
        "L1 is a divalent linking group selected from C2–C22-alkylene; —(CH2CH2—Y1)1-3—CH2CH2—; C3–C8-cycloalkylene; arylene; or —CO-L2-OC—;",
        "L2 is selected from C1–C22-alkylene, arylene, —(CH2CH2—Y1)1-3—CH2CH2— and C3–C8-cycloalkylene;",
        "Y1 is selected from —OC(O)—, —NHC(O)—, —O—, —S—, —N(R1)—;",
        "Y2 is selected from —O— or —N(R1)—;",
        "Z is a positive integer of up to about 20, preferably up to about 6;",
        "m1, is selected from 0 to about 10;",
        "n1 is a positive integer selected from 2 to about 12;",
        "R11, and R12 are independently selected from hydrogen, C1–C22-alkyl, substituted C1–C22-alkyl, C3–C8-cycloalkyl, substituted C3–C8-cycloalkyl, heteroaryl, aryl, and radical A wherein radical A is selected from the following structures:",
        "",
        "Radical A structures wherein * designates the position of attachment.",
        "wherein at least one of R11 and R12 is an A radical; and wherein the ratio of the number of phosphorus atoms in the acidic phosphorus-containing compound to the number of basic nitrogen atoms in the HALS is about 0.25 to about 2, preferably from about 0.5 to about 1.1",
        "The term “C1–C22-alkyl” denotes a saturated hydrocarbon radical which contains one to twenty-two carbons and which may be straight or branched-chain. Such C1–C22 alkyl groups can be methyl, ethyl, propyl, butyl, pentyl, hexyl, heptyl, octyl, isopropyl, isobutyl, tertbutyl, neopentyl, 2-ethylheptyl, 2-ethylhexyl, and the like. The term “substituted C1–C22-alkyl” refers to C1–C22-alkyl radicals as described above which may be substituted with one or more substituents selected from hydroxy, halogen, cyano, aryl, heteroaryl, C3–C8-cycloalkyl, substituted C3–C8-cycloalkyl, C1–C6-alkoxy, C2–C6 alkanoyloxy and the like.",
        "The term “C3–C8-cycloalkyl” is used to denote a cycloaliphatic hydrocarbon radical containing three to eight carbon atoms. The term “substituted C3–C8-cycloalkyl” is used to describe a C3–C8-cycloalkyl radical as detailed above containing at least one group selected from C1–C6-alkyl, C1–C6-alkoxy, hydroxy, halogen, and the like.",
        "The term “aryl” is used to denote an aromatic radical containing 6,10 or 14 carbon atoms in the conjugated aromatic ring structure and these radicals substituted with one or more groups selected from C1–C6-alkyl; C1–C6-alkoxy; phenyl, and phenyl substituted with C1–C6-alkyl; C1–C6-alkoxy; halogen and the like; C3–C8-cycloalkyl; halogen; hydroxy, cyano, trifluoromethyl and the like. Typical aryl groups include phenyl, naphthyl, phenylnaphthyl, anthryl (anthracenyl) and the like. The term “heteroaryl” is used to describe conjugated cyclic radicals containing at least one hetero atom selected from sulfur, oxygen, nitrogen or a combination of these in combination with from two to about ten carbon atoms and these heteroaryl radicals substituted with the groups mentioned above as possible substituents on the aryl radical. Typical heteroaryl radicals include: 2- and 3-furyl, 2- and 3-thienyl, 2- and 3-pyrrolyl, 2-, 3-, and 4-pyridyl, benzothiophen-2-yl; benzothiazol-2-yl, benzoxazol-2-yl, benzimidazol-2-yl, 1,3,4-oxadiazol-2-yl, 1,3,4-thiadiazol-2-yl, 1,2,4-thiadiazol-5-yl, isothiazol-5-yl, imidazol-2-yl, quinolyl and the like.",
        "The terms “C1–C6-alkoxy” and “C2–C6-alkanoyloxy” are used to represent the groups —O—C1–C6-alkyl and —OCOC1–C6-alkyl, respectively, wherein “C1–C6-alkyl” denotes a saturated hydrocarbon that contains 1–6 carbon atoms, which may be straight or branched-chain, and which may be further substituted with one or more groups selected from halogen, methoxy, ethoxy, phenyl, hydroxy, acetyloxy and propionyloxy. The term “halogen” is used to represent fluorine, chlorine, bromine, and iodine; however, chlorine and bromine are preferred.",
        "The term “C2–C22-alkylene” is used to denote a divalent hydrocarbon radical that contains from two to twenty-two carbons and which may be straight or branched chain and which may be substituted with one or more substituents selected from hydroxy, halogen, C1–C6-alkoxy, C2–C6-alkanolyloxy and aryl. The term “C3–C8-cycloalkylene” is used to denote divalent cycloaliphatic radicals containing three to eight carbon atoms and these are optionally substituted with one or more C1–C6-alkyl groups. The term “arylene” is used to denote 1,2-, 1,3-, and 1,4-phenylene radicals and these optionally substituted with C1–C6-alkyl, C1–C6-alkoxy and halogen.",
        "The salt of component (B) of the novel compositions provided by the present invention may be prepared by bringing together the acidic phosphorus-containing compound and the hindered amine light stabilizer in a suitable manner. A suitable manner is any procedure that involves contacting the acidic phosphorus-containing acid with the hindered amine light stabilizer. For example, the acidic phosphorus-containing compound and the hindered amine light stabilizer may be dissolved in an appropriate solvents and the solutions mixed followed by precipitation of the reaction product; mixing the phosphorus-containing acid and the hindered amine light stabilizer without solvent; and the like.",
        "The ratio of the number of phosphorus atoms in the acidic phosphorus-containing compound to the number of basic nitrogen atoms in the hindered amine light stabilizer may be in the range of about 0.05 to about 2, preferably from about 0.25 to about 1.1. Compositions that contain a large excess of unreacted phosphorus-containing acidic compounds may result in corrosion of process equipment during concentrate manufacture and have a negative effect on the hydrolytic stability of the polymer.",
        "The salt or salts constituting component (B) of our novel compositions typically is present in concentrations ranging from about 0.01 to about 0.25 weight percent based on the total weight of the composition, i.e., the total weight of the component (A) polycarbonate, the salt and any additional components present, such as stabilizers and pigments and colorants. Concentrations of salt (B) within this range typically are effective to improve the hydrolytic stability of polycarbonates. The concentration of the salt(s) preferably is about 0.05 to 0.15 weight percent (same basis).",
        "Although polycarbonates are not commonly made using metal catalysts, it is possible. The polycarbonate may contain metal catalyst residues in 10 to 200 ppmw. Metal catalyst residues in concentrations of about 20 to 100 ppmw are more typical. An addition source of metal catalysts residue may be contributed by a polymer that is blended with the polycarbonate. For example, polyesters may contain 10 to 200 ppmw of metal catalyst residues. Corrosion of metal process equipment is an additional source of metal contaminants in polycarbonate component (A). For example, 304 and 316 stainless steels contain manganese, chromium and nickel. The salts of component (B) of the invention can be used in the polycarbonate compositions where the polycarbonates are either prepared by use of metal catalysts or contain metal contaminants or are blended with polymers comprising metal catalyst residues such that improved hydrolytic stability as well as improved color is provided to such polycarbonates.",
        "The acidic phosphorus-containing compounds preferably are phosphorous acid, phosphoric acid and polyphosphoric acid, most preferably phosphorous acid.",
        "Examples of suitable hindered amine light stabilizers (HALS) include, but are not limited to: Cyasorb UV-3346 (Cytec Industries, CAS# 90751-07-8), Cyasorb UV-3529 (Cytec Industries, CAS# 193098-40-7), Cyasorb UV-3641 (Cytec Industries, CAS# 106917-30-0), Cyasorb UV-3581 (Cytec Industries, CAS# 79720-19-7), Cyasorb UV-3853 (Cytec Industries, CAS# 167078-06-0), Cyasorb UV-3853S (Cytec Industries, CAS# 24860-22-8), Tinuvin 622 (Ciba Specialty Chemicals, CAS# 65447-77-0), Tinuvin 770 (Ciba Specialty Chemicals, CAS# 52829-07-9), Tinuvin 144 (Ciba Specialty Chemicals, CAS# 63843-89-0), Tinuvin 123 (Ciba Specialty Chemicals, CAS# 129757-67-1), Chimassorb 944 (Ciba Specialty Chemicals, CAS# 71878-19-8), Chimassorb 119 (Ciba Specialty Chemicals, CAS# 10699043-6), Chimassorb 2020 (Ciba Specialty Chemicals, CAS# 192268-64-7), Lowilite 76 (Great Lakes Chemical Corp., CAS# 41556-26-7), Lowilite 62 (Great Lakes Chemical Corp., CAS# 65447-77-0), Lowilite 94 (Great Lakes Chemical Corp., CAS# 71878-19-8), Uvasil 299LM (Great Lakes Chemical Corp., CAS# 182635-99-0), and Uvasil 299HM (Great Lakes Chemical Corp., CAS# 182635-99-0), Dastib 1082 (Vocht a.s., CAS# 131290-28-3), Uvinul 4049H (BASF Corp., CAS# 109423-00-9), Uvinul 4050H (BASF Corp., CAS# 124172-53-8), Uvinul 5050H (BASF Corp., CAS# 199237-39-3), Mark LA 57 (Asahi Denka Co., Ltd., CAS# 64022-61-3), Mark LA 52 (Asahi Denka Co., Ltd., CAS# 91788-83-9), Mark LA 62 (Asahi Denka Co., Ltd., CAS# 107119-91-5), Mark LA 67 (Asahi Denka Co., Ltd., CAS# 100631-43-4), Mark LA 63 (Asahi Denka Co., Ltd. Co., Ltd. Co., CAS# 115055-30-6), Mark LA 68 (Asahi Denka Co., Ltd., CAS# 100631-44-5), Hostavin N 20 (Clariant Corp., CAS# 95078-42-5), Hostavin N 24 (Clariant Corp., CAS# 85099-51-1, CAS# 85099-50-9), Hostavin N 30 (Clariant Corp., CAS# 78276-66-1), Diacetam-5 (GTPZAB Gigiena Truda, USSR, CAS# 76505-58-3), Uvasorb-HA 88 (3V Sigma, CAS# 136504-96-6), Goodrite UV-3034 (BF Goodrich Chemical Co., CAS# 71029-16-8), Goodrite UV-3150 (BF Goodrich Chemical Co., CAS# 96204-36-3), Goodrite UV-3159 (BF Goodrich Chemical Co., CAS# 130277-45-1), Sanduvor 3050 (Clariant Corp., CAS# 85099-51-0), Sanduvor PR-31 (Clariant Corp., CAS# 147783-69-5), UV Check AM806 (Ferro Corp., CAS# 154636-12-1), Sumisorb TM-061 (Sumitomo Chemical Company, CAS# 84214-94-8), Sumisorb LS-060 (Sumitomo Chemical Company, CAS# 99473-08-2), Uvasil 299 LM (Great Lakes Chemical Corp., CAS# 164648-93-5), Uvasil 299 HM (Great Lakes Chemical Corp., CAS# 164648-93-5), Nylostab S-EED (Clariant Corp., CAS# 42774-15-2). Additional preferred hindered amine light stabilizer may be listed in the Plastic Additives Handbook 5thEdition (Hanser Gardner Publications, Inc., Cincinnati, Ohio., USA, 2001).",
        "Chimassorb 944 (Ciba Specialty Chemicals, CAS# 71878-19-8), Cyasorb UV-3529 (Cytec Industries, CAS# 19309840-7), Chimassorb 119 (Ciba Specialty Chemicals, CAS# 106990-43-6) and Tinuvin 770 (Ciba Specialty Chemicals, CAS# 52829-07-9) as described further herein in the Examples and any equilavents thereof are specific examples of the preferred hindered amine light stabilizers. A group of preferred hindered amine light stabilizers include ones having above formulas (1), (2), (3), (4), (5), (6), (7), (8), (9), (10), (11) and (12) wherein radical R7 is hydrogen or alkyl. The most preferred are high molecular weight HALS wherein the molecular weight is greater than about 1000 such as Cyasorb UV-3529 (Cytec Industries, CAS# 193098-40-7). The most preferred HALS correspond to formula (6) set forth above wherein R3=R4=R5=R6=R7=methyl, (R9)(R10)N— collectively represent morpholino, L1 is C1 to C6 alkylene, and Z is 1 to 6.",
        "The term “polycarbonate” as used herein embraces those polycarbonates comprising repeating units or residues of the formula",
        "wherein Y is a divalent aromatic or aliphatic radical derived from a dihydroxyaromatic compound or a dihydroxyaliphatic compound of the formula HO—Y—OH. Typical dihydroxyaromatic compounds are 2,2-bis-(4-hydroxyphenyl)propane, also known as bisphenol A; bis(4-hydroxyphenyl)methane; 2,2-bis(4-hydroxy-3-methylphenyl)-propane; 4,4-bis(4-hydroxyphenyl)heptane; 2,2-(3,5,3′,5′-tetrachloro-4,4′-dihydroxy-phenyl)propane; 2,2-(3,5,3′,5′-tetrabromo-4,4′-dihydroxyphenol)propane; 3,3′-dichloro-3,3′-dichloro-4,4′-dihydroxydiphenyl)methane; 2,2′-dihydroxyphenyl-sulfone, and 2,2′-dihydroxyl phenylsulfide. Most preferably, HO—Y—OH is 2,2-bis-(4-hydroxyphenyl)propyl, in which case, the polycarbonate is a “bisphenol A polycarbonate”. Examples of dihydroxyaliphatic compounds include 1,4-cyclohexanedimethanol, 1,2-propanediol, 1,3-propanediol, 1,4-butanediol, 2,2-dimethyl-1,3-propanediol, 1,6-hexanediol, 2,6-decahydronaphthalenedimethanol, 1,2-cyclohexanediol, 1,4-cyclohexanediol, 1,2-cyclohexanedimethanol, 1,3-cyclohexanedimethanol, isosorbide, 4,4′-isopropylidenedicyclohexanol, 2,2,4,4-tetramethylcyclobutane-1,2-diol, Z,8-bis(hydroxymethyl)-tricyclo-[5.2.1.0]-decane wherein Z represents 3, 4, or 5; and diols containing one or more oxygen atoms in the chain, e.g., diethylene glycol, triethylene glycol, dipropylene glycol, tripropylene glycol and the like. In general, these diols contain 2 to 18, preferably 2 to 8 carbon atoms. Cycloaliphatic diols can be employed in their cis or trans configuration or as mixtures of both forms. Branched polycarbonates are also useful in the present invention.",
        "The polycarbonates comprising component (A) of the above-described embodiment of the present invention may be prepared according to known procedures by reacting the dihydroxyaromatic compound with a carbonate precursor such as phosgene, a haloformate or a carbonate ester, a molecular weight regulator, an acid acceptor and a catalyst. Methods for preparing polycarbonates are known in the art and are described, for example, in U.S. Pat. No. 4,452,933, which is hereby incorporated by reference herein.",
        "Examples of suitable carbonate precursors include carbonyl bromide, carbonyl chloride, and mixtures thereof; diphenyl carbonate; a di(halophenyl)-carbonate, e.g., di(trichlorophenyl) carbonate, di(tribromophenyl) carbonate, and the like; di(alkylphenyl)carbonate, e.g., di(tolyl)carbonate; di(naphthyl)carbonate; di(chloronaphthyl)carbonate, or mixtures thereof; and bis-haloformates of dihydric phenols.",
        "Examples of suitable molecular weight regulators include phenol, cyclohexanol, methanol, alkylated phenols, such as octylphenol, para-tertiary-butyl-phenol, and the like. The preferred molecular weight regulator is phenol or an alkylated phenol.",
        "The acid acceptor may be either an organic or an inorganic acid acceptor. A suitable organic acid acceptor is a tertiary amine and includes such materials as pyridine, triethylamine, dimethylaniline, tributylamine, and the like. The inorganic acid acceptor can be either a hydroxide, a carbonate, a bicarbonate, or a phosphate of an alkali or alkaline earth metal.",
        "The catalysts that can be used are those that typically aid the polymerization of the monomer with phosgene. Suitable catalysts include tertiary amines such as triethylamine, tripropylamine, N,N-dimethylaniline, quanternary ammonium compounds such as, for example, tetraethylammonium bromide, cetyl triethyl ammonium bromide, tetra-n-heptylammonium iodide, tetra-n-propyl ammonium bromide, tetramethyl ammonium chloride, tetra-methyl ammonium hydroxide, tetra-n-butyl ammonium iodide, benzyltrimethyl ammonium chloride and quaternary phosphonium compounds such as, for example, n-butyltriphenyl phosphonium bromide and methyltriphenyl phosphonium bromide.",
        "The polycarbonate of component (A) also may be a copolyestercarbonate such as those described in U.S. Pat. Nos. 3,169,121; 3,207,814; 4,194,038; 4,156,069; 4,430,484, 4,465,820, and 4,981,898, all of which are incorporated by reference herein.",
        "Copolyestercarbonates useful in this invention are available commercially. They are typically obtained by the reaction of at least one dihydroxyaromatic compound with a mixture of phosgene and at least one dicarboxylic acid chloride, especially isophthaloyl chloride, terephthaloyl chloride, or both.",
        "The present invention provides polycarbonates that exhibit improved hydrolytic stability. The acidic phosphorus-containing compound salts of suitable hindered amine light stabilizer [Component (B)] are useful in providing that hydrolytic stability.",
        "Another embodiment of the present invention is a polymer concentrate comprising:\n\n    \n    \n        (A) at least one polycarbonate; and\n        (B) up to about 10 weight percent, preferably about 5 to 10 weight percent, based on the total weight of the polycarbonate of at least one salt prepared by the reaction of one or more acidic phosphorus-containing compounds and one or more hindered amine light stabilizers.",
        "The compositions of the present invention also may contain one or more compounds selected from the group consisting of (C) water, (D) colorants and pigments such as organic colorants, inorganic colorants and or white pigments such as TiO2, ZnO and baryta, (E) other additives such as impact modifiers, plasticizers, halogenated flame-retardants, fillers, nonhalogenated flame-retardants, synergists, processing aids, phosphite stabilizers, phosphonite stabilizers and other stabilizers known to one skilled in the art; and (F) a recycled polymer.",
        "The terms “phosphite stabilizers” and “phosphonite stabilizers” refer to secondary antioxidants that are known to those skilled in the art and may be represented by the structures listed on pages 109–112 in the Plastic Additives Handbook 5thEdition (Hanser Gardner Publications, Inc., Cincinnati, Ohio., USA, 2001), incorporated herein by reference in its entirety. Some common phosphite stabilizers are as follows: Ultranox 626 (GE Specialty Chemicals, CAS# 26741-53-7), Irgafos 168 (Ciba Specialty Chemicals, CAS# 31570-04-4), Weston 619 (GE Specialty Chemicals, CAS# 3806-34-6) and Doverphos S-9228 (Dover Chemicals, CAS# 154862-43-8).",
        "The term “halogenated flame-retardants” is defined as compounds that can contain one or more of the following: fluorine, chlorine, bromine, and iodine, which act in such a way as to decrease the flammability of the polymer composition. More preferred are compounds that contain bromine such as brominated polycarbonate, brominated polystyrene, and the like.",
        "Salts of phosphorus-containing acids and hindered amine light stabilizers, as defined herein, may reduce the amount of corrosion to process equipment as compared to some of the hydrolysis products of commercial phosphites, phosphorous acid, phosphoric acid, and polyphosphoric acid, thereby improving the color of the polymer composition and improving the lifetime of the process equipment.",
        "The compositions provided by the present invention are useful for improving the properties of heavy-gauge sheet, cap layers for extruded sheet, cap layers for extruded films, thermoformable sheeting products, injection molded products, thin films, thick films, articles made using thin films, articles using from thick films, articles made using heavy gauge sheet, multilayer films, twin-wall sheet, triple wall sheet and the like.",
        "This invention is further illustrated by the following examples of preferred embodiments thereof, although it will be understood that these examples are included merely for purposes of illustration and are not intended to limit the scope of the invention unless otherwise specifically indicated. Unless otherwise indicated, all weight percentages are based on the total weight of the polymer composition and all molecular weights are weight average molecular weights. Also, all percentages are by weight unless otherwise indicated. Wherever an R group, L group, Y group, Z group, m group or n group is defined herein, the definition for a particular group remains the same throughout this description regardless of whether it is used for multiple formulas or types of compounds unless otherwise specified.",
        "In the examples, the following procedures were followed. To evaluate the effect of additives on hydrolytic stability of polycarbonate-polyester blends, samples were cut from 20-mil film and then exposed to 70° C. and 100% relative humidity by suspending the films in the vapor space of sealed jars containing a small amount of water and placed inside a forced air oven set at 70° C. Small samples were subsequently taken periodically and the molecular weight distribution for the polyester and polycarbonate components determined using gel permeation chromatography (GPC). The GPC method for the polycarbonate fraction consisted of first immersing the blends in tetrahydrofuran to selectively extract the polycarbonate. The GPC system used to analyze the polycarbonate fraction consisted of a Perkin-Elmer LC-250 pump, a Perkin-Elmer LC-600 autosampler, and a Perkin-Elmer LC-235 photodiode array UV detector operated at 265 nm. The columns used were a Plgel 5-micron guard, a Mixed-C, and an Oligopore from Polymer Laboratories. The molecular weight distribution was computed using monodisperse polystyrene standards for calibration and the Mark-Houwink constants for polystyrene and polycarbonate available in the literature. The solvent used for the polyester fraction was 70/30-v/v hexafluoroisopropanol/methylene chloride mixture, which is also a good solvent for polycarbonate. The GPC system used consisted of a Perkin-Elmer LC-250 pump, a Perkin-Elmer ISS-200 autosampler, and a Perkin-Elmer LC-95 UV/VIS detector operated at 285 nm. The absorption coefficient of terephthalate based copolyesters at 285 nm is considerably greater than the coefficient for polycarbonate so that the method selectively detects the polyester. The columns used were a Plgel 5-micron guard and a Mixed-C from Polymer Laboratories. The molecular weight distribution was computed using monodisperse polystyrene standards for calibration and Mark-Houwink constants for polystyrene measured in this solvent. Universal calibration constants for each polyester were chosen to yield accurate molecular weight values for a series of samples that were characterized by light scattering measurement.",
        "The color of the polymer films is determined in a conventional manner using a HunterLab UltraScan Colorimeter manufactured by Hunter Associates Laboratory, Inc., Reston, Va. The instrument is operated using HunterLab Universal Software (version 3.8). Calibration and operation of the instrument is according to the HunterLab User Manual and is largely directed by the Universal Software. To reproduce the results on any calorimeter, run the instrument according to its instructions and use the following testing parameters: D65 Light Source (daylight, 6500° K color temperature), Reflectance Mode, Large Area View, Specular Included, CIE 10° Observer, Outputs are CIE L*, a*, b*. An increase in the positive b* value indicates yellowness, while a decrease in the numerical value of b* indicates a reduction in yellowness. Color measurement and practice are discussed in greater detail in Anni Berger-Schunn in Practical Color Measurement, Wiley, N.Y. pages 39–56 and 91–98 (1994). Preferably, for 20-mil films the b* value is less than +0.75, more preferably from about +0.25 to about −0.25.",
        "These examples illustrate the detrimental effect of commercial phosphite stabilizers on the hydrolytic stability of polycarbonate-polyester blends. The polyester, polyester A, is a polyester comprised of 74 mole percent terephthalic acid residues, 26 mole percent isophthalic acid residues and 100 mole percent 1,4-cyclohexanedimethanol residues having an inherent viscosity of about 0.74 and containing approximately 100 ppmw titanium metal and the polycarbonate, polycarbonate A, is a bisphenol A polycarbonate supplied by Bayer as Makrolon 2608. The following commercial phosphates were utilized: Ultranox 626 (GE Specialty Chemicals, CAS# 26741-53-7, bis(2,4-di-t-butylphenyl) pentaerythritol diphosphite), Ultranox 641 (GE Specialty Chemicals, CAS# 26741-53-7, 2,4,6-tri-tert-butylphenyl-2-butyl-2-ethyl-1,3-propanediol phosphite), Weston 619 (GE Specialty Chemicals, CAS# 3806-34-6, distearyl pentaerythritol diphosphite) and Doverphos S-9228 (Dover Chemicals, CAS# 154862-43-8, bis(2,4-dicumylphenyl) pentaerythritol diphosphite). The phosphite stabilizers were precompounded with polyester A using an 19-mm APV twin-screw extruder at 250° C., 200 RPM, at a rate of about 5 lbs/hr to produce concentrates containing 5 percent phosphite stabilizer. Blends of polyester A and polycarbonate A were prepared by melt blending a 3:1 weight ratio of polyester A with polycarbonate A, respectively, with 0.5 weight percent of the various phosphite stabilizers as reported in Table 1. The blends were prepared as 20-mil extrusion cast films using a 1″ Killion single-screw extruder at 275° C. and 70 RPM. The films were subsequently conditioned at 70° C. and 100% relative humidity for up to 3 weeks and the molecular weight of the polyester A and polycarbonate A components determined by GPC as previously described. The results are shown in Table 1. As shown in Table 1, the addition of a phosphite stabilizer improves the blend color (i.e. less yellow as represented by lower b*); however, the phosphites are detrimental to hydrolytic stability of the blend as indicated by significant decrease in molecular weight for both the polyester A and polycarbonate A components.",
        "TABLE 1\n\n\n\n\n\n\n\n\n\n20-\nHydrolytic Stability @ 70° C.\n\n\n\nmil\nand 100% Relative Humidity\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCIE\nExposure\npolyester A\npolyester A\npolycarbonate A\npolycarbonate A\n\n\nExample\nPhosphite\nb*\n(weeks)\nMw\nΔMw (%)\nMw\nΔMw (%)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1\nNo\n9.6\n0\n23297\n0.0\n13582\n0.0\n\n\n\nStabilizer\n\n1\n23595\n1.3\n12446\n−8.4\n\n\n\n\n\n2\n23408\n0.5\n14007\n3.1\n\n\n\n\n\n3\n23528\n1.0\n13391\n−1.4\n\n\n2\nWeston\n−0.1\n0\n23123\n0.0\n20723\n0.0\n\n\n\n619\n\n1\n21337\n−7.7\n14339\n−30.8\n\n\n\n\n\n2\n20532\n−11.2\n12239\n−40.9\n\n\n\n\n\n3\n20317\n−12.1\n 9919\n−52.1\n\n\n3\nUltranox\n0.5\n0\n22559\n0.0\n21684\n0.0\n\n\n\n626\n\n1\n20813\n−7.7\n14663\n−32.4\n\n\n\n\n\n2\n20452\n−9.3\n12888\n−40.6\n\n\n\n\n\n3\n20129\n−10.8\n11102\n−48.8\n\n\n4\nDoverphos\n0.4\n0\n22339\n0.0\n20935\n0.0\n\n\n\n9228\n\n1\n20937\n−6.3\n14860\n−29.0\n\n\n\n\n\n2\n20112\n−10.0\n13385\n−36.1\n\n\n\n\n\n3\n20641\n−7.6\n11561\n−44.8\n\n\n5\nUltranox\n0.6\n0\n22651\n0.0\n20128\n0.0\n\n\n\n641\n\n1\n21367\n−5.7\n12889\n−36.0\n\n\n\n\n\n2\n20461\n−9.7\n11244\n−44.1\n\n\n\n\n\n3\n20574\n−9.2\n 9722\n−51.7\n\n\n\n\n\nWeston 619 is distearyl pentaerythritol diphosphite.\n\n\n\n\n\n\nUltranox 626 is Bis(2,4-di-t-butylphenyll) pentaerythritol disphosphite. Doverphos 9228 is Bis(2,4-dicumylphenyll) pentaerythritol disphosphite. Ultranox 641 is 2,4,6 tri-t-butylphenyl 2 butyl 2 ethyl 1,3 propane diol phosphite.",
        "These examples illustrate improved hydrolytic stability for polycarbonate-polyester blends containing phosphorous acid salts of HALS compared to blends containing phosphorous acid. The polyester, polyester B, comprised of 100 mole percent terephthalic acid residues, 62 mole percent cyclohexandimethanol and 38 mole percent ethylene glycol residues having an inherent viscosity of about 0.7 and the polycarbonate, polycarbonate B, is a bisphenol A polycarbonate (tradename Makrolon 1804 (Bayer Corporation) believed to contain about 0.25 wt % of a ultraviolet light absorbing compound and a blue toner colorant. A 70:30 ratio by weight blend of polyester B and polycarbonate B (70:30 blend by weight) were melt blended with 0.03 weight percent and 0.06 weight percent of phosphorous acid and the phosphorous acid salts described in Table 2. The phosphorous acid salts were compounded with polyester B using a WP 30-mm twin-screw extruder at 250° C., 250 RPM at a rate of about 40 lbs/hr to produce concentrates containing 5 percent of the phosphorous acid salt. The polyester B and polycarbonate B blends were subsequently prepared as 20-mil extrusion cast films using a 1″ Killion single-screw extruder at 275° C. and 70 RPM.",
        "A blend was prepared as described previously without any added stabilizer.",
        "A phosphorous acid concentrate was prepared by mixing pellets of polyester B with a 45 percent weight percent aqueous solution of phosphorous acid and then drying under vacuum to produce a concentrate containing 2.5 percent phosphorous acids. Blends were prepared as described previously with 0.03 weight percent and 0.06 weight percent phosphorous acid.",
        "Phosphorous acid and Cyasorb UV-3529 (supplied by Cytec Industries, Inc.), which is a polymeric hindered amine light stabilizer (HALS) believed to conform generally to the compounds of amine formula (6) set forth above whrein R3=R4=R5=R6=R7=methyl; L1 is hexamethylene; and (R9)(R10)N— collectively represent a morpholino group, were added to a large mortar and pestle according to Table 2. The solids were ground to a fine powder thereby forming a salt and placed into a vacuum oven overnight at 70° C. with a slight ingress of dry nitrogen. The solid was allowed to cool to room temperature and ground again to a fine powder using mortar and pestle. Blends were prepared as described previously with 0.03 and 0.06 weight percent of each phosphorous acid salt.",
        "TABLE 2\n\n\n\n\n\nExample\nPhosphorous Acid (g)\nCyasorb 3529 (g)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n8\n32.76\n200\n\n\n9\n65.45\n200\n\n\n10\n98.18\n200",
        "Phosphorous acid and Chimassorb 119 were added to a large mortar and pestle according to Table 3. Chimassorb 119 is a hindered amine light stabilizer believed to form generally to the compounds of amine formula (13) set forth above wherein R1=R2=hydrogen; R11 and R12 each is the first radical A structure set forth above wherein R3=R4=R5=R6=R7=methyl; Y2 is —N(C4H9-n)-; n1 is 3; and m1 is 3. The solids were ground to a fine powder and placed into a vacuum oven overnight at 70° C. with a slight ingress of dry nitrogen. The solid was allowed to cool to room temperature and ground again to a fine powder using mortar and pestle. Blends were prepared as described previously with 0.03 and 0.06 weight percent of each phosphorous acid salt.",
        "TABLE 3\n\n\n\n\n\nExample\nPhosphorous Acid (g)\nChimassorb 119 (g)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n11\n37.19\n200\n\n\n12\n74.38\n200\n\n\n13\n111.57\n200\n\n\n14\n148.76\n200",
        "To a clean dry 5 L three neck round-bottomed flask equipped with a mechanical stirrer, thermocouple, heating mantle and addition funnel was added Tinuvin 770, as described in Table 4 and 1.5 L of isopropyl alcohol. (Tinuvin 770 is a hindered amine light stabilizer believed to conform generally to the compounds of amine formula (3) set forth above wherein R3=R4=R5=R6=methyl; R7 is hydrogen; Y2 is —OCO—; and L1 is octamethylene.) The mixture was heated to 30° C. and stirred until a homogeneous solution was obtained. To a clean dry 2 L beaker was added phosphorous acid as given in Table 5 and 1 L of isopropyl alcohol. The mixture was stirred until a homogeneous solution was obtained. The phosphorous acid solution was added to the addition funnel and delivered to the stirred reaction vessel at a rate of about 50 mL/min. A solid formed as the phosphorous acid solution was added. Stirring was continued at about 30° C. for 1 h upon complete addition of the phosphorous acid solution. The reaction mixture was allowed to cool to room temperature and the product was further precipitated by adding half of the material to each of two 4 L beakers that contained 1.5 L of rapidly stirred heptane (equipped with a mechanical stirrer). The solid material was collected by suction filtration, washed with 500 mL of heptane, and then allowed to dry on the filter paper overnight. The solid cake was broken up, placed into a 12″×7″×2″ aluminum pan and dried in a vacuum oven at 70° C. at about 15 mm of Hg with a slight ingress of dry nitrogen for 2 days. Blends were prepared as described previously with 0.03 and 0.06 weight percent of each phosphorous acid salt.",
        "TABLE 4\n\n\n\n\n\n\nPhosphorous Acid\nTinuvin 770\nYield\n\n\nExample\ng (mole)\ng (mole)\n(% of theoretical)\n\n\n\n\n\n\n\n15\n450 (0.94)\n 76.71 (0.94)\n90\n\n\n16\n425 (0.88)\n106.68 (1.32)\n97\n\n\n17\n400 (0.83)\n143.20 (1.75)\n97",
        "To a clean dry 5 L three neck round-bottomed flask equipped with a mechanical stirrer and addition funnel was added 200 g of Cyasorb UV-3346 (HALS, supplied by Cytec Industries, Inc.) and 1 kg of toluene. Cyasorb UV-3346 is a polymeric hindered amine light stabilizer believed to conform generally to the compounds of amine formula (6) set forth above R3=R4=R5=R6=methyl; R7=hydrogen; L1 is hexamethylene; and (R9)(R10)N— collectively represent a morpholino group. The mixture was stirred until a homogeneous solution was obtained. To a clean dry 1 L beaker was added 30.69 g of phosphorous acid and 200 g of isopropyl alcohol. The mixture was stirred until a homogeneous solution was obtained. The phosphorous acid solution was added to the addition funnel and delivered to the stirred reaction vessel at a rate of about 13 mL/min. A precipitate began to form. Stirring was continued for about 30 min upon complete addition of the phosphorous acid solution. Heptane (1 kg) was added to the reaction mixture at a dropwise rate to precipitate the product. The solid material was collected by suction filtration and washed twice with 100 mL of heptane, then allowed to dry on the filter paper overnight. The solid cake was broken up, placed into a 12″×7″×2″ aluminum pan, and dried in a vacuum oven at 70° C. at about 15 mm of Hg with a slight ingress of dry nitrogen for 24 h to give 230.05 g of material (100% of theoretical yield). Blends were prepared as described previously with 0.03 and 0.06 weight percent the phosphorous acid salt.",
        "To a clean dry 5 L three neck round-bottomed flask equipped with a mechanical stirrer and addition funnel was added 200 g of Cyasorb UV-3346, which is previously described in Example 18, and 1 kg of toluene. The mixture was stirred until a homogeneous solution was obtained. To a clean dry 1 L beaker was added 61.37 g of phosphorous acid and 400 g of isopropyl alcohol. The mixture was stirred until a homogeneous solution was obtained. The phosphorous acid solution was added to the addition funnel and delivered to the stirred reaction vessel at a rate of about 10 mL/min. A precipitate began to form. Stirring was continued for about 30 min upon complete addition of the phosphorous acid solution. Heptane (1 kg) was added to the reaction mixture at a dropwise rate to precipitate the product. The solid material was collected by suction filtration and washed twice with 100 mL of heptane, then allowed to dry on the filter paper overnight. The solid cake was broken up, placed into a 12″×7″×2″ aluminum pan, and dried in a vacuum oven at 70° C. at about 15 mm of Hg with a slight ingress of dry nitrogen for 24 h to give 259.09 g of material (100% of theoretical yield). Blends were prepared as described previously with 0.03 and 0.06 weight percent the phosphorous acid salt.",
        "The blends described in Examples 6–19 were evaluated for hydrolytic stability at 70° C. and 100% relative humidity for up to 6 weeks as described previously. The results for blends containing 0.03 and 0.06 weight percent phosphorous acid salt are shown in Tables 5 and 6 respectively. As shown, the addition of phosphorous acid or phosphorous acid salts of HALS dramatically improves the color (i.e. less yellow as represented by lower b*) of polycarbonate-polyester blends compared to the blends without a phosphorus-containing compound (Example 6). Example 7 serves to illustrate the detrimental effect of phosphorous acid on the hydrolytic stability of the blend components similar to the results shown previously in Examples 2–5 that contained commercial phosphite stabilizers. However, the hydrolytic stability of the blend components is significantly improved for the blends containing phosphorous acid salts of HALS (Examples 8–19) compared to the blends containing phosphorous acid only (Example 7).",
        "TABLE 5\n\n\n\n\n\n\n\nHydrolytic Stability of Blends with 0.03% by\n\n\nweight phosphorous acid salts\n\n\n\n\n\n\n\n\n\n\nPolyester B\nPolycarbonate B\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nΔMw\nΔMw\nΔMw\n\nΔMw\nΔMw\nΔMw\n\n\n\n\n\n(%)\n(%)\n(%)\n\n(%)\n(%)\n(%)\n\n\nExample\nCIE b*\nInitial Mw\n2 wks\n4 wks\n6 wks\nInitial Mw\n2 wks\n4 wks\n6 wks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n6\n0.9\n29111\n−0.6\n−0.6\n−1.9\n22415\n−5.5\n−9.2\n−10.5\n\n\n7\n−0.1\n28379\n−3.0\n−6.9\n−11.4\n21990\n−14.3\n−34.6\n−37.3\n\n\n8\n0.2\n30055\n0.7\n−0.3\n−1.7\n21453\n0.9\n−9.0\n−12.2\n\n\n9\n−0.1\n29695\n1.8\n0.7\n−1.6\n20979\n0.8\n−9.3\n−10.2\n\n\n10\n−0.1\n29492\n1.2\n0.4\n−1.9\n22741\n−10.6\n−16.8\n−18.9\n\n\n11\n0.5\n30208\n−1.1\n−1.2\n−2.1\n22626\n−4.8\n−15.0\n−13.3\n\n\n12\n03\n29089\n2.3\n1.8\n0.1\n22191\n−6.7\n−17.9\n−17.5\n\n\n13\n0.2\n29321\n−0.2\n−1.5\n−3.1\n22220\n−4.8\n−19.2\n−23.0\n\n\n14\n0.0\n29067\n0.2\n−2.1\n−4.9\n22145\n−10.7\n−20.1\n−23.6\n\n\n15\n0.1\n29486\n0.5\n−0.4\n0.0\n22370\n−11.1\n−20.7\n−20.0\n\n\n16\n0.0\n29376\n1.0\n0.8\n−0.1\n22220\n−11.9\n−19.4\n−20.8\n\n\n17\n−0.1\n29746\n−1.3\n−1.0\n−2.5\n21808\n−14.3\n−16.6\n−30.7\n\n\n18\n0.1\n30093\n0.6\n−1.0\n−2.0\n22463\n−7.5\n−14.4\n−17.9\n\n\n19\n0.1\n29609\n1.3\n0.7\n−2.3\n23009\n−12.2\n−15.0\n−17.4",
        "TABLE 6\n\n\n\n\n\n\n\nHydrolytic Stability of Blends with 0.06 Weight\n\n\nPercent Phosphorous Acid Salts\n\n\n\n\n\n\n\n\n\n\nPolyester B\nPolycarbonate B\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nΔMw\nΔMw\nΔMw\n\nΔMw\nΔMw\nΔMw\n\n\n\n\n\n(%)\n(%)\n(%)\n\n(%)\n(%)\n(%)\n\n\nExample\nCIE b*\nInitial Mw\n2 wks\n4 wks\n6 wks\nInitial Mw\n2 wks\n4 wks\n6 wks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n6\n0.9\n29111\n−0.6\n−0.6\n−1.9\n22415\n−5.5\n−9.2\n−10.5\n\n\n7\n−0.2\n28477\n−12.7\n−19.1\n−24.7\n21518\n−27.8\n−53.1\n−55.4\n\n\n8\n−0.2\n29538\n1.4\n0.2\n−0.6\n21717\n−6.8\n−15.0\n−15.3\n\n\n9\n−0.2\n30029\n0.6\n−1.6\n−3.0\n22270\n−4.5\n−17.1\n−16.2\n\n\n10\n−0.1\n29518\n1.5\n0.8\n−2.5\n23287\n−13.8\n−21.7\n−22.2\n\n\n11\n0.1\n29884\n0.7\n−1.2\n−3.0\n22665\n−13.6\n−17.2\n−19.3\n\n\n12\n0.0\n29535\n−0.2\n−1.0\n−2.9\n21764\n−3.5\n−19.2\n−19.1\n\n\n13\n−0.1\n29351\n−0.8\n−2.7\n−4.9\n21614\n−9.6\n−16.2\n−24.8\n\n\n14\n−0.1\n29288\n−1.9\n−4.8\n−9.9\n22072\n−16.6\n−27.1\n−31.0\n\n\n15\n0.0\n29465\n0.4\n−0.2\n−0.4\n23459\n−21.4\n−27.8\n−31.3\n\n\n16\n−0.1\n29269\n0.9\n0.6\n−1.2\n21965\n−12.1\n−23.8\n−29.8\n\n\n17\n−0.1\n29189\n0.8\n1.2\n−2.1\n22114\n−24.4\n−30.6\n−33.7\n\n\n18\n0.1\n29962\n−0.4\n0.2\n−2.6\n22278\n−4.1\n−12.0\n−15.5\n\n\n19\n−0.1\n29864\n0.3\n−1.3\n−2.3\n22057\n−4.5\n−9.7\n−18.4",
        "These examples illustrate different methods of preparing the phosphorous acid salts. To a clean, dry 5 L three neck round-bottomed flask equipped with a mechanical stirrer and addition funnel was added 100 g of Cyasorb UV-3529, which is described in Examples 8–10, and 575 g of toluene. The mixture was stirred until a homogeneous solution was obtained. To a clean dry 2 L beaker was added 28.05 g (0.34 mol) of phosphorous acid and 575 g of isopropyl alcohol. The mixture was stirred until a homogeneous solution was obtained. The phosphorous acid solution was added to the addition funnel and delivered to the stirred reaction vessel over 2 h (added dropwise). Stirring was continued for about 30 min upon complete addition of the phosphorous acid solution. The reaction product was precipitated by adding half of the reaction mixture to each of two 4 L beakers that contained 2475 g of rapidly stirred heptane (equipped with a mechanical stirrer). The solid material was collected by suction filtration and washed with 500 mL of heptane then allowed to dry on the filter paper overnight. The solid cake was broken up, placed into a 12″×7″×2″ aluminum pan and dried in a vacuum oven at 70° C. at about 150 torr with a slight ingress of dry nitrogen for 24 h to give 135.07 g of material (>100% of theory, slightly solvent wet).",
        "Blends of polyester B and polycarbonate B (70:30 blend ratio by weight) were melt blended along with 0.1 weight percent of the phosphorous acid salt prepared by an organic method (Example 20), the phosphorous acid salt prepared by a mechanical method described in Example 9 (Example 21) and Weston 619 (Example 22) for comparison. The phosphorous acid salts and Weston 619 were compounded with polyester B using a 30-mm WP twin-screw extruder at 250° C., 250 RPM at a rate of about 40 lbs/hr to produce concentrates containing 5 percent of each additive. The blends were prepared as 20-mil extrusion cast films using a 1″ Killion single-screw extruder at 275° C. and 70 RPM. The blends were evaluated for hydroytic stability at 70° C. and 100% relative humidity for up to 6 weeks as described previously and the results are shown in Tables 7. The results show significantly improved hydrolytic stability for the blends containing the phosphorous acid salts whether prepared by an organic method (Example 20) or a mechanical method (Example 21) compared to the commercial phosphite stabilizer Weston 619 (Example 22).",
        "TABLE 7\n\n\n\n\n\n\n\n\n\nPolyester A\nPolycarbonate A\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nΔMw\nΔMw\nΔMw\n\nΔMw\nΔMw\nΔMw\n\n\n\nInitial\n(%)\n(%)\n(%)\nInitial\n(%)\n(%)\n(%)\n\n\nExample\nMw\n2 wks\n4 wks\n6 wks\nMw\n2 wks\n4 wks\n6 wks\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n20\n27105\n−1.7\n−3.1\n7.3\n23287\n−8.4\n−21.6\n−25.5\n\n\n21\n26159\n1.1\n−0.8\n7.9\n22538\n−8.1\n−18.2\n−24.0\n\n\n22\n25957\n−6.4\n−9.1\n−8.5\n22308\n−25.7\n−40.3\n−49.0",
        "The invention has been described in detail with particular reference to preferred embodiments thereof, but it will be understood that variations and modifications can be effected within the spirit and scope of the invention."
    ],
    "citations": [
        "3169121",
        "3207814",
        "3218372",
        "3953539",
        "4025492",
        "4088709",
        "4136089",
        "4156069",
        "4176224",
        "4188314",
        "4194038",
        "4208527",
        "4238593",
        "4331586",
        "4374961",
        "4391954",
        "4393158",
        "4401804",
        "4430484",
        "4452932",
        "4452933",
        "4456717",
        "4465820",
        "4532290",
        "4619956",
        "4786692",
        "4808645",
        "4879355",
        "4956407",
        "4957953",
        "4981898",
        "5010146",
        "5011877",
        "5116905",
        "5134181",
        "5180762",
        "5194523",
        "5207967",
        "5239020",
        "5254610",
        "5283295",
        "5354791",
        "5359064",
        "5420212",
        "5441997",
        "5461120",
        "5478896",
        "5606007",
        "5679733",
        "5714530",
        "5719217",
        "5721298",
        "5744526",
        "5744554",
        "5907026",
        "5922816",
        "5942585",
        "5965261",
        "5965643",
        "6005059",
        "6011124",
        "6037424",
        "6043322",
        "6051164",
        "6077890",
        "6103796",
        "6107375",
        "6114420",
        "6221556",
        "6254950",
        "6306939",
        "6323291",
        "6333113",
        "6348591",
        "6469083",
        "6455616",
        "6476158",
        "6500887",
        "6509399",
        "6727303",
        "6780917",
        "2002/0086953",
        "2002/0128357",
        "0272417",
        "0294862",
        "0295730",
        "0 466 137",
        "0 483 488",
        "0 537 837",
        "0543125",
        "0 661 342",
        "0 675 159",
        "1 304 351",
        "1466261",
        "04059852",
        "04011660",
        "04-059852",
        "10-1602",
        "10-298439",
        "10298439",
        "WO 0 438 488",
        "WO 02/053633",
        "WO 2004/065472"
    ],
    "us_classification": "524 96",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "08",
            "subclass": "K",
            "main_group": "5",
            "subgroup": "34"
        }
    ]
}