{
    "title": "Swipe imager scan engine",
    "abstract": "An imaging scan engine includes both a solid-state camera and an illumination source in the same package. The scan engine unit simplifies the integration of swipe imaging components into new and existing scanners.",
    "inventors": [
        "He",
        "Zuelch"
    ],
    "document_number": "07296744",
    "publication_date": "20071120",
    "assignees": [
        "Symbol Technologies, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A scan engine for use in swipe imager, the scan engine mounted in a housing of the swipe imager adjacent an exit window of the swipe imager housing, the scan engine comprising:",
            "components": [
                {
                    "component": "a camera mounted on a scan engine chassis; an illumination source mounted on the scan engine chassis; and a synchronization module;",
                    "subcomponents": []
                },
                {
                    "component": "the camera including a senor and an optical element to focus illumination from a field of view of the camera onto the sensor, the sensor and the optical element mounted to a circuit board of the scan engine chassis, the camera defining near working range and a far working range for imaging a target bar code, the near working range including the exit window to provide for imaging a target bar code swiped along the exit window;",
                    "subcomponents": []
                },
                {
                    "component": "the illumination source mounted on the scan engine chassis such that the divergence angle of light from the illumination source is approximately matched to the field of view of the camera; and",
                    "subcomponents": []
                },
                {
                    "component": "the synchronization module coupled to the camera and the illumination source, the illumination source being activated to generate a series of illumination pulses, a duration of each of the illumination pulses being synchronized with an integration duration of the camera sensor to provide that the integration duration of the camera sensor and the duration an illumination pulse of the illumination source occur simultaneously and have substantially the same duration.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The scan engine of claim 1 wherein the scan engine chassis is a printed circuit board on which the camera and illumination source are mounted.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The scan engine of claim 1 wherein the camera is a solid state camera having a two-dimensional CCD sensor.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The scan engine of claim 1 wherein the camera is a solid state camera having a two-dimensional CMOS sensor.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The scan engine of claim 1 comprising one or more interfaces for inputting control signals.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The scan engine of claim 1 comprising one or more interfaces for outputting data and/or timing signals.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The scan engine of claim 1 comprising a microprocessor and memory having instructions stored thereon for decoding indicia on objects whose image is captured by the camera.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The scan engine of claim 1 comprising a digital data output port.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The scan engine of claim 1 wherein the illumination source includes one or more high-brightness LEDs.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A method that processes indicia with an imaging scanner having at least one camera, the steps of the method comprising:",
            "components": [
                {
                    "component": "providing an imaging scanner including a housing and a camera mounted in the housing of the imaging scanner adjacent an exit window of the imaging scanner housing wherein the camera includes: a camera mounted on a scan engine chassis; and an illumination source mounted on the scan engine chassis, and a synchronization module; the camera including a sensor and an optical element to focus illumination from a field of view of the camera onto sensor, the sensor and the optical element mounted to a circuit board of the scan engine chassis, the camera defining a near working range and a far working range for imaging a target bar code, the near working range including, the exit window to provide for imaging a target bar code swiped along the exit window: the illumination source mounted on the scan engine chassis such that the divergence angle of light from the illumination source is approximately matched to the field of view of the camera; and the synchronization module coupled to the camera and the illumination source, the illumination source being activated to generate a series of illumination pulses, a duration of each of the illumination pulse being synchronized with an integration duration of the camera sensor to provide that the integration duration of the camera sensor and the duration an illumination pulse of the illumination source occur simultaneously and have substantially the same duration;",
                    "subcomponents": []
                },
                {
                    "component": "initiating an integration period of the camera;",
                    "subcomponents": []
                },
                {
                    "component": "substantially simultaneously activating the associated illumination source to generate an illumination pulse, a duration of the illumination pulse having substantially the same duration as a duration of the integration period; and terminating the activation of the illumination source substantially simultaneously with an end of the integration period of the camera.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 10 wherein two or more cameras are present in the imaging scanner and wherein the substantially simultaneous activation of the integration period of each camera and its associated illumination source is performed to provide that the integration periods for at least some of the cameras are non-overlapping in time.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 11 comprising storing images from each camera to provide that the images from the different cameras appear to be acquired at the same time.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. Computer-readable media comprising computer-executable instructions for performing a method to process indicia with an imaging scanner having at least one camera, the method comprising:",
            "components": [
                {
                    "component": "providing an imaging scanner including a housing having an exit window and a camera mounted within the imaging scanner housing adjacent the exit window, the camera mounted on a scan engine chassis, an illumination source mounted on the scan engine chassis, and a synchronization module; the camera including a sensor and an optical element to focus illumination from a field of view of the camera onto the sensor, the sensor and the optical element mounted to a circuit board of the scan engine chassis, the camera defining a near working range and a far working range for imaging a target bar code, the near working range including the exit window to provide for imaging a target bar code swiped along the exit window; the illumination source mounted on the scan engine chassis such that the divergence angle of light from the illumination source is approximately matched to the field of view of the camera; and the synchronization module coupled to the camera and the illumination source, the illumination source being activated to generate a series of illumination pulse, a duration of each of the illumination pulses being synchronized with an integration duration of the camera sensor to provide that the integration duration of the camera sensor and the duration an illumination pulse of the illumination source occur simultaneously and have substantially same duration",
                    "subcomponents": []
                },
                {
                    "component": "initiating an integration period of the camera;",
                    "subcomponents": []
                },
                {
                    "component": "substantially simultaneously activating the associated illumination source to generate an illumination pulse, duration of the illumination pulse having substantially the same duration as a duration of the integration period; and terminating the activation of the illumination source substantially simultaneously with an end of the integration period of the camera.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The computer-readable media of claim 13 wherein two or more cameras are present in the imaging scanner and wherein instructions for the substantially simultaneous activation of the integration period of each camera and its associated illumination source are performed to provide that the integration periods for at least some of the cameras are non-overlapping in time.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The computer-readable media of claim 14 comprising instructions for storing images from each camera to provide that the images from the different cameras appear to be acquired at the same time.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A scan engine for use in a swipe imager, the scan engine mounted in a housing of the swipe imager adjacent an exit window of the swipe imager housing, the scan engine comprising:",
            "components": [
                {
                    "component": "a camera means mounted on a scan engine chassis means; an illumination source means mounted on the scan engine chassis means, and a synchronization module means;",
                    "subcomponents": []
                },
                {
                    "component": "the camera means including a sensor and an optical element to focus illumination from a field of view of the camera onto the sensor, the sensor and the optical element mounted to a circuit board of the scan engine chassis, the camera defining a near working range and a far working range for imaging a target bar code, the near working range including the exit window to provide for imaging a target bar code swiped along the exit window; the illumination source means mounted on the scar engine chassis such that the divergence angle of light from the illumination source means is approximately matched to the field of view of the camera; and",
                    "subcomponents": []
                },
                {
                    "component": "the synchronization module means coupled to the camera and the illumination source, the illumination source means being activated to generate a series of illumination pulses, a duration of each of the illumination pulses being synchronized with an integration duration of the camera sensor to provide that the integration duration of the camera sensor and the duration an illumination pulse of the illumination source means occur simultaneously and have substantially the same duration.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application is a continuation-in-part of U.S. application Ser. No. 11/007,403 filed on Dec. 8, 2004 now U.S. Pat. No. 7,204,418, and incorporated herein by reference in its entirety.",
        "The invention relates generally to the field of imaging scanners and more particularly to scan engine components for use in imaging scanners.",
        "Swipe scanners are defined as scanners that can successfully scan an indicium while it is in motion. Traditionally, scanners that are used in swipe type applications are laser scanners. This is because the laser scanning technology utilizes a fast sweeping flying laser spot to do the scanning. The flying laser spot typically moves at a much faster speed than the object bearing the indicium could move. The speed of the indicium is usually governed by the arm or hand motion of an operator, and such motion is typically in the range of 25 inches per second. Laser scanners can achieve high throughput scanning of 1-dimensional barcodes and some types of 2-dimensional barcodes, such as PDF-417 barcodes, but they are generally not effective at scanning general 2-dimensional barcodes or matrix codes such as DataMatrix.",
        "In the last several years, imaging scanners also know as “imagers” in this context have picked up a sizable market share of the scanner market that is traditionally served by laser scanners. While 1-dimensional imagers, or those with 1-dimensional sensors, have similar capabilities as laser scanners, 2-dimensional imagers, or those with 2-dimensional sensors, have additional capabilities and useful features. These features include the ability to scan general 2-dimensional barcodes, such as DataMatrix codes, and the ability to capture images, useful in such applications as capturing signatures and checks.",
        "Existing imagers do not perform well when indicia are in motion because the target object must be positioned in front of the imager relatively steadily for a split second for the imager's camera to capture the target object's image without excessive blurring. This hold time is dependent upon many factors in the scanner design, and is typically in the order of 10 milliseconds.",
        "It is anticipated that more and more applications requiring an imager will coexist with traditional scanning applications. For example, in a drug store, the operator of the scanner may need to scan the UPC (1-dimensional) barcode to check out a medicine, and at the same time need to scan the DataMatrix code to verify that the medicine has not expired. Or, in a liquor store, the operator may need to check out an alcoholic beverage and scan the PDF-417 barcode on the customer's driver's license for proof of age, while also capturing the customer's check to facilitate processing according to laws governing check processing.",
        "Another area in which imagers can outperform laser scanners is the processing of truncated barcodes, such as those on small items like jewelry, pens and pencils, and candy. Traditionally these were scanned by a laser scanner, but alignment between the barcode and the laser scan line is often required on such a small item, preventing swipe operation with the laser scanner and slowing throughput.",
        "An imaging scan engine that includes both a solid-state camera and an illumination source in the same package simplifies the integration of swipe imaging components into scanners.",
        "Accordingly, a scan engine includes a camera mounted on a scan engine chassis and an illumination source, such as one or more high-brightness LEDs, also mounted on the scan engine chassis. The scan engine chassis can be a printed circuit board on which the camera and illumination source are mounted. The illumination source is coupled with an optical element of the camera such that the divergence angle of light from the illumination source is approximately matched to a field-of-view of the camera. The camera can be a solid state camera having a two-dimensional CCD sensor or a two-dimensional CMOS sensor. One or more interfaces for inputting control signals may be present in the scan engine as well as one or more interfaces for outputting data and/or timing signals. A synchronization module can be part of the scan engine to synchronize the integration duration of the camera's sensor and the activation duration of the illumination source such that they occur substantially simultaneously and have substantially the same duration. The scan engine can also include a microprocessor and memory having instructions stored thereon for decoding indicia on objects whose image is captured by the camera.",
        "A bi-optic imager includes a substantially vertical exit window, a horizontal exit window, and a plurality of cameras and associated illumination sources. Each camera can be mounted on a single scan engine chassis with its associated illumination source. The bi-optic imager can include three cameras, two of which are aligned so that a field of view of each of the cameras is substantially contained within the vertical exit window. In this case, one of the cameras can be aligned so that a field of view of the camera is perpendicular to and substantially contained within the horizontal exit window. A camera control unit can activate each camera and its associated illumination source such that the integration periods for at least some of the cameras are non-overlapping in time. Such a bi-optic imager can include a buffer that stores images from each camera such that the images from the different cameras appear to be acquired at the same time.",
        "These and other objects, advantages, and features of the exemplary embodiment of the invention are described in detail in conjunction with the accompanying drawings.",
        "FIG. 1 is a schematic view of a handheld scanner incorporating an imager scan engine constructed in accordance with one embodiment of the present invention;",
        "FIGS. 2a and 2b are schematic views of an imager scan engine constructed in accordance with one embodiment of the present invention; and",
        "FIGS. 3a -3c are projection views of a bi-optic scanning system utilizing scan engines constructed in accordance with one embodiment of the present invention.",
        "In order to make a swipe imager having a 2-dimensional sensor feasible, the scanning function of the imager must be able to be performed while the object bearing the indicium is in motion, preferable at object speeds over 10 inches per second. Such a swipe imager would be particularly advantageous as compared to laser scanners because with an imager the alignment of the barcode and imaging scanner is not an issue. The imaging scanner captures an image and creates virtual scan lines that are designed to pass through the barcode, no matter at what angle it lies. A swipe imager that can function at relatively high object speeds could perform the functions described in the Background, such as capturing signatures and documents, reading DataMatrix codes, and capturing truncated barcodes, as well as performing equally as well on 1-dimensional barcodes as the traditional laser scanner. A swipe imager that utilizes strobe lighting, a global shutter, and synchronized illumination and exposure time to achieve relatively high speed performance is described in U.S. patent application Ser. No. 11/007,403 filed on Dec. 8, 2004, owned by the assignee of the present invention, and which is incorporated herein by reference in its entirety.",
        "Accordingly, FIG. 1 illustrates a swipe imager 12 that incorporates a scan engine 10, a folding mirror 21, and exit window 22. FIGS. 2A and 2B show a more detailed view of the scan engine 10 housed within the imager 12 which includes a solid-state camera 25 and an illumination source that includes one or more high-brightness LEDs 27. Because it is designed to be incorporated into an imager or imaging scanner, it is advantageous that the scan engine has no enclosure separating it from its environment. The camera 25 and LEDs are mechanically and electrically integrated, such as being mounted on a single circuit board 15 that may also include a microprocessor 36 if the scan engine is to provide decoding operations or other components such as interface ports (not shown.) The camera 25 includes as its sensor 40 a two-dimensional array sensor such as a CCD sensor or CMOS sensor. The LEDs 27 are tightly integrated with the camera 25 to form a scan engine housed on a single circuit board 15 that can be assembled into a scanner as a single component. The LEDs and camera can be controlled by the microprocessor 36, if one is present in the scan engine or by an external control unit (not shown) that activates the camera 25 and the LEDs 27 synchronously. For swipe performance the LEDs are pulsed for very short periods of time, such as on the order of 0.5 milliseconds or less. The duration of the pulses can be controlled to match the integration period of the camera. In addition, the illumination's divergence angle is approximately matched to the camera's field-of-view so that energy is conserved. Labels WD1 and WD2 depict near and far extremes of working ranges for a particular barcode, respectively. The exact locations of WD1 and WD2 depend on the characteristics of the barcode being scanned. In some cases it is advantageous, for certain important barcode types, such as regular sized UPC codes, to locate WD1 either on the window 22 or within the housing so such a barcode can be scanned while positioned in contact with the window.",
        "Referring back to FIG. 1, the mirror 21 and the window 22 are both slightly extended from the requirement of the camera 25 so that the mirror and window do not too severely vignette the light coming from the LEDs. The scanner depicted is a handheld scanner that can be used as a hands-free when coupled to a base. Because the illumination source (LEDs) is positioned so closely to the camera, the illumination light path is not shown separately in FIG. 1.",
        "FIGS. 3a -3c are projection views of a bi-optic scanning system 50. FIG. 3a shows top view of the bi-optic scanner, FIG. 3b is a front view, and 3c is a view from the left-hand side of the scanning system. The scanning system 50 incorporates three cameras, which can advantageously be packaged as part of three swipe scan engines 10, with two of them covering the vertical window 23 and one of them covering the horizontal window 24. The scan engine that is used to cover the horizontal window has its optical axis substantially perpendicular to the exit window 24 of the scanner (due to folding mirror 29) such that there is virtually no geometrical distortion. Such a distortion-free image capture capability is good for certain expanded features of a point-of-sale scanner, such as signature capture and check scanning, etc. This feature is also more advantageously associated with the horizontal window, because the vertical window is usually larger and therefore it is harder to define a small sub-region for such image capturing needs.",
        "The two scan engines covering the vertical scan window 23 have an up-and-down arrangement and act upon vertical folding mirrors 21. The scan engines, due to their small size, could also be arranged on essentially the same horizontal plane. It is advantageous, however, to place the scan engines in an asymmetrical fashion as shown in FIG. 3a. This arrangement allows more complimentary coverage of the top and bottom sides of the object being scanned. The mirror arrangements can be further tilted in such as way as to make the top and bottom side coverage more substantial.",
        "The incorporation of the illumination source LEDs with each of the cameras in a single scan engine unit helps to reduce design complexity as the illumination sources are guaranteed to match the camera in both the direction and the field-of-view.",
        "To avoid scattered illumination from one scan engine entering a camera for another scan engine as background noise, it is advantageous to make the different cameras capture images during non-overlapping time intervals. For example, if each camera is to have an exposure of 0.3 milliseconds, the three cameras can have their exposures set at three consecutive 0.3 millisecond intervals. The maximum delay between the cameras is then 0.6 milliseconds. Having only a small delay between the cameras can be advantageous if it is desirable to have their images processed in a synchronized way. To synchronize the image processing when two or more cameras are operating at slightly different times a first-in-first-out buffer can be used to store up the data from each camera that is ahead of the latest camera.",
        "The bi-optic scanning system 50 has several advantages made possible by the scan engine units 10 that each efficiently packages a camera and illumination source. All three cameras can be located in close vicinity of each other, reducing the length of any cables that are needed to link them together. The data connection between a camera and processing unit carries a high-frequency signal and is therefore prone to generating radiation noise and is susceptible to high-frequency noise from the environment. The close proximity of the three cameras allows the three cameras to send their data to one combined processing unit, without long cables that may generate or receive too much radiation noise. The scan engine unit 10 is also easily incorporated into new and existing designs to provide swipe-scanning capability.",
        "It can be seen from the foregoing description that providing a scan engine with a camera and illumination source in close proximity to one another simplifies integration of swipe imager performance into new and existing products. Although the invention has been described with a certain degree of particularity, it should be understood that various changes can be made by those skilled in the art without departing from the spirit or scope of the invention as hereinafter claimed."
    ],
    "citations": [
        "4743773",
        "2003/0089776",
        "2003/0136843",
        "2005/0103851",
        "PCT/US2005/043618"
    ],
    "us_classification": "235454",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "06",
            "subclass": "K",
            "main_group": "7",
            "subgroup": "10"
        }
    ]
}