{
    "title": "Process for nickel silicide Ohmic contacts to n-SiC",
    "abstract": "A Ni",
    "inventors": [
        "Cole",
        "Weihs"
    ],
    "document_number": "07297626",
    "publication_date": "20071120",
    "assignees": [
        "United States of America as Represented by the Secretary of the Army"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A pulsed laser ablation deposition process for forming at least one low specific contact resistance, (ρ",
            "components": [
                {
                    "component": "mounting an n-type SiC wafer substrate or n-SiC substrate with SiC epilayer in a vacuum chamber in a sample-substrate position;",
                    "subcomponents": []
                },
                {
                    "component": "mounting a Ni",
                    "subcomponents": []
                },
                {
                    "component": "rotating the Ni",
                    "subcomponents": []
                },
                {
                    "component": "ablating the Ni",
                    "subcomponents": []
                },
                {
                    "component": "transferring said intermetallic phase Ni",
                    "subcomponents": []
                },
                {
                    "component": "depositing said intermetallic phase Ni",
                    "subcomponents": []
                },
                {
                    "component": "rapid thermally annealing in an N",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The pulsed laser ablation deposition process of claim 1 wherein the Ni",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The laser ablation deposition process of claim 2 wherein the Ohmic contact is the same composition and stoichiometry as the 99.9% pure Ni",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The pulsed laser ablation deposition process of claim 1 wherein the SiC substrate wafer or n-SiC substrate wafer with SiC epilayer is select grade, Si-face, 8° off-c-axis (0001) 4H n-type (2.0×10",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The pulsed laser ablation deposition process of claim 1 wherein, prior to mounting, the SiC wafer SiC substrate wafer with SiC epilayer is cleaned in warm electronic grade trichloroethane (TCA), acetone and methanol and then rinsed in deionized water.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The pulsed laser ablation deposition process of claim 1 wherein ablating is continued until the Ni",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The pulsed laser ablation deposition process of claim 1 wherein the laser beam is a KrF 248 nm excimer laser beam.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The laser ablation deposition process of claim 7 wherein the KrF-248 nm excimer laser beam is under a base pressure of ≦10×10",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The laser ablation deposition process of claim 7 wherein the KrF-248 nm excimer laser beam has a laser fluence of 10 Jcm",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The laser ablation deposition process of claim 1 wherein the laser beam is an excimer laser having average pulse energy of 200 to 400 milliJoules at a 20-nanosecond pulse width.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The laser ablation deposition process of claim 1 wherein the sample to target gap is 10 cm.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The pulsed laser ablation deposition process of claim 1 wherein the laser beam is focused onto the rotating target at a 45° incident angle.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The laser ablation deposition process of claim 1 wherein the sample substrate SiC wafer SiC substrate wafer with SiC epilayer is unheated.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The laser ablation deposition process of claim 1 wherein after deposition of Ni",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation-in-part of U.S. patent application Ser. No. 10/884,580 filed Jul. 6, 2004, now U.S. Pat. No. 7,163,882 which was a Division of U.S. patent application Ser. No. 09/939,420 filed Aug. 27, 2001 now U.S. Pat. No. 6,759,683.",
        "The invention described herein may be manufactured and used by or for the Government of the United States of America for Governmental purposes without payment of any royalties thereon or therefore.",
        "1. Field of the Invention",
        "The invention relates to a semiconductor device manufacturing process. More particularly, the invention is a process for forming an Ohmic contact on a wide bandgap semiconductor material (SiC). More particularly, the invention is a process for forming a nickel silicide (Ni2Si) Ohmic contact to n-type SiC.",
        "2. Discussion of the Related Art",
        "The invention relates to the technology of manufacturing a SiC based semiconductor device. All semiconductor devices require high quality, low resistivity thermally stable reliable n- and p-type Ohmic contacts. Ohmic contacts are essential for the transfer of signals between the SiC device and the external circuitry. Ohmic contact metallization design, selection and method of deposition heavily influence the electrical and physical properties of Ohmic contacts to all semiconductors. There are many metallization designs; however, the most common used in SiC device technology consists of single layer, bilayer, multilayer composite metallization schemes and compound intermetallics. Low resistance Ohmic contacts to n-type SiC can be obtained by depositing metallizations with appropriate work functions to achieve a barrier height reduction at the metal-SiC interface. The barrier heights of various contacts depend on the surface properties and electron affinity of the semiconductor, and the work function of the metal. For SiC, barrier heights do not follow the Schottky Mott theory and are typically constrained to high values. In practice, the degree of dependence of barrier height on choice of metal has been determined to be dependent on the bulk semiconductor properties, the nature of the surface before contact formation and the interfacial chemistry. At practical SiC interfaces, interface states cause Fermi level pinning which results in the formation of a potential barrier. The interface states affect the charge transfer between the metal and the SiC, hence control the Schottky barrier height.",
        "Metal deposition can be achieved by a variety of methods; the most common being electron-beam (e-beam) evaporation, sputtering, and thermal evaporation. Sputtering and e-beam evaporation is preferred over thermal evaporation for Ohmic contact metal deposition. The reason for this centers on the fact that thermal evaporation methods involve either a resistance-heated source (refractory metal coiled into a filament) or an evaporation source that is heated by rf induction (utilizing a BN crucible) which results in contamination of the charge from the heater or crucible. This contamination leads to unwanted impurities which adversely affect the electrical properties of the condensed Ohmic contact metal film. The method of metal deposition heavily influences the grain size, uniformity, and metal-epilayer interface properties of the condensed contact film. Grain boundaries serves as diffusion pathways, thus minimization of grain boundary area is desirable to control unwanted elemental diffusion. For the same metal deposited by sputtering and e-beam evaporation, the e-beam evaporated films will possess a much larger grain size, which translates to less grain boundary area and lower diffusion pathways. Additionally, larger grain metal films possess higher hardness values which influence the overall mechanical durability of the metal film. E-beam evaporated metal films also have less gas incorporation in the condensed films than sputtered metal films, and as a result have a higher level of film purity. However, the film-substrate adhesion is usually enhanced for sputtered films since the condensing atoms have higher energy with respect to e-beam deposited films. Both e-beam and sputter deposition produce large area uniform films. The method of metal deposition is often determined by the choice of metal to be deposited, for example, since refractory metals are not easily deposited via e-beam evaporation, sputter deposition is preferred. Additionally, the metal deposition method is usually a strong function of equipment availability.",
        "Deposition of an intermetallic Ohmic contact such as X2Y can be accomplished by sequential e-beam evaporation of each component layer (X and Y) separately with the correct thickness so as to achieve the correct stoichiometric ratio of 2X:1Y followed by a post metal deposition annealing step to achieve the uniform intermetallic phase, X2Y. Alternatively, the intermetallic phase X2Y can be produced by the sequential co-sputtering of two source targets (target #1 is composition X and target #2 is composition Y) such that two layers, X and Y, are deposited with the proper thickness and post metal deposition annealed in order to achieve the uniform intermetallic phase X2Y with the correct stoichiometric composition 2X:1Y. A single compound target with composition X2Y can also be sputter deposited onto the SiC substrate or SiC substrate with SiC epilayer, however the proper 2X:1Y stoichiometry is not easily achieved via this deposition technique. The physical vapor deposition technique, pulsed laser ablation deposition (PLD) has been extensively employed for the preparation/deposition of high quality thin films of multi-component metal-oxide ceramics. The principle desirable feature of PLD is that it is a non-equilibrium evaporation process which produces an intense plasma plume and transfers the target composition/stoichiometry (particularly metallic constituents in the multi-component systems) into the deposited film on a substrate. Thus, PLD is an excellent method for depositing an intermetallic phase X2Y (Ni2Si) onto a substrate (n-SiC) or SiC substrate with SiC epilayer where precise stoichiometric composition is necessary to achieve a highly conductive low resistivity metal film for Ohmic contact formation (such as Ni2Si-n-SiC).",
        "Post metal deposition annealing is usually required to achieve Ohmic behavior in the deposited metal films on SiC. Annealing of metal contact-SiC structures has been achieved via conventional furnace annealing (CFA) and rapid thermal annealing (RTA). The choice of ambient annealing gas influences the electrical properties of Ohmic contact significantly. For CFA, the ambient atmosphere can range from vacuum annealing where metal oxidation is an issue, to flowing N2, Ar, and forming gas. The most common RTA ambient gases are N2, Ar, and forming gas. CFA requires longer processing times with respect to RTA and thus often enhances unwanted elemental diffusion. For annealing some contact metals to SiC the thermally induced interfacial reactions which are responsible for Ohmic behavior demand narrow time-temperature process windows, thus favoring rapid thermal processing. Specifically, RTA is a fast thermal processing method, 1-100 sec, which provides the advantages of (a) reduced thermal budget (anneal temperature×anneal time), and (b) rapid heating and cooling rates in the range of 30-500° C./sec. These advantages are critical to the formation of good Ohmic contacts since the desired interfacial phase formation usually occurs at some temperature (T1) for a time (t1), after which the processing temperature can be reduced rapidly by as much as 50° C. in 1 sec. Thus, undesired contact metal-SiC phase formation/phenomena having different activation energy than the desired contact metal-SiC phase formation are almost completely suppressed since only a fraction of a second would be available for the undesirable process or phase formation. The most common annealing method for SiC contact technology is RTA, but again, like metal deposition methods, the annealing mode is often a function of equipment availability.",
        "Optimum contact performance is not only influenced by the material processing and design elements described above, but also relies on strict adherence to a set of fundamental contact-semiconductor requirements. Currently, there are several critical requirements for Ohmic contacts which must be satisfied in order to achieve high performance reliable SiC based devices. The most prominent of these is the attainment of a reproducible low specific contact resistance value. Additionally, the Ohmic contact must not significantly perturb device performance. In other words, the contact must supply the required current density with a voltage drop that is significantly small compared with the drop across the active region of the device. The contact must also possess good mechanical properties, that is, good metal adhesion during formation, subsequent processing and in service device operation. The metallization must not cause excessive stress in the underlying semiconductor since this can result in alteration of electronic characteristics. The Ohmic contact must be temporally and thermally stable. Additionally, the Ohmic contact must be environmentally stable under prolonged bias-temperature stress, humidity, and reactive ambient conditions. The contact metal-semiconductor interface must be uniform, shallow, and abrupt. In the case of alloyed contacts, the metal-semiconductor interface phase(s) must be laterally homogenous. This uniformity of metal-semiconductor interfacial reactions serves to minimize the spread in contact resistance values, suppress current nonuniformity and improve device reliability. The metallization must have a smooth surface morphology, which is critical for device wire bonding. Fabrication of the Ohmic contacts must be controllable and reproducible, that is, reactions and other properties which govern the contact resistance must be reproducible and the contact fabrication must be compatible with semiconductor processing. Finally, the drive towards lower contact processing temperatures should be adhered to whenever possible. This is critical for device integration issues, namely, integration of materials with differing thermal stability within a single device (heterostructures) and/or integration of several devices, composed of different materials, on a common substrate.",
        "A nickel silicide (Ni2Si) Ohmic contact is formed on n-type silicon carbide (n-SiC) semiconductor substrate or n-SiC substrate with SiC epilayer by means of a pulsed laser ablation deposition process.",
        "A SiC substrate or n-SiC substrate with SiC epilayer is optionally masked to expose the required deposition area(s). The SiC substrate or n-SiC substrate with SiC epilayer is mounted in a vacuum chamber (preferred base pressure of <1.0×10−6 Torr) in the substrate/sample position. A source nickel silicide target has the chemical composition Ni2Si and is 99.9% pure. The source Ni2Si target is mounted in a vacuum chamber in close proximity to the sample substrate and separated from the target by a gap. The preferred gap distance is 10 cm.",
        "A laser beam is focused onto the rotating source target with a 45° incident angle. The source target Ni2Si is then ablated by a laser beam (preferred laser fluence 10 Jcm−2) to produce a Ni2Si plume that is the deposited on the SiC substrate or n-SiC substrate with SiC epilayer (substrate is not heated). The preferred amount is a 200-400 nanometer thick Ni2Si layer on the SiC substrate or n-SiC substrate with SiC epilayer.",
        "The result is a Ni2Si Ohmic contact having the same stoichiometric composition as the source target. In order to dissolve the native oxide, which is present at the interface between the Ni2Si contact metallization and the SiC substrate or n-SiC substrate with SiC epilayer, a post deposition anneal at 950° C. for 30 s (via rapid thermal annealing (RTA)) is performed in a N2 ambient. Thus the Ni2Si—SiC Ohmic contact is formed.",
        "FIG. 1. Ni-contact to n-SiC. (a) Schematic diagram of the e-beam as-deposited Ni on n-SiC; (b) Scanning electron microscopy (SEM) micrograph of the Ni—SiC after annealing at 950° C. for 2-5 min showing interfacial voiding, unreacted carbon, broad interface/significant expansion of the contact layer, and extreme surface roughness; (c) Schematic representation of the annealed Ni—SiC Ohmic contact with the reliability issues highlighted.",
        "FIG. 2. (a) Schematic diagram of the pulsed laser ablation deposition (PLD) system and processing parameters. (b) nickel silicide (Ni2Si) Ohmic contact to n-type SiC. (c) processing steps.",
        "FIG. 3. Current-Voltage (I-V) characteristics of the PLD as-deposited (open diamonds), 700° C. annealed (filled circles), and 950° C. annealed (filled triangles) Ni2Si contacts to n-SiC.",
        "FIG. 4. Rutherford backscattering spectroscopy (RBS) spectra of the PLD as-deposited and annealed Ni2Si—SiC contacts.",
        "FIG. 5. Auger electron spectroscopy (AES) elemental depth profiles of the PLD (a) as-deposited and (b) 950° C. annealed Ni2Si contact to n-SiC.",
        "FIG. 6. Cross-sectional field emission scanning electron microscopy (FESEM) micrographs of the PLD (a) as-deposited and (b) 950° C. annealed Ni2Si Ohmic contacts to n-SiC.",
        "FIG. 7. Plan-view field emission scanning electron microscopy (FESEM) micrographs showing the surface morphology of the PLD (a) as-deposited and (b) 950° C. annealed Ni2Si Ohmic contacts to n-SiC.",
        "SiC is an excellent candidate for high temperature and high power device applications because of its combination of electronic and thermal properties, namely, wide energy bandgap, high electric breakdown field, large saturated electron drift velocity and high thermal conductivity. Based on these properties, devices fabricated from SiC promise superior performance to that of present day devices. Rapid advances in the growth, doping, and processing of SiC have led to the realization of several electronic and photonic devices including fast recovery high voltage diodes, metal oxide semiconductor field effect transistors (MOSFETs), metal semiconductor field effect transistors (MESFETs), static induction transistors (SITs), junction field effect transistors (JFETs), UV photodiodes, and SiC bipolar devices, bipolar junction transistors (BJTs) and hybrid bipolar transistors (HBTs). The wide bandgap and high thermal conductivity are attractive for high temperature digital integrated circuits and nonvolatile solid-state memories. Although progress with SiC based electronic devices has been encouraging, there are significant challenges to overcome in the development of physically, chemically, and electrically stable and reliable multilevel metallization technology capable of high packing density. An important requirement of all device technologies is the development of electrical contacts with low specific contact resistance and high stability and long term reliability. Ohmic contacts with low specific contact resistance and good thermal stability are necessary to obtain optimum performance from high temperature, high power, and high frequency devices. As the device dimensions continue to decrease, much more stringent requirements are being placed on the material, processing, and electrical performance of low resistance Ohmic contacts. Metallization of wide bandgap semiconductors (SiC) is complicated, particularly because of their high surface reactivity, low doping concentrations, and high density of interface states.",
        "Nickel Ohmic contacts are deemed the industry standard contacts for SiC devices. Nickel Ohmic contacts to n-SiC possess a low specific contact resistance (ρc) less than 5.0×10−5 Ω-cm2, and good physical thermal stability at temperatures up to 500° C. for ˜100 h. In addition, from the point of electrical integrity, nickel Ohmic contacts to n-SiC are reproducible.",
        "It is known that Ni-nSiC Ohmic contacts are formed by depositing pure metallic nickel on the n-SiC substrate or n-SiC substrate with SiC epilayer. This intermediate (Ni—SiC) is then furnace annealed at temperatures of about 950° C. for 2 to 5 minutes or rapid thermal annealed (RTA) at temperatures of about 950° to 1000° C. for 30 s-60 s. Annealing results in the formation of the intermetallic phase Ni-silicide (N2Si) overlying the SiC substrate or n-SiC substrate with SiC epilayer material. The resulting Ohmic contact composition is represented by the chemical formula Ni2Si—SiC. Formation of Ni2Si by annealing Ni—SiC at 950° C. to 1000° C. has been reported to cause a lower resistance of the initial Ni—SiC contact. Therefore, it is actually this Ni2Si—SiC composition and not pure Ni intermediate contact that displays the low specific contact resistance reported above.",
        "It has been reported that the high temperature annealing process used to form this Ni2Si—SiC Ohmic contacts results in several undesirable features which cause device reliability issues and ultimate device failure. These features include:",
        "Substantial broadening of the contact layer thickness or metal-SiC interface expansion. The increase in contact thickness via consumption of the SiC substrate or n-SiC substrate with SiC epilayer is due to the high reactivity of Ni with Si to form Ni-silicide leaving behind both voids and unreacted carbon. Annealing the Ni—SiC contact results in a contact thickness increase of ≧100%. Such an increase in contact thickness makes the annealed Ni—SiC Ohmic contact not useable for device designs which posses shallow p-n junctions.",
        "A rough interface morphology heavily laden with Kirkendall voids. The voids, (resulting from the high reactivity of Ni with Si) at the interface will cause internal stress and possible delamination of the contact layer, which will compromise device reliability. The internal stress and contact delamination will be significantly amplified under the extreme thermal and electrical stresses typical of the power device operational environment and will ultimately result in device failure. The rough interface morphology makes the annealed Ni—SiC Ohmic contact not useable for device designs which posses shallow p-n junctions. Thus loss of a sharp interface will compromise device designs which possess shallow p-n junctions.",
        "Carbon segregation at the metal-SiC interface and/or throughout the metal layer. It is known, via x-ray photoelectron spectroscopy (XPS) analyses of the annealed contact, that carbon is in the graphite state and that Si is bonded predominantly to Ni resulting in Ni-silicide formation. Dissociation of SiC, to Si and C in the presence of Ni atoms is possible at temperatures above 400° C. Thus, the dissociation of SiC at the Ni/SiC interface to Si and C is due to the reactivity of Ni. Carbon inclusions at the metal-SiC interface and/or within the contact layer are considered a potential source of electrical instability, especially after prolonged operation of the devices at high temperatures. At elevated temperatures redistribution of carbon inclusions will arise, resulting in significant degradation of the contact's electrical and microstructural properties.",
        "Substantial roughening of the contact surface (on the order of tens of nanometers). For many device applications Ohmic contacts must be wire bonded to a die package. A rough surface morphology will most likely cause wire bonding difficulty and/or failure under the extreme thermal fatigue during high power and high temperature device operation. Additionally, rough surface morphology is not desirable for high current applications because it causes non-uniformity of current flow. In addition, contact surface roughness results in residual material stresses that may induce SiC polytype changes. Alteration of the SiC polytype also alters the electrical properties. For example, a polytype change from 4H to 6H degrades the electron mobility of the SiC and degrades the device.",
        "Therefore, even though Ni contacts possess excellent electrical properties, the above mentioned features will lead to device reliability problems and ultimately cause device failure via contact degradation and/or wire bond failure after exposure to long term high power and high temperature device operational stresses. FIG. 1(a) displays a cross sectional view schematic of the e-beam as-deposited Ni-nSiC Ohmic contact. A cross sectional view scanning electron microscopy (SEM) micrograph (showing the above mentioned undesirable features: residual carbon 101, void formation 102, rough surface morphology 103 and 105 and extreme contact broadening or interface broadening 104) of the 950° C. annealed Ni—SiC is displayed in FIG. 1(b). From the data in FIG. 1(b) the inventor constructed a schematic diagram, displayed in FIG. 1(c), of the cross sectional view of the annealed Ni-nSiC Ohmic contact highlighting the above mentioned undesirable features.",
        "All of the above mentioned phenomena have led the inventors to seek a method of forming a Ni2Si-nSiC Ohmic contact in the absence of the undesirable phenomena (residual carbon, void formation, rough surface morphology and extreme contact broadening or interface broadening) associated with the annealing of pure Ni-nSiC Ohmic contacts. The inventors have fabricated an improved Ohmic contact to n-SiC via direct deposition of the intermetallic phase, Ni2Si, known to be in thermodynamic equilibrium with SiC at high temperatures (900-1000° C.).",
        "The Ni2Si (400 nm) metallization was deposited via pulse laser ablation deposition (PLD) on select grade, Si-face, 8° off-c-axis (0001) 4H n-type (2.0×1018 cm−3) SiC wafers. Prior to metal deposition the wafers were cleaned in warm electronic grade trichoroethane (TCA), acetone and methanol followed by a rinse in deionized water. The Ni2Si metallization was pulse laser ablated from a Ni2Si (99.9% pure) source target under a base vacuum of less than 1.0×10−6 Torr using a Lambda Physik Complex 205 excimer laser (KrF-248 nanometer laser). Depositions were performed with the laser beam 201 focused through focusing lens 202 onto the rotating target 207 at a 45° incident angle. The sample-target separation distance was 10 cm and the laser fluence was 10 Jcm−2 with a repetition rate of 50 Hz. The Ni2Si films were deposited on to an unheated SiC wafer substrate 205 or n-SiC substrate with SiC epilayer also 205. A schematic of the deposition system and processing parameters is displayed in FIGS. 2(a) thru 2(c). The target rotation motor 203 rotates the target 207 causing ablation plume 204 which is deposited on sample 205, which is mounted on sample holder 206. The process can be observed through viewing window 208.",
        "This process is shown in greater detail by a flow diagram showing the individual steps to the deposition/annealing process in FIG. 2(c). Step 210: An n-type SiC wafer substrate 205 is mounted in a vacuum chamber in a sample-substrate position on sample holder 206. Step 220: a Ni2Si source target 207 is mounted in the vacuum chamber separated from the n-type SiC wafer 205 by a sample-target gap—preferably about 10 cm. Step 230: the Ni2Si source target 207 is rotated. Step 240: the Ni2Si source target 207 is ablated by the use of a laser beam 201 producing an intermetallic phase plasma plume 204. Step 250: the intermetallic phase plasma plume 204 is transferred to the n-type SiC wafer substrate 205. Step 260: the intermetallic phase Ni2Si plume is deposited, as shown in FIG. 2(b), as an Ni2Si film 209 on the n-type SiC substrate 205 to form an Ni2Si-n-type SiC Ohmic contact. Step 270: the Ni2Si-n-type SiC Ohmic contact undergoes rapid thermal annealing in N2 ambient for 30 s at 950° C.",
        "Subsequent to deposition the Ni2Si—SiC samples were rapid thermally annealed (RTA) in an AG Associates RTA for 30 sec at 700° C. and 950° C. Material characterization was performed on the PLD as-deposited and annealed samples. The contacts electrical quality was evaluated via current voltage characteristics using a HP 4140B semiconductor test system. The contacts composition, thickness, and interface quality was determined via Rutherford backscattering spectroscopy (RBS) analysis with a NEC Pelletron accelerator using a 2 MeV He+ ion beam with a scattering angle of 170° and a solid angle of 5.5 msr. Simulations were produced using the computer code RUMP. The contact structure was analyzed by glancing angle x-ray diffraction (GAXRD) with a Siemens D-5005 powder diffractometer using Cu Kα radiation at 50 kV and 40 mA. Auger electron spectroscopy (AES) was employed to assess elemental distribution within the contact and across the contact-SiC interface. AES analyses were obtained using a Perkin Elmer PH1660 scanning Auger microprobe. A Hitachi S4500 field emission scanning electron microscopy (FESEM) was utilized to assess the contact surface morphology, contact-SiC interface uniformity and film microstructure. DI Tapping mode atomic force microscopy (AFM) was used to quantify the contacts surface roughness.",
        "The electrical, structural, compositional, and interfacial properties of the PLD Ni2Si Ohmic contacts to n-SiC have been investigated as a function of annealing temperature. The I-V characteristics of the PLD as-deposited and annealed contacts to n-SiC are displayed in FIG. 3. The as-deposited sample exhibited non-Ohmic behavior suggestive of a large barrier height. Annealing at 700° C. caused no improvement in the I-V characteristics. However, annealing at 950° C. resulted in excellent Ohmic behavior as demonstrated by the I-V characteristics which possess linear characteristics with small resistance and is symmetric with reversal of voltage polarity. Thus, annealing at 950° C. significantly enhanced the current conduction through the contacts. The fact that a thermal anneal was required to achieve good Ohmic behavior suggests that some minute reaction must have occurred. Such as interfacial reaction may have eliminated some interfacial contaminants (e.g. thin oxide layer) thereby releasing Fermi level pinning and inducing Ohmic behavior.",
        "In order to assess and understand the contacts electrical characteristics RBS, GAXRD, AES, and FESEM analyses were performed on the PLD as-deposited and annealed contacts. The RBS spectra for the Ni2Si—SiC contacts are displayed in FIG. 4. The surface energies of the film elements are marked by arrows. The high energy edge of the Si signal from the SiC substrate is shifted to lower energies with respect to that of the Si in the Ni2Si film, because the detected particles that are backscattered there lose energy in the overlying film. From the energy width of the Ni signal the contact thickness was determined to be ˜400 nm. The width of the Ni signal is the same for the as-deposited and 700° C. annealed sample, however, the 950° C. sample is slightly thinner as indicated by the higher energy position of the back edge of the Ni signal and front edge of the Si signal in SiC. The thinner film, 950° C. sample, is due to non-uniformity of the PLD process. Slight variations in film thickness across a PLD deposited film are inherent to the deposition technique since PLD maintains uniformity on a scale of ˜1×1 cm2. However, since Ohmic contact dimensions are on the scale of 10 s to 100 s of microns this non-uniformity of ˜1×1 cm2 is negligible and does not pose an issue for device manufacture. The fact that the back edge of the Ni signal did not shift to lower energies (width of the Ni signal did not increase) as a result of annealing indicates that there is no increase of the vertical dimension of the contact (that is, no broadening of the contact layer or interface expansion) as a result of annealing. The contact-SiC interface quality was assessed by comparing the slopes of the front edge of the Si signal in SiC and the back edge of the back edge of the Ni signal of the as-deposited spectrum with those of the annealed spectra. The slopes of the as-deposited and annealed contacts appear virtually identical, indicating a minimal amount of interaction between the contact and SiC as a result of annealing required for Ohmic contact formation.",
        "The GAXRD data for the contacts annealed at 700° C. and 950° C. confirmed the presence of the Ni2Si phase. The AES depth profiles for the as-deposited and 950° C. annealed contacts are displayed in FIGS. 5(a) and 5(b). AES elemental depth profile for the PLD as-deposited sample shows a very sharp interface between the contact metallization and the SiC substrate or n-SiC substrate with SiC epilayer, however, slight oxygen enrichment is observed at the contact-SiC interface. The interfacial oxygen is most likely due to lack of an oxide etch step prior to the metal deposition. The AES depth profile for the 950° C. annealed sample shows the contact-SiC interface to be chemically abrupt with no interfacial oxygen present or signs of elemental interdiffusion. The high temperature, 950° C., anneal appears to have caused dissolution of the interfacial oxide, which in turn prompted the excellent electrical properties of this contact. The negligible level of the carbon signal within the annealed contact and at the contact-SiC interface indicates that no residual carbon is present within the film or accumulated at the interface as a result of the high temperature annealing process. The absence of residual carbon within the contact metallization is extremely desirable from the standpoint of device reliability. Carbon inclusions at the metal-SiC interface and/or within the contact layer are considered a potential source of electrical instability, especially after prolonged operation of the devices at high temperatures. At elevated temperatures redistribution of carbon inclusions will arise, resulting in significant degradation of the contact's electrical and microstructural properties. Thus, the direct deposition of Ni2Si served to eliminate carbon accumulation within the film and at the metal-SiC interface.",
        "FIG. 6 displays the field emission scanning electron microscopy (FESEM) secondary electron cross-sectional micrographs of the as-deposited and 950° C. annealed contacts to SiC. For both the PLD as-deposited and annealed samples, the metal-SiC interfaces were morphologically abrupt and the contact layer thickness/interface width remained unchanged and uniform over large lateral distances with no evidence of void formation or contact delamination as a result of the annealing process.",
        "Plan-view field emission scanning electron microscopy (FESEM) micrographs, FIG. 7, of the as-deposited and annealed contacts show the surfaces to be homogenous, smooth, crack and pinhole free. Quantification of the surface roughness was achieved via AFM. The average root mean square roughness values (Rrms) for the PLD as-deposited and 950° C. annealed contacts were 0.037 nm and 0.067 nm respectively. The extreme surface smoothness of the annealed Ni2Si contact promotes strong reliable wire bonding and will ensure maintenance of wire-contact mechanical durability during high power and high temperature device operation. In addition, a smooth surface morphology ensures current uniformity and retention of the original SiC polytype with its inherent electrical properties.",
        "The inventors have demonstrated that excellent electrical, and enhanced structural, compositional, and interfacial properties have been achieved by direct deposition, via PLD, of the intermetallic phase, Ni2Si, on n-SiC.",
        "The foregoing description of the specific embodiments will so fully reveal the general nature of the invention that others can, by applying current knowledge, readily modify and/or adapt for various applications such specific embodiments without departing from the generic concept, and, therefore, such adaptations and modifications should and are intended to be comprehended within the meaning and range of equivalents of the disclosed embodiments. It is to be understood that the phraseology or terminology employed herein is for the purpose of description and not of limitation. Therefore, while the embodiments of the invention have been described in terms of preferred embodiments, those skilled in the art will recognize that the embodiments of the invention can be practiced with modification within the spirit and scope of the appended claims."
    ],
    "citations": [
        "4554045",
        "5075243",
        "5415829",
        "5502003",
        "5504041",
        "5652437",
        "5877077",
        "5929523",
        "6110813",
        "6139624",
        "6150246",
        "2001/0039105",
        "2002/0125482",
        "198 11 046",
        "198 27 925",
        "199 19 905",
        "WO 97/26678"
    ],
    "us_classification": "438602",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "L",
            "main_group": "21",
            "subgroup": "3205"
        }
    ]
}