{
    "title": "Guide rails for pull-out drawer/equipment",
    "abstract": "A sliding guide rail assembly is provided for slidably mounting a drawer or equipment within a cabinet or chassis. The rail is formed from a sheet metal into a T-shaped section onto which a sliding means fits and slides smoothly thereon. Guides also formed from a sheet metal into C-sections fitting over the sliding means and operable to slide smoothly therewith. This enables the drawer/equipment mounted on the slide to be drawn in and out with little effort or wear and tear.",
    "inventors": [
        "Lam",
        "Lam"
    ],
    "document_number": "07296863",
    "publication_date": "20071120",
    "assignees": [
        "Harn Marketing Sdn Bhd"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A sliding guide assembly supporting a drawer/equipment for slidably opening and closing within a cabinet or chassis comprising:",
            "components": [
                {
                    "component": "a mounting bracket having at least two parallel flanges, one flange (",
                    "subcomponents": []
                },
                {
                    "component": "a first sliding housing fitting on said T-rail and being operable to slide smoothly thereon, with the distance of travel limited between said first limit stoppers (",
                    "subcomponents": []
                },
                {
                    "component": "a pull-out guide in the form of a C-section fitting over said first sliding housing and being operable to slide smoothly therewith between a pair of second limit stoppers (",
                    "subcomponents": []
                },
                {
                    "component": "a second sliding housing fitting over said pull-out guide and being operable to slide smoothly thereon between said pair of third limit stoppers (",
                    "subcomponents": []
                },
                {
                    "component": "a second pull-out guide of C-section having locating means and arranged to fit over said second sliding housing and being operable to slide smoothly therewith between a pair of fourth limit stoppers (",
                    "subcomponents": []
                },
                {
                    "component": "wherein said second pull-out guide is mounted to said drawer/equipment by said locating means, the potential travel of the second pull-out guide in relation to the second flange (",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The sliding guide assembly according to claim 1 , wherein said other flange (",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The sliding guide assembly according to claim 2 , wherein the T-rail has flanges of equal width on both sides of said other flange (",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The sliding guide assembly according to claim 1 , wherein the T-rail has flanges of equal width on both sides of said other flange (",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The sliding guide assembly according to claim 1 , wherein said second pull-out guide is fixedly attached to said drawer/equipment.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The sliding guide assembly according to claim 1 , wherein the mounting bracket is formed from a sheet metal.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The sliding guide assembly according to claim 1 , wherein said pull-out guide is formed from a sheet metal.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The sliding guide assembly according to claim 1 , wherein the T-rail is formed with one flange folded.",
            "components": []
        }
    ],
    "description": [
        "This application is a division of U.S. patent application Ser. No. 11/206,593, filed on Aug. 18, 2005 now U.S. Pat. No. 7,156,478 which in turn is a division of U.S. patent application Ser. No. 10/440,413, filed on May 19, 2003, now U.S. Pat. No. 6,945,620 which are incorporated by reference as if fully set forth.",
        "This invention relates to the sliding guide rails for pull-out drawers and/or equipment from their cabinets/chassis.",
        "Guide rails are components in common every day use, such as for drawers in desks or cabinets, and for industrial use such as pull-out storage shelves at the warehouse, cash registers at the supermarket, automated teller machines at the banking kiosks, electronic equipment at the telephone switching stations and so on. These guide rails provide frictionless rolling means and they enable us, for example, to pull out our drawers with little effort, and to reduce the pulling force required for operating the cash registers or shelves at the warehouses.",
        "Guide rails are provided for drawers to be either partially or fully opened. For other applications, such as the automated teller machines, they may have to be fully pulled out from their chassis for purposes of regular maintenance. In the latter case, over travel is typically provided by the guide rails.",
        "In most applications, these guide rails are preferred to be compact and allow maximum use of the available space. The primary requirements are their strength and rigidity. In most cases, these guides are thin and wide, and are usually installed vertically because of their greater rigidity in this position. However, when installed in the horizontal position, the strength and rigidity are very much reduced. Other requirements may be the ease of installation and/or alignment.",
        "The cost of a guide rail is also an important consideration. This depends on the construction of the rail such as on the number of components, manufacturing costs and/or installation costs.",
        "According to a first embodiment of the present invention there is provided a sliding guide assembly for supporting a drawer/equipment for slidably opening and closing within a cabinet or chassis comprising:",
        "a mounting bracket having at least two flanges, one flange for mounting to a part of said cabinet or chassis, and the other flange has its edge formed into a T-rail, and on the central web (36) adjacent said T-rail are formed a pair of limit stoppers;",
        "a housing having sliding means fitting on said T-rail and being operable to slide smoothly thereon, with the distance of travel limited between said stoppers; and",
        "a pull-out guide having a C-section fitting over said slide housing and being operable to slide smoothly therewith between a pair of limit stoppers;",
        "wherein the pull-out guide is attached to the drawer/equipment, and the travel of said slide is given by the total distance between the stoppers on the said T-rail and said pull-out guide minus twice the length of the said housing means.",
        "According to a second embodiment of this invention is provided a sliding guide comprising:",
        "a mounting bracket in the form of an L-section having a vertical flange for mounting to a part of said cabinet or chassis and a horizontal flange;",
        "a fixed guide having a pair of limit stoppers and mounted along said horizontal flange;",
        "a first and a second sliding housing means;",
        "an intermediate I-rail integrally comprising upper and lower T-rails and having two pairs of limit stoppers adjacent said T-rails; and",
        "a pull-out guide having a pair of limit stoppers;",
        "wherein said first sliding housing means is operable to fit and slide smoothly on said lower T-rail and to fit and slide smoothly within said guide between said stoppers, whilst the second housing means is operable to fit and slide smoothly on said upper T-rail and to fit and slide smoothly within said guide between said stoppers; and the travel is given by the total distances between the said stoppers of the said fixed guide, said intermediate I-rail and said pull-out guide minus three times the length of said housing means.",
        "According to a third embodiment, a sliding guide is provided and comprising:",
        "a mounting bracket having at least two flanges, one flange for mounting to a part of said cabinet or chassis, and the other flange with its edge formed into a T-rail and having a pair of limit stoppers (39a) adjacent said T-rail (33a);",
        "a first sliding housing means fitting on said T-rail and being operable to slide smoothly thereon, with the distance of travel limited between said stoppers;",
        "a pull-out guide in the form of a C-section fitting over said housing means and being operable to slide smoothly therewith between a pair of stoppers, on either or both vertical flanges, said pull-out guide having a further pair of stoppers on the horizontal flange of said pull-out guide;",
        "a second sliding housing means fitting over said pull-out guide and being operable to slide smoothly thereon between said stoppers; and",
        "a pull-out guide of C-section having locating means and fitting over said second sliding housing means and being operable to slide smoothly therewith between a pair of stoppers;",
        "wherein said second pull-out guide is attached at the bottom of said drawer by said locating means, and the travel of the slide is given by the total distances between the said stoppers of the said T-rail and said pull-out guides and minus the lengths of said housing means.",
        "Preferably, the mounting brackets and sliding guides are formed from sheet metals.",
        "Preferably, the T-rails have flanges of equal widths on both sides of the central web. These flanges may be folded at either side of the vertical web, or on both sides.",
        "This invention will now be further described by way of non-limitative examples, with reference to the accompanying drawings, in which:",
        "FIG. 1 illustrates a drawer incorporating a sliding rail according to a first embodiment of the present invention.",
        "FIG. 2 is a sectional view of a drawer shown in FIG. 1.",
        "FIG. 3 is a perspective view of an assembled sliding rail according to the first embodiment.",
        "FIG. 4a illustrates the fixed member of the sliding rail shown in FIG. 3.",
        "FIG. 4b illustrates the roller housing of the sliding rail shown in FIG. 3.",
        "FIG. 4c illustrates the pull-out guide of the sliding rail shown in FIG. 3.",
        "FIG. 5a illustrates a drawer shown in FIG. 1 in its closed position.",
        "FIG. 5b illustrates a drawer shown in FIG. 1 at an intermediate open position.",
        "FIG. 5c illustrates a drawer shown in FIG. 1 in its fully opened position.",
        "FIG. 6 illustrates a drawer incorporating a sliding rail according to a second embodiment of the present invention.",
        "FIG. 7 is a sectional view of the drawer shown in FIG. 6.",
        "FIG. 8 is a perspective view of a sliding rail assembly according to the second embodiment.",
        "FIG. 9a illustrates the fixed member shown in FIG. 8.",
        "FIG. 9b illustrates the fixed guide shown in FIG. 8.",
        "FIG. 9c illustrates the lower roller housing shown in FIG. 8.",
        "FIG. 9d illustrates the intermediate guide shown in FIG. 8.",
        "FIG. 9e illustrates the upper roller housing shown in FIG. 8.",
        "FIG. 9f illustrates the pull-out guide shown in FIG. 8.",
        "FIG. 10 illustrates a drawer incorporating a sliding rail according to a third embodiment of the present invention.",
        "FIG. 11 is a sectional view of the drawer shown in FIG. 10.",
        "FIG. 12 is a perspective view of a sliding rail assembly according to the third embodiment.",
        "FIGS. 13a-13e illustrate the individual parts of the sliding rail shown in FIG. 12.",
        "FIG. 14 illustrates a drawer shown in FIG. 6 at an intermediate open position.",
        "FIG. 15 illustrates a drawer shown in FIG. 10 at an intermediate open position.",
        "Referring to FIG. 1, a slide rail assembly 20 according to the first embodiment is installed at each of the two sides of a drawer or slidable storage compartment/equipment 10. The sectional view of the drawer assembly, illustrated in FIG. 2, shows each slide rail comprising of a fixed support member 30; a roller housing 40; and a pull-out guide 50. FIG. 3 shows a perspective view of the slide rail assembly.",
        "The fixed support member 30 is formed from a sheet metal into a substantially U-shaped section. The longer flange 31 of the U has a multitude of holes 32 for mounting this support member 30 onto the inner side of a cabinet, for example, where a drawer or piece of equipment is to be slidably installed into. The other flange 33 is shorter and substantially parallel to flange 31. The long edge of flange 33 is formed into a T-shaped rail 33a, with the horizontal legs 34, 35 of the T being substantially equal in width from either side of the vertical leg or web 36.",
        "The centre part of the U-section is perpendicular to both flanges 31 and 33. In order to give these bent edges rigidity, notches 37 are formed at regular intervals along the bent edges.",
        "To increase the rigidity of flange 31, stepped edges 38, with heights of substantially half the thickness of the sheet metal, are formed on it. The stepped edges 38 may simply be a pair of parallel edges formed along the long side or depressed areas of a few cm2 of any shape formed at regular spaced intervals.",
        "Below the T-shaped rail of flange 33 and towards each of the two ends is a cut 39 in the shape of a U. The tongues of the U are bent inwardly and these serve as the limit stoppers 39 for the roller housing 40. The distance L1 between the stoppers determines the opening or pull-out travel of the drawer/equipment mounted on these slide rails 20. The tongues of 39 are preferably bent inward. This is to prevent the hands of the persons installing these slides or using the drawer or machine employing such slides from accidental cuts. However, these tongues can be bent outward without affecting their function as stoppers.",
        "The roller housing 40 is a long member of length L2 and is substantially of rectangular cross-section. The centre is substantially hollow and is in the form of an open T. Rollers 41 are provided at-the upper part of the T, whilst rollers 42, 43 are provided parallel to rollers 41 but at both sides of the T. These rollers 42 and 43 are relatively displaced in the vertical direction by substantially the thickness of flange 33. Depending on the loading capacity for which the slide is designed for, there may be a plurality of rollers 41, 42, 43 (as shown in FIG. 4b) or at least one of each type of rollers at each end of the housing 40.",
        "On each side of the roller housing 40 are at least two further side rollers 44 spaced apart as far as possible without interfering with the rollers 41, 42, 43. A similar arrangement is provided at the opposite side of housing 40. These side rollers 44 provide lateral guidance for the drawer/equipment. When these rollers 44 are spaced as far apart as possible, they provide greater lateral stability.",
        "In this embodiment, the slides provide only partial opening of a drawer and therefore the primary load is on rollers 41. This means that more rollers 41 may be provided than rollers 42 or 43.",
        "These rollers and the support parts of the housing are sized to withstand their designed loads. Rollers of appropriate size bigger than the supporting parts are selected so that the rolling planes of the rollers have sufficient clearance from the body of housing 40.",
        "The open T-recess at the centre of housing 40 fits onto the T-shaped rail 33a formed on flange 33. Rollers 41 inside the housing run on the upper, horizontal flange 34, 35 of the T-rail, whilst rollers 42 run on the lower surfaces of flange 34 and rollers 43 on the lower surface of flange 35. Of course, some clearances are provided between rollers 42, 43 and the lower surfaces of flanges 34, 35 for ease of alignment and/or assembly. Similarly, some clearances are provided between rollers 44 and the surfaces of the vertical web 36. Obviously, if the T-rail 33a is formed with the folded edge at the right hand side of flange 33 (as opposed to that shown in FIG. 4a), then the roller housing 40 would have to be turned around.",
        "Pull-out guide 50 is formed from a sheet metal into an open C-section having unequal sides. Guide 50 encloses roller housing 40 and slides smoothly on rollers 41, 42, 43, 44. On either side of guide 50 are two U cuts, one towards each of the ends, with the tongues bent inwardly to form stoppers 51. The distance L3 between these stoppers 51 determines the travel of the slide rail 20. On the upper surface at the rear end of 50 is cut and formed an L-shape extension 52. This extension 52 engages with an attachment (not shown) on the sideboard of drawer 10 for fixing this guide 50 to the drawer. At the outer end of guide 50 is punched an aperture 53 for engagement with a catch 54 (shown in FIG. 5) mounted at the forward sideboard of this drawer. In this way, the drawer can be easily and removably attached to the pull-out guide 50.",
        "A variation of a T-rail having flange 35a (not shown) folded may be provided. In this case, the T-recess of roller housing is symmetrical and the axes of rollers 42, 43 are in line with each other. It follows that the C-section of the pull-out guide has also symmetrical sides.",
        "With a pair of guide rails 20 installed at the sides of drawer 10, the drawer is then fully supported and can be slidably opened and closed with little effort. FIGS. 5a to 5c illustrate the closed, intermediate and fully opened positions of a drawer. The travel of the drawer is determined by L1+L3−2L2.",
        "FIG. 6 shows a second embodiment of a sliding guide 20a. This sliding guide 20a comprises of a fixed support bracket 110; a fixed sliding guide 120; a lower roller housing 40a; a pull-out slide rail 140; an upper roller housing 40b; and a pull-out guide 150. FIG. 7 illustrates a sectional view of this embodiment, while FIG. 8 shows a perspective view of an assembled slide rail 20a.",
        "As shown in FIG. 9a, the fixed support bracket 110 is formed from a sheet metal into a substantially L-section. The vertical flange 111 has a multitude of holes 112 for fixing to the side of a cabinet or chassis into which a drawer or equipment is to be installed in. As described earlier for flange 31, stepped edges 113 are formed on flange 111 for increasing its rigidity. Similarly, notches 114 are formed at the bent edge for increasing the rigidity and load capacity of this bracket.",
        "On the horizontal flange 115 of bracket 110 is attached a fixed guide 120. This guide 120 is formed from a sheet metal into an open C-section similar to the pull-out guide 50 described earlier. Stoppers 121 are punched and formed at either or opposite sides proximate the ends of guide 120. The distance L4 apart between these stoppers 121 determines the travel provided by this slide 20a.",
        "Fitted inside guide 120 is a lower roller housing 40a similar to the roller housing 40 described in the first embodiment. This housing 40a runs smoothly on its rollers 41, 42, 43, 44 inside guide 120 between the limit stoppers 121.",
        "FIG. 9d shows the pull-out slide rail 140. This is formed from a sheet metal into a substantially I-section or a composite of two Ts. Each part of the T is similar to the T-rail 33a on flange 33 as described in the first embodiment. Of course, the bent edges 141, 142 of the T-flanges may be on the same side as each other or at opposite sides. On the vertical web 143, adjacent to the T-rails, are formed two sets of stoppers 144, 145 spaced apart by distance L5. At the centre of the vertical flange 143, a roller 147 is mounted on a bracket 148 through a pin or shaft 149. This rail 140 can be installed with no distinction as to which end is forward. Of course, one type of rail 140 can be provided with the tongues of stoppers 144, 145 without being bent yet. These tongues of 144, 145 can then be bent in the required direction during assembly or installation. In this way, further flexibility in installation is provided. This also reduces the number of parts required for stocking.",
        "FIG. 9e shows the upper roller housing 40b, which is similar to housing 40 or 40a. Housing 40b fits and slides on the upper T-flange of rail 140, whilst housing 40a fits and slides on the lower T-flange.",
        "FIG. 9f shows the pull-out guide 150, which is similar to guide 50 as described in the first embodiment. Guide 150 fits over and slides on the rollers of housing 40b. Stoppers 151 at both ends determine the travel L6 of this sliding guide. Extended bracket 152 at the rear end and an aperture 153 at the front end provide means for attaching this guide 150 to the side of a drawer.",
        "As a variation of the T-rail as in the first embodiment, the flanges on both sides of the central web 143 of pull-out rail 140 may be folded. This follows that the T-recess of roller housing 40a, 40b are symmetrical, so are the C-section of guides 120, 150.",
        "Once both sides of a drawer, for example, are mounted and fully supported by the sliding guides 20a, the drawer can be safely drawn in or out. The opening of the drawer is determined by the distances between the limit stoppers on the various components of this slide and is given by L4+L5+L6−3L2. FIG. 14 illustrates a drawer at an intermediate open position. With this embodiment, it is possible to provide even some over-travel with two stages of telescopic extension of the sliding guide. It is possible to provide further over-travel with more stages of extension, depending on the loading capacity and rigidity required for a particular application.",
        "FIG. 10 shows a third embodiment of a sliding rail 20b in which the rail is mounted below the drawer rather than at the sides. With this arrangement, the vertical height of the slide assembly 20b is preferably kept low, so that the available height in the drawer is not sacrificed. This assembly 20b comprises a fixed support bracket 30a; roller housing 40c; intermediate pull-out guide 160; roller housing 170; and pull-out guide 180. FIG. 11 is a sectional view of this embodiment, whilst FIG. 12 is a perspective view of slide assembly 20b.",
        "As shown in FIG. 13a, support bracket 30a is similar in construction with bracket 30. However, the heights of vertical flanges 31a, 31b are shorter and are kept to the minimum possible and is formed from a sheet metal. The T-rail 33a is also similar to that described for the previous embodiments.",
        "FIG. 13b shows the roller housing 40c which is similar to the roller housing 40, 40a or 40b described above. With similar function, housing 40c fits onto the T-rail 33a of bracket 30a and slides smoothly thereon between stoppers 39a.",
        "As shown in FIG. 13c, pull-out guide 160 is similar in construction with previous guides 50, 120 or 150. On the side flanges are two stoppers 161, one towards each end. The tongues of these stoppers 161 are bent inward. On the upper horizontal flange are two further stoppers 162, also one towards each end. However, the tongues of 162 are bent outward.",
        "Roller housing 170 is a long and hollow member with a cross-section of a C with only one lip (as shown in FIG. 13d). There are rollers 171, 172, 173 on the top surface, sides and lip respectively. Depending on the design load, length of housing 170 and over-travel, at least one type of each roller 171, 172, 173 is provided at each of these surfaces. The rollers are sized bigger than the support parts of housing 170 such that housing 170 fits onto pull-out guide 160 and runs smoothly on these rollers 171, 172, 173.",
        "FIG. 13e shows another pull-out guide 180. This is also formed from a sheet metal and has a C-section with only one lip. On the top surface and at the rear end is punched and formed an L-bracket 181 for fixing with an attachment on the drawer. At the forward end but on the side flange is punched and formed a bracket 182 for fixing to the front part of the drawer. On each or both the sides are formed a pair of typical stoppers 183. This guide 180 fits over roller housing 170 and allows 170 to move smoothly therein between stoppers 183.",
        "Once the drawer/equipment 10 is attached to guide 180 and supported by slide 20b, the drawer/equipment can be drawn in or out with little effort as the component parts of slide 20b run smoothly on rollers between their respective limit stoppers. FIG. 15 illustrates such a drawer at an intermediate open position.",
        "While only a few embodiments and variations of a sliding guide have been described and illustrated, it is to be understood that many changes and modifications could be made to the present invention without departing from the scope of the present invention. A modification such as the T-rail oriented in the lateral direction is possible. Also instead of rollers 42, 43 and 44, which are not subjected to heavy loads, plain sliding strips made of low friction materials may be used."
    ],
    "citations": [
        "2277703",
        "3904254",
        "4469384",
        "4480878",
        "4606588",
        "4662761",
        "4752142",
        "4752143",
        "4779999",
        "4799802",
        "5020869",
        "5207781",
        "5209572",
        "5492400",
        "5570943",
        "5775788",
        "5779333",
        "5882100",
        "6132020",
        "6478393",
        "6588866",
        "2004/0000850",
        "3921858",
        "4432821",
        "19511999",
        "0 391 221",
        "0 927 530",
        "1117071",
        "WO 92/00027"
    ],
    "us_classification": "3123346",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "47",
            "subclass": "B",
            "main_group": "88",
            "subgroup": "00"
        }
    ]
}