{
    "title": "Method of measuring gate capacitance by correcting dissipation factor error",
    "abstract": "A gate capacitance of a MOS transistor is determined by (a) measuring the gate capacitance and dissipation factor; (b) obtaining a channel resistance and a tunneling resistance; (c) setting an initial capacitance and an error dissipation factor; (d) calculating a direct dissipation factor using the channel resistance, the tunneling resistance, and the initial capacitance; (e) calculating a calculated dissipation factor using the error dissipation factor, the direct dissipation factor, and the measured dissipation factor; (f) calculating a calculated capacitance using the channel resistance, the tunneling resistance, the initial capacitance, the error dissipation factor, and the measured dissipation factor; and (g) detecting the initial capacitance as an accurate gate capacitance of the transistor if it is determined that the calculated capacitance is equal to the measured capacitance and the calculated dissipation factor is equal to the measured dissipation factor, and otherwise repeating steps (c) through (g).",
    "inventors": [
        "Yang",
        "Jang"
    ],
    "document_number": "07298160",
    "publication_date": "20071120",
    "assignees": [
        "Samsung Electronics Co., Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of determining a gate capacitance of a MOS transistor, the method comprising:",
            "components": [
                {
                    "component": "(a) obtaining a measured capacitance and a measured dissipation factor by measuring the gate capacitance of the MOS transistor;",
                    "subcomponents": []
                },
                {
                    "component": "(b) obtaining a channel resistance and a tunneling resistance of an equivalent circuit of the MOS transistor;",
                    "subcomponents": []
                },
                {
                    "component": "(c) setting an initial capacitance and an error dissipation factor, which are required to find a calculated capacitance and a calculated dissipation factor, respectively;",
                    "subcomponents": []
                },
                {
                    "component": "(d) calculating a direct dissipation factor using the channel resistance, the tunneling resistance, and the initial capacitance;",
                    "subcomponents": []
                },
                {
                    "component": "(e) calculating the calculated dissipation factor using the error dissipation factor, the direct dissipation factor, and the measured dissipation factor;",
                    "subcomponents": []
                },
                {
                    "component": "(f) calculating the calculated capacitance using the channel resistance, the tunneling resistance, the initial capacitance, the error dissipation factor, and the measured dissipation factor;",
                    "subcomponents": []
                },
                {
                    "component": "(g) detecting the initial capacitance as an accurate gate capacitance of the MOS transistor when it is determined that the calculated capacitance is equal to the measured capacitance and the calculated dissipation factor is equal to the measured dissipation factor; and",
                    "subcomponents": []
                },
                {
                    "component": "(h) repeating steps (c) through (g) when at least one of the following conditions is true:",
                    "subcomponents": [
                        "(1) the calculated capacitance is not equal to the measured capacitance, and",
                        "(2) the calculated dissipation factor is not equal to the measured dissipation factor."
                    ]
                },
                {
                    "component": "(1) the calculated capacitance is not equal to the measured capacitance, and",
                    "subcomponents": []
                },
                {
                    "component": "(2) the calculated dissipation factor is not equal to the measured dissipation factor.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein step (b) comprises:",
            "components": [
                {
                    "component": "(b1) measuring a direct gate current, a direct drain current, a direct gate voltage, and a direct drain voltage of the MOS transistor; and",
                    "subcomponents": []
                },
                {
                    "component": "(b2) obtaining the channel resistance and the tunneling resistance using the direct gate current, the direct drain current, the direct gate voltage, and the direct drain voltage.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 2 , wherein the tunneling resistance is calculated by",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein the error dissipation factor is obtained by subtracting the measured dissipation factor from the direct dissipation factor.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 , wherein the direct dissipation factor is calculated by",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein the calculated dissipation factor is calculated by D",
            "components": [
                {
                    "component": "wherein D",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein the calculated capacitance is calculated by C",
            "components": [
                {
                    "component": "wherein D",
                    "subcomponents": []
                },
                {
                    "component": "wherein C",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A method of determining a gate capacitance of a MOS transistor, comprising:",
            "components": [
                {
                    "component": "(a) measuring a measured capacitance and a measured dissipation factor of the MOS transistor;",
                    "subcomponents": []
                },
                {
                    "component": "(b) setting an initial capacitance;",
                    "subcomponents": []
                },
                {
                    "component": "(c) calculating a calculated capacitance and a calculated dissipation factor based on the initial capacitance;",
                    "subcomponents": []
                },
                {
                    "component": "(d) repeating steps (b) and (c) until both the calculated capacitance is equal to the measured capacitance and the calculated dissipation factor is equal to the measured dissipation factor; and",
                    "subcomponents": []
                },
                {
                    "component": "(e) detecting the initial capacitance as an accurate gate capacitance of the MOS transistor when it is determined that both the calculated capacitance is equal to the measured capacitance and the calculated dissipation factor is equal to the measured dissipation factor.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 8 , further comprising, prior to step (c):",
            "components": [
                {
                    "component": "measuring a direct gate current, a direct drain current, a direct gate voltage, and a direct drain voltage of the MOS transistor; and",
                    "subcomponents": []
                },
                {
                    "component": "obtaining a channel resistance and a tunneling resistance of the MOS transistor using the direct gate current, the direct drain current, the direct gate voltage, and the direct drain voltage,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the calculated dissipation factor is calculated in step (c) based upon the channel resistance and the tunneling resistance.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 9 , wherein the tunneling resistance is calculated by",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 10 , wherein the calculated capacitance is calculated by C",
            "components": [
                {
                    "component": "wherein D",
                    "subcomponents": []
                },
                {
                    "component": "wherein C",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 8 , wherein the calculated dissipation factor is calculated by D",
            "components": [
                {
                    "component": "wherein D",
                    "subcomponents": []
                },
                {
                    "component": "wherein the direct dissipation factor is calculated by",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application claims priority under 35 U.S.C. §119 from Korean Patent Application No. 2003-12040, filed on Feb. 26, 2003, the contents of which are hereby incorporated by reference in their entirety as if fully set forth herein.",
        "1. Technical Field",
        "The present invention relates to a method of measuring a gate capacitance of a MOS transistor. Particularly, the present invention relates to a method of measuring an accurate gate capacitance by detecting a measurement error of an LCR meter used to analyze the characteristics of a MOS transistor.",
        "2. Description of the Related Art",
        "A MOS transistor operates on a principle that electric charges accumulate in a channel after passing through a gate oxide layer. Thus, to determine the characteristics of the MOS transistor, a method of measuring a gate capacitance has been widely used.",
        "By measuring the gate capacitance, the amount of electric charge accumulated in the channel of the transistor and the thickness of the gate oxide layer can be obtained. For this reason, the gate capacitance is a critical value that requires precise measurement.",
        "An LCR meter is an apparatus broadly used for measuring a gate capacitance of a MOS transistor. The LCR meter is used to measure parameters, such as a capacitance, an inductance, and a dissipation factor, with high accuracy in a short amount of time. Also, the LCR meter is used to easily measure contact resistances of electronic components, such as coils, condensers, and resistors.",
        "However, the LCR meter cannot avoid a measurement error. In particular, as the gate oxide layer of a MOS transistor becomes thinner, the measurement error becomes larger.",
        "FIG. 1 is a flow chart illustrating a conventional method of determining a gate capacitance of a MOS transistor.",
        "Referring to FIG. 1, a measured capacitance and a measured dissipation factor are obtained (step 110). Here, the measured capacitance and the measured dissipation factor are measured using an LCR meter. Next, a channel resistance and a tunneling resistance are obtained (step 120). The channel resistance and the tunneling resistance are obtained using a measured direct current of the MOS transistor via the transistor's equations.",
        "An initial capacitance is set and a calculated capacitance is obtained (steps 130 and 140). The initial capacitance is a parameter used for finding the calculated capacitance and is arbitrarily set by a designer. That is, the initial capacitance is arbitrarily set and the calculated capacitance is obtained using an equation. Then, it is determined whether or not the obtained calculated capacitance is equal to the measured capacitance obtained by the LCR meter (step 150).",
        "If it is determined that the calculated capacitance is not equal to the measured capacitance, a new initial capacitance is set, and steps 140 and 150 are repeated. Steps 130 through 150 are repeated until the calculated capacitance is equal to the measured capacitance. If the calculated capacitance is equal to the measured capacitance, the then initial capacitance corresponds to an accurate gate capacitance. Therefore, the initial capacitance is detected as the accurate gate capacitance (step 160).",
        "However, as described above, as the gate oxide layer of a MOS transistor becomes thinner, the measurement error of an LCR meter becomes larger. Thus, in step 110, the measured capacitance itself may have an error. As a result, the accurate gate capacitance, obtained by the conventional method 100 shown in FIG. 1, may have an error.",
        "When the gate capacitance is measured using an LCR meter, the number of measurement errors is proportional to the dissipation factor. Thus, to precisely correct a measurement error of the gate capacitance, an error of the dissipation factor must be precisely compensated.",
        "Therefore, it would be desirable to provide a method of measuring an accurate gate capacitance by correcting a measurement error of a gate capacitance measured by an LCR meter, by correcting an error in the dissipation factor.",
        "In accordance with one aspect of the present invention, there is provided a method of measuring a gate capacitance of a MOS transistor, which comprises: (a) obtaining a measured capacitance and a measured dissipation factor by measuring the gate capacitance of the MOS transistor; (b) obtaining a channel resistance and a tunneling resistance of an equivalent circuit of the MOS transistor; (c) setting an initial capacitance and an error dissipation factor, which are required to find a calculated capacitance and a calculated dissipation factor, respectively; (d) calculating a direct dissipation factor using the channel resistance, the tunneling resistance, and the initial capacitance; (e) calculating the calculated dissipation factor using the error dissipation factor, the direct dissipation factor, and the measured dissipation factor; (f) calculating the calculated capacitance using the channel resistance, the tunneling resistance, the initial capacitance, the error dissipation factor, and the measured dissipation factor; and (g) detecting the initial capacitance as an accurate gate capacitance of the MOS transistor if it is determined that the calculated capacitance is equal to the measured capacitance and the calculated dissipation factor is equal to the measured dissipation factor, and repeating step (c) through step (g) if the calculated capacitance is not equal to the measured capacitance or if the calculated dissipation factor is not equal to the measured dissipation factor.",
        "Beneficially, step (b) comprises: (b1) measuring a direct gate current, a direct drain current, a direct gate voltage, and a direct drain voltage of the MOS transistor; and (b2) obtaining the channel resistance and the tunneling resistance using the direct gate current, the direct drain current, the direct gate voltage, and the direct drain voltage.",
        "The tunneling resistance is calculated by",
        "R\n      t\n    \n    =\n    \n      \n        \n          L\n          [\n          \n            \n              \n                Z\n                \n                  d\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  c\n                \n              \n              \n                Y\n                \n                  d\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  c\n                \n              \n            \n            ⁢\n            \n              (\n              \n                \n                  \n                    Z\n                    \n                      d\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      c\n                    \n                  \n                  ·\n                  \n                    Y\n                    \n                      d\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      c\n                    \n                  \n                \n                +\n                2\n              \n              )\n            \n          \n          ]\n        \n        \n          1\n          /\n          2\n        \n      \n      /\n      \n        \n          cosh\n          \n            -\n            1\n          \n        \n        ⁡\n        \n          (\n          \n            \n              \n                Z\n                \n                  d\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  c\n                \n              \n              ·\n              \n                Y\n                \n                  d\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  c\n                \n              \n            \n            +\n            2\n          \n          )\n        \n      \n    \n  \n  ,\n\n\n\n\nand the channel resistance is calculated by",
        "R\n    s\n  \n  =\n  \n    \n      \n        1\n        \n          R\n          t\n        \n      \n      ⁡\n      \n        [\n        \n          \n            \n              Z\n              \n                d\n                ⁢\n                \n                  \n                \n                ⁢\n                c\n              \n            \n            \n              Y\n              \n                d\n                ⁢\n                \n                  \n                \n                ⁢\n                c\n              \n            \n          \n          ·\n          4\n          ·\n          \n            (\n            \n              \n                \n                  Z\n                  \n                    d\n                    ⁢\n                    \n                      \n                    \n                    ⁢\n                    c\n                  \n                \n                ·\n                \n                  Y\n                  \n                    d\n                    ⁢\n                    \n                      \n                    \n                    ⁢\n                    c\n                  \n                \n              \n              +\n              2\n            \n            )\n          \n        \n        ]\n      \n    \n    .\n  \n\n\n\n\nHere, Zdc is a drain impedance that is obtained by dividing the direct drain voltage by the direct drain current, and Ydc is a gate admittance that is obtained by dividing the direct gate current by the direct gate voltage.",
        "The error dissipation factor is obtained by subtracting the measured dissipation factor from the direct dissipation factor.",
        "The direct dissipation factor is calculated by",
        "D\n    \n      d\n      ⁢\n      \n        \n      \n      ⁢\n      c\n    \n  \n  =\n  \n    \n      \n        \n          A\n          ⁢\n          \n            \n          \n          ⁢\n          \n            sinh\n            ⁡\n            \n              (\n              \n                L\n                ·\n                Y\n                ·\n                A\n              \n              )\n            \n          \n        \n        -\n        \n          B\n          ⁢\n          \n            \n          \n          ⁢\n          \n            sin\n            ⁡\n            \n              (\n              \n                L\n                ·\n                Y\n                ·\n                B\n              \n              )\n            \n          \n        \n      \n      \n        \n          A\n          ⁢\n          \n            \n          \n          ⁢\n          \n            sin\n            ⁡\n            \n              (\n              \n                L\n                ·\n                Y\n                ·\n                B\n              \n              )\n            \n          \n        \n        +\n        \n          B\n          ⁢\n          \n            \n          \n          ⁢\n          \n            sinh\n            ⁡\n            \n              (\n              \n                L\n                ·\n                Y\n                ·\n                A\n              \n              )\n            \n          \n        \n      \n    \n    .",
        "Here, A is obtained by",
        "A\n    =\n    \n      \n        \n          \n            1\n            +\n            \n              \n                (\n                \n                  ω\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  \n                    \n                      c\n                      i\n                    \n                    ·\n                    \n                      R\n                      t\n                    \n                  \n                \n                )\n              \n              2\n            \n          \n        \n      \n      ·\n      \n        cos\n        (\n        \n          \n            \n              tan\n              \n                -\n                1\n              \n            \n            ⁢\n            ω\n            ⁢\n            \n              \n            \n            ⁢\n            \n              \n                c\n                i\n              \n              ·\n              \n                R\n                t\n              \n            \n          \n          2\n        \n        )\n      \n    \n  \n  ;\n\n\n\n\nB is obtained by",
        "B\n    =\n    \n      \n        \n          \n            1\n            +\n            \n              \n                (\n                \n                  \n                    ω\n                    ⁢\n                    \n                      \n                    \n                    ⁢\n                    \n                      c\n                      i\n                    \n                  \n                  +\n                  \n                    R\n                    t\n                  \n                \n                )\n              \n              2\n            \n          \n        \n      \n      ·\n      \n        sin\n        ⁡\n        \n          (\n          \n            \n              \n                tan\n                \n                  -\n                  1\n                \n              \n              ⁢\n              ω\n              ⁢\n              \n                \n              \n              ⁢\n              \n                \n                  c\n                  i\n                \n                ·\n                \n                  R\n                  t\n                \n              \n            \n            2\n          \n          )\n        \n      \n    \n  \n  ;\n\n\n\n\nY is obtained by",
        "Y\n    =\n    \n      \n        \n          R\n          s\n        \n        \n          R\n          t\n        \n      \n    \n  \n  ;\n\n\n\n\nand L denotes a length of the MOS transistor.",
        "The calculated dissipation factor is calculated by Dm′=Ddc·(1−Derr(1+Dm)). The calculated capacitance is calculated by Cm′=Cm1·(1−Derr/100·√{square root over ((1+Dm2)))}; Cm1 is calculated by",
        "Y\n      \n        a\n        ⁢\n        \n          \n        \n        ⁢\n        c\n      \n    \n    =\n    \n      \n        2\n        ·\n        \n          \n            tanh\n            ⁡\n            \n              (\n              \n                γ\n                ·\n                \n                  L\n                  2\n                \n              \n              )\n            \n          \n          \n            Z\n            O\n          \n        \n      \n      =\n      \n        \n          R\n          ′\n        \n        +\n        \n          j\n          ⁢\n          \n            \n          \n          ⁢\n          w\n          ⁢\n          \n            \n          \n          ⁢\n          \n            C\n            m1\n          \n        \n      \n    \n  \n  ;\n\n\n\n\nwhere R′ is a real number; Yac represents a gate input admittance of the MOS transistor, γ is calculated by",
        "γ\n    =\n    \n      \n        \n          \n            R\n            s\n          \n          \n            R\n            t\n          \n        \n        +\n        \n          j\n          ⁢\n          \n            \n          \n          ⁢\n          w\n          ⁢\n          \n            \n          \n          ⁢\n          \n            \n              C\n              i\n            \n            ·\n            \n              R\n              s\n            \n          \n        \n      \n    \n  \n  ;\n\n\n\n\nand Zo is calculated by",
        "Z\n    O\n  \n  =\n  \n    \n      \n        \n          \n            R\n            s\n          \n          ·\n          \n            R\n            t\n          \n        \n        \n          1\n          +\n          \n            j\n            ⁢\n            \n              \n            \n            ⁢\n            w\n            ⁢\n            \n              \n            \n            ⁢\n            \n              \n                C\n                i\n              \n              ·\n              \n                R\n                t\n              \n            \n          \n        \n      \n    \n    .",
        "The above features and advantages of the present invention will become more apparent by describing in detail exemplary embodiments thereof with reference to the attached drawings in which:",
        "FIG. 1 is a flow chart illustrating a conventional method of measuring a gate capacitance;",
        "FIG. 2 is an equivalent circuit diagram modeling a channel region of a MOS transistor;",
        "FIG. 3 is a circuit diagram modeling a MOS transistor to obtain an impedance and an admittance; and",
        "FIG. 4 is a flow chart illustrating a method of measuring a gate capacitance according to one or more aspects of the present invention.",
        "The present invention will now be described more fully with reference to the accompanying drawings, in which preferred embodiments of the invention are shown. The same reference numerals in different drawings represent the same element.",
        "FIG. 2 is an equivalent circuit modelling a channel region of a MOS transistor.",
        "A plurality of capacitors C and a plurality of tunnelling resistors Rt are respectively connected in parallel to a gate. A plurality of channel resistors Rs are connected in a series between a drain and a source. The capacitors C are gate capacitors.",
        "FIG. 3 is a circuit diagram modelling a MOS transistor to obtain an impedance and an admittance.",
        "Reference character L denotes a length of the MOS transistor. Zdc is a drain impedance that is obtained by dividing a direct drain voltage by a drain current, and Ydc is a gate admittance that is obtained by dividing a direct gate current by a direct gate voltage.",
        "The drain impedance Zdc and the gate admittance Ydc are used to obtain a value of the tunnelling resistor Rt (i.e., a tunnelling resistance) of FIG. 2 and a value of the channel resistor Rs (i.e., a channel resistance) of FIG. 2. A method of calculating the tunnelling resistance and the channel resistance using the drain impedance Zdc and the gate admittance Ydc will be described later.",
        "FIG. 4 is a flow chart illustrating a method of measuring a gate capacitance.",
        "Referring to FIG. 4, the method 400 of measuring a gate capacitance comprises, initially, obtaining a measured capacitance and a measured dissipation factor by measuring a gate capacitance of a MOS transistor (step 410).",
        "Next, a channel resistance and a tunnelling resistance of an equivalent circuit of the MOS transistor are obtained (step 420). More specifically, step 420 includes: (1) measuring a direct gate current, a direct drain current, a direct gate voltage, and a direct drain voltage of the MOS transistor; and (2) obtaining the channel resistance and the tunnelling resistance using the direct gate current, the direct drain current, the direct gate voltage, and the direct drain voltage.",
        "An initial capacitance and an error dissipation factor are set to obtain a calculated capacitance and a calculated dissipation factor, respectively (step 430). A direct dissipation factor is calculated using the tunnelling resistance and the initial capacitance (step 440).",
        "The calculated dissipation factor is calculated using the error dissipation factor, the direct dissipation, and the measured dissipation factor (step 450). Then, the calculated capacitance is calculated using the channel resistance, the tunnelling resistance, the initial capacitance, the error dissipation factor, and the measured dissipation factor (step 460).",
        "Then, it is determined whether or not the calculated capacitance is equal to the measured capacitance and whether or not the calculated dissipation factor is equal to the measured dissipation factor (step 470). If it is determined that the calculated capacitance is equal to the measured capacitance and the calculated dissipation factor is equal to the measured dissipation factor, the initial capacitance is detected as an accurate gate capacitance of the MOS transistor (step 480). If it is determined that the calculated capacitance is not equal to the measured capacitance or that the calculated dissipation factor is not equal to the measured dissipation factor, step 430 through step 470 are performed again.",
        "Hereinafter, a method of measuring a gate capacitance will be described with reference to FIGS. 2 through 4 in greater detail.",
        "A measured capacitance and a measured dissipation factor are obtained by measuring a gate capacitance of a MOS transistor (step 410). Hereinafter, the measured capacitance will be denoted by Cm and the measured dissipation factor will be denoted by Dm. As in the conventional method (100 of FIG. 1), the measured capacitance Cm and the measured dissipation factor Dm are measured using an LCR meter.",
        "Next, a channel resistance and a tunnelling resistance of an equivalent circuit 200 of the MOS transistor are obtained (step 420). To obtain the channel resistance and the tunnelling resistance, a direct current of the MOS transistor is measured using a direct current measuring apparatus (not shown).",
        "FIG. 3 shows a process of measuring the direct current. That is, a direct gate current, a direct drain current, a direct gate voltage, and a direct drain voltage of the MOS transistor are measured using the direct current measuring apparatus. Also, a drain impedance and a gate admittance are obtained using the direct gate current, the direct drain current, the direct gate voltage, and the direct drain voltage.",
        "Hereinafter, the drain impedance will be denoted by Zdc and the gate admittance will be denoted by Ydc. The direct gate current will be denoted by Ig, the direct drain current will be denoted by Id, the direct gate voltage will be denoted by Vg, and the direct drain voltage will be denoted by Vd. The drain impedance Zdc is obtained by dividing the direct drain voltage Vd by the direct drain current Id. That is, Zdc=Vd/Id.",
        "The gate admittance Ydc is obtained by dividing the direct gate current Ig by the direct gate voltage Vg. That is, Ydc=Ig/Vg.",
        "Then, the tunnelling resistance can be obtained using the following Equation 1.",
        "R\n          t\n        \n        =\n        \n          \n            \n              L\n              [\n              \n                \n                  \n                    Z\n                    \n                      d\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      c\n                    \n                  \n                  \n                    Y\n                    \n                      d\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      c\n                    \n                  \n                \n                ⁢\n                \n                  (\n                  \n                    \n                      \n                        Z\n                        \n                          d\n                          ⁢\n                          \n                            \n                          \n                          ⁢\n                          c\n                        \n                      \n                      ·\n                      \n                        Y\n                        \n                          d\n                          ⁢\n                          \n                            \n                          \n                          ⁢\n                          c\n                        \n                      \n                    \n                    +\n                    2\n                  \n                  )\n                \n              \n              ]\n            \n            \n              1\n              /\n              2\n            \n          \n          /\n          \n            \n              cosh\n              \n                -\n                1\n              \n            \n            ⁡\n            \n              (\n              \n                \n                  \n                    Z\n                    \n                      d\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      c\n                    \n                  \n                  ·\n                  \n                    Y\n                    \n                      d\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      c\n                    \n                  \n                \n                +\n                2\n              \n              )\n            \n          \n        \n      \n    \n    \n      \n        (\n        1\n        )",
        "Also, the channel resistance is obtained using the following Equation 2.",
        "R\n          s\n        \n        =\n        \n          \n            1\n            \n              R\n              t\n            \n          \n          ⁡\n          \n            [\n            \n              \n                \n                  Z\n                  \n                    d\n                    ⁢\n                    \n                      \n                    \n                    ⁢\n                    c\n                  \n                \n                \n                  Y\n                  \n                    d\n                    ⁢\n                    \n                      \n                    \n                    ⁢\n                    c\n                  \n                \n              \n              ·\n              4\n              ·\n              \n                (\n                \n                  \n                    \n                      Z\n                      \n                        d\n                        ⁢\n                        \n                          \n                        \n                        ⁢\n                        c\n                      \n                    \n                    ·\n                    \n                      Y\n                      \n                        d\n                        ⁢\n                        \n                          \n                        \n                        ⁢\n                        c\n                      \n                    \n                  \n                  +\n                  2\n                \n                )\n              \n            \n            ]\n          \n        \n      \n    \n    \n      \n        (\n        2\n        )",
        "Equations 1 and 2 for finding the tunnelling resistance and the channel resistance are obtained from the equivalent circuit 200 of the MOS transistor shown in FIG. 2.",
        "An initial capacitance for finding a calculated capacitance and an error dissipation factor for finding a calculated dissipation factor are set (step 430). While only the initial capacitance is set in the conventional method (100 of FIG. 1), both the initial capacitance and the error dissipation factor are set in the method 400. Herein, the initial capacitance is denoted by Ci and the error dissipation factor is denoted by Derr.",
        "The initial capacitance Ci is arbitrarily set by a designer. The error dissipation factor Derr is obtained by subtracting the measured dissipation factor Dm from the direct dissipation factor. The measured dissipation factor Dm is measured using the LCR meter in step 410. Hereinafter, the direct dissipation factor will be denoted by Ddc.",
        "The direct dissipation factor Ddc can be obtained from the following Equation 3 using the channel resistance, the tunnelling resistance, and the initial capacitance Ci (step 440).",
        "D\n            \n              d\n              ⁢\n              \n                \n              \n              ⁢\n              c\n            \n          \n          =\n          \n            \n              \n                A\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  sinh\n                  ⁡\n                  \n                    (\n                    \n                      L\n                      ·\n                      Y\n                      ·\n                      A\n                    \n                    )\n                  \n                \n              \n              -\n              \n                B\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  sin\n                  ⁡\n                  \n                    (\n                    \n                      L\n                      ·\n                      Y\n                      ·\n                      B\n                    \n                    )\n                  \n                \n              \n            \n            \n              \n                A\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  sin\n                  ⁡\n                  \n                    (\n                    \n                      L\n                      ·\n                      Y\n                      ·\n                      B\n                    \n                    )\n                  \n                \n              \n              +\n              \n                B\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  sinh\n                  ⁡\n                  \n                    (\n                    \n                      L\n                      ·\n                      Y\n                      ·\n                      A\n                    \n                    )\n                  \n                \n              \n            \n          \n        \n        ⁢\n        \n          \n\n        \n        ⁢\n        \n          Here\n          ,\n          \n            A\n            =\n            \n              \n                \n                  \n                    1\n                    +\n                    \n                      \n                        (\n                        \n                          \n                            ω\n                            ⁢\n                            \n                              \n                            \n                            ⁢\n                            \n                              c\n                              i\n                            \n                          \n                          +\n                          \n                            R\n                            t\n                          \n                        \n                        )\n                      \n                      2\n                    \n                  \n                \n              \n              ·\n              \n                cos\n                ⁡\n                \n                  (\n                  \n                    \n                      \n                        tan\n                        \n                          -\n                          1\n                        \n                      \n                      ⁢\n                      ω\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      \n                        \n                          c\n                          i\n                        \n                        ·\n                        \n                          R\n                          t\n                        \n                      \n                    \n                    2\n                  \n                  )\n                \n              \n            \n          \n          ,\n          \n            \n\n          \n          ⁢\n          \n            B\n            =\n            \n              \n                \n                  \n                    1\n                    +\n                    \n                      \n                        (\n                        \n                          \n                            ω\n                            ⁢\n                            \n                              \n                            \n                            ⁢\n                            \n                              c\n                              i\n                            \n                          \n                          +\n                          \n                            R\n                            t\n                          \n                        \n                        )\n                      \n                      2\n                    \n                  \n                \n              \n              ·\n              \n                sin\n                ⁡\n                \n                  (\n                  \n                    \n                      \n                        tan\n                        \n                          -\n                          1\n                        \n                      \n                      ⁢\n                      ω\n                      ⁢\n                      \n                        \n                      \n                      ⁢\n                      \n                        \n                          c\n                          i\n                        \n                        ·\n                        \n                          R\n                          t\n                        \n                      \n                    \n                    2\n                  \n                  )\n                \n              \n            \n          \n          ,\n          \n            Y\n            =\n            \n              \n                \n                  R\n                  s\n                \n                \n                  R\n                  t\n                \n              \n            \n          \n          ,\n        \n      \n    \n    \n      \n        (\n        3\n        )\n      \n    \n  \n\n\n\n\nand L is a length of the MOS transistor.",
        "Equation 3 for finding the direct dissipation factor Ddc is obtained from the equivalent circuit 200 of the MOS transistor shown in FIG. 2. The direct dissipation factor Ddc is an accurate value with no measurement error.",
        "The calculated dissipation factor is calculated using the error dissipation factor, the direct dissipation factor, and the measured dissipation factor (step 450). Hereinafter, the calculated dissipation factor will be denoted by Dm′.",
        "The calculated dissipation factor Dm′ is obtained using the following Equation 4.\n\nDm′=Ddc·(1−Derr(1+Dm))  (4)",
        "Equation 4 for finding the calculated dissipation factor Dm′ can be obtained from a data sheet of the LCR meter.",
        "The calculated capacitance is obtained using the channel resistance, the tunnelling resistance, the initial capacitance Ci, the error dissipation factor Derr, and the measured dissipation factor Dm (step 460). Hereinafter, the calculated capacitance is denoted by Cm′.",
        "The calculated capacitance Cm′ can be obtained using the following Equation 5.\n\nCm′=Cm1·(1−Derr/100·√{square root over ((1+Dm2)))}  (5)",
        "Equation 5 for finding the calculated capacitance Cm′ can be obtained from the data sheet of the LCR meter. Cm1 in Equation 5 is obtained using the following Equation 6.",
        "Y\n            \n              a\n              ⁢\n              \n                \n              \n              ⁢\n              c\n            \n          \n          =\n          \n            \n              2\n              ·\n              \n                \n                  tanh\n                  ⁡\n                  \n                    (\n                    \n                      γ\n                      ·\n                      \n                        L\n                        2\n                      \n                    \n                    )\n                  \n                \n                \n                  Z\n                  o\n                \n              \n            \n            =\n            \n              \n                R\n                ′\n              \n              +\n              \n                jwC\n                m1\n              \n            \n          \n        \n        ,\n      \n    \n    \n      \n        (\n        6\n        )\n      \n    \n  \n\n\n\n\n    \n    \n        where R′ is a real number",
        "Yac is a gate input admittance of the MOS transistor, and Equation 5 is obtained from the transmission line theory. That is, the gate input admittance of the equivalent circuit 200 as shown in FIG. 2 is obtained in a complex number form as: R′+jwCm1. Thus, Cm1 can be obtained.",
        "Then, γ is calculated by",
        "γ\n    =\n    \n      \n        \n          \n            R\n            s\n          \n          \n            R\n            t\n          \n        \n        +\n        \n          j\n          ⁢\n          \n            \n          \n          ⁢\n          w\n          ⁢\n          \n            \n          \n          ⁢\n          \n            \n              C\n              i\n            \n            ·\n            \n              R\n              s\n            \n          \n        \n      \n    \n  \n  ,\n\n\n\n\nand Zo is calculated by",
        "Z\n    o\n  \n  =\n  \n    \n      \n        \n          \n            R\n            s\n          \n          ·\n          \n            R\n            t\n          \n        \n        \n          1\n          +\n          \n            jw\n            ⁢\n            \n              \n            \n            ⁢\n            \n              \n                C\n                i\n              \n              ·\n              \n                R\n                t\n              \n            \n          \n        \n      \n    \n    .",
        "It is determined whether or not the calculated capacitance Cm′ is equal to the measured capacitance and whether or not the calculated dissipation factor Dm′ is equal to the measured dissipation factor Dm (step 470).",
        "In the conventional method 100, it is determined only whether or not the calculated capacitance is equal to the measured capacitance. If the measured capacitance contains an error, the gate capacitance obtained from the calculated capacitance also contains an error.",
        "On the other hand, in the method 400, as an error contained in the calculated dissipation factor Dm′ is corrected using the error dissipation factor Derr, an error contained in the calculated capacitance Cm′ can also be corrected.",
        "If it is determined that the calculated capacitance Cm′ is not equal to the measured capacitance Cm or the calculated dissipation factor Dm′ is not equal to the measured dissipation factor Dm, step 430 through step 470 are performed again.",
        "If the calculated capacitance Cm′ is not equal to the measured capacitance Cm or if the calculated dissipation factor Dm′ is not equal to the measured dissipation factor Dm, the initial capacitance Ci and the error dissipation factor Derr are newly set. As the initial capacitance Ci is set again, the direct dissipation factor Ddc is varied and thus the error dissipation factor Derr is also varied.",
        "If the error dissipation factor Derr and the direct dissipation factor Ddc are varied, the calculated dissipation factor Dm′ is also varied. As the error dissipation factor Derr is varied, the calculated capacitance Cm′ is also varied. Thus, it is determined whether or not the varied calculated dissipation factor Dm′ is equal to the measured dissipation factor Dm. Also, it is determined whether or not the varied calculated capacitance Cm′ is equal to the measured capacitance Cm.",
        "If it is determined that the varied calculated dissipation factor Dm′ is not equal to the measured dissipation factor Dm or the varied calculated capacitance Cm′ is not equal to the measured capacitance Cm, the initial capacitance Ci and the error dissipation factor Derr are newly set again, and step 440 through step 470 are performed again.",
        "As described above, a process of optimizing the initial capacitance Ci and the error dissipation factor Derr is repeated until the calculated dissipation factor Dm′ is equal to the measured dissipation factor Dm. Thus, the error contained in the measured dissipation factor Dm can be corrected.",
        "Also, while the error dissipation factor Derr is being compensated, the error contained in the measured capacitance is also corrected. Accordingly, if the calculated capacitance Cm′ is equal to the measured capacitance Cm, the then initial capacitance Ci is detected as an accurate gate capacitance of the MOS transistor (step 480).",
        "That is, according to the method 400, when the error contained in the measured dissipation factor Dm is corrected using the error dissipation factor Derr and the calculated dissipation factor Dm′, the error contained in the measured capacitance Cm is also corrected. Thus, it is possible to obtain an accurate gate capacitance of the MOS transistor.",
        "As explained thus far, an error in the measured dissipation factor can be corrected by use of an LCR meter, thus enabling correct measurement of a gate capacitance of a MOS transistor.",
        "In the drawings and specification, there has been disclosed a typical preferred embodiment of the invention and, although, specific terms are employed, they are used in a generic and descriptive sense only and not for purposes of limitation. As for the scope of the invention, it is to be set forth in the following claims. Therefore, it will be understood by those of ordinary skill in the art that various changes in form and details may be made therein without departing from the spirit and scope of the present invention as defined by the following claims."
    ],
    "citations": [
        "3049666",
        "4267503",
        "6069485",
        "6426671",
        "6560567"
    ],
    "us_classification": "324769",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "01",
            "subclass": "R",
            "main_group": "31",
            "subgroup": "26"
        }
    ]
}