{
    "title": "Combination utility and sporting knife",
    "abstract": "A combination utility and sporting knife includes a longitudinal knife handle, a utility blade carrier disposed within the handle and linearly movable within the handle, a utility blade carried by the blade carrier, a manual movable blade moving member operatively connected with the blade carrier, and a pivotally movable blade pivotally connected to the handle. The utility blade and the pivotally movable blade are extendable from opposite ends of the handle. The utility blade edge and the pivotally movable blade edge both are exposed towards the bottom portion of the handle when the pivotally movable blade and the utility blade are in operative positions thereof so that the bottom and top portions of the handle retain their relative bottom and top orientations for use of either the utility blade or the pivotally moveable blade.",
    "inventors": [
        "Van Deursen",
        "Rowlay",
        "Roberts"
    ],
    "document_number": "07296354",
    "publication_date": "20071120",
    "assignees": [
        "The Stanley Works"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A combination utility and sporting knife, comprising:",
            "components": [
                {
                    "component": "a longitudinal knife handle;",
                    "subcomponents": []
                },
                {
                    "component": "a utility blade movably carried by said handle, said utility blade having a linear cutting edge and being movable between 1) a storage position wherein said cutting edge thereof is confined within said handle, and 2) an operative position wherein said cutting edge thereof is exposed;",
                    "subcomponents": []
                },
                {
                    "component": "a pivotally movable sporting blade pivotally movable with respect to said handle, said pivotally movable sporting blade comprising a cutting edge and an opposite dull edge, said cutting edge having a convex forward portion, said convex forward portion of said cutting edge intersecting with said dull edge to form a forward point of said pivotally movable sporting blade, said pivotally movable sporting blade being movable between a storage position wherein said cutting edge thereof is concealed by said handle and an operative position wherein said cutting edge thereof is exposed; and",
                    "subcomponents": []
                },
                {
                    "component": "a blade interlock constructed to prevent movement of one of the utility blade and the pivotally movable sporting blade from the storage position thereof when the other of the utility blade and the pivotally movable sporting blade is in the operative position thereof.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The combination according to claim 1 , wherein the utility blade has a trapezoidal shape, a longest side of which comprises the linear cutting edge.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The combination according to claim 1 , wherein the utility blade is releasably carried by the handle.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The combination according to claim 1 , wherein the utility blade is slidable with respect to the handle.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A combination utility and sporting knife, comprising:",
            "components": [
                {
                    "component": "a knife handle;",
                    "subcomponents": []
                },
                {
                    "component": "a utility blade carrier movably mounted with respect to said handle;",
                    "subcomponents": []
                },
                {
                    "component": "a utility blade releasably carried by said blade carrier, said blade carrier being movable between 1) a first position wherein said utility blade carried thereby is positioned so that said utility blade is in a storage position wherein said cutting edge thereof is concealed by said handle, and 2) a second position wherein said utility blade carried thereby is positioned so that said utility blade is in an operative position wherein said cutting edge thereof is exposed;",
                    "subcomponents": []
                },
                {
                    "component": "a pivotally movable sporting blade pivotally movable with respect to said handle, said pivotally movable sporting blade comprising a cutting edge and an opposite dull edge, said cutting edge having a convex forward portion, said convex forward portion of said cutting edge intersecting with said dull edge to form a forward point of said pivotally movable sporting blade,",
                    "subcomponents": []
                },
                {
                    "component": "said pivotally movable sporting blade being movable between a storage position wherein said cutting edge thereof is concealed by said handle and an operative position wherein said cutting edge is exposed; and",
                    "subcomponents": []
                },
                {
                    "component": "a blade interlock constructed to prevent movement of one of the utility blade and the pivotally movable sporting blade from the storage position thereof when the other of the utility blade and the pivotally movable sporting blade is in the operative position thereof.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The combination according to claim 5 , wherein utility blade carrier is linearly movable within said handle.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The combination according to claim 5 , wherein said utility blade has a trapezoidal shape, a longest side of which comprises a linear cutting edge.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The combination according to claim 6 , further comprising a manually movable blade moving member operatively connected with said blade carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The combination according to claim 8 , wherein said utility blade and said pivotally movable sporting blade are extendable from opposite ends of said handle.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The combination according to claim 9 , wherein the utility blade carrier, the utility blade, and the manually movable blade moving member constitute a utility blade assembly, and wherein the blade interlock is constructed to interact with the utility blade assembly and pivotally movable sporting blade to prevent movement of one of the utility blade and the pivotally movable sporting blade from the storage position thereof when the other of the utility blade and the pivotally movable sporting blade is in the operative position thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The combination according to claim 10 , wherein the utility blade is releasably carried by the blade carrier.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The combination according to claim 5 , wherein the blade interlock includes an elongated pivoting structure that interacts with a rearwardly extending actuating slide provided on the blade carrier, the actuating slide of the blade carrier being configured and positioned such that (a) when the pivotally movable sporting blade is in the storage position, movement of the utility blade from a storage position to an operative position pivotally moves one end of the pivoting structure into a hole provided in the pivotally movable sporting blade to thereby prevent movement of the pivotally movable sporting blade from the storage position thereof and (b) when the pivotally movable sporting blade is in the operative position, movement of the utility blade from a storage position to an operative position is prevented due to engagement of one end of the pivoting structure with an outer surface of the pivotally movable sporting blade.",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation of U.S. application Ser. No. 11/168,451, titled “COMBINATION UTILITY AND SPORTING KNIFE,” filed Jun. 29, 2005, which is a continuation of U.S. application Ser. No. 09/984,865, titled “COMBINATION UTILITY AND SPORTING KNIFE,” filed Oct. 31, 2001 and issued Oct. 25, 2005 as U.S. Pat. No. 6,957,491, the contents of both of which are incorporated herein in their entirety.",
        "The present invention relates generally to cutting devices.",
        "Cutting devices, such as utility blades and knives, are typically manufactured, and used separately. However, this may become inconvenient to those who frequently use these devices.",
        "It has been proposed in U.S. Pat. No. 4,890,387 to provide a drywall utility knife that includes a utility blade at one end of the knife and a serrated drywall saw at the opposite end of the knife. As a result, the same utility knife may be conveniently used to both cut and saw drywall.",
        "However, this patent discloses an arrangement in which the cutting edge of the utility blade is exposed towards a bottom portion of the knife and the cutting edge of the saw is exposed towards an upper portion of the knife. The arrangement lacks a uniform handle orientation when using either the utility blade or the saw. In addition, the saw is intended for a relatively specific purpose and lacks versatility. There is a need for an ergonomic utility knife that can also be used for multi-purpose cutting operations.",
        "It is thus an object of the present invention to address the need noted above. In accordance with the principles of the present invention, this objective is achieved by providing a combination utility and sporting knife. The combination includes a longitudinal knife handle, a utility blade carrier, a utility blade, a manual movable blade moving member, and a pivotally movable blade. The utility blade carrier is disposed within the handle and linearly movable within the handle. The utility blade is carried by the blade carrier. The utility blade has a trapezoidal shape, a longest side of which comprises a linear cutting edge. The manual movable blade moving member is operatively connected with the blade carrier and is disposed towards an upper portion of the handle. The blade moving member is linearly movable between 1) a first position wherein the utility blade carrier and the blade carried thereby are positioned so that the utility blade is in a storage position wherein the cutting edge thereof is confined within the handle, and 2) an second position wherein the utility blade carrier and the blade carried thereby are positioned so that the utility blade is in an operative position wherein the cutting edge thereof extends outwardly from the handle. The pivotally movable blade is pivotally connected to the handle. The pivotally movable blade includes a cutting edge and an opposite dull edge. The cutting edge has a convex forward portion, the convex forward portion of the cutting edge intersecting with the dull edge to form a forward point of the pivotally movable blade. The pivotally movable blade is movable between a storage position wherein the cutting edge thereof is concealed by the handle and an operative position wherein the cutting edge is exposed. The utility blade and the pivotally movable blade are extendable from opposite ends of the handle. The utility blade edge and the pivotally movable blade edge both are exposed towards the bottom portion of the handle when the pivotally movable blade and the utility blade are in the operative positions thereof so that the bottom and top portions of the handle retain their relative bottom and top orientations for use of either the utility blade or the pivotally moveable blade.",
        "These and other objects, features, and advantages of this invention will become apparent from the following detailed description when taken into conjunction with the accompanying drawings, which are a part of this disclosure and which illustrate, by way of example, the principles of this invention.",
        "The accompanying drawings facilitate an understanding of the various embodiments of this invention. In such drawings:",
        "FIG. 1 is a perspective view of an embodiment of the combination utility and sporting knife constructed according to the principles of the present invention;",
        "FIG. 2 is a bottom view of the combination utility and sporting knife shown in FIG. 1;",
        "FIG. 3 is a side view of the combination utility and sporting knife shown in FIG. 1;",
        "FIG. 4 is a top view of the first and second handle halves and the interior components thereof;",
        "FIG. 5 is a top view of the second handle half with the pivotally movable blade shown in phantom in order to illustrate the movable blade locking mechanism;",
        "FIG. 6 is a top view of the second handle half illustrating the pivotally movable blade locked in the storage position;",
        "FIG. 7 is a top view of the second handle half illustrating the pivotally movable blade locked in the operative position;",
        "FIG. 8 is an enlarged bottom view of the combination utility and sporting knife shown in FIG. 1 illustrating the thumb button;",
        "FIG. 9 is an enlarged bottom view of the combination utility and sporting knife shown in FIG. 1 illustrating a depressed thumb button which unlocks the pivotally movable blade;",
        "FIG. 10 is a top view of the first handle half illustrating the pivotally movable blade and the utility blade in the storage position, the utility blade and the pivotally movable blade shown in phantom in order to illustrate the blade interlocking mechanism;",
        "FIG. 11 is a cross-section taken along line 11-11 of FIG. 10;",
        "FIG. 12 is a top view of the first handle half illustrating the pivotally movable blade in the storage position and the utility blade in the operative position, the utility blade and the pivotally movable blade shown in phantom in order to illustrate the blade interlocking mechanism;",
        "FIG. 13 is a cross-section taken along line 13-13 of FIG. 12;",
        "FIG. 14 is a top view of the first handle half illustrating the pivotally movable blade in the operative position and the utility blade in the storage position, the utility blade and the pivotally movable blade shown in phantom in order to illustrate the blade interlocking mechanism;",
        "FIG. 15 is a cross-section taken along line 15-15 of FIG. 14;",
        "FIG. 16 is a side view of the combination utility and sporting knife illustrating another embodiment of the blade interlocking mechanism, the pivotally movable blade and the utility blade in the storage position;",
        "FIG. 17 is a side view of the combination utility and sporting knife shown in FIG. 16 with the pivotally movable blade in the operative position and the utility blade in the storage position; and",
        "FIG. 18 is a side view of the combination utility and sporting knife shown in FIG. 16 with the pivotally movable blade in the storage position and the utility blade in the operative position.",
        "Referring now more particularly to the drawings, there is shown therein a combination utility and sporting knife 10 in accordance with one illustrated embodiment of the present invention. The main components of the combination 10 are a longitudinal knife handle 12, a utility blade carrier 14, a utility blade 16 carried by the blade carrier 14, a manual movable blade moving member 18 operatively connected with the blade carrier 14, and a pivotally movable blade 20. The utility blade carrier 14, the utility blade 16, and the manual movable blade moving member 18 may be referred to as a utility blade assembly 21.",
        "As shown in FIGS. 1-4, the handle 12 is substantially hollow and includes first and second mating handle halves 22, 24 with the blade carrier 14 and the movable blade 20 movably mounted between the handle halves 22, 24. A movable blade locking mechanism 26, a blade interlocking mechanism 28, and a utility blade replacement mechanism 30 is also mounted between the handle halves 22, 24, as will be further discussed.",
        "The first and second handle halves 22, 24 have complementary configurations and cooperate to provide a handle 12 having a forward utility blade retaining portion 32, a rearward movable blade retaining portion 34, and an intermediate gripping portion 36. The exterior surface of the handle 12 is suitably contoured to assist the user in holding onto the gripping portion 36 of the handle 12 and to facilitate employment of both the utility blade 16 and the movable blade 20 to perform various cutting tasks. Specifically, the top portion 35 of the handle 12 is contoured or arranged, preferably slightly convex, to more comfortably accommodate the palm of the user's hand. Likewise, the bottom portion 37 of the handle 12 is contoured or arranged to more comfortably accommodate the fingers of the user rather than the palm. As a result, the bottom and top portions 35, 37 of the handle 12 retain their relative bottom and top orientations for use of either the utility blade 16 or the moveable blade 20 during cutting tasks.",
        "The gripping portion 36 may include an elastomeric material thereon to further facilitate gripping.",
        "The utility blade retaining portions 32 of the first and second handle halves 22, 24 cooperate to form a nose portion 33 from which the utility blade 16 projects outwardly and forwardly to present a cutting edge 38 thereof. Further, the utility blade retaining portion 32 of the first handle half 22 provides a first cooperating interlocking structure 40 and the utility blade retaining portion 32 of the second handle half 24 provides a second cooperating interlocking structure 42. The first and second cooperating interlocking structures 40, 42 are configured to interlock with one another to prevent relative pivotal movement between the first and second handle halves 22, 24 with respect to one another.",
        "The movable blade retaining portion 34 of the first handle half 22 includes a threaded boss 44 that extends upwardly from an interior surface thereof. A fastener 46 extends through the movable blade retaining portion 34 of the second handle half 24, through a journal structure 48 that pivotally mounts the movable blade 20, and into the threaded boss 44 to fixedly secure the first and second handle halves 22, 24 to one another in the cooperating interlocking relation.",
        "The first handle half 22 also includes a hollow boss 50 on the interior surface that receives a protrusion 52 provided on the interior surface of the second handle half 24 to prevent relative pivotal movement between the first and second handle halves 22, 24 with respect to one another.",
        "Further, the handle 12 includes a cutout 54 in order to receive a thumb button 56 provided on the movable blade 20.",
        "It is contemplated that the first and second handle halves 22, 24 are pivotally mounted to one another such that the first and second handle halves 22, 24 are pivotally movable relative to one another in a swivel fashion between open and closed positions.",
        "Referring now more particularly to FIG. 4, the utility blade carrier 14 is disposed within the handle 12 and linearly movable within the handle 12. The utility blade 16 is carried by the blade carrier 14. Specifically, the utility blade 16 is mounted in the blade carrier 14 to project outwardly from the nose portion 33 of the handle 12 to present the linear cutting edge 38.",
        "The utility blade 16 has a trapezoidal shape, a longest side of which includes the linear cutting edge 38. The shorter side of the utility blade 16 includes at least one locating notch 58a, 58bconfigured to mate with a complementary blade engaging protrusion 60 provided on the blade carrier 14. In the illustrated embodiment, the utility blade 16 has first and second notches 58a, 58b with the second notch 58b mating with the protrusion 60.",
        "Specifically, the blade carrier 14 is in the form of an interval sheet metal slide that includes forward and rearward ends 62, 64 and upper and lower ends 66, 68. A web portion 70 extends between the upper and lower ends 66, 68. The web portion 70 has a planar face for abutting against the planar side face of the utility blade 16 to provide lateral retention and support for the utility blade 16. Upper and lower blade retaining flanges 72, 74 are positioned at the upper and lower ends 66, 68 of the blade carrier 14, respectively. The upper and lower flanges 72, 24 extend outwardly from the web portion 70 to provide vertical retention and support for the utility blade 16. The blade engaging protrusion 60 is positioned slightly below the upper flanges 72 and extends outwardly from the web portion 70. As illustrated in FIG. 4, the blade engaging protrusion 60 is received within the second notch 58b of the utility blade 16 to retain the utility blade 16 in a fixed longitudinal position relative to the blade carrier 14. The blade carrier 14 includes a stop member 76 on the web portion 70 configured to abut the angular edge of the utility blade 16 to facilitate placement of the utility blade 16 in the blade carrier 14. The blade carrier 14 also includes a rearwardly extending actuating slide 78 that interacts with the blade interlocking mechanism 28, as will be further discussed.",
        "The blade carrier 14 is slidably positioned on upper and lower guide structures 80, 82 provided in the first handle half 22.",
        "The manual movable blade moving member 18 is operatively connected with the blade carrier 14 and disposed towards an upper portion of the handle 12. The blade moving member 18 is linearly movable between a first position (as shown in FIGS. 4 and 10) and a second position (as shown in FIG. 12). In the first position, the utility blade carrier 14 and the utility blade 16 carried thereby are positioned so that the utility blade 16 is in a storage position wherein the cutting edge 38 thereof is confined within the handle 12. In the second position, the utility blade carrier 14 and the utility blade 16 carried thereby are positioned so that the utility blade 16 is in an operative position wherein the cutting edge 38 thereof extends outwardly from the handle 12.",
        "In the illustrated embodiment, the blade moving member 18 includes a resilient button arm 84 integrally formed at the rearward upper end of the blade carrier 14 so as to extend rearwardly and slightly upwardly therefrom. The button arm 84 has a thumb button 86 mounted thereto that extends upwardly therefrom and through a longitudinal slot 88 provided at the top of the handle 12. The button arm 84 further includes an outwardly projecting latching tab 90 positioned at the rearward end thereof. The latching tab 90 is biased upwardly by the resilience of the button arm 84 so as to be received into any one of four notches 92 provided in the top interior of the first handle half 22 in a conventional manner. The notches 92 in the top interior of the first handle half 22 are longitudinally spaced to define multiple extended second positions (or multiple operative positions of the utility blade 16) and a single confined first position (or storage position of the utility blade 16). The first operative position of the utility blade 16 generally exposes the pointed tip of the utility blade 16 for purposes of scoring. The remaining operative positions of the utility blade 16 are generally cutting positions. The blade carrier 14 may be manually shifted in a longitudinal direction by pressing the thumb button 86 to unlatch the latching tab 90 from one of the respective notches 92 and thereafter longitudinally moving the utility blade 16 with respect to the handle halves 22, 24. The thumb button 86 may have a series of grooves formed therein for improving gripping.",
        "The pivotally movable blade 20, also referred to as a sporting knife, is pivotally connected to the handle 12. Specifically, the movable blade 20 includes an opening 94 that receives the journal structure 48 therethrough. The journal structure 48 includes a threaded opening that receives the fastener 46 therethrough when the handle halves 22, 24 are fixedly secured to one another. As a result, the movable blade 20 is pivotable relative to the handle 12 about the journal structure 48. Washers are provided on opposing sides of the movable blade 20.",
        "The pivotally movable blade 20 includes a cutting edge 96 and an opposite dull edge 98. The cutting edge 96 has a convex forward portion 100. The convex forward portion 100 of the cutting edge 96 intersects with the dull edge 98 to form a forward point 102 of the pivotally movable blade 20. The movable blade 20 may include a plurality of serrations on the cutting edge 96.",
        "The pivotally movable blade 20 is movable between a storage position (as shown in FIGS. 4, 5, and 6) and an operative position (as shown in FIGS. 7 and 14). In the storage position, the cutting edge 96 of the movable blade 20 is concealed by the handle 12. In the operative position, the cutting edge 96 is exposed.",
        "The movable blade 20 further includes a hole 104 that interacts with the blade interlocking mechanism 28 and a slot 106 that cooperates with the blade locking miechanism 26, as will be further discussed.",
        "The utility blade 16 and the movable blade 20 are extendable from opposite ends of the handle 12. As shown in FIGS. 12 and 14, the utility blade cutting edge 38 and the pivotally movable blade cutting edge 96 are both exposed towards the bottom portion of the handle 12 when the movable blade 20 and the utility blade 16 are in the operative positions thereof so that the bottom and top portions 35, 37 of the handle 12 retain their relative bottom and top orientations for use of either the utility blade 16 or the moveable blade 20.",
        "The blade interlocking mechanism 28 is provided so that only one of the utility blade 16 and the movable blade 20 may be moved to the operative position at a time. In other words, the blade interlocking mechanism 28 prevents movement of one of the utility blade 16 and the pivotally movable blade 20 from the storage position thereof when the other of the utility blade 16 and the pivotally movable blade 20 is in the operative position thereof.",
        "Referring now more particularly to FIGS. 10-15, the blade interlocking mechanism 28 includes an elongated pivoting structure 108. The elongated pivoting structure 108 is a piece of sheet metal that is folded or otherwise deformed in a conventional manner to provide a central wall 110 and opposing end walls 112, 114 that are perpendicular to the central wall 110. One end wall 112 includes an elongated extension 116 and the opposite end wall 114 includes a T-shaped extension 118. A substantially rigid stiffening member 120 is secured to the central wall 110 between the end walls 112, 114. However, the pivoting structure 108 may be constructed as a single unitary body. Further, a pair of pivoting arms 122 extend outwardly from opposing sides of the central wall 110. As illustrated, each of the pivoting arms 122 has a rounded protuberance 124 thereon.",
        "The first handle half 22 includes a pair of spaced apart retaining flanges on an interior surface thereof. As illustrated, the pivoting structure 108 is mounted in the first handle half 22 with the pivoting arms 122 positioned within the retaining flanges to thereby retain the pivoting structure 108 in a fixed longitudinal position relative to the first handle half 22. A pair of threaded protrusions are provided adjacent the retaining flanges. A cover member 126 is secured to the threaded protrusions by fasteners thereby securing the pivoting structure 108 within the first handle half 22.",
        "Sufficient space is provided between the cover member 126 and the pivoting structure 108 such that the pivoting structure 108 may pivot in a “see-saw” manner about the rounded protuberances 124 provided on the pivoting arms 122. Thus, when one end wall 112 or 114 moves upwardly, the opposite end wall 114 or 112 moves downwardly.",
        "The rearwardly extending actuating slide 78 provided on the blade carrier 14 includes a longitudinally extending slot 128. Further, the actuating slide 78 is bent such that a distal end of the slide 78 extends in a different plane than a proximal end of the slide 78 adjacent the web portion 70. Thus, the slide 78 includes a first portion 130 in a first plane, a second portion 132 in a second plane, and a ramped portion 134 that interconnects the first and second portions 130, 132.",
        "The pivoting structure 108 is oriented such that the T-shaped extension 118 of the pivoting structure 108 is slidably mounted within the slot 128 in the actuating slide 78. The distal end of the slide 78 extends between the cover member 126 and the pivoting structure 108. As shown in FIGS. 10 and 11, when the utility blade 16 is in the storage position, the slide 78 maintains the T-shaped extension 118 at a position in the first portion 130 thereof. At this position, the T-shaped extension 118 and the elongated extension 116 are generally equally upwardly spaced from an interior surface of the first handle half 22.",
        "As shown in FIGS. 12 and 13, as the utility blade 16 is moved in the longitudinal direction from the storage position to an operative position (with the movable blade 20 in the storage position), the slide 78 moves relative to the T-shaped extension 118. Due to the shape of the slide 78, continued movement of the blade carrier 14 and the utility blade 16 thereof causes the T-shaped extension 118 to ride downwardly along the ramped portion 134 and continue along the second portion 132 of the slide 78 in the second plane. This tends to cam the opposite end wall 112 with the elongated extension 116 upwardly and the elongated extension 116 moves into the hole 104 in the movable blade 20. As a result, the movable blade 20 cannot be pivoted out of handle 12. Thus, the pivoting structure 108 prevents the movable blade 20 from being pivoted out of the handle 12 when the utility blade 16 is moved to an operative position. The utility blade 16 must be moved to the storage position in order to cam the end wall 112 of the pivoting structure 108 downwardly. This will remove the elongated extension 116 from the hole 104 in the movable blade 20 to thereby permit pivotal movement of the movable blade 20.",
        "Alternatively, as shown in FIGS. 14 and 15, when the movable blade 20 is in the operative position (with the utility blade 16 in the storage position), as the utility blade 16 is moved in the longitudinal direction to an operative position, the slide 78 causes the T-shaped extension 118 to ride slightly downwardly along the ramped portion 134, which tends to cam the end wall 112 with the elongated extension 116 upwardly. As the elongated extension 116 moves upwardly, it engages an outer surface of the movable blade 20. As a result, the T-shaped extension 118 at the opposite end wall 114 is prevented from moving downwardly and cannot continue moving down the ramped portion 134 to the second portion 132. Thus, the blade carrier 14 and the utility blade 16 thereof is prevented from further movement in the longitudinal direction and the hence into an operative position. The movable blade 20 must be moved to the storage position in order to permit the pivoting structure 108 to cam further upwardly with the elongated extension 116 moving into the hole 104 in the movable blade 20, thereby permitting the blade carrier 14 and the utility blade 16 thereof to move in the longitudinal direction.",
        "Thus, the blade interlocking mechanism 28 locks the movable blade 20 in the storage position when the blade carrier 14 and utility blade 16 thereof are moved to an operative position. Likewise, the blade interlocking mechanism 28 locks the blade carrier 14 and utility blade 16 thereof in the storage position when the movable blade 20 is moved to an operative position.",
        "Although the above-described blade interlocking mechanism 28 is preferred, it is contemplated that other mechanisms may be used so that only one of the utility blade 16 and the movable blade 20 may be moved to the operative position at a time.",
        "For example, FIGS. 16-18 illustrate a mechanism wherein a blade carrier 214 has an extension 222 with a flanged end 224 that is received within a slot 226 provided in a movable blade 220. When the movable blade 220 is pivoted to the operative position (as shown in FIG. 17), the end 224 of the extension 222 rides along an arcuate portion of the slot 226. The path of the slot 226 is configured such that, when the movable blade 220 is in the operative position, the blade carrier 214 and the utility blade 216 thereof cannot move longitudinally from the storage position to an operative position. Likewise, when the blade carrier 214 and utility blade 216 thereof is moved to an operative position (as shown in FIG. 18), the end 224 of the extension 222 rides along an elongated portion of the slot 226. Hence, the movable blade 220 cannot be pivotally moved from the storage position to an operative position.",
        "Referring now more particularly to FIGS. 5-7, the movable blade locking mechanism 26 functions to lock the movable blade 20 in the storage and operative positions. The locking mechanism 26 includes a flat spring 136 secured to the second handle half 24. The flat spring 136 has a locking arm 138 that is biased outwardly from the second handle half 24. The locking arm 138 has a locking tab 140 at the distal end thereof. The locking arm 138 also includes a series of serrations 142 that are accessible through the handle 12.",
        "As shown in FIGS. 5 and 6, when the movable blade 20 is in the storage position, the locking arm 138 is biased into engagement with the moveable blade 20 such that the locking tab 140 is received within the slot 106 provided in the movable blade 20. This locks the movable blade 20 in the storage position and prevents pivotable movement of the movable blade 20 relative to the handle 12. In order to pivot the movable blade 20 out of the handle 12, the locking arm 138 must be pivoted away from the movable blade 20 to remove the locking tab 140 from the slot 106.",
        "Once the movable blade 20 is moved out of the storage position and towards the operative position, the locking arm 138 may be released which causes the locking tab 140 to engage the exterior surface of the movable blade 20 due to the biasing of the locking arm 138. As the movable blade 20 is pivoted towards the operative position, the locking tab 140 rides along the exterior surface of the movable blade 20. As shown in FIG. 7, when the movable blade 20 reaches the operative position, the locking tab 140 drops to a position adjacent the side edge of the movable blade 20. This locks the movable blade 20 in the operative position. In order to pivot the movable blade 20 into the storage position, the locking arm 138 must be pivoted away from the movable blade 20 to move the locking tab 140 to a position outwardly from the movable blade 20. Thus, the movable blade 20 may be retracted back into the housing 12 into the storage position.",
        "Referring now more particularly to FIGS. 2, 8, and 9, the movable blade 20 includes the thumb button 56. A biasing member 144, such as a spring, biases the thumb button 56 outwardly from the movable blade 20. The thumb button 56 is biased such that, when the movable blade 20 is in the storage position (as shown in FIGS. 2 and 8), the one end 146 of the thumb button 56 adjacent the locking arm 138 is positioned to allow the locking tab 140 of the locking arm 138 to be received within the slot 106 of the movable blade 20. When the thumb button 56 is depressed against the bias of the biasing member 44 (as shown in FIG. 9), the one end 146 engages the locking arm 138 and pivots the locking tab 140 out of the slot 106 to unlock the movable blade 20 and permit pivotable movement of the movable blade 20 out of the handle 12. The thumb button 56 is positioned to enable the user to pivot the movable blade 20 out of the handle 12 with his/her thumb.",
        "Although the above-described movable blade locking mechanism 26 is preferred, it is contemplated that other mechanisms may be used to lock the movable blade 20 in the storage and operative positions.",
        "The utility blade replacement mechanism 30 enables a user to remove and replace utility blades 16 from the blade carrier 14 without uncoupling the handle halves 22, 24. As shown in FIGS. 3 and 4, the replacement mechanism 30 includes an elongated arm 148 having one end secured within the utility blade retaining portion 32 of the second handle half 24 and the opposite free end having a knob 150 that extends through an opening in the second handle half 24. When the blade carrier 14 and the utility blade thereof is the fully extended operative position, the knob 150 may be pressed by the user to pivot the opposite end of the arm 148 into one of the upper blade retaining flanges 72 of the blade carrier 14. This moves the blade retaining flange 72 as well the blade engaging protrusion 60 in a direction away from the utility blade 16. As a result, the blade engaging protrusion 60 is not located within the second notch 58b in the utility blade 16, and the utility blade 16 may be removed from the blade carrier 14. Further details of the replacement mechanism 30 are provided in U.S. Pat. No. 6,192,589, the entirety of which is hereby incorporated by reference.",
        "It can thus be appreciated that the objectives of the present invention have been fully and effectively accomplished. The foregoing specific embodiments have been provided to illustrate the structural and functional principles of the present invention and is not intended to be limiting. To the contrary, the present invention is intended to encompass all modifications, alterations, and substitutions within the spirit and scope of the appended claims."
    ],
    "citations": [
        "166099",
        "521555",
        "988068",
        "1194486",
        "1388014",
        "1828121",
        "2575652",
        "2906021",
        "2980996",
        "3061927",
        "3596300",
        "3660896",
        "D236579",
        "4078272",
        "4265017",
        "4302877",
        "4461081",
        "4491261",
        "4517741",
        "4604805",
        "4635309",
        "4660284",
        "4748743",
        "4776094",
        "4783867",
        "4813132",
        "4817284",
        "4823463",
        "4835865",
        "4890387",
        "4939839",
        "5023996",
        "D324899",
        "5093994",
        "5230152",
        "5283954",
        "5293690",
        "5301428",
        "5337481",
        "5511262",
        "5511311",
        "5513405",
        "5528834",
        "D371288",
        "5572793",
        "D378982",
        "5661908",
        "D384871",
        "D386381",
        "5689890",
        "5778536",
        "5806189",
        "5906049",
        "5940970",
        "D414989",
        "5960544",
        "5987751",
        "6026575",
        "6088861",
        "6125543",
        "6148522",
        "6161290",
        "D436014",
        "6170104",
        "D437767",
        "6192589",
        "D438443",
        "6233769",
        "D446689",
        "6354007",
        "6397476",
        "6467173",
        "6481034",
        "D473778",
        "6701626",
        "6715209",
        "6742261",
        "7003833",
        "7124510",
        "2002/0157260",
        "2007/0056170",
        "284158"
    ],
    "us_classification": "30142",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "26",
            "subclass": "B",
            "main_group": "1",
            "subgroup": "00"
        }
    ]
}