{
    "title": "Erectable rocking chair",
    "abstract": "An erectable rocking chair is described which can be packed together in close and parallel relationship for assembly into a rocking chair with reinforced joints attaching seat to front and rear uprights.",
    "inventors": [
        "Branch, III"
    ],
    "document_number": "07296859",
    "publication_date": "20071120",
    "assignees": [
        "Hatteras Hammocks, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An erectable rocking chair comprising:",
            "components": [
                {
                    "component": "(a) a front upright frame and a taller rear upright frame;",
                    "subcomponents": []
                },
                {
                    "component": "(b) runners attachable to bottom ends of said upright frames; and",
                    "subcomponents": []
                },
                {
                    "component": "(c) a seat attachable to and extendable between said upright frames, said seat providing a joint with said upright frames and comprising a rectangular tenon formed on the end of a side frame and insertable into a corresponding rectangular mortise on a front or rear upright wherein a space is provided between said tenon and an end of the adjacent front or rear frame, said space being slightly wider than that portion of the upright on the inner side of said mortise, said inner side portion of the upright being wedged into said space when said tenon is inserted into said mortise, said joint being horizontally and vertically reinforced.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The erectable rocking chair of claim 1 , wherein said seat includes a seat frame comprised of a front frame, a rear frame, a left side frame and a right side frame.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The erectable rocking chair of claim 1 which includes left and right arms attachable to and extending between said uprights.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The erectable rocking chair of claim 1 which includes a rail attached to and extending between said rear uprights toward their bottom ends and a rail attached to and extending between said front uprights toward their bottom ends.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The erectable rocking chair of claim 4 which includes side rails, attachable to and extending between said front uprights and said rear uprights.",
            "components": []
        }
    ],
    "description": [
        "NOT APPLICABLE",
        "NOT APPLICABLE",
        "NOT APPLICABLE",
        "(1) Field of the Invention",
        "This invention is directed to a rocking chair that can be shipped as component parts and readily assembled.",
        "Rocking chairs are an enduringly popular item of furniture. But due to their characteristically high backs, and the extended runners that form their rocking base, they are unusually bulky chairs, which take up much space. This is a particular problem when they are packed for shipping. The shipping container must be quite large to contain the chair, and quite sturdy because all the chair's extended parts are relatively fragile.",
        "It would be a great advantage for the manufacturers of rocking chairs to be able to ship in smaller containers, and have the chair parts packed so as to be less fragile. This can be accomplished by shipping the rocking chair in the form of unassembled components.",
        "It is accordingly, an object of the present invention, to provide a rocking chair which is comprised of specific components, which can be packed together in close and parallel relationship, and yet readily assembled into a sturdy chair with a minimal number of steps and no particular skills. This is facilitated by use of unique corner joints which attach the seat to front and rear uprights.",
        "(2) Description of Related Art",
        "Applicant is aware of no prior art directly relevant to the present invention.",
        "In accordance with the present invention, an erectable rocking chair in the form of components which can be packed together in close and parallel relationship and yet readily assembled into a sturdy chair with horizontally and vertically reinforced joints attaching the seat to the front and rear uprights.",
        "FIG. 1 is a front perspective view of the various components of a rocking chair.",
        "FIG. 2 is a side perspective view of the chair's back with side rails being inserted",
        "FIG. 3 is a side perspective view of the chair's back with the seat frame being inserted. To better illustrate the seat frame, woven seat bottom is not shown.",
        "FIG. 4 is the same view with the front frame being applied",
        "FIG. 4a is an enlarged view of a portion of FIG. 4, showing greater detail of the corner joint attaching seat frame to the rear frame",
        "FIG. 5 is the same view as FIG. 4, with one of the arms being applied",
        "FIG. 6 is a side perspective view of the assembled chair being inserted into the runners",
        "FIG. 7 is a side perspective view of the fully assembled rocking chair",
        "Reference will now be made to the present preferred embodiment of the invention.",
        "FIG. 1 illustrates a rocking chair disassembled into its various components.",
        "The front frame 11 comprises a left upright 12a, and right upright 12b. A front rail 15, extends between them, near their bottom ends. On top of uprights 12a and 12b, are formed tenons 13a and 13b. On the bottom of upright 12a and 12b, are formed tenons 14a and 14b.",
        "The rear frame 16 comprises a left upright 17a and right upright 17b. A head board 18, extends between uprights 17a and 17b near their top ends. A woven back support 19, extends between uprights 17a and 17b, below headboard 18. A rail 20, extends between uprights 17a and 17b, near their bottom ends. The lower halves of uprights 17a and 17b, have upper mortises 21a and 21b, middle mortises 22a and 22b, and lower mortises 23a and 23b. Mortises 22a and 22b are rectangular in shape to accommodate a rectangular tenon.",
        "Seat 24, is formed on a rectangular frame comprised of front seat frame 25, rear seat frame 26, left side seat frame 27 and right side seat frame 28. Tenon 29b is formed on the front end of frame 28, and tenon 30b is formed on its rear end. Tenon 29 is formed on the front end of frame 27, and tenon 30a is formed on its rear end. A woven seat bottom 45 extends between and is supported by front seat frame 25 and rear seat frame 26.",
        "A left rail 41 is illustrated; and a right rail 42. Rail 41 has a tenon 43a on its front end and tenon 44a on its rear end. Rail 42 has tenon 43b on its front end and tenon 44b on its rear end.",
        "Left runner 35 is essentially identical to right runner 36. Each has a front mortise 37a and 37b, as well as a rear mortise 38a and 38b.",
        "Left arm 31 is essentially identical to right arm 32. Each has a tenon 33a and 33b formed on its rear end. Each has mortise 34a and 34b formed toward its front end.",
        "It will be appreciated that FIG. 1 illustrates all of the individual separate components of a rocking chair. These components thus separated can be contained and packed flat in a relatively compact container, less than a quarter the size of a container required for an assembled rocking chair.",
        "The subsequent FIG. 2 through FIG. 6, illustrate the order and method by which the components are assembled to form the rocking chair illustrated in FIG. 7. All joints are glued.",
        "FIG. 2 shows the insertion of tenons 43a and 43b, into mortises 23a and 23b.",
        "FIG. 3 shows the attachment of the seat 24 to the rear frame 16. Tenons 30a and 30b are inserted into mortises 22a and 22b.",
        "FIG. 4 shows the attachment of front frame 11 to seat 24. For purposes of clearer understanding this view does not show the woven seat bottom 45, but only the seat frame (25, 26, 27 and 28). Mortises in the underside of uprights 12a and 12b, fit onto the tenons 29a and 29b as well as tenons 43a and 43b.",
        "FIG. 4a is an enlarged detail from FIG. 4 that illustrates a distinctive feature of the present invention. Mortise 22b is formed in upright 17b. Mortise 22b is a relatively large mortise, and rectangular in shape. Tenon 30b (on the rear end of side seat frame 28) is of a corresponding rectangular shape. The joint formed of tenant 30b and mortise 22b, is particularly stable. Due to its rectangular shape, the tenon 30b cannot rotate, as a round tenon could. There is a space between tenon 30b and the adjacent end of rear seat frame 26. That space is just slightly wider than the portion of upright 17b, which is adjacent to mortise 22b on the inner side of upright 17b. So when the tenon 30b is forced into mortise 22b, that portion of upright 17b is edged into the said space between tenon 30b and the adjacent end of rear seat frame 26. This wedging, combined with the joint formed by tenon 30b and mortise 22b creates a juncture between the seat 24 and rear frame 16 which is both horizontally and vertically reinforced at a point subject to considerable stress. Similar junctures are formed at the other three corners of seat 24, where it is attached to uprights 17a, 12a and 12b.",
        "FIG. 5 illustrates the attachment of arm 32 to uprights 12b and 17b. Tenon 33b is forced into mortise 21b, and mortise 34b is forced down onto tenon 13b. Arm 31 (not shown) is attached in the same way.",
        "FIG. 6 illustrates the attachment of runners 35 and 36. The tenons 39a and 39b are forced into mortises 38a and 38b of runners 35 and 36. The tenons 14a and 14b are forced into the mortises 37a and 37b of runners 35 and 36. The joint formed by insertion of tenons 39a and 39b into mortises 38 a and 38b, as well as the joint formed by the insertion of tenons 14a and 14b into mortises 37a and 37b, is further strengthened by insertion of a dowel (not illustrated in the drawings) through the runner and through the tenon.",
        "FIG. 7 illustrates the assembled rocking chair.",
        "It will be further apparent to those skilled in the art that various modifications and variations can be made in the present invention without departing from the spirit or scope thereof. Thus, it is intended that the present invention cover such modifications and variations which come within the scope of the appended claims and their equivalents."
    ],
    "citations": [
        "458808",
        "1257389",
        "5350218",
        "5407250"
    ],
    "us_classification": "29744023",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "47",
            "subclass": "C",
            "main_group": "7",
            "subgroup": "00"
        }
    ]
}