{
    "title": "Position sensing apparatus and method",
    "abstract": "There is described an inductive position sensor in which a signal generator applies a excitation signal to an excitation winding formed on a first member, the excitation winding being electromagnetically coupled to at least two resonant circuits formed on a second member which are spaced from each other along a measurement path. The excitation windings are shaped so that the electromagnetic coupling between the exciting winding and each of the resonators varies along the measurement path. In this way, by applying an excitation signal to the excitation winding, respective different signals are induced in the resonators which depend upon the relative position of the first and second members.",
    "inventors": [
        "Howard",
        "Sills",
        "Kreit",
        "James"
    ],
    "document_number": "07298137",
    "publication_date": "20071120",
    "assignees": [
        "TT Electronics Technology Limited"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A position sensor comprising:",
            "components": [
                {
                    "component": "first and second members which are movable relative to each other along a measurement path, the first member comprising an excitation winding and the second member comprising first and second resonators spaced apart along the measurement path;",
                    "subcomponents": []
                },
                {
                    "component": "an excitation signal generator operable to generate an excitation signal and to apply the excitation signal to the excitation winding to induce a first resonant signal in the first resonator and a second resonant signal in the second resonator; and",
                    "subcomponents": []
                },
                {
                    "component": "an analyser operable to analyse the first and second resonant signals to determine a value representative of the relative position along the measurement path of the first and second members, the analyser operable to measure a phase of a signal formed by a weighted combination of the first and second resonant signals;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the analyser is operable to generate a second signal at a frequency different from that of the excitation signal, and to mix the second signal with the signal formed by a weighted combination of the first and second resonant signals to generate a third signal having a frequency component equal to the difference between the frequency of the excitation signal and that of the second signal, and to determine the said value from the phase of the third signal;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the excitation winding and the first resonator have a first electromagnetic coupling which varies with the relative position along the measurement path of the first and second members in accordance with a first function, and the excitation winding and the second resonator have a second electromagnetic coupling which varies with said relative position in accordance with a second function different from the first function, and wherein the first resonator is operable to introduce a first phase shift into the first resonant signal and the second resonator is operable to introduce a second phase shift, which is different from the first phase shift by one quarter of a cycle, into the second resonant signal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The position sensor according to claim 1 , wherein the first and second members are relatively movable along a rectilinear direction.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The position sensor according to claim 1 , wherein the excitation winding is formed by a conductive track on a planar substrate.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The position sensor according to claim 3 , wherein the planar substrate is a printed circuit board.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The position sensor according to claim 3 , wherein the excitation winding effectively comprises a plurality of loops arranged so that current flowing through the excitation winding flows around at least one of the loops in an opposite direction to at least one other of the loops.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The position sensor according to claim 1 , wherein at least one of said first and second resonators comprises a passive resonant circuit.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The position sensor according to claim 1 , wherein at least one of said first and second resonators comprises an amplifier for amplifying the power of a signal induced in the resonator.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The position sensor according to claim 1 , wherein the first and second resonators comprise respective conductive tracks formed on a planar substrate.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The position sensor according to claim 8 , wherein the planar substrate is a printed circuit board.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The position sensor according to claim 1 , wherein the excitation signal comprises a sinusoidal component at 1 MHz.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The position sensor of claim 1 , where the first resonator exhibits resonance in response to a first range of frequencies about a first resonant frequency and the second resonator exhibits resonance in response to a second range of frequencies about a second resonant frequency which is different from the first resonant frequency, the first and second ranges overlapping,",
            "components": [
                {
                    "component": "wherein the excitation generator is operable to generate an excitation signal having a frequency component which induces the first and second resonant signals in the first and second resonators respectively.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application claims priority to International Patent Application No. PCT/GB2003/004504 filed on Oct. 16, 2003 that claims priority to Great Britain Patent Application No. 0224090.1 filed on Oct. 16, 2002 and claims priority to Great Britain Patent Application No. 0308257.5 filed on Apr. 9, 2003.",
        "This invention relates to a sensing apparatus and method, in particular for sensing the relative position of two members.",
        "Various forms of inductive sensor have been used to generate signals indicative of the position of two relatively movable members. For example, UK Patent Application No. 2374424 describes a position sensor in which two excitation windings and a sensor winding are formed on a first member, and a resonant circuit is formed on a second member. The two excitation windings are shaped so that the electromagnetic coupling between the excitation windings and the resonant circuit varies along a measurement path in accordance with a sine function and a cosine function respectively. By applying an in-phase oscillating signal and a quadrature oscillating signal (that is 90° out of phase with the in-phase oscillating signal) to the first and second excitation windings respectively, an oscillating signal is generated in the resonant circuit whose phase is dependent upon the relative position between the first and second members along the measurement path. The oscillating signal in the resonant circuit in turn induces an oscillating signal in the sensor winding whose phase is indicative of the relative position between the first and second members along the measurement path.",
        "A problem with the position sensor described in GB 2374424A is that the drive circuitry which applies the quadrature pair of excitation signals to the two excitation windings is relatively complex.",
        "According to an aspect of the invention, there is provided a position sensor in which a signal generator applies an excitation signal to an excitation winding formed on a first member, wherein the excitation winding is electromagnetically coupled to at least two resonant circuits formed on a second member which are spaced from each other along a measurement path. The excitation windings are shaped so that the electromagnetic coupling between the excitation winding and each of the resonators varies along the measurement path. In this way, by applying an excitation signal to the excitation winding, respective different signals are induced in the resonators which depend upon the relative position of the first and second members.",
        "An exemplary embodiment of the present invention will now be described with reference to the accompanying drawings in which:",
        "FIG. 1 schematically shows a perspective view of a position sensor;",
        "FIG. 2 schematically shows the main components of the position sensor illustrated in FIG. 1;",
        "FIG. 3 schematically shows how the respective phases of signals induced in two resonant circuits which form part of the position sensor illustrated in FIG. 1 vary with the frequency of a driving signal;",
        "FIG. 4 shows an unmodulated signal and a sensed signal generated by the sensor illustrated in FIG. 1;",
        "FIG. 5 shows part of a signal that is sensed by a sensor winding, which forms part of the position sensor illustrated in FIG. 1, after mixing with a second frequency;",
        "FIG. 6 shows part of the signal illustrated in FIG. 5 after filtering, together with a reference signal; and",
        "FIG. 7 is a schematic block diagram showing the main elements of the position sensor illustrated in FIG. 1.",
        "FIG. 1 schematically shows a position sensor for detecting the position of a sensor element 1 which is slidably mounted to a support (not shown) to allow linear movement along a measurement direction (the direction X in FIG. 1). A printed circuit board (PCB) 3 extends along the measurement direction and has printed thereon conductive tracks which form a sine coil 5 and a sense coil 7, each of which are connected to a control unit 9. A display 11 is also connected to the control unit 9 for displaying a number representative of the position of the sensor element 1 in the measurement direction.",
        "The sensor element 1 includes a printed circuit board 13 having conductive tracks printed thereon which form a first resonant circuit 15a and a second resonant circuit 15b which are spaced from each other in the measurement direction. By applying an excitation signal to the sine coil 3, resonant signals are induced in the two resonant circuits 15a, 15b on the sensor element 1, and these resonant signals in turn induce a signal in the sense coil 7 which is processed by the control unit 9 to determine the position of the sensor element 1 along the measurement direction.",
        "As shown in FIG. 1, the PCB 3 is generally rectangular in shape with the lengthwise axis aligned with the measurement direction and the widthwise axis aligned perpendicular to the measurement direction. The sine coil 5 and the sense coil 7 are connected to the control unit 9 via a proximal lengthwise edge 17 of the PCB 3, and extend along the length of the PCB 3 to a distal lengthwise edge 19.",
        "An overview of the operation of the position sensor illustrated in FIG. 1 will now be given with reference to FIG. 2. The control unit 9 includes an excitation signal generator 21 which generates an oscillating excitation signal having a frequency f0, which in this embodiment is 1 MHz.",
        "The excitation signal is applied to the sine coil 5 via the proximal lengthwise edge 17 of the PCB 3, which substantially corresponds to a position value of x=0. The position value increases along the length of the PCB 3 from the proximal lengthwise edge 17 to the distal lengthwise edge 19, which substantially corresponds to a position value of x=L.",
        "As shown in FIG. 2, the sine coil 5 is formed by a conductive track which generally extends around the periphery of the PCB 3 apart from a cross-over point halfway along the PCB 3 in the measurement direction, at which point the conductive track adjacent each widthwise edge of the PCB 3 crosses to the respective opposing widthwise edge of the PCB 3. In this way, effectively a first current loop 23a and a second current loop 23b are formed. When a signal is applied to the sine coil 5, current flows around the first current loop 23a and the second current loop 23b in opposite directions, and therefore the current flowing around the first current loop 23a generates a magnetic field which has an opposite polarity to the magnetic field generated by the current flow around the second current loop 23b.",
        "The lay-out of the sine coil 5 is such that the field strength of the component of the magnetic field B resolved perpendicular to the PCB 3 which is generated by current flowing through the sine coil 5 varies along the measurement direction from approximately zero at the point where x=0, then to a maximum value at x=L/4 (the position A as shown in FIG. 1), then back to zero at x=L/2 (the position B as shown in FIG. 1), then to a maximum value (having opposite polarity to the maximum at position A) at x=3L/4, and then back to zero at x=L. In particular, the sine coil 5 generates a magnetic field component B perpendicular to the PCB 3 which varies according to one period of the sine function, as set out in Equation 1,",
        "B\n        =\n        \n          A\n          ⁢\n          \n            \n          \n          ⁢\n          sin\n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            \n              \n                2\n                ⁢\n                \n                  \n                \n                ⁢\n                π\n                ⁢\n                \n                  \n                \n                ⁢\n                x\n              \n              L\n            \n            )\n          \n        \n      \n    \n    \n      \n        (\n        1\n        )\n      \n    \n  \n\n\n\n\nwhere A is a constant.",
        "When the excitation signal is applied to the sine coil 5, an oscillating signal at the same frequency is induced in each of the two resonant circuits 15a, 15b on the sensor element 1, with the magnitude of the induced signal in each resonant circuit 15 being dependent upon the strength of the magnetic field component B resolved perpendicular to the PCB 3 at the respective position of the resonant circuit 15 along the measurement direction. In this embodiment, the first resonant circuit 15a is separated from the second resonant circuit 15b by a distance d which is equal to L/4, so that as the sensor element 1 moves along the measurement direction the magnitude of the resonant signals induced in the first and second resonant circuits 15 vary in quadrature. A phase lag is also introduced between the excitation signal and the induced signal in each resonant circuit, the amount of the phase lag being dependent upon the relationship between the frequency of the excitation signal and the resonant frequency of each resonant circuit 15. FIG. 3 shows the variation in phase lag with the frequency of the excitation signal for the first and second resonant circuits 15a, 15b. In particular, the curve referenced 31a shows the variation in phase lag with the frequency of the excitation signal for the first resonant circuit 15a, and the curve referenced 31b shows the variation in phase lag with the frequency of the excitation signal for the second resonant circuit 15b.",
        "As shown in FIG. 3, the resonant frequency f1res of the first resonant circuit 15a is set so that at the frequency f0 of the excitation signal, the phase lag of the induced signal in the first resonant circuit is 3Π/4, whereas the resonant frequency f2res of the second resonant circuit 15b is set so that at the frequency f0 of the excitation signal, the phase lag of the signal induced in the second resonant circuit is Π/4. If the position of the first resonant circuit 15a along the measurement direction is X0, then the signals I1, I2 induced in the first and second resonant circuits 15a, 15b are given by equations 2 and 3 respectively.",
        "I\n          1\n        \n        =\n        \n          B\n          ⁢\n          \n            \n          \n          ⁢\n          sin\n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            \n              \n                2\n                ⁢\n                \n                  \n                \n                ⁢\n                π\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  X\n                  0\n                \n              \n              L\n            \n            )\n          \n          ⁢\n          \n            \n          \n          ⁢\n          cos\n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            \n              \n                2\n                ⁢\n                \n                  \n                \n                ⁢\n                π\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  f\n                  0\n                \n                ⁢\n                t\n              \n              -\n              \n                \n                  3\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  π\n                \n                4\n              \n            \n            )\n          \n        \n      \n    \n    \n      \n        (\n        2\n        )\n      \n    \n  \n  \n    \n      \n        \n          I\n          2\n        \n        =\n        \n          B\n          ⁢\n          \n            \n          \n          ⁢\n          sin\n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            \n              \n                2\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  π\n                  ⁡\n                  \n                    (\n                    \n                      \n                        X\n                        0\n                      \n                      +\n                      \n                        L\n                        4\n                      \n                    \n                    )\n                  \n                \n              \n              L\n            \n            )\n          \n          ⁢\n          \n            \n          \n          ⁢\n          cos\n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            \n              \n                2\n                ⁢\n                \n                  \n                \n                ⁢\n                π\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  f\n                  0\n                \n                ⁢\n                t\n              \n              -\n              \n                π\n                4\n              \n            \n            )\n          \n        \n      \n    \n    \n      \n        (\n        3\n        )\n      \n    \n  \n\n\n\n\nwhere B is a constant.",
        "The induced signals I1, I2 in turn induce a signal S in the sense coil 7 proportional to the sum of the induced signals I1 and I2. This sum simplifies to the expression given in Equation 4, in which C is a constant.",
        "S\n        =\n        \n          C\n          ⁢\n          \n            \n          \n          ⁢\n          cos\n          ⁢\n          \n            \n          \n          ⁢\n          \n            (\n            \n              \n                \n                  2\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  π\n                  ⁢\n                  \n                    \n                  \n                  ⁢\n                  \n                    X\n                    0\n                  \n                \n                L\n              \n              -\n              \n                2\n                ⁢\n                \n                  \n                \n                ⁢\n                π\n                ⁢\n                \n                  \n                \n                ⁢\n                \n                  f\n                  0\n                \n                ⁢\n                t\n              \n              +\n              \n                π\n                4\n              \n            \n            )\n          \n        \n      \n    \n    \n      \n        (\n        4\n        )",
        "In effect, the phase of the signal S rotates as the sensor element 1 moves along the measurement direction.",
        "As shown in FIG. 2, the signal S is input to a timing comparator 25 which compares the timing of the signal S with the timing of a reference signal from the excitation signal generator 21 to determine a value representative of the phase of the signal S. This value is then input to a position calculator 27. which converts the value to a position value for the sensor element 1, and outputs a drive signal to the display 11 causing the display 11 to show the position value.",
        "As mentioned above, in this embodiment the frequency f0 of the oscillating excitation signal is 1 MHz. This frequency is sufficiently high to induce a relatively large signal in each resonant circuit 15. FIG. 4 shows the excitation signal P together with the signal S which is induced in the sense coil 7. In FIG. 6, the sense signal S has a phase delay of 0.1 μs with respect to the excitation signal P. At a frequency of 1 MHz, the phase delay will always be 1 μs or less, with the result that, in order to determine the position of the sensor element accurately, it is necessary to resolve the phase delay to a value of 1 to 10 ns, which is relatively difficult. If, however, the sensed signal S is mixed with a second signal of slightly lower or higher frequency, a signal as shown in FIG. 5 is generated which contains a signal at a frequency higher than the original signal, together with a lower frequency “beat” signal at a frequency equal to the frequency difference between the sensed signal and the second signal. This signal can be filtered to remove the high frequency signal and other signals and leave the beat sinusoidal signal 35 as shown in FIG. 6. The beat signal 35 has a phase delay that is related to the position of the sensor element 1 so that it may be compared with a reference signal 37 of the same frequency to determine the position of the sensor element 1. It can be seen from FIG. 6 that the phase delay of the resulting beat signal corresponds to much longer times with the result that relatively inexpensive circuitry can be employed to measure the phase delay.",
        "FIG. 7 schematically shows the circuitry within the control unit 9 in more detail, together with the sine coil 5 and sense coil 7. The circuitry within the control unit 9 comprises a microprocessor 41, signal generator 42, analogue driving circuitry 40 and analogue signal processing components 44.",
        "The microprocessor 41 includes a square wave oscillator 112 which generates a square wave signal at twice the frequency f0 (i.e. at 2 MHz). This square wave signal is output from the microprocessor 41 to the signal generator 42 which divides the square wave signal by two and forms an in-phase digital signal +I at the frequency f0. The in-phase signal +I is sent to the analogue driving circuitry 40, and is input to a coil driver 83 which amplifies the signal and outputs the excitation signal to the sine coil 5.",
        "The digital generation of the excitation signals applied to the sine coil 5 introduces high frequency harmonic noise. However, the coil driver 83 removes some of this high frequency harmonic noise, as does the frequency response characteristics of the sine coil 5. Further, the resonant circuits 15 within the sensor element 1 do not respond to signals which are greatly above their respective resonant frequencies and therefore the resonant circuits 15 also filter out a portion of the unwanted high frequency harmonic noise.",
        "The signal S induced in the sense coil 7 is passed through a high pass filter amplifier 93 which both amplifies the received signal, and removes low frequency noise (e.g. from a 50 Hz mains electricity supply) and any D.C. offset. The amplified signal is then input to a mixer 95, where the amplified signal is mixed with a reference signal at a second frequency f1. The second signal of frequency f1 is a digital signal having sinusoidal characteristics, and is generated by the signal generator 42. The second signal has a fundamental frequency somewhat higher or lower than that of the original signals at frequency at f0 so that the signal output by the mixer 95 includes components at frequencies f0+f1 and at f0−f1. This mixed signal is then input to a low pass amplifier filter 97 to filter out the high frequency components, i.e. those components at a frequency of f0+f1.",
        "The second signal typically has a frequency f1 that differs from f0 by not more than 10% of the original frequency f0 so that the components of the resulting signal have a frequency f0−f1 which is at a much lower frequency than any other component of the signal and the higher frequency components can therefore easily be removed by means of an analogue filter. The filtered signal is then input to a band pass filter amplifier 99 having a pass band centered at f0−f1, after which a generally sinusoidal third signal is formed as shown in FIG. 6.",
        "The signal output by the band pass filter amplifier 99 is input to a comparator 101 which converts it to a square wave signal whose rising and falling edges correspond with the zero crossing points of the sinusoidal signal of FIG. 6. The square wave signal is input into a timer 104, forming part of the microprocessor 41, together with another square wave signal Vref, generated by the signal generator 42, of the same frequency which provides a reference phase.",
        "The timer measures the difference between the timings of the rising and falling edges of the signal output by the comparator 101 and the reference signal Vref, and outputs the measured timings to a processing unit 108 which determines the corresponding position value using a look-up table. The processing unit 108 then outputs the determined position value to a display controller 110 which generates drive signals to cause the display 11 to show the determined position value.",
        "Further details of the components and operation of the control unit 9 may be found in UK patent application no. 0224100.8, whose contents are hereby incorporated by reference.",
        "In the illustrated embodiment, an excitation winding (i.e. the sine coil 5) is electromagnetically coupled to two resonators (i.e. the resonant circuits 15), and the resonant signals induced in the resonant circuits 15 are analysed using a sensor winding (i.e. the sense coil 7) which is electromagnetically coupled with the two  resonators. It is not essential to use such a sensor winding because the resonant signals induced in the two resonators could be measured directly. Such direct measurement is not, however, preferred because it would require electrical connections to be made to the sensor element.",
        "In the illustrated embodiment, the resonant circuits 15 on the sensor element 1 have overlapping, but not identical, ranges of frequencies over which a sinusoidal signal applied to the sine coil 5 induces a resonant signal in the sense coil 7. The frequency of the excitation signal is selected so that there is a quarter of a cycle phase difference between the signals induced in the first and second resonant circuits caused by the phase shifts which are inherent to resonators around the resonant frequency.",
        "In the illustrated embodiment, the sensor element includes two resonant circuits 15 which are separated by a distance corresponding to a quarter of a cycle of the sine coil 5. This is not, however, essential as the sensor element could, for example, have two resonant circuits separated by three-quarters of a cycle of the sine coil 5. Alternatively, the sensor element could have three or more spaced resonant circuits.",
        "In the illustrated embodiment, the sine coil 7 is arranged so that the magnetic field component perpendicular to the PCB 3 varies sinusoidally in accordance with position along the measurement direction, and the two resonant circuits are separated by a distance of L/4 along the measurement direction. In this way, the electromagnetic coupling between the sine coil 5 and the first resonant circuit 15a varies in accordance with a first function (i.e. the sine function) and the electromagnetic coupling between the sine coil 5 and the second resonant circuit 15b varies in accordance with a second function (i.e. the cosine function). In order to achieve this, the sine coil has an alternate twisted loop structure. However, it would be apparent to a person skilled in the art that an enormous variety of different excitation winding geometries could be employed to form transmit aerials which achieve the objective of causing the relative strengths of the resonant signals appearing in the first and second resonant circuits to depend upon the position of the sensor element in the measurement direction according to respective first and second functions.",
        "In the above described embodiment, a passive resonator is used. However, in some circumstances it may be advantageous to use a resonator including an amplifier so that the signal induced in the resonator is increased.",
        "In the illustrated embodiment, instead of detecting the phase of the sense signal, it is also possible to perform parallel synchronous detection of the sense signal, with one synchronous detection using an in-phase signal (with respect to the excitation signal) and the other synchronous detection using a quadrature signal (with respect to the excitation signal). By then performing an arctangent operation on the ratio of the magnitudes of the synchronously detected signals, a value representative of the position of the sensor element 1 in the measurement direction can be obtained.",
        "In the described embodiment, the inductive sensor is used to measure the linear position of a first member (i.e. the sensor element 1) relative to a second member (i.e. the PCB 3) along a rectilinear measurement path.",
        "Alternatively, the inductive sensor could be adapted to measure linear position along a curved measurement path, for example a circle (i.e. a rotary position sensor), by varying the layout of the sine coil in a manner which would be apparent to a person skilled in the art. The inductive sensor could also be used as a speed detector by taking a series of measurements of the position of the first member relative to the second member at known timings.",
        "In the illustrated embodiment, the sine coil, sense coil and resonant circuits are formed by conductive tracks on a printed circuit board. Alternatively, a different planar substrate could be used. Further, the sine coil and sense coil could, if sufficiently rigid, be fixed relative to a first member and the resonant circuits fixed relative to a second member without the use of a substrate. It is also not essential that the sine coil, sense coil and resonant circuits are planar because, for example, cylindrical windings could also be used with the sensor element moving along the cylindrical axis of the cylindrical winding.",
        "Of course, as the position sensor detects the relative position between first and second members, it does not matter which of the first member and the second member are moved, or even if both are moved.",
        "In the above described embodiment, the excitation signal is a digital representation of a sinusoidal signal. This is not essential and may be convenient to use an excitation signal which is more easily generated. For example, the excitation signal could be a digital representation of a triangular waveform. The phase of the sensed signal can be decoded in the same way as the illustrated embodiment by only looking at the fundamental frequency of the sensed signal, i.e. by filtering out the higher harmonics present in the triangular waveform. As described previously, the frequency responses of the analogue driving circuitry, the sine coil and the resonant circuits are effective in removing a large proportion of the higher harmonics."
    ],
    "citations": [
        "3275938",
        "3772587",
        "3789393",
        "3819025",
        "4253079",
        "4282485",
        "4467320",
        "4671116",
        "4697144",
        "4737698",
        "4816759",
        "4853666",
        "4893077",
        "4893078",
        "4959631",
        "4970450",
        "5023408",
        "5173696",
        "5260650",
        "5433115",
        "5513913",
        "5598153",
        "5625327",
        "5646496",
        "5793202",
        "5793204",
        "5796250",
        "5815091",
        "5986549",
        "6124708",
        "6239571",
        "6304014",
        "6489899",
        "2005/0030010",
        "2005/0035836",
        "4230950",
        "0487730",
        "0748054",
        "0772025",
        "2021273",
        "2044461",
        "2197078",
        "57122311",
        "63218819",
        "1458946",
        "9800921",
        "9843046",
        "9934171",
        "9961868",
        "0033244",
        "WO 00 77480",
        "0129759",
        "0142865"
    ],
    "us_classification": "32420724",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "01",
            "subclass": "B",
            "main_group": "7",
            "subgroup": "14"
        }
    ]
}