{
    "title": "Radio prototyping system",
    "abstract": "A method for prototyping an integrated circuit may include selecting at least one daughter card for connection to a motherboard. The daughter card is selected having an ability to provide functionality corresponding to a specific integrated circuit device. The at least one daughter card is connected to the motherboard so that the daughter card is communicatively connected to common memory provided on the motherboard. The at least one daughter card and motherboard emulate an integrated circuit design. At least one of software and system integration of the integrated circuit emulated by the motherboard and the at least one daughter card is tested.",
    "inventors": [
        "Settles"
    ],
    "document_number": "07299427",
    "publication_date": "20071120",
    "assignees": [
        "LSI Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A system for prototyping an integrated circuit, comprising:",
            "components": [
                {
                    "component": "a motherboard having a plurality of connectors suitable for receiving daughter cards, the plurality of connectors being communicatively coupled to the plurality of daughter cards over a bus matching an ASIC AMBA bus environment, the plurality of connectors being selected from a group consisting of an AHB master connector, an AHB slave connector, and an APB connector, the motherboard including a multi-ported memory controller implemented in a FPGA, the multi-ported memory controller being communicatively coupled to common memory on the motherboard; and",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of daughter communicatively coupled to the motherboard utilizing the plurality of connectors, the plurality of daughter cards being communicatively coupled to the multi-ported memory controller; and",
                    "subcomponents": []
                },
                {
                    "component": "a mezzanine card suitable for communicatively coupling to at least one daughter card of the plurality of daughter cards, wherein the mezzanine card provides physical I/O connectivity to the at least one daughter card, the mezzanine card being a telephony mezzanine card, the telephony mezzanine card including a TDM port to a voice codec and subscriber line interface circuits, the telephony mezzanine card further including a message processing unit (MPU) interface configured for controlling SLAC devices,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the motherboard and plurality of daughter cards are configured as an integrated circuit emulation platform for at least one of testing software and system integration of an integrated circuit emulated by the motherboard and the plurality of daughter cards,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the system is processor independent and is configured for supporting multi-instruction processing system (MIPS), advanced RISC machine (ARM) and ZSP logic architecture.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The system as described in claim 1 , wherein the plurality of connectors support concurrent multi-processing on the motherboard.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The system as described in claim 1 , wherein the daughter cards are modular.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A system for prototyping an integrated circuit, comprising:",
            "components": [
                {
                    "component": "a motherboard having a plurality of connectors suitable for receiving daughter cards, the plurality of connectors being selected from a group consisting of an AHB master connect or, an AHB slave connector, and an APB connector, the motherboard including a multi-ported memory controller implemented in a FPGA, the multi-ported memory controller being communicatively coupled to common memory on the motherboard; and",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of daughter cards communicatively coupled to the motherboard utilizing the plurality of connectors, the plurality of daughter cards being communicatively coupled to the multi-ported memory controller; and",
                    "subcomponents": []
                },
                {
                    "component": "a mezzanine card suitable for communicatively coupling to at least one daughter card of the plurality of daughter cards, wherein the mezzanine card provides physical I/O connectivity to the at least one daughter card, the mezzanine card being a telephony mezzanine card, the telephony mezzanine card including a TDM port to a voice codec and subscriber line interface circuits, the telephony mezzanine card further including a message processing unit (MPU) interface configured for controlling SLAC devices,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the motherboard and plurality of daughter cards are configured as an integrated circuit emulation platform for at least one of testing software and system integration of an integrated circuit emulated by the motherboard and the plurality of daughter cards,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the system is processor independent and is configured for supporting multi-instruction processing system (MIPS), advanced RISC machine (ARM) and ZSP logic architecture.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The system as described in claim 4 , wherein the plurality of connectors support concurrent multi-processing on the motherboard.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The system as described in claim 4 , wherein the daughter cards are modular.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A system for prototyping an integrated circuit, comprising:",
            "components": [
                {
                    "component": "a motherboard having a plurality of connectors suitable for receiving daughter cards, the plurality of connectors of the motherboard having at least a common advanced high-performance bus (AHB), the plurality of connectors being selected from a group consisting of an AHB master connector, an AHB slave connector, and an APB connector, the motherboard including a multi-ported memory controller implemented in a FPGA, the multi-ported memory controller being communicatively coupled to common memory on the motherboard; and",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of daughter cards communicatively coupled to the motherboard utilizing the plurality of connectors, the plurality of daughter cards being communicatively coupled to the multi-ported memory controller, and",
                    "subcomponents": []
                },
                {
                    "component": "a mezzanine card suitable for communicatively coupling to at least one daughter card of the plurality of daughter cards, wherein the mezzanine card provides physical I/O connectivity to the at least one daughter card, the mezzanine card being a telephony mezzanine card, the telephony mezzanine card including a TDM port to a voice codec and subscriber line interface circuits, the telephony mezzanine card further including a message processing unit (MPU) interface configured for controlling SLAC devices,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the motherboard and plurality of daughter cards are configured as an integrated circuit emulation platform for at least one of testing software and system integration of an integrated circuit emulated by the motherboard and the plurality of daughter cards,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the system is processor independent and is configured for supporting multi-instruction processing system (MIPS), advanced RISC machine (ARM) and ZSP logic architecture.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The system as described in claim 7 , wherein the plurality of connectors are communicatively coupled to the plurality of daughter cards over a bus matching an ASIC AMBA bus environment.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The system as described in claim 7 , wherein the plurality of connectors support concurrent multi-processing on the motherboard.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The system as described in claim 7 , wherein the daughter cards are modular.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A method for prototyping an integrated circuit, comprising:",
            "components": [
                {
                    "component": "selecting at least one daughter card for connection to a motherboard, wherein the daughter card is selected having an ability to provide functionality corresponding to a specific integrated circuit device, the motherboard including a multi-ported memory controller implemented in a FPGA;",
                    "subcomponents": []
                },
                {
                    "component": "connecting the at least one daughter card to the motherboard via a plurality of connectors of the motherboard so that the daughter card is communicatively connected to common memory provided on the motherboard through the multi-ported memory controller, the at least one daughter card and motherboard emulating an integrated circuit design, the plurality of connectors being selected from a group consisting of an AHB master connector, an AHB slave connector, and an APB connector;",
                    "subcomponents": []
                },
                {
                    "component": "connecting a mezzanine, card to the at least one daughter card, wherein the mezzanine card provides physical I/O connectivity to the at least one daughter card, the mezzanine card being a telephony mezzanine card, the telephony mezzanine card including a TDM port to a voice codec and subscriber line interface circuits, the telephony mezzanine card further including a message processing unit (MPU) interface configured for controlling SLAG devices, and",
                    "subcomponents": []
                },
                {
                    "component": "testing at least one of software and system integration of the integrated circuit emulated by the motherboard and the at least one daughter card,",
                    "subcomponents": []
                },
                {
                    "component": "wherein the at least one daughter card and the motherboard are processor independent and are configured for supporting multi-instruction processing system (MIPS), advanced RISC machine (ARM) and ZSP logic architecture.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method as described in claim 11 , further comprising taking an RTL directly from an ASIC design, adding a library file for FPGA I/O, and synthesizing directly into a FPGA.",
            "components": []
        }
    ],
    "description": [
        "The present application incorporates patent application titled “Interface for Rapid Prototyping System” by Curtis Settles, patent application Ser. No. 10/231,641, filed Aug. 30, 2002, now U.S. Pat. No. 7,212,961, by reference in its entirety.",
        "The present invention generally relates to the field of integrated circuit design, and particularly to a system, method and apparatus for a rapid prototyping and designing an integrated circuit.",
        "Designers of integrated circuits, and especially application specific integrated circuits, are confronted with increased complexity as the number of functions provided by the circuits increase. Faster speeds, greater numbers of components, increased size of the circuit, routing issues, software development, and the like, have all contributed to the increase in integrated circuit complexity. However, as this complexity has increased, there has not been a corresponding increase in methods and systems designed to embrace this complexity. Rather designers are confronted with outdated methodologies that while sufficient for previous designs, may not take into account the issues experienced with the higher complexity devices.",
        "For example, ASIC designs are typically late in design and therefore late to market. Much of this delay is caused by difficulty in testing the design in a system environment early enough, and the need to “spin” silicon because of inadequate system tests.",
        "Therefore, it would be desirable to provide a system and method for rapid prototyping of an integrated circuit.",
        "Accordingly, the present invention is directed to a system and method for rapid prototyping. In a first aspect of the present invention, a system for prototyping an integrated circuit includes a motherboard and a plurality of daughter cards. The motherboard has a plurality of connectors suitable for receiving daughter cards, the plurality of connectors being communicatively coupled to the plurality of daughter cards over a bus matching an ASIC AMBA bus environment. The plurality of daughter cards is communicatively coupled to the motherboard utilizing the plurality of connectors. The motherboard and plurality of daughter cards are configured as an integrated circuit emulation platform for at least one of testing software and system integration of an integrated circuit emulated by the motherboard and the plurality of daughter cards.",
        "In an additional aspect of the present invention, a method for prototyping an integrated circuit includes selecting at least one daughter card for connection to a motherboard. The daughter card is selected having an ability to provide functionality corresponding to a specific integrated circuit device. The at least one daughter card is connected to the motherboard so that the daughter card is communicatively connected to common memory provided on the motherboard. The at least one daughter card and motherboard emulate an integrated circuit design. At least one of software and system integration of the integrated circuit emulated by the motherboard and the at least one daughter card is tested.",
        "In a further aspect of the present invention, a system for prototyping an integrated circuit includes a motherboard and a plurality of daughter cards. The motherboard has a plurality of connectors suitable for receiving daughter cards and includes multi-ported memory capability as a shared resource to the plurality of connectors of the motherboard. The plurality of daughter cards are communicatively coupled to the motherboard utilizing the plurality of connectors. The motherboard and plurality of daughter cards are configured as an integrated circuit emulation platform for at least one of testing software and system integration of an integrated circuit emulated by the motherboard and the plurality of daughter cards.",
        "In another aspect of the present invention, a system for prototyping an integrated circuit includes a motherboard and a plurality of daughter cards. The motherboard has a plurality of connectors suitable for receiving daughter cards having a common advanced high-performance bus (AHB). The plurality of daughter cards is communicatively coupled to the motherboard utilizing the plurality of connectors. The motherboard and plurality of daughter cards are configured as an integrated circuit emulation platform for at least one of testing software and system integration of an integrated circuit emulated by the motherboard and the plurality of daughter cards.",
        "It is to be understood that both the forgoing general description and the following detailed description are exemplary and explanatory only and are not restrictive of the invention as claimed. The accompanying drawings, which are incorporated in and constitute a part of the specification, illustrate an embodiment of the invention and together with the general description, serve to explain the principles of the invention.",
        "The numerous advantages of the present invention may be better understood by those skilled in the art by reference to the accompanying figures in which:",
        "FIG. 1A is a block diagram illustrating a typical development schedule;",
        "FIG. 1B is a block diagram illustrating a development schedule with modeling and rapid prototyping of the present invention;",
        "FIG. 2 is an illustration of an exemplary embodiment of the present invention wherein a system suitable for providing rapid prototyping is shown;",
        "FIG. 3 is a block diagram depicting an exemplary embodiment of the present invention wherein an architecture for a rapid prototyping system is shown;",
        "FIG. 4 is a top plan view of a system of an exemplary embodiment of the present invention wherein a motherboard suitable for use in prototyping an ASIC is shown;",
        "FIG. 5 is a block diagram illustrating an exemplary embodiment of the present invention wherein a motherboard configuration is shown;",
        "FIG. 6 is a block diagram illustrating an additional exemplary embodiment of the present invention wherein a motherboard configuration is shown;",
        "FIG. 7A is a block diagram depicting an exemplary embodiment of the present invention wherein a motherboard configuration in a multi-layer board is shown;",
        "FIG. 7B is an illustration of an exemplary embodiment of the present invention wherein a multi-ported system is shown;",
        "FIG. 8A is a block diagram illustrating an exemplary embodiment of the present invention wherein prototyping AHB RTL in FPGAs is shown;",
        "FIG. 8B is a block diagram depicting an embodiment of the present invention wherein multiple cores in one FPGA are shown;",
        "FIG. 9A is a diagram of an exemplary embodiment of the present invention wherein an AHB master connectors are shown;",
        "FIG. 9B is a diagram of an exemplary embodiment of the present invention wherein an AHB slave connector is shown;",
        "FIG. 9C is a diagram of an exemplary embodiment of the present invention wherein an APB connector is shown; and",
        "FIG. 10 is a block diagram of an exemplary embodiment of the present invention wherein an example of mapping an ASIC onto a system of the present invention is shown.",
        "Reference will now be made in detail to the presently preferred embodiments of the invention, examples of which are illustrated in the accompanying drawings.",
        "Referring generally now to FIGS. 1A through 10, exemplary embodiments of the present invention are shown. The development of integrated circuits, such as general purpose integrated circuits, application specific integrated circuits (ASIC), and the like, has become more complicated as the functionality provided by the circuits increases. Faster speeds, greater numbers of components, increased size of the circuit, routing issues, software development, and the like, have all contributed to the increase in integrated circuit complexity. To address this complexity, the design process needs to become more efficient, since mechanisms and processes that may have been adequate in lower component count devices may not be sufficient when the count increases. Accordingly, the present invention is directed to a system, method and apparatus for rapid prototyping.",
        "ASIC designs are typically late in design and therefore late to market. Much of this delay is caused by difficulty in testing the design in a system environment early enough, and the need to “spin” silicon because of inadequate system tests. However, though use of the present invention, a development system is provided which allows a design to be prototyped in FPGA and system software integrated prior to tape out of the first silicon, increasing the probably that the first silicon meets the desired requirements.",
        "For instance, when designing an integrated circuit, both hardware and software may be developed to provide the desired functionality. Because of this co-development, an interdependency may be created between such hardware and software development so that one process may not continue until a corresponding part of the other process is developed, such as the development of a software architecture in conjunction with register transfer level (RTL) development. For instance, previously, the development of an integrated circuit and corresponding software may go through a variety of stages, including testing, verification, and the like before a working product could be produced, an example of such a process is shown in FIG. 1A.",
        "However, through use of the present invention, a rapid prototyping system and method is provided which enables the circuit to be designed in an efficient and timesaving manner with reduced revisions, which may result in a time saving of several months, as shown in FIG. 1B. For instance, the present invention may provide a rapid prototyping platform; ASIC emulation platform; provide early software debugging and system integration; and provide a customer demonstration platform.",
        "Rapid Prototyping System",
        "Referring now to FIG. 2, an exemplary embodiment of the present invention is shown wherein a system 200 is suitable for providing a rapid prototyping platform. A rapid prototyping system 200 may include a central motherboard 202 with common memory 204. Daughter cards, such as processor cards 206, FPGA cards 208, and the like may be connected to the motherboard 202. For example, the daughter cards may be connected through an advanced microcontroller bus architecture (AMBA) advanced high-performance bus (AHB) to the motherboard to provide specific desired functionality. Additionally, the daughter cards may include mezzanine cards 210 & 212 for physical I/O connectivity, i.e. physical interfaces, for the daughter cards. The daughter cards may utilize similar connects as utilized by the daughter card to the motherboard, and the like without departing from the spirit and scope of the present invention. Preferably, the specifications are standardized to enable a user to design and interchange components of the system, thereby providing a modular development system.",
        "In this way, a standardized advanced microcontroller bus architecture (AMBA) based rapid prototyping vehicle may be provided. The system may be a configurable FPGA-based system which is extendable to support multiple cores and interfaces. Preferably, the system is processor independent and is thus suitable for supporting multi-instruction processing system (MIPS), advanced RISC machine (ARM), ZSP, and the like. The system may also support a common mechanical and electrical form factor and specification so that the system is customizable to meet application specific needs and extensions, which may be designed in an efficient and intuitive manner by a circuit designer. Thus, the system of the present invention may enable the ready and efficient prototyping of integrated circuits, and even the wide range of functionality desired in application specific integrated circuits.",
        "The present invention enables rapid prototyping and reductions in development and integration time. For instance, the present invention may provide an early hardware debugging and software development platform. Additionally, as previously mentioned the present invention provides a custom CPU option due to processor independence and enables multi-processor system prototyping and debugging. Thus, the present invention may be configured to add customer logic and application specific functions. Further, the present invention demonstrates FPGA prototyping methodology flow for ASIC IP.",
        "Referring now to FIG. 3, an exemplary embodiment of the present invention is shown wherein an architecture 300 for an ASIC-on-a-board suitable for rapid prototyping is illustrated. A motherboard includes a multi-ported memory controller 302 communicatively coupled to common memory, which may include SDRAM 304, DDR DRAM 306, synch flash 308, and the like. For example, 128 MB of multi-ported memory, 32 MB SDRAM, 2 MB SRAM and 8 MB of flash memory may be provided. The multi-ported memory controller may be implemented in a FPGA to provide flexibility of the design.",
        "A plurality of daughter cards 310, 312, 314 & 316 are communicatively coupled to the multi-ported memory controller 302 through advanced high-performance bus interfaces 318, 320, 322 & 324. For example, a motherboard may include daughter card (DC) slots which have 32-bit AHB interfaces, which support four AHB masters, four AHB slaves and four APB slaves. The daughter cards 310, 312, 314 & 316 may each include a mezzanine card 326, 328, 330 & 332 to provide an interface.",
        "The advanced high-performance bus interfaces 318, 320, 322 and 324 are communicatively coupled over a common system bus 334, which may include an advanced high-performance bus, for communication between the daughter cards 310, 312, 314 & 316. A peripherals bus, such as an advanced peripheral bus (APB) 336, may also be provided to link peripherals to the daughter cards 310, 312, 314 and 316.",
        "Although four daughter cards are shown, it should be apparent that a wide number of daughter cards may be utilized in conjunction with the present invention without departing from the spirit and scope thereof. Moreover, although an advanced high-performance bus (AHB) is described, a variety of bus architectures are contemplated by the present invention, such as DDR FPGA and the like.",
        "Motherboards",
        "A view of a motherboard 400 of an embodiment of the present invention is shown in FIG. 4. The motherboard 400 includes multi-ported DDR memory controller implemented in a FPGA. Memory 402 which is onboard the motherboard may include multi-ported memory, SDRAM, SRAM, Flash, and the like, as previously described in relation to FIG. 3. Four daughter card (DC) slots 406, 408, 410 & 412 are provided for linking with daughter cards. The daughter card slots 406, 408, 410 & 412 may include 32-bit AHB interfaces which support four AHB masters, four AHB slaves and four APB slaves. The daughter card slots 406, 408 410 & 412 may also include a stand-alone AHB subsystem, such as a ZSP subsystem, and interface to a common AHB bus. Preferably, a dedicated memory port interface is also included, such as to a 64-bit DDR memory.",
        "As described with regards to FIG. 3, the motherboard shown in FIG. 4 is not restricted to an AHB interface, it is contemplated that a wide variety of interface may be utilized without departing from the spirit and scope of the present invention. In this way, a modular daughter card is provided which supports multilayer AHB designs.",
        "Referring now to FIG. 5, an exemplary embodiment of the present invention is shown wherein a motherboard 500 configuration of the present invention is illustrated. The motherboard 500 includes a common memory controller 502 implemented through a FPGA communicatively coupled to an APB peripheral FPGA 504 and a plurality of common AHB interface FPGAs 506 over a common AHB bus 508. A plurality of daughter cards 510, in this instance four, are also included, which have an AHB master, AHB slave and APB slave interfaces. The daughter cards 510 are linked to the APB peripheral FPGA 504 utilizing the APB slave connected to a peripheral bus 512. The daughter cards 510 are also linked to the common AHB interface FPGA 506 and a DDR interface FPGAs 514 through use of an AHB master. The DDR interface FPGAs 514 are communicatively coupled to a DDR DRAM controller FPGA 516.",
        "An additional embodiment of a motherboard 600 of the present invention is shown in FIG. 6. In this embodiment, a multi-ported controller FPGA 602 is utilized, which is coupled to two 32 bit DDR memory banks, a 32 bit SDRAM bank and a syncflash bank. The rest of the architecture is substantially similar to the architecture of a motherboard of the present invention described in relation to FIG. 5.",
        "Referring now to FIG. 7, an exemplary embodiment of the present invention is shown where a multi-layer motherboard 700 is shown. The multi-layer motherboard 700 includes four daughter card slots 702, each having an AHB master, AHB slave and APB slave. The daughter card slots 702 are communicatively coupled to a multi-layer bus matrix 702 having eight masters and eight slaves by utilizing four slave ports 706. The multi-layer bus matrix 704 is communicatively coupled to a common memory controller FPGA 708 utilizing three slaves 710.",
        "The daughter card slots 702 are also communicatively coupled to the multi-layer bus matrix 704 utilizing the AHB master, as well as to a multi-ported controller FPGA 712. The multi-ported control FPGA 712 is coupled to two 32 bit DDR memory banks and a 32 bit SDRAM bank, plus a syncflash bank. An APB peripheral FPGA is also included, which is coupled to the multi-layer bus matrix 704, as well as the daughter card slots 702 through the APB slave.",
        "In this embodiment, the motherboard 700 has full 64-bit support. For instance, the combination of master and expansion connector supports 64-bit master, and the AHB slave and APB connectors may be combined to support a 64-bit AHB slave, a second 64-bit AHB master, and the like. Additionally, the APB connector may be used as a second 32-bit AHB slave.",
        "Further, by providing a multi-layer AHB, all masters may talk to all slaves. A variety of other changes may be made to the motherboard 700 without departing from the spirit and scope of the present invention. For instance, common AHB FPGAs may be replaced with high speed CPLDs, EBIU and APB FPGAs may be combined into one Virtex-II, DDR Dram may use standard DIMMS, common memory and multi-ported (non DDR) memory may be included on the daughter cards for maximum flexibility, and the like as contemplated by a person of ordinary skill in the art. An additional block diagram illustrating a multi-ported system is shown in FIG. 7B.",
        "Daughter Cards",
        "Implementing IP in a FPGA daughter card may be accomplished with a minimum of effort through use of the present invention. Daughter card connection may be made standard AHB master, slave and APB, which are identical to an ASIC. The IP hierarchy may be extracted from the AHB bus down. Additionally, an FPGA specific top level may be added for bus connections, such as I/O pads, clocks, and the like, which may be implemented as a library function. Further, FPGA specific I/O may be added as needed for mezzanine interface. Partitions design across multiple FPGAs through use of the present invention. AHB RTLs may be prototyped in FPGAs as shown in FIG. 8A. Additionally, multiple cores may be provided in a single FPGA, as shown in FIG. 8B.",
        "Daughter cards of the present invention may support a variety of functionality as desired to enable rapid prototyping. For example, an ARM922 daughter card may be provided which leverages an ARM922 test chip and provided full hardware support for JTAG based debugging. The ARM922 daughter card may include an AHB master interface to the motherboard, and operate as a standalone daughter card. An ARM 946/966 daughter card may also be provided having similar functionality but leverages an ARM946/966 test chip.",
        "A daughter card may also be configured as a general purpose FPGA daughter card. This daughter card may include a general purpose FPGA to provide a wide range of desired functionality. Preferably, the interconnect will support AHB masters, AHB slaves and APB slaves. Additionally, connectors may be provided to allow a mezzanine card to be attached to provide a physical interface for further customization. A ZSP daughter card may also be provided with an interconnection which will support AHB masters, AHB slaves and APB slaves and connectors to a mezzanine card to allow",
        "Mezzanine cards may also be provided to enable physical level interfaces for daughter cards. For example, a telephony mezzanine card may be provided which contains TDM port to a voice codec and subscriber line interface circuits. The telephony mezzanine card may be utilized with the ZSP daughter card for an additional or other voice CODEC, echo cancellation, and other voice processing as contemplated by a person of ordinary skill in the art. The telephony card may also include a message processing unit (MPU) interface to control SLAC devices. Additionally, an Ethernet mezzanine card may also be provided to provide an Ethernet connection. The Ethernet mezzanine card may include 10/100 Ethernet ports and be used with general purpose FPGA daughter card as previously described. Use with the General Purpose FPGA daughter card may require Ethernet controller logic.",
        "A motherboard of the present invention may support a variety of features. For example, the motherboard may include a power connector (2×25 pin 0.1 header) suitable for supporting +5, +3.3, +2.5, +1.8, +1.5, −12 and −5 V. The motherboard may also include a joint test action group (JTAG) connector (2×25 pin 0.1 header). The connector may support daisy chaining and for debugging JTAP signals, such as TDI, TDO, RTCK, TCK, TMS, nSRST, nTRST, DBGACK, and the like (DBGACK goes to APB FPGA to stop cntr, watchdog, and the like). The connector may support a 4-bit MB revision number; 2-bit slot ID; 8-bit jumper settings such as master only, slave only, and the like; FPGA present to inform reset circuitry of initialized device; FPGA done to inform reset circuitry that initialization is complete; and the like as contemplated by a person of ordinary skill in the art.",
        "Communication",
        "To achieve communication between devices utilizing the AHB, AHB master MUXs are provided. For instance, referring again to FIG. 4, four masters may be provided for each daughter card slot. The slot is enabled if HMAST[3:2]==Slot ID. One of the four masters is selected by HMAST[1:0], with the library function being a part of I/O of the FPGA daughter card for 1, 2, 3 or 4.",
        "An ApArbiter is located in APB FPGA. A critical path is provided by HCLK to HMAST out of APB FPGA across the motherboard to common AHB interface FPGAs, which is preferably slower than control signal delays. For RTL changes, the ApArbiter outputs unregistered HMAST. Common AHB Interface FPGAs register the compare of HMAST[3:2] to slot ID, and actually register the enable of the IOB. Thus, timing problems are eliminated.",
        "A centralized decoder may be utilized in APB FPGA for HSEL generation. For example, the decoder may generate 24 HSELs. Additional embodiments contemplate one copy of decoder distributed to all motherboard FPGAs, thereby allowing syntheses to use what it needs. Further, the decoder may be register based, so there is no need to change RTL to remap the system.",
        "The configuration of an APB bridge may be provided in an number of ways. For example, a main APB bridge may be provided in an APB FPGA. The bridge may generate 16 daughter card PSELs on peripherals on the FPGA. A unidirectional data bus is provided to the daughter card slots from the APB FPGA. A secondary bridge is provided in the common memory FPGA, which connects ApSdramCtrl to the AHB bus.",
        "Connectors which may be utilized in embodiments of the present invention are shown in FIGS. 9A, 9B and 9C. For instance, in FIG. 9A, AHB master connectors 900 & 902 are shown. In FIG. 9B, an AHB slave connector 904 is shown. In FIG. 9C, an APB connector 906 is shown.",
        "Mapping an ASIC Utilizing the Rapid Prototyping System",
        "Much of the delays and problems caused in bringing ASIC designs to market result from the difficulty in testing the design in a system environment early enough, and the need to “spin” silicon because of inadequate system tests. However, though use of the present invention, a development system is provided which allows a design to be prototyped in FPGA and system software integrated prior to tape out of the first silicon, increasing the probably that the first silicon meets the desired requirements.",
        "For example, referring now to FIG. 10, an exemplary embodiment of the present invention is shown wherein an ASIC example is mapped into a system of the present invention. In this example, an ASIC is desired having Ethernet functionality. A motherboard 1002 is provided with commonly used memory system, such as SRAM 1006, SDRAM 1004, and the like and peripherals 1008, such as UARTS 1010, 1012 & 1014, interrupt controllers 1016, timers 1018, and the like.",
        "To provide the processing for the prototype, three processor daughter cards 1020, 1022 & 1024 are utilized. Additional, a FPGA card is utilized to act as the Ethernet controller 1026. The cards 1020, 1022, 1024 & 1026 are communicatively coupled over a system bus, such as an advanced high performance bus (AHB) 1028 having an AHB arbiter 1030. A peripherals bus 132, such as an advanced peripherals bus, is provided for connecting the peripherals 1008. A bridge 134 links the system bus 1028 to the peripherals bus 1032. In this way, the system 1000 of the present invention may be utilized to prototype a design for an ASIC and thereby enable system software to be integrated prior to producing the design in silicon, thereby increasing the probability that the first silicon device produced will function as intended.",
        "Thus, the present invention provides for a variety of advantages over the prior art. Concurrent multi-processing allows for prototyping multi-processor system such as dual ARM, ARM and ZSP, and the like, including support for multi-core debugging. Multi-ported memory environment allows prototyping of more than one master device, processor or bus master DMA type controller, accessing memory at the same time. AMBA bus connections matching the ASIC methodology flow allows a designer to take the RTL directly from an ASIC design, add a library file for FPGA I/O and synthesize directly into a FPGA. Processors and peripherals may be prototyped using either test silicon or FPGA. Common AHB bus allows prototyping of system where the peripherals and non-multi-ported memory on the motherboard are shared by any or all masters in the system. Additionally, a system may be made application specific by providing a needed subset of the features previously mentioned in the discussion.",
        "It is believed that the system and method of the present invention and many of its attendant advantages will be understood by the forgoing description. It is also believed that it will be apparent that various changes may be made in the form, construction and arrangement of the components thereof without departing from the scope and spirit of the invention or without sacrificing all of its material advantages. The form herein before described being merely an explanatory embodiment thereof. It is the intention of the following claims to encompass and include such changes."
    ],
    "citations": [
        "4656592",
        "4775942",
        "5036473",
        "5274765",
        "5339262",
        "5515514",
        "5604888",
        "5804986",
        "5818728",
        "5818729",
        "5887145",
        "6011730",
        "6138183",
        "6226756",
        "6230307",
        "6266724",
        "6289376",
        "6321366",
        "6347395",
        "6356109",
        "6381662",
        "6389379",
        "6459136",
        "6496517",
        "6571370",
        "6621325",
        "6651225",
        "6785873",
        "6798784",
        "6842865",
        "6893268",
        "6898657",
        "7129860",
        "7130942",
        "7137011",
        "2001/0056480",
        "2002/0116168",
        "2002/0131765",
        "2003/0046478",
        "2004/0015633",
        "2004/0243386",
        "2005/0031097",
        "2005/0055192",
        "2005/0091029",
        "2005/0102125",
        "2005/0182838",
        "2005/0193091",
        "2005/0204082",
        "2006/0241921",
        "2007/0016704",
        "61166667",
        "2001134522",
        "01202397",
        "02202886",
        "WO 8803679",
        "WO 9525310"
    ],
    "us_classification": "716  4",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "06",
            "subclass": "F",
            "main_group": "17",
            "subgroup": "50"
        }
    ]
}