{
    "title": "Dipole antenna element",
    "abstract": "Described is a dipole which may includes a feed line electrically coupled to a first antenna element; a balun electrically coupled to a second antenna element; and a short assembly slidably coupled to the feed line and the balun to create a short circuit at variable distances along the feed line and the balun.",
    "inventors": [
        "Rankin"
    ],
    "document_number": "07298345",
    "publication_date": "20071120",
    "assignees": [
        "Symbol Technologies, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A dipole, comprising:",
            "components": [
                {
                    "component": "a feed line electrically coupled to a first antenna element;",
                    "subcomponents": []
                },
                {
                    "component": "a balun electrically coupled to a second antenna element; and",
                    "subcomponents": []
                },
                {
                    "component": "a short assembly slidably coupled to the feed line and the balun to create a short circuit at variable distances along the feed line and the balun.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The dipole according to claim 1 , further comprising:",
            "components": [
                {
                    "component": "a support plate holding the feed line and the balun at a fixed spacing, the support plate including a short circuit path between the feed line and the balun.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The dipole according to claim 1 , wherein the short assembly is detachably coupled to the feed line and the balun.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The dipole according to claim 1 , wherein each of the variable distances along the feed line and the balun correspond to a receiving frequency band.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The dipole according to claim 4 , wherein the receiving frequency band is one of an Advanced Mobile Phone System frequency band, a Global System for Mobile Communication frequency band, a Digital Cellular System frequency band, a Personal Communication Services frequency band, and an Industrial, Scientific and Medical frequency band.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The dipole according to claim 1 , wherein at least one of the first and second antenna elements includes a plurality of releaseably connectable conducting segments.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The dipole according to claim 6 , wherein each of the segments is an aluminum hexagonal standoff having a length of substantially one inch.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The dipole according to claim 1 , wherein the first and second antenna elements are constructed from a conducting material including one of aluminum, brass and copper.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The dipole according to claim 1 , wherein the feed line is one of a semi-rigid coaxial cable and a rigid coaxial cable.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The dipole according to claim 1 , wherein the short assembly includes a switch.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The dipole according to claim 1 , further comprising:",
            "components": [
                {
                    "component": "a spacer holding the feed line and the balun at the fixed spacing.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A dipole, comprising:",
            "components": [
                {
                    "component": "a variable length antenna element;",
                    "subcomponents": []
                },
                {
                    "component": "a feed line coupled to the variable length antenna element;",
                    "subcomponents": []
                },
                {
                    "component": "a balun; and",
                    "subcomponents": []
                },
                {
                    "component": "a switch assembly slidably coupled to the feed line and the balun,",
                    "subcomponents": []
                },
                {
                    "component": "wherein, when the switch assembly is closed, the switch assembly creates a short circuits at variable distances along the feed line and the balun.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The dipole according to claim 12 , further comprising:",
            "components": [
                {
                    "component": "a support plate holding the feed line and the balun at a fixed spacing and creating a permanent short circuit between the feed line and the balun.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The dipole according to claim 12 , wherein a first variable distance corresponds to one of an Advanced Mobile Phone System frequency band and a Global System for Mobile Communication frequency band, a second variable distance corresponds to one of a Digital Cellular System frequency band and a Personal Communication Services frequency band, and a third variable distance corresponds to an Industrial, Scientific and Medical frequency band.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The dipole according to claim 12 , wherein the variable length antenna element includes a plurality of releaseably connectable conducting segments.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The dipole according to claim 15 , wherein the segments include two segments for one of an Advanced Mobile Phone System frequency band and a Global System for Mobile Communication frequency band, one segment for one of a Digital Cellular System frequency band and a Personal Communication Services frequency band, and zero segments for an Industrial, Scientific and Medical frequency band.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. A short assembly for a dipole antenna including a feed line connected to a first antenna element and a balun connected to a second antenna element, the short assembly comprising:",
            "components": [
                {
                    "component": "a first conductive portion; and",
                    "subcomponents": []
                },
                {
                    "component": "a second conductive portion detachably coupleable to the first conductive portion,",
                    "subcomponents": []
                },
                {
                    "component": "wherein, when the first and second conductive portions are coupled, the first and second conductive portions form two vias for receiving the balun and the feed line.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The short assembly according to claim 17 , wherein the first and second conductive portions include threaded bores for being coupled together with a screw.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The short assembly according to claim 17 , wherein, when coupled, the first and second conductive portions are slidable about a fitting, the coupled first and second conductive portions sliding relative to the balun and the feed line.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The short assembly according to claim 17 , wherein the first and second conductive portions are formed from one of aluminum, brass and copper.",
            "components": []
        }
    ],
    "description": [
        "The present application is a continuation of a U.S. patent application Ser. No. 10/854,323 filed May 26, 2004 now U.S. Pat. No. 7,116,281 entitled “Universal Dipole”. The entire disclosure of this prior application is considered as being part of the disclosure of the accompanying application and is hereby expressly incorporated herein by reference.",
        "In a wireless communication network, a device may include or be attached to a dipole antenna in order to receive and/or transmit communications over the network. However, there may be a need to receive and/or transmit signals at different frequencies. In a traditional network, such a device would need to include a dipole antenna set to accommodate the various frequencies. The dipole antenna set includes multiple antennas of varying lengths in order to receive and/or transmit the communications at the different frequencies. These dipole sets are very expensive and tend to include antenna lengths which the user does not need.",
        "The present invention relates to a universal dipole which may include (a) a feed line coupled to a first fitting; a balun coupled to a second fitting, (b) a first variable length antenna element coupled to the first fitting and (c) a second variable length antenna element coupled to the second fitting. In addition, the universal dipole may include (d) a support plate holding the feed line and the balun at a fixed spacing. The support plate includes a short circuit path between the feed line and the balun. Furthermore, the universal dipole may include (e) a sliding short assembly attachable between the feed line and the balun to create a short circuit at variable distances along the feed line and the balun.",
        "FIG. 1 shows a first exemplary embodiment of the universal dipole according to the present invention;",
        "FIG. 2 shows a hexagonal standoff which may be used as a conducting element of the universal dipole according to the present invention;",
        "FIG. 3 shows two connected hexagonal standoffs which may be used as a conducting element of the universal dipole according to the present invention;",
        "FIG. 4 shows a cross-sectional view of the hexagonal standoff of FIG. 2;",
        "FIG. 5 shows a top view of the spacers which may be used to construct the universal dipole according to the present invention;",
        "FIG. 6 shows a side view of an exemplary sliding short assembly of the universal dipole according to the present invention;",
        "FIG. 7 shows an exemplary process for constructing the universal dipole according to the present invention;",
        "FIG. 8 shows an exemplary VSWR (S11) for the AMPS/GSM band;",
        "FIG. 9 shows an exemplary VSWR (S11) for the DCS/PCS band;",
        "FIG. 10 shows an exemplary VSWR (S11) for the ISM band;",
        "FIG. 11 shows an exemplary antenna pattern for an AMPS signal at 881 MHz;",
        "FIG. 12 shows an exemplary antenna pattern for a GSM signal at 942 MHz;",
        "FIG. 13 shows an exemplary antenna pattern for a DCS signal at 1837 MHz;",
        "FIG. 14 shows an exemplary antenna pattern for a PCS signal at 1960 MHz;",
        "FIG. 15 shows an exemplary antenna pattern for an ISM signal at 2.4 GHz;",
        "FIG. 16 shows a second exemplary embodiment of a universal dipole according to the present invention.",
        "The present invention may be further understood with reference to the following description and the appended drawings, wherein like elements are provided with the same reference numerals. A dipole antenna is a straight electrical conductor which measures one-half of the wavelength of interest from end to end. The conductor is generally connected at the center to a radio-frequency (“RF”) feed line to propagate the received signal to the device which is attached to the antenna or in the opposite direction for a signal which is to be transmitted. The feed line may be an unbalanced line such as a coaxial cable. Where such an unbalanced feed line is used, a balun may be inserted where the feed line joins the antenna to balance the signal.",
        "Since the dipole antenna has an ideal measurement of one-half the wavelength of interest, signals of different frequencies require dipole antennae of different lengths. Similarly, the different signals require baluns of differing lengths. Thus, in a traditional antenna system dipole sets having antennas of different lengths are provided to accommodate signals at different frequencies.",
        "The exemplary embodiments of the universal dipole of the present invention alleviate the need to supply expensive dipole sets when the device attached to the antenna is to transmit and/or receive signals at different frequencies. The exemplary embodiments of the universal dipole allow for a single adjustable dipole antenna to accommodate signals of varying frequencies, i.e., the lengths of the antenna and the balun are adjustable to accommodate the different wavelengths.",
        "FIG. 1 shows a first exemplary embodiment of the universal dipole 1. The universal dipole 1 will be described and include various dimensions for the receipt and transmission of signals for the Advanced Mobile Phone System (“AMPS”) which uses the 800 MHz frequency band (approximately 824-849 MHz), the Global System for Mobile Communication (“GSM”) which uses the 900 MHz frequency band, the Digital Cellular System (“DCS”) which uses the 1800 MHz frequency band, the Personal Communication Services (“PCS”) which uses the 1900 MHz frequency band and the Industrial, Scientific and Medical (“ISM”) frequency bands of 2.4 GHz. Those of skill in the art will understand that these frequency bands were selected only for exemplary purposes and that a universal dipole according to the present invention may be constructed and used for any number of frequency bands.",
        "The universal dipole 1 includes antenna elements 5, a center section 10, a feed line 20 and a balun 25. The antenna elements 5 are constructed of one or more straight pieces of conducting material. In the example of FIG. 1, each of the antennal elements 5 are constructed of two (2) conducting elements 6 and 7. Each of the conducting elements 6 and 7 includes a threaded male end and a threaded female end. A first conducting element 6 may be secured to the center section 10 by screwing the threaded male end into a threaded female fitting of the center section 10. A second conducting element 7 may be secured to the first conducting element 6 by screwing the male end of the second conducting element 7 into the female end of the first conducting element 6. Thus, the length of the antenna elements 5 may be varied using any number of conducting elements 6 and 7, including the use of no conducting elements.",
        "In the examples provided below, the different universal dipole embodiments will include embodiments with no conducting elements, one conducting element and two conducting elements. However, there may be embodiments where any number of conducting elements are combined to provide the desired length for the antenna elements 5 of the exemplary embodiment of the present invention.",
        "Those of skill in the art will understand that threaded male and female ends of conducting elements 6 and 7 are only one exemplary manner of securing multiple conducting elements. Other examples include fitted ends, releaseable compression fittings, radial screws or thumbscrews, etc. Any manner of releaseably connecting one or more conducting elements such that the length of the antenna element 5 may be varied.",
        "An example of a conducting element 6 and 7 may be a male/female aluminum hexagonal standoff of the size 4-40 3/16 by 1 inch. The hex standoff material is commercially available in various sizes and in a male/female configuration allowing for easy attachment and removal to each other and the center section 10. However, any type of conducting material that is generally used in an antenna may be used for the conducting elements 6 and 7. In addition, the length and diameter may be varied based on the desired response of the universal dipole. Furthermore, in one exemplary embodiment, the conducting elements 6 and 7 of various lengths may be covered in shrink tubing. For example, as shown in FIG. 1, conducting elements 6 and 7 may be covered in shrink tubing which makes them one integral antenna element 5 that is attached and removed in one piece from the center section 10.",
        "FIG. 2 shows a hexagonal standoff 50 which may be used as the conducting element 6 of the universal dipole 1. The hexagonal standoff 50 includes a male end 51 which may be screwed into the center section 10 and a hexagonal body 52. FIG. 4 shows a cross-sectional view of the hexagonal standoff 50 of FIG. 2. This view shows the hexagonal body 52 and the threaded female end 53 which may accept the male end 51 of another hexagonal standoff.",
        "FIG. 3 shows two connected hexagonal standoffs 50 and 55 which may be used as conducting elements 6 and 7 of the universal dipole 1. In this example, hexagonal standoff 50 includes the same threaded male end 51 and hexagonal body 52 as described above. However, the male end (not shown) of hexagonal standoff 55 is screwed into the female end (not shown) of hexagonal standoff 50 creating a longer antenna element 5.",
        "The center section 10 is also constructed of a conducting material, e.g., brass. The center section 10 is constructed of a conducting material because it contributes to the length of the universal dipole antenna 1. For example, for particular wavelengths, there may be no conducting elements 6 and 7 attached to the center section 10. The center section 10 may contribute the entire length of the antenna 1. The center section 10 may include two fittings 11 and 12 which are connected via a connector 13 which may be soldered, welded, etc. to hold the fittings 11 and 12 in relation to each other.",
        "Each of the fittings 11 and 12 may include a threaded female portion or other connection device to accept the conducting elements 6 of the antenna elements 5. The fitting 11 will include an opening for insertion of the balun 25 and the fitting 12 will include an opening for the insertion of the feed line 20. The fittings 11 and 12 may also include a manner of securing the balun 25 and the feed line 20 to the respective fittings 11 and 12, e.g., a compression screw, a compression fitting, a solder accepting portion, etc.",
        "The feed line 20 and the balun 25 may be a conductor such as a semi-rigid coaxial cable, e.g., RG-141. As described above, the feed line 20 is to conduct the received signals from the antenna elements 5 to the attached device or conduct the signals to be transmitted from the device to the antenna elements 5. The feed line 20 may also include a connector 23 (e.g., an SMA connector) for the feed line 20 to be connected to the device. The balun 25 is used to balance the RF current distribution on the antenna elements 5. While the feed line 20 is shown as being connected to the fitting 12, the center conductor of the feed line 20 is also connected to the fitting 11 in order to balance the signals received from each of the antenna elements 5.",
        "The further elements of the universal dipole 1 include spacers 15, a support plate 40, and a sliding short assembly 45. FIG. 5 shows a top view of the spacers 15 which may be used to construct the universal dipole 1. The spacers 15 may be constructed from a rigid or semi-rigid non-conducting material (e.g., plastic, ceramic, etc.). The spacers 15 include vias 60 and 61 for the feed line 20 and the balun 25 to be fed through. The spacers 15 are used to maintain a fixed distance relationship between the feed line 20 and the balun 25 as shown in FIG. 1. The spacers 15 may also add to the rigidity of the universal dipole 1.",
        "The support plate 40 further maintains the fixed distance between the feed line 20 and the balun 25 and adds support and rigidity to the universal dipole 1. The support plate 40 also creates a short circuit between the feed line 20 and the balun 25. As described above, the operating characteristics of the universal dipole 1 depend on the length of the antenna elements 5 and the relationship between the feed line 20 and the balun 25. The support plate 40 provides a short circuit path between the feed line 20 and the balun 25 which defines the maximum distance relationship between the feed line 20 and the balun 25.",
        "The sliding short assembly 45 provides for a movable assembly that places the short circuit between the feed line 20 and the balun 25 at variable positions. The sliding short assembly 45 is shown in FIG. 1 in its storage position. As described above, the support plate 40 defines the maximum distance relationship between the feed line 20 and the balun 25. The storage position is greater than this maximum distance and is used for the storage of the sliding short assembly 45.",
        "When in use, the sliding short assembly 45 is moved into position along the feed line 20 and the balun 25. For example, the sliding short assembly 45 may be moved into position 30 on the feed line 20 and position 35 on the balun 25 to create the short circuit at this distance which is shorter than the maximum distance presented by the support plate 40 short circuit. Similarly, the sliding short assembly 45 may be moved into position 31 on the feed line 20 and position 36 on the balun 25 to create the short circuit at this distance.",
        "The variable feed line 20 and balun 25 short circuit distance may be used in conjunction with the variable antenna element 5 distance to create the desired operating characteristics of universal dipole 1. Examples of such variable distances will be described in greater detail below.",
        "The exemplary feed line 20 and balun 25 of FIG. 1 show two variable positions 30, 31 and 35, 36, respectively. However, it should be understood that the feed line 20 and balun 25 may have any number of variable positions where the sliding short assembly 45 may be attached to create the short circuit between the feed line 20 and balun 25.",
        "FIG. 6 shows a side view of an exemplary sliding short assembly 45 of the universal dipole 1. The exemplary sliding short assembly 45 includes a top portion 70 and a bottom portion 80 which are both constructed of a conducting material. The top portion 70 may be attached to the bottom portion 80 by, for example, a screw inserted into the respective vias 72 and 82. As shown by FIG. 6, when attached the top portion 70 and the bottom portion 80 form two vias 75 and 77. The screw may be loose to allow the sliding short assembly 45 to be moved into position on the feed line 20 and balun 25, e.g., positions 30, 35 and 31, 36. The screw may then be tightened to allow the sliding short assembly 45 to clamp down on the feed line 20 and balun 25, such that the inner faces (74, 84 and 76, 86) of the sliding short assembly 45 forming the vias 75 and 77 contact the feed line 20 and balun 25 creating the short circuit.",
        "The sliding short assembly 45 shown in FIG. 6 is only exemplary and those of skill in the art will understand that there are numerous embodiments of assemblies which may be secured to the feed line 20 and the balun 25 to create a short circuit at variable distances.",
        "Also, as described above, the feed line 20 and the balun 25 may be constructed of coaxial cable which may have an insulating jacket. Where the feed line 20 and the balun 25 are constructed from coaxial cable having an insulating jacket, the insulation may have to be stripped at the various locations along the feed line 20 and the balun 25 where the permanent short circuit of the support plate 40 is created and the variable locations where the sliding short assembly 45 may be attached in order that the support plate 40 and/or the sliding short assembly 45 contact the outer conductor of the coaxial cable.",
        "FIG. 7 shows an exemplary process 100 for constructing the universal dipole 1 including exemplary dimensions as described above. In step 105 the two (2) spacers 15 are placed on the feed line 20 and the balun 25. In step 110, the ends of the feed line 20 and the balun 25 are inserted into the respective fittings 11 and 12 of the center section 10. The feed line 20 and the balun 25 are secured to the center section 10 by, for example, tightening a screw into the fittings 11 and 12 which compresses the fittings 11 and 12 onto feed line 20 and the balun 25.",
        "In step 115, the support plate 40 is secured to the feed line 20 and the balun 25. The support plate 40 may be installed at 4.92 inches from the bottom of the center section 10. This is the location of the permanent short between the feed line 20 and the balun 25. The support plate 40 may be secured by soldering the support plate 40 to the feed line 20 and the balun 25. The first spacer 15 may then be positioned at the top edge of the support plate 40 and the second spacer may be positioned at the lower edge of the center section 10 (step 120). The spacers 15 may be secured to the outside of the feed line 20 and the balun 25 using, for example, an adhesive.",
        "In step 125, the center conductor of the feed line 20 is connected to the fitting 11 to which the balun 25 is connected. As described above, the feed line is connected to the balun 25 portion of the center section 10 in order to balance the signal received from the antenna elements 5. The connection may be accomplished by bending the center conductor of the feed line 20 and fitting it into a slot (not shown) of the fitting 11, trimming the conductor, as required, and soldering the conductor to the fitting 11.",
        "The next step 130 is to assemble the antenna elements 5. As described above, the length of the antenna elements 5 depend on the wavelength of the signals of interest. Using the example of the aluminum hex standoffs described above for the conducting elements 6 and 7, the AMPS/GSM band would use two (2) standoffs for each of the antenna elements 5, the DCS/PCS band would use one (1) standoff for each of the antenna elements 5 and the ISM band would not require any standoffs, i.e., the fittings 11 and 12 of the center section 10 provide the required element length for the ISM band. As described above, the conducting elements 6 may be secured to the fittings 11 and 12 and any additional conducting elements 7 may be secured to the conducting elements 6.",
        "The sliding short assembly 45 is then placed at the required location (step 135). For example, for the AMPS/GSM band, the sliding short assembly 45 may stay in the storage position because the permanent short of the support plate 40 is used. The DCS/PCS band may have the sliding short assembly 45 create a short circuit at a distance of 2.44 inches from the bottom edge of the center section 10, e.g., the sliding short assembly 45 is placed between position 31 of the feed line 20 and position 36 of the balun 25. The ISM band may have the sliding short assembly 45 create a short circuit at a distance of 1.14 inches from the bottom edge of the center section 10, e.g., the sliding short assembly 45 is placed between position 30 of the feed line 20 and position 35 of the balun 25.",
        "At the end of process 100, an exemplary universal dipole 1 is complete. However, as described above, the universal dipole 1 may be altered by changing the lengths of the antenna elements 5 and the position of the sliding short assembly 45 to accommodate various bands of interest.",
        "Furthermore, the various configurations of the universal dipole 1 may be tested to verify that the operating characteristics match the expected characteristics. The universal dipole 1 may be tested against both the expected VSWR (S11) and the Antenna Patterns. VSWR (S11) is the scattering parameter designation for the transmission coefficient of return loss which is designated as reflected power/incident power.",
        "FIGS. 8-10 show exemplary VSWR (S11) plots against which the universal dipole 1 according to the present invention maybe tested to determine that its operating characteristics match the desired characteristics. FIGS. 11-15 show exemplary antenna pattern against which the universal dipole 1 according to the present invention maybe tested to determine that its operating characteristics match the desired characteristics.",
        "FIG. 16 shows a second exemplary embodiment of a universal dipole 200 according to the present invention. The universal dipole 200 has the same elements as the exemplary universal dipole 1, except that there is no sliding short assembly 45 and switch elements 205 and 210 have been added. The switch element 205 spans between locations 30 and 35 and the switch element 210 spans between locations 31 and 36. The switch elements 205 and 210 are conductors which contain a normally open switch. In the normal position, the switch elements 205 and 210 do not effect the universal dipole 200. However, when a user of the universal dipole 200 closes one of the switches of the switching elements 205 and 210, the user can create a short circuit between the feed line 20 and the balun 25 at the desired location. Thus, the switch elements 205 and 210 act in the same manner as the sliding short assembly 45 of universal dipole 1, except that the switch elements 205 and 210 may be permanently mounted to the feed line 20 and balun 25. The switching elements 205 and 210 may be connected to the outer conductor of the feed line 20 and balun 25 by soldering to form an electrical connection so that when the switch is closed, a short is formed at the location.",
        "Again, in the exemplary universal dipole 200, two switching elements 205 and 210 are shown. However, a universal dipole according to the present invention may include any number of switching elements at various locations along the feed line 20 and balun 25 to create a short circuit at various lengths. Thus, to carry through with the examples from above, switching element 210 may be permanently connected at a distance of 2.44 inches from the bottom edge of the center section 10 to accommodate the DCS/PCS band and switching element 205 may be permanently connected at a distance of 1.14 inches from the bottom edge of the center section 10 to accommodate the ISM band.",
        "The present invention has been described with the reference to the above exemplary embodiments. One skilled in the art would understand that the present invention may also be successfully implemented if modified. Accordingly, various modifications and changes may be made to the embodiments without departing from the broadest spirit and scope of the present invention as set forth in the claims that follow. The specification and drawings, accordingly, should be regarded in an illustrative rather than restrictive sense."
    ],
    "citations": [
        "3618105",
        "6642902",
        "7116281"
    ],
    "us_classification": "343820",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "Q",
            "main_group": "9",
            "subgroup": "16"
        }
    ]
}