{
    "title": "System and method for efficient basis conversion",
    "abstract": "This invention describes a method for evaluating a polynomial in an extension field F",
    "inventors": [
        "Lambert"
    ],
    "document_number": "07299253",
    "publication_date": "20071120",
    "assignees": [
        "Certicom Corp."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for converting an element of a finite field of characteristic q stored in a cryptographic system from a representation in a first basis defined by a first irreducible polynomial to a representation in a second basis defined by a second irreducible polynomial, wherein said representation in said second basic is to be used in a cryptographic scheme, said method comprising the steps of:",
            "components": [
                {
                    "component": "a) obtaining said element from said cryptographic system;",
                    "subcomponents": []
                },
                {
                    "component": "b) representing said element of said finite field in said first basis as a polynomial a(x);",
                    "subcomponents": []
                },
                {
                    "component": "c) determining a root r of said second irreducible polynomial;",
                    "subcomponents": []
                },
                {
                    "component": "d) evaluating said polynomial a(x) at said root r to obtain a representation a(r) of a(x) in said second basis for use in said cryptographic system; said evaluation being characterised by the steps of:",
                    "subcomponents": []
                },
                {
                    "component": "e) partitioning said polynomial a(x) into a plurality of component polynomials, such that said polynomial a(x) is recoverable by combining said plurality of component polynomials using the operations of multiplication by x and exponentiation by q;",
                    "subcomponents": []
                },
                {
                    "component": "f) obtaining values of each of said component polynomials by evaluating each of said component polynomials at said root r;",
                    "subcomponents": []
                },
                {
                    "component": "g) computing the value of a(r) from said values of said component polynomials at said root r, using the operations of multiplication by r and exponentiation by q and;",
                    "subcomponents": []
                },
                {
                    "component": "h) providing said representation a(r) in said second basis to said cryptographic scheme.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A method according to claim 1 , wherein the evaluation of said component polynomials comprises evaluating said component polynomials directly.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A method according to claim 1 , wherein the evaluation of said component polynomials comprises using Horner's rule to evaluate said component polynomials.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A method according to claim 1 , wherein said polynomial a(x) is partitioned into q component polynomials C",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A method according to claim 4 , wherein said component polynomials are combined using the formula a(r)=(C",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A method according to claim 1 , wherein said polynomial a(x) is partitioned into q",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A method according to claim 6 , wherein said component polynomials are combined using the formula",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A method according to claim 1 , wherein said finite field is F",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A method according to claim 8 , wherein said polynomial a(x) is partitioned into 2 component polynomials b(x) and c(x).",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A method according to claim 9 , wherein said component polynomials are combined using the formula a(r)=(b(r))",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A method according to claim 8 , wherein said polynomial a(x) is partitioned into 4 component polynomials C",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A method according to claim 11 , wherein said component polynomials are combined using the formula a(r)=(C",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A method according to claim 8 , wherein said finite field is F",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 1 , in which the evaluation of the component polynomials is further characterised by the steps of:",
            "components": [
                {
                    "component": "a) determining a set of exponents of x appearing in the component polynomial, such that all exponents appearing in said component polynomial are q-multiples of the exponents in said set of exponents;",
                    "subcomponents": []
                },
                {
                    "component": "b) computing the exponentiation of r to the exponents in the set of exponents to obtain a first set of exponentiations;",
                    "subcomponents": []
                },
                {
                    "component": "c) computing the exponentiation of r to q-multiples of the exponents in said set of exponents to obtain a second set of exponentiations, the computation using the first set of exponentiations and the operation of exponentiation by q; and",
                    "subcomponents": []
                },
                {
                    "component": "d) combining said first and second sets of exponentiations in accordance with said component polynomial to obtain the value of evaluation of said component polynomial.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A method according to claim 14 , wherein said finite field is F",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. A method according to claim 15 , wherein said finite field is F",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. A method according to claim 15 , wherein a set of exponentiations by odd exponents is precomputed and used for multiple basis conversions.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. A method according to claim 1 wherein said cryptographic scheme is any one of a key exchange scheme, a signature scheme, and an encryption scheme.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. A method for evaluating a first irreducible polynomial a(x) at a root r to obtain a representation a(r) of a second irreducible in a second basis, said method to be used in a cryptographic scheme for converting an element of a finite field of characteristic q, stored in a cryptographic system from a representation in a first basis defined by said first irreducible polynomial to a representation in said second basis defined by said second irreducible polynomial, said method for evaluating comprising the steps of:",
            "components": [
                {
                    "component": "a) obtaining said first irreducible polynomial a(x) and determining said root r of said second irreducible polynomial from said cryptographic system, said first irreducible polynomial representing said element of said finite field in said first basis;",
                    "subcomponents": []
                },
                {
                    "component": "b) partitioning said first irreducible polynomial a(x) into a plurality of component polynomials, such that said first irreducible polynomial a(x) is recoverable by combining said plurality of component polynomials using operations of multiplication by x and exponentiation by q, said first irreducible polynomial a(x) representing an element of a finite field of characteristic q in a first basis;",
                    "subcomponents": []
                },
                {
                    "component": "c) obtaining values of each of said component polynomials by evaluating each of said component polynomials at said root r;",
                    "subcomponents": []
                },
                {
                    "component": "d) computing the value of a second irreducible polynomial a(r) in a second basis from the values of said component polynomials at said root r using operations of multiplication by r and exponentiation by q and;",
                    "subcomponents": []
                },
                {
                    "component": "e) providing said second irreducible polynomial a(r) to said cryptographic scheme.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. A method according to claim 19 , wherein the computation of said component polynomials further comprises the steps of:",
            "components": [
                {
                    "component": "a) determining a set of exponents of x appearing in the component polynomial, such that all exponents appearing in said component polynomial are q-multiples of the exponents in said set of exponents;",
                    "subcomponents": []
                },
                {
                    "component": "b) computing the exponentiation of r to the exponents in the set of exponents to obtain a first set of exponentiations;",
                    "subcomponents": []
                },
                {
                    "component": "c) computing the exponentiation of r to q-multiples of the exponents in said set of exponents to obtain a second set of exponentiations, the computation using the first set of exponentiations and the operation of exponentiation by q; and",
                    "subcomponents": []
                },
                {
                    "component": "d) combining said first and second sets of exponentiations in accordance with said component polynomial to obtain the value of evaluation of said component polynomial.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. A method according to claim 19 wherein said cryptographic scheme is any one of a key exchange scheme, a signature scheme, and an encryption scheme.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. In a cryptographic system utilizing a first irreducible polynomial a(x) for converting an element of a finite field of characteristic q stored in said cryptographic system from a representation in a first basis defined by said first irreducible polynomial to a representation in a second basis defined by a second irreducible polynomial, the method of evaluating said first irreducible polynomial a(x) at a root r of said field to obtain a representation a(r) of said second irreducible polynomial in said second basis to be used in a cryptographic scheme comprising the steps of:",
            "components": [
                {
                    "component": "a) obtaining said first irreducible polynomial a(x) and determining said root r of said second irreducible polynomial from said cryptographic system, said first irreducible polynomial representing said element of said finite field in said first basis;",
                    "subcomponents": []
                },
                {
                    "component": "b) partitioning said first irreducible polynomial a(x) into a plurality of component polynomials, such that said first irreducible polynomial a(x) is recoverable by combining said plurality of component polynomials using operations of multiplication by x and exponentiation by q, said first irreducible polynomial a(x) representing an element of a finite field of characteristic q in a first basis;",
                    "subcomponents": []
                },
                {
                    "component": "c) obtaining values of each of said component polynomials by evaluating each of said component polynomials at said root r;",
                    "subcomponents": []
                },
                {
                    "component": "d) computing the value of a second irreducible polynomial a(r) in a second basis from the values of said component polynomials at said root r using operations of multiplication by r and exponentiation by q and;",
                    "subcomponents": []
                },
                {
                    "component": "e) providing said second irreducible polynomial a(r) to said cryptographic scheme.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. A method according to claim 22 , wherein the computation of said component polynomials further comprises the steps of:",
            "components": [
                {
                    "component": "a) determining a set of exponents of x appearing in the component polynomial, such that all exponents appearing in said component polynomial are q-multiples of the exponents in said set of exponents;",
                    "subcomponents": []
                },
                {
                    "component": "b) computing the exponentiation of r to the exponents in the set of exponents to obtain a first set of exponentiations;",
                    "subcomponents": []
                },
                {
                    "component": "c) computing the exponentiation of r to q-multiples of the exponents in the set of exponents to obtain a second set of exponentiations, the computation using the first set of exponentiations and the operation of exponentiation by q; and",
                    "subcomponents": []
                },
                {
                    "component": "d) combining said first and second sets of exponentiations in accordance with said component polynomial to obtain the value of evaluation of said component polynomial.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. A method according to claim 22 wherein said cryptographic scheme is any one of a key exchange scheme, a signature scheme, and an encryption scheme.",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation of PCT Application No. PCT/CA00/00256 filed on Mar. 13, 2000, and published as WO 00/55756 on Sep. 21, 2000; and claims priority from Canadian Patent Application No. 2,265,389 filed Mar. 12, 1999.",
        "This invention relates to the field of cryptographic systems, and conversion of elements between bases used in such systems.",
        "It is well known that there is only one finite field of any given order, but that there are many different representations. When an extension field is built by adjoining a root of an irreducible polynomial to the ground field, the choice of irreducible affects the representation of the extension field. In general if Fqm is the finite field, where q is a prime and Fq is the ground field over which it is defined, the elements of the finite field can be represented in a number of ways depending on the choice of basis. In order to interoperate, cryptographic systems employing finite fields often need to establish a common representation. In addition to the choice of irreducible polynomial, finite fields can also be represented by either polynomial or normal basis. A polynomial basis represents elements of Fqm as linear combinations of the powers of a generator element x: {x0, x1, . . . , xm−1}. A normal basis representation represents elements as linear combination of successive q-th powers of the generator element x: {xq0, xq1, . . . , xqm−1}. Each basis has its own advantages, and cryptographic implementations may prefer one or the other, or indeed specific types of irreducible polynomials, such as trinomials or pentanomials.",
        "To support secure communication between devices using different representations, basis conversion, which changes the representation used by one party into that used by another party is generally required.",
        "Basis conversion often entails the evaluation of a polynomial expression at a given finite field element. If an element a, when represented as a polynomial, is given as a(x)=Σaixi mod f(x), where f(x) is an irreducible, in one basis, then the conversion of the element a into a new representation using another irreducible polynomial requires that a be evaluated at r, where r is a root of the new irreducible polynomial in the field represented by f(x), then a(r) is the element a in the new representation. Any of the conjugates of r (the other roots of the new irreducible) will also induce equivalent, but different representations.",
        "There is a need for an efficient method for evaluating these polynomials, for application to basis conversion.",
        "In accordance with this invention there is provided a method for evaluating polynomials in an extension field comprising the steps of: partitioning the polynomials into a plurality of parts, such that each part may be computed from smaller polynomials using a q-th power operation in a field of characteristic q.",
        "In accordance with a further embodiment of the invention there is provided a method for evaluating a polynomial in an extension field comprising the steps of computing components of the q-th powers from components of smaller powers.",
        "These and other features of the preferred embodiments of the invention will become more apparent in the following detailed description in which reference is made to the appended drawings wherein:",
        "FIG. 1 is a schematic diagram illustrating an embodiment of the present invention;",
        "FIGS. 2(a) and 2(b) are schematic diagrams illustrating an embodiment of the invention;",
        "FIGS. 3(a) and (b) are schematic diagrams of further embodiments of the invention; and",
        "FIG. 4 is a schematic diagram of a three level tree according to an embodiment of the invention.",
        "In a first embodiment of the invention, we exemplify a specific case F2m of the general field Fqm, then in order to evaluate a field element a(x)=Σaixi in F2m, it is noted that approximately one half of the exponents xi are even powers. These powers can be efficiently calculated from lower degree exponents of odd powers. For example, the powers for i=2,4,6,8,10 can be calculated by squaring the powers for i=1,2,3,4,5, respectively. This approach does not apply to the odd powers, but if we partition a into even and odd powers, e.g. a(x)=aeven(x)+aodd(x), and if we factor x from the odd powers, then a will be represented by a sum of even powers and x times a sum of even powers.",
        "Explicitly,",
        "a\n          ⁡\n          \n            (\n            x\n            )\n          \n        \n        =\n        \n        ⁢\n        \n          \n            (\n            \n              \n                a\n                0\n              \n              +\n              \n                \n                  a\n                  2\n                \n                ⁢\n                \n                  x\n                  2\n                \n              \n              +\n              \n                \n                  a\n                  4\n                \n                ⁢\n                \n                  x\n                  4\n                \n              \n              +\n              …\n            \n            ⁢\n            \n              \n            \n            )\n          \n          +\n          \n            x\n            (\n            \n              \n                a\n                1\n              \n              +\n              \n                \n                  a\n                  3\n                \n                ⁢\n                \n                  x\n                  2\n                \n              \n              +\n              \n                \n                  a\n                  5\n                \n                ⁢\n                \n                  x\n                  4\n                \n              \n              +\n              …\n            \n            ⁢\n            \n              \n            \n            )\n          \n        \n      \n    \n  \n  \n    \n      \n        =\n        \n        ⁢\n        \n          \n            \n              a\n              even\n            \n            ⁡\n            \n              (\n              x\n              )\n            \n          \n          +\n          \n            \n              xa\n              even\n              ′\n            \n            ⁡\n            \n              (\n              x\n              )\n            \n          \n        \n      \n    \n  \n\n\n\n\nwhere a′even (x) is the even-powered polynomial derived by factoring x from aodd(x).",
        "In a field of characteristic 2, F2m squaring is a linear operation, which allows aeven and a′even to be expressed as squares of polynomials of smaller (roughly one half) degree. Explicitly, defining b(x)=a0+a2x+a4x2+a6x3+ . . . and c(x)=a1+a3x+a5x2+a7x3+ . . . , then a(x) can be expressed as a(x)=(b(x))2+x(c(x))2. Now b and c have approximately half the degree of the original polynomial a to be evaluated.",
        "Evaluation of b (and c) can (recursively) be made by further dividing the polynomial into odd and even parts. The odd part can be shifted to an even power by factoring out x and expressing the result as a combination of squares of lower degree polynomials. At each application of the partitioning and shifting two squaring operations and one multiplication by x are required.",
        "At some point, the recursive partitioning can be halted and the component polynomials evaluated via one or more methods.",
        "Note that although we have described the method for the extension fields over F2, similar application can be made to other characteristics if the polynomials are divided into more components. For example, for the extension held over F3, the polynomial a(x) might be divided into a(x)=a0 mod 3+a1 mod 3+a2 mod 3, where\n\na0 mod=(a0+a3x3+a6x6 . . . )a1 mod 3=(a1x+a4x4+a7x7 . . . ), and a2 mod 3=(a2x+a5x5+a8x8 . . . ).\n\nIn general, for extension fields over Fq the polynomial may be divided into q parts. Even over characteristic 2, the polynomial a might be broken up into more than 2 polynomials, at the cost of more multiplications by x or powers of x.",
        "As an example of a preferred embodiment at a given size, consider conversion of polynomial representations over F2163. An element of this field is represented by the polynomial\n\na(x)=a0+a1x+a2x2+ . . . a162x162.\n\nThe first branching divides a(x) into:",
        "a\n          ⁡\n          \n            (\n            x\n            )\n          \n        \n        =\n        \n        ⁢\n        \n          \n            \n              (\n              \n                \n                  a\n                  0\n                \n                +\n                \n                  \n                    a\n                    2\n                  \n                  ⁢\n                  x\n                \n                +\n                \n                  \n                    a\n                    4\n                  \n                  ⁢\n                  \n                    x\n                    2\n                  \n                \n                +\n                \n                  \n                    a\n                    6\n                  \n                  ⁢\n                  \n                    x\n                    3\n                  \n                \n                +\n                \n                  \n                \n                ⁢\n                …\n                +\n                \n                  \n                    a\n                    162\n                  \n                  ⁢\n                  \n                    x\n                    81\n                  \n                \n              \n              )\n            \n            2\n          \n          +\n        \n      \n    \n  \n  \n    \n      \n        \n        ⁢\n        \n          \n            x\n            ⁡\n            \n              (\n              \n                \n                  a\n                  1\n                \n                +\n                \n                  \n                    a\n                    3\n                  \n                  ⁢\n                  x\n                \n                +\n                \n                  \n                    a\n                    5\n                  \n                  ⁢\n                  \n                    x\n                    2\n                  \n                \n                +\n                \n                  \n                    a\n                    7\n                  \n                  ⁢\n                  \n                    x\n                    3\n                  \n                \n                +\n                \n                  \n                \n                ⁢\n                …\n                +\n                \n                  \n                    a\n                    161\n                  \n                  ⁢\n                  \n                    x\n                    80\n                  \n                \n              \n              )\n            \n          \n          2\n        \n      \n    \n  \n  \n    \n      \n        \n          =\n          \n          ⁢\n          \n            \n              \n                (\n                \n                  b\n                  ⁡\n                  \n                    (\n                    x\n                    )\n                  \n                \n                )\n              \n              2\n            \n            +\n            \n              \n                x\n                ⁡\n                \n                  (\n                  \n                    c\n                    ⁡\n                    \n                      (\n                      x\n                      )\n                    \n                  \n                  )\n                \n              \n              2\n            \n          \n        \n        ,\n      \n    \n  \n\n\n\n\nwhere b(x) and c(x) are each polynomials referred to as component polynomials Ci, Cj. At the next level down,",
        "b\n          ⁡\n          \n            (\n            x\n            )\n          \n        \n        =\n        \n        ⁢\n        \n          \n            \n              (\n              \n                \n                  b\n                  0\n                \n                +\n                \n                  \n                    b\n                    2\n                  \n                  ⁢\n                  x\n                \n                +\n                \n                  \n                    b\n                    4\n                  \n                  ⁢\n                  \n                    x\n                    2\n                  \n                \n                +\n                \n                  \n                    b\n                    6\n                  \n                  ⁢\n                  \n                    x\n                    3\n                  \n                \n                +\n                \n                  \n                \n                ⁢\n                …\n                +\n                \n                  \n                    b\n                    80\n                  \n                  ⁢\n                  \n                    x\n                    40\n                  \n                \n              \n              )\n            \n            2\n          \n          +\n        \n      \n    \n  \n  \n    \n      \n        \n        ⁢\n        \n          \n            x\n            ⁡\n            \n              (\n              \n                \n                  b\n                  1\n                \n                +\n                \n                  \n                    b\n                    3\n                  \n                  ⁢\n                  x\n                \n                +\n                \n                  \n                    b\n                    5\n                  \n                  ⁢\n                  \n                    x\n                    2\n                  \n                \n                +\n                \n                  \n                    b\n                    7\n                  \n                  ⁢\n                  \n                    x\n                    3\n                  \n                \n                +\n                \n                  \n                \n                ⁢\n                …\n                +\n                \n                  \n                    b\n                    81\n                  \n                  ⁢\n                  \n                    x\n                    40\n                  \n                \n              \n              )\n            \n          \n          2\n        \n      \n    \n  \n  \n    \n      \n        =\n        \n        ⁢\n        \n          \n            \n              (\n              \n                d\n                ⁡\n                \n                  (\n                  x\n                  )\n                \n              \n              )\n            \n            2\n          \n          +\n          \n            \n              \n                x\n                ⁡\n                \n                  (\n                  \n                    e\n                    ⁡\n                    \n                      (\n                      x\n                      )\n                    \n                  \n                  )\n                \n              \n              2\n            \n            .\n          \n        \n      \n    \n  \n\n\n\n\nThe polynomial c(x) is partitioned in a similar way.\n\nAs mentioned above, the partitioning of polynomials into parts may be halted and the resulting component polynomials evaluated at a root by using any one of several known methods. The positions at which the partitioning stops may be denoted as the leaves of the evaluation tree. The component polynomials at the leaves may be evaluated either directly, or with Horner's rule. However, current methods do not exploit a property of finite fields of characteristic q, wherein taking the q-th powers is usually an efficient operation.",
        "An exemplary method will now be described for efficiently evaluating a component polynomial for extension fields over F2.",
        "At the leaf, a component polynomial a(x)=Σaixi must be evaluated at a root of a new irreducible. Again, approximately one half of these terms will be even and can be calculated efficiently from odd powers. These odd powers will either be stored, for explicit basis conversion, or calculated explicitly by multiplication. If, for example a(x) is guaranteed to be of degree not greater than 10 (which may be the case if certain evaluation tree depths are employed), then a(x) can be evaluated from the powers 1,3,5,7,9, which are either stored or calculated. Squarings can be reduced by grouping coefficients together. This is shown schematically in FIG. 2(a) where a notional table is constructed to show the relationship between the stored or evaluated odd powers of r and the higher degree even powers of r. Thus, consider the first row in which r2, r4 and r8 are derived by squaring r1, similarly, r6 is derived by squaring r3 and r10 is derived by squaring r5. It is to be noted that in this example, powers of 2 are used.",
        "Turning back to FIG. 2(a), however, the notional table may be used as shown schematically in FIG. 2(b). Thus, assume an accumulator is set initially to 0. Since we are using an extension field over F2 the coefficients ai are either 0 or 1. First, if a8 is 1, then r1 is added to the accumulator, which consists of a copying operation in a processor. Next, the accumulator is squared. Next, if a4 is 1, then r1 is added into the accumulator. Again, the accumulator is squared. Now, if a2, a6, a10 are one (1) then r1, r3, r5 are added into the accumulator respectively. Again, the accumulator is squared. Finally, if a0, a1, a3, a5, a7, a9 are set (1), then r0, r1, r3, r5, r7, r9 are added into the accumulator. This completes the evaluation o a(x) at r, requiring three squares and the initial evaluation of r0,r1,r3,r5,r7,r9, which can be reused at another leaf evaluation.",
        "It will be apparent to those skilled in the art that the precomputed values technique can equally well be applied to multiplication techniques.",
        "For polynomials of larger degrees, similar evaluations can be made from evaluation of odd powers. First, the coefficients of those exponents with the largest powers of 2 are added into the accumulator according to whether the polynomial to be evaluated has non-zero coefficients at those powers, then the result is squared. Next, powers divisible by one less power of 2 are added in as required by polynomial evaluation. Accumulation and squaring continues until the odd powers themselves are added in as required by the polynomial under evaluation.",
        "In FIGS. 3(a) and 3(b), a similar evaluation is exemplified for an extension field over F3 and for a polynomial of degree no greater than 17. Note that in this embodiment, the coefficients ai may take a value 0, 1, or 2. Thus, the powers are added with the required coefficients. In general then, for an extension field over Fq, powers of q are used to construct the notional table and evaluation of the polynomial proceeds by accumulation and q powering until all required powers in the polynomial are added in as required by the polynomial being evaluated.",
        "An application of the above method to basis conversion may be illustrated as below. Given a field F231 and a pair of bases having respective irreducible f1 and f2 and if f1=x31+x6+1; and f2=x31+x3+1. Then, a root of f1 in the field represented by f2 is given by r=x26+x24+x23+x22+x19+x17+x12+x11+x9+x8+x6+x5+x3+x2. Now, to convert an element a(x)=af1 in the first basis to a representation in the second basis af2 (that is to basis defined by f2) we proceed as follows. Let",
        "a\n    ⁡\n    \n      (\n      x\n      )\n    \n  \n  =\n  \n    \n      ∑\n      \n        i\n        =\n        0\n      \n      30\n    \n    ⁢\n    \n      \n    \n    ⁢\n    \n      \n        a\n        i\n      \n      ⁢\n      \n        x\n        i\n      \n    \n  \n\n\n\n\nin general. For this example, we choose a specific element:\n\na(x)=x30+x29+x28+x27+x25+x22+x20+x19+x14+x13+x12+x11+x10+x8+x7+x6+x3+x0",
        "We assume a three level evaluation tree which is constructed in accordance with the present invention as shown in FIG. 4. At the bottom level of the tree (the leaf nodes), we require the following powers of r: r0, r1, r2 . . . r7. The odd powers are calculated r1, r3, r5, and r7 (by squaring r and 3 multiplications by r2).",
        "When a above is decomposed in the tree, the leaf nodes are:\n\nL0=(r7+r5+r3+r2+1)2\n\nL1=r(r7+r5+r3+r2+r)2\n\nL2=(r7+r3)2\n\nL3=r(r6+r5+r4+r2+r+1)2\n\nTo evaluate the leaf node L0, we will evaluate the component polynomial, then square it and, when appropriate, further multiply its value by r to obtain the value of the leaf node:\n\n    0) zero A\n    1) add r1 to A, square A, now A=r2 \n    2) add in r0, r3, r5, r7 to A\n    3) square A=L0 \n\nFor L1, we will\n\n    0) zero A\n    1) add r1 to A\n    2) square A\n    3) add r1, r3, r5, r7, to A\n    4) square A\n    5) multiply A by r=L1\n\nfor L2 \n\n    0) zero A\n    1) add in r3, r7 \n    2) square A=L2 \n\nfor L3 \n\n    0) zero A\n    1) add in r1 \n    2) square A=r2 \n    3) add in r1, r3 \n    4) square A=r6+r4+r2 \n    5) add in r0, r1, r5 \n    \n        A=r6+r5+r4+r2+r+1\n    \n    \n    6) square A\n    7) multiply A by r=L3 \n\nNow a(r) is built by evaluating the tree M0=(L0+L1)2, M1=r(L2+L3)2. Finally, a(r)=T0=M0+M1.",
        "Thus, it may be seen that his method may be applied to various cryptographic schemes such as key exchange schemes, signature schemes and encryption schemes.",
        "Although the invention has been described with reference to certain specific embodiments, various modifications thereof will be apparent to those skilled in the art without departing from the spirit and scope of the invention as outlined in the claims appended hereto. For example, the invention may be applied to basis conversion wherein the bases to be converted between are an optimal normal basis and a polynomial basis."
    ],
    "citations": [
        "4031370",
        "4417338",
        "4847801",
        "4866716",
        "5485474",
        "5761102",
        "6192497",
        "6895422",
        "0 806 838"
    ],
    "us_classification": "708492",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "06",
            "subclass": "F",
            "main_group": "15",
            "subgroup": "00"
        }
    ]
}