{
    "title": "Photoiniators having triarylsulfonium and arylsulfinate ions",
    "abstract": "Compositions are provided that include a photoinitiator system for free radical polymerization reactions. More specifically, the photoinitiator includes an arylsulfinate ion and a triarylsulfonium ion. Polymerization methods are also provided those include the photoinitiator in a photopolymerizable composition. Additionally, triarylsulfonium arylsulfinate salts are disclosed.",
    "inventors": [
        "Kalgutkar"
    ],
    "document_number": "07297724",
    "publication_date": "20071120",
    "assignees": [
        "3M Innovative Properties Company"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of photopolymerization comprising irradiating a photopolymerizable composition with actinic radiation until the photopolymerizable composition gels or hardens, said photopolymerizable composition comprising:",
            "components": [
                {
                    "component": "an ethylenically on saturated monomer;",
                    "subcomponents": []
                },
                {
                    "component": "an arylsulfinate salt having an anion of Formula I",
                    "subcomponents": [
                        ""
                    ]
                },
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , wherein the actinic radiation is in the range of 250 to 1000 nanometers.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , wherein the actinic radiation is in the range of 250 to 850 nanometers.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 , wherein the arylsulfinate salt has an anion that is a benzenesulfinate substituted with an electron withdrawing group selected front halo, cyano, fluoroalkyl, perfluoroalkyl, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkysulfonyl, alkylsulfonyl, azo, alkenyl,alkynyl, dialkylphosphonato, diarylphosphonato, aminocarbonyl, or combinations thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 , wherein the Ar",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein the cation of the arylsulfinate salt is of Formula II",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , wherein the arylsulfinate salt has a cation that is a tetralkylammonium ion, wherein each alkyl group has 4 to 30 carbon atoms.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 1 , wherein the cation of the arylsulfinate salt is of Formula III",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 1 wherein the cation of the arylsulfinate salt is a ring structure comprising a 4 to 12 member heterocyclic group having a positively charged nitrogen atom, said heterocyclic being saturated or unsaturated and having up to 3 heteroatoms selected from oxygen, sulfur, nitrogen, or combinations thereof, wherein said ring structure is unsubstituted or substituted with a substituent selected from an alkyl, aryl, acyl, alkoxy, aryloxy, halo, mercapto, amino, hydroxy, azo, cyano, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, or combinations thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 1 , wherein the triarylsulfonium salt has a cation according to Formula V",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 1 , wherein the triarylsulfonium salt has a cation selected from",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 1 , wherein the triarylsufomium salt has a cation that is triphenylsulfonium, diphenylmaphthylsulfonium, tritolysulfonium, anisyldiphenylsulfonuim, 4-butoxyphenyldipenylsulfonium, 4-tert-butylphenyldiphenylsulfonuim, 4-chlorophenyldiphenylsulfonuim, tris(4-phenoxyphenyl)sulfonuim, 4-acetonylphenyldiphenylsulfonium, or tris(4-thiomethoxyphenyl)sulfonuim, or 4-acetamidophenyldiphenylsulfonium.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 1 , wherein the triarylsulfonium salt has an anion that is selected from AsF",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A method of photopolymerization comprising irradiating a photopolymerizable composition with actinic radiation until the photopolymerizable composition gels or hardens, said photopolymerizable composition comprising:",
            "components": [
                {
                    "component": "an ethylenically unsaturated monomer;",
                    "subcomponents": []
                },
                {
                    "component": "an arylsulfinate triarylsulfonium salt having an anion of Formula I",
                    "subcomponents": [
                        ""
                    ]
                },
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method or claim 14 , wherein the triarylsulfonium arylsulfinate salt has a cation according to Formula V",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 14 , wherein the cation of the triarylsulfonium arylsulfinate is selected from",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 14 , wherein the cation of the triarysulfonium arylsulfinate salt is triphenylsulfonium, diphenylnaphthylsulonium, tritolysulfonium, anisyldiphenylsulfonium, 4-butoxyphenyldipenylsulfonium, 4-tert-butylphenyldiphenylsulfonium, 4-chlorophenyldiphenylsulfonium, tris(4-phenoxyphenyl) sulfonium, 4-acetonylphenyldiphenylsulfonium, or tris(4-thiomethoxyphenyl)sulfonium, or 4-acetamidophenyldiphenylsulfonium.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 14 , wherein the triarylsulfonium arylsulfinate salt has an anion that is a beuzenesulfinate substituted with an electron withdrawing group selected from halo, cyano, fluoroakyl, perfluoroalky, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsufonyl, azo, alkenyl, alkynyl, dialkylphosphonato, aminocarbonyl, or combinations thereof.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 14 , wherein the Ar",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method of claim 14 , wherein the actinic radiation is in the range of 250 to 1000 nanometers.",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation of application Ser. No. 10/672,554 filed on Sep. 26, 2003 now U.S. Pat. No. 7,026,367, incorporated herein by reference.",
        "Photoinitiators for free radical polymerization reactions are provided that include triarylsulfonium ions and arylsulfinate ions.",
        "Free radical polymerization reactions can be photoinitiated. The photoinitiator system can be based on various chemical approaches. For example, free radical polymerization reactions can be photoinitiated using a three-component photoinitiator system that includes an electron acceptor, an electron donor, and a sensitizing compound. The sensitizing compound usually absorbs actinic radiation resulting in the formation of an excited sensitizing compound. The electron donor can donate an electron to the excited sensitizing compound. That is, the sensitizing compound is reduced and the electron donor is oxidized. The reduced sensitizing compound is a radical anion that can donate an electron to an electron acceptor to yield an initiating free radical for the polymerization reaction. The initiating free radical is the reduced electron acceptor. In some instances of a three-component photoinitiator system, the oxidized electron donor is a radical species that also can function as an initiating free radical.",
        "Other photoinitiator systems include a sensitizing compound and an electron donor but no electron acceptor. The sensitizing compound is usually an organic dye, an organic pigment, or an inorganic pigment. The sensitizing compound can absorb actinic radiation to form an exited sensitizing compound. The electron donor typically donates an electron to the excited sensitizing compound resulting in the oxidation of the electron donor. The oxidized electron donor is a radical species that functions as an initiating free radical for polymerization reactions.",
        "In other free radical photopolymerization reactions, a salt such as a triarylsulfonium salt can generate an initiating free radical. Triarylsulfonium salts typically absorb ultraviolet radiation to form an excited triarylsulfonium ion. The excited triarylsulfonium ion can then photodegrade, abstract a hydrogen atom from another species present in the composition, and ultimately form a radical that can function as an initiating free radical for a polymerization reaction.",
        "Compositions are provided that include a photoinitiator system for free radical polymerization reactions. More specifically, the photoinitiator includes an arylsulfinate ion and a triarylsulfonium ion. Polymerization methods are also provided that include the photoinitiator in a photopolymerizable composition. Additionally, triarylsulfonium arylsulfinate salts are disclosed.",
        "One aspect of the invention provides a composition that includes an arylsulfinate salt and a triarylsulfonium salt. The arylsulfinate salt has an anion of Formula I\n\nAr1—SO2−  I\n\nand a cation having at least one carbon atom and either a positively charged nitrogen atom or a positively charged phosphorus atom. The Ar1 group in Formula I is a substituted phenyl, an unsubstituted or substituted C7-30 aryl, or an unsubstituted or substituted C3-30 heteroaryl. A substituted Ar1 group can have a substituent that is an electron withdrawing group or an electron withdrawing group in combination with an electron donating group.",
        "A second aspect of the invention provides a composition that includes an ethylenically unsaturated monomer and a triarylsulfonium arylsulfinate salt. The triarylsulfonium arylsulfinate salt has an anion of Formula I\n\nAr1—SO2−  I\n\nwhere Ar1 is a substituted phenyl, an unsubstituted or substituted C7-30 aryl, or an unsubstituted or substituted C3-30 heteroaryl. A substituted Ar1 group can have a substituent that is an electron withdrawing group or an electron withdrawing group in combination with an electron donating group.",
        "A third aspect of the invention provides a method of photopolymerization that includes irradiating a photopolymerizable composition with actinic radiation until the photopolymerizable composition gels or hardens. The photopolymerizable composition includes ethylenically unsaturated monomers, an arylsulfinate salt, and a triarylsulfonium salt.",
        "A fourth aspect of the invention provides a method of photopolymerization that includes irradiating a photopolymerizable composition with actinic radiation until the photopolymerizable composition gels or hardens. The photopolymerizable composition includes ethylenically unsaturated monomers and a triarylsulfonium arylsulfinate salt.",
        "A fifth aspect of the invention provides a triarylsulfonium arylsulfinate salt.",
        "The above summary is not intended to describe each disclosed embodiment or every implementation of the present invention. The detailed description section that follows more particularly exemplifies these embodiments.",
        "Compositions are provided that include a photoinitiator system for free radical polymerization reactions. More specifically, the photoinitiator includes an arylsulfinate ion and a triarylsulfonium ion. Polymerization methods are also provided for preparing a polymeric material using a free radical polymerization reaction. The polymerization reaction is photoinitiated. Additionally, triarylsulfonium arylsulfinate salts are disclosed.",
        "Definitions",
        "As used herein, the terms “a”, “an”, and “the” are used interchangeably with “at least one” to mean one or more of the elements being described.",
        "As used herein, the term “acyl” refers to a monovalent group of formula —(CO)Ra where Ra is an alkyl or aryl group.",
        "As used herein, the term “actinic radiation” refers to electromagnetic radiation capable of producing photochemical activity.",
        "As used herein, the term “alkenyl” refers to a monovalent radical of an alkene (i.e., an alkene is an aliphatic compound having at least one carbon-carbon double bond).",
        "As used herein, the term “alkoxy” refers to a group of monovalent formula —OR where R is an alkyl group.",
        "As used herein, the term “alkoxycarbonyl” refers to a monovalent group of formula —(CO)OR where R is an alkyl group.",
        "As used herein, the term “alkoxycarbonyloxy” refers to a monovalent group of formula —O(CO)OR where R is an alkyl group.",
        "As used herein, the term “alkoxysulfonyl” refers to a monovalent group having the formula —SO3R where R is an alkyl group.",
        "As used herein, the term “alkyl” refers to a monovalent radical of an alkane. The alkyl can be linear, branched, cyclic, or combinations thereof and typically contains 1 to 30 carbon atoms. In some embodiments, the alkyl group contains 1 to 20, 1 to 14, 1 to 10, 4 to 10, 4 to 8, or 1 to 4 carbon atoms. Examples of alkyl groups include, but are not limited to, methyl, ethyl, n-propyl, isopropyl, n-butyl, isobutyl, tert-butyl, n-octyl, n-heptyl, n-hexyl, cyclohexyl, ethylhexyl, and the like.",
        "As used herein, the term “alkylcarbonylamido” refers to a monovalent group of formula —NRb(CO)R where R is an alkyl and Rb is a hydrogen, alkyl, or aryl group.",
        "As used herein, the term “alkylcarbonyloxy” refers to a monovalent group of formula —O(CO)R where R is an alkyl.",
        "As used herein, the term “alkylsulfonamido” refers to a monovalent group of formula —NRbSO2R where R is an alkyl and Rb is a hydrogen, alkyl, or aryl group.",
        "As used herein, the term “alkynyl” refers to a monovalent radical of an alkyne (i.e., an alkyne is an aliphatic compound having at least one carbon-carbon triple bond).",
        "As used herein, the term “alkylsulfonyl” refers to a monovalent group of formula —SO2R where R is an alkyl group.",
        "As used herein, the term “alkylthio” refers to a monovalent group of formula —SR where S is sulfur and R is an alkyl.",
        "As used herein, the term “amino” refers to a monovalent group of formula —N(Rb)2 where each Rb is independently hydrogen, alkyl, or aryl group. In a primary amino group, each Rb group is hydrogen. In a secondary amino group, one of the Rb groups is hydrogen and the other Rb group is either an alkyl or aryl. In a tertiary amino group, both of the Rb groups are an alkyl or aryl.",
        "As used herein, the term “aminocarbonyl” refers to a monovalent group of formula —(CO)N(Rb)2 where each Rb is independently hydrogen, alkyl, or aryl.",
        "As used herein, the term “aralkyl” refers to a monovalent group of formula —RAr where Ar is an aryl group and R is an alkylene.",
        "As used herein, the term “aromatic” refers to both carbocyclic aromatic compounds or groups and heteroaromatic compounds or groups. A carbocyclic aromatic compound is a compound that contains only carbon atoms in an aromatic ring structure. A heteroaromatic compound is a compound that contains at least one heteroatom selected from S, O, N, or combinations thereof in an aromatic ring structure.",
        "As used herein, the term “aryl” refers to a monovalent aromatic carbocyclic radical. The aryl can have one aromatic ring or can include up to 5 ring structures that are connected to or fused to the aromatic ring. The other ring structures can be aromatic, non-aromatic, or combinations thereof. Examples of aryl groups include, but are not limited to, phenyl, biphenyl, terphenyl, anthryl, naphthyl, acenaphthyl, anthraquinonyl, phenanthryl, anthracenyl, pyrenyl, perylenyl, and fluorenyl.",
        "As used herein, the term “arylcarbonylamido” refers to a monovalent group of formula —NRb(CO)Ar where Rb is hydrogen, alkyl, or aryl and Ar is an aryl.",
        "As used herein, the term “arylcarbonyloxy refers to a monovalent group of formula —O(CO)Ar where Ar is an aryl group.",
        "As used herein, the term “aryloxy” refers to a monovalent group of formula —OAr where Ar is an aryl group.",
        "As used herein, the term “aryloxycarbonyl” refers to a monovalent group of formula —(CO)OAr where Ar is an aryl group.",
        "As used herein, the term “aryloxycarbonyloxy” refers to a monovalent group of formula —O(CO)OAr where Ar is an aryl group.",
        "As used herein, the term “aryloxysulfonyl” refers to a monovalent group having the formula —SO3Ar where Ar is an aryl group.",
        "As used herein, the term “arylsulfonyl” refers to a monovalent group having the formula —SO2Ar where Ar is an aryl group.",
        "As used herein, the term “arylthio” refers to a monovalent group having the formula —SAr where Ar is an aryl group.",
        "As used herein, the term “azo” refers to a divalent group of formula —N═N—.",
        "As used herein, the term “boryl” refers to a monovalent group of formula —B(Ar)2 where B is boron and Ar is an aryl group.",
        "As used herein, the term “carbonyl” refers to a divalent group of formula —(CO)— where the carbon atom is connected to the oxygen atom by a double bond.",
        "As used herein, the term “carboxy” refers to a monovalent group of formula —COOH.",
        "As used herein, the term “conjugated” refers to unsaturated compounds having at least two carbon-carbon double or triple bonds with alternating carbon-carbon single bonds and carbon-carbon double or triple bonds.",
        "As used herein, the term “cyano” refers to a monovalent group of formula —CN.",
        "As used herein, the term “dialkylphosphonato” refers to a monovalent group of formula —(PO)(OR)2 where R is an alkyl. As used herein the formula “(PO)” indicates that the phosphorus atom is attached to an oxygen atom with a double bond.",
        "As used herein, the term “diarylphosphonato” refers to a monovalent group of formula —(PO)(OAr)2 where Ar is a aryl.",
        "As used herein, the term “diarylstibino” refers to a monovalent group of formula —Sb(Ar)2 where Ar is an aryl group.",
        "As used herein, the term “diarylarsino” refers to a monovalent group of formula —As(Ar)2 where Ar is an aryl group.",
        "As used herein, the term “electron donating” refers to a substituent that can donate electrons. Suitable examples include, but are not limited to, a primary amino, secondary amino, tertiary amino, hydroxy, alkoxy, aryloxy, alkyl, or combinations thereof.",
        "As used herein, the term “electron withdrawing” refers to a substituent that can withdraw electrons. Suitable examples include, but are not limited to, a halo, cyano, fluoroalkyl, perfluoroalkyl, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, aminocarbonyl, or combinations thereof.",
        "As used herein, the term “fluoroalkyl” refers to an alkyl group that has at least one hydrogen atom replaced with a fluorine atom.",
        "As used herein, the term “formyl” refers to a monovalent group of formula —(CO)H where the carbon is attached to the oxygen atom with a double bond.",
        "As used herein, the term “halo” refers to a halogen group (i.e., F, Cl, Br, or I). In some embodiments, the halo group is F or Cl.",
        "As used herein, the term “halocarbonyl” refers to a monovalent group of formula —(CO)X where X is a halogen group (i.e., F, Cl, Br, or I).",
        "As used herein, the term “heteroaryl” refers to a monovalent radical of a five to seven member aromatic ring that includes one or more heteroatoms independently selected from S, O, N, or combinations thereof in the ring. Such a heteroaryl ring can be connected to or fused to up to five ring structures that are aromatic, aliphatic, or combinations thereof. Examples of heteroaryl groups include, but are not limited to, quinolinyl, isoquinolinyl, quinazolinyl, quinoxalinyl, cinnolinyl, benzofuranyl, benzomercaptophenyl, benzoxazolyl, benzothiazolyl, benzimidazolyl, indolyl, phthalazinyl, benzothiadiazolyl, benzotriazinyl, phenazinyl, phenanthridinyl, acridinyl, and indazolyl, and the like.",
        "As used herein, the term “heterocyclic” refers to a monovalent radical having a ring structure that is saturated or unsaturated and that includes one or more heteroatoms independently selected from S, O, N, or combinations thereof in the ring. The heterocyclic group can be a single ring, bicyclic, or can be fused to another cyclic or bicyclic group. The fused cyclic or bicyclic group can be saturated or unsaturated and can be carbocyclic or contain heteroatoms.",
        "As used herein, the term “hydroxy” refers to a monovalent group of formula —OH.",
        "As used herein, the term “imino” refers to a divalent group of formula —N(Rb)— where Rb is hydrogen, alkyl, or aryl.",
        "As used herein, the term “mercapto” refers to a monovalent group of formula —SH.",
        "As used herein, the term “methylene” refers to a divalent group of formula —C(Rb)2— where each Rb is independently a hydrogen, alkyl, or aryl.",
        "As used herein, the term “N-alkylaminocarbonyl” refers to a monovalent group of formula —(CO)NRdR where Rd is an alkyl or hydrogen and R is an alkyl.",
        "As used herein, the term “N-alkylsulfamyl” refers to a monovalent group of formula —SO2NRdR where Rd is an alkyl or hydrogen and R is an alkyl.",
        "As used herein, the term “N-arylaminocarbonyl” refers to a monovalent group of formula —(CO)NRcAr where Rc is an aryl or hydrogen and Ar is an aryl.",
        "As used herein, the term “N-arylsulfamyl” refers to a monovalent group of formula —SO2NRcAr where Rc is an alkyl or hydrogen and Ar is aryl.",
        "As used herein, the term “oxo” refers to a divalent group of formula —O—.",
        "As used herein, the term “perfluoroalkyl” refers to an alkyl group that has all the hydrogen atoms replaced with fluorine atoms. A perfluoroalkyl is a subset of a fluoroalkyl.",
        "As used herein, the term “perfluoroalkylsulfonyl” refers to a group of formula —SO2Rf where Rf is a perfluoroalkyl.",
        "As used herein, the term “polymerization” refers to forming a higher weight material from monomer or oligomers. The polymerization reaction also can involve a cross-linking reaction.",
        "As used herein when referring to a composition containing an initiator system and photopolymerizable material, the term “stable” means that the composition can be stored for at least one day without any visible gel formation at room temperature.",
        "As used herein when referring to a compound, the term “stability” refers to the length of time needed to oxidize 50 weight percent of the compound (t1/2) at room temperature (i.e., 20° C. to 25° C.) which can be calculated using pseudo-first order kinetics as described in K. A. Connors, Chemical Kinetics: The Study of Reaction Rates in Solution, Chapter 2, VCH, New York, 1990.",
        "As used herein, the term “sulfinyl” refers to a divalent group having the formula —(SO)—.",
        "As used herein, the term “sulfonyl” refers to a divalent group having the formula —SO2—.",
        "As used herein, the term “sulfo” refers to a monovalent group having the formula —SO3H.",
        "As used herein, the term “thio” refers to a divalent group of formula —S—.",
        "As used herein, the term “trialkylgermano” refers to a group having the formula —Ge(Ar)2 where Ar is an aryl group.",
        "As used herein, the term “trialkylsiloxy” refers to a monovalent group of formula —OSiR3 where R is an alkyl.",
        "Composition",
        "Triarylsulfonium salts, in the absence of a sensitizing compound, typically cannot generate an initiating free radical for polymerization reactions when exposed to visible radiation. A photoinitiator system that can be activated using visible radiation is desirable for some applications. Visible light sources are typically less expensive and less hazardous than ultraviolet light sources. Additionally, compared to ultraviolet radiation, visible radiation can typically transmit more readily through various substrates such as polymeric materials.",
        "One aspect of the invention provides compositions that include an arylsulfinate salt and a triarylsulfonium salt. The compositions can function as a photoinitiator system for free radical polymerization reactions. Although not intending to be bound by theory, it is believed that the arylsulfinate salt can absorb actinic radiation to form an excited arylsulfinate salt. The excited arylsulfinate salt can transfer an electron to the triarylsulfonium salt resulting in the formation of an arylsulfinate radical. The arylsulfinate radical can initiate free radical polymerization reactions. In some instances, the reduced triarylsulfonium salt can photodegrade to produce other initiating free radicals.",
        "One component of the composition is an arylsulfinate salt. The arylsulfinate salt has an anion of Formula I\n\nAr1—SO2−  I\n\nand a cation that contains at least one carbon atom and either a positively charged nitrogen atom or a positively charged phosphorus atom. The Ar1 group in Formula I is a substituted phenyl, an unsubstituted or substituted C7-30 aryl, or an unsubstituted or substituted C3-30 heteroaryl. A substituted Ar1 group can have a substituent that is an electron withdrawing group or an electron withdrawing group in combination with an electron donating group.",
        "The arylsulfinate salt is typically soluble in monomers capable of undergoing free radical polymerization reactions and in a variety of non-polar and polar solvents. As used herein, the term “soluble” refers to a compound that can be dissolved in an amount at least equal to 0.05 moles/liter, at least equal to 0.07 moles/liter, at least equal to 0.08 moles/liter, at least equal to 0.09 moles/liter, or at least equal to 0.1 moles/liter in a given material such as a solvent or monomer.",
        "In some arylsulfinate salts, the Ar1 group is a substituted phenyl or an unsubstituted or substituted C7-30 aryl group having a carbocyclic aromatic ring. The aryl group can have a single carbocyclic aromatic ring or can have additional carbocylic rings that are fused or connected to a carbocyclic aromatic ring. Any fused or connected rings can be saturated or unsaturated. The aryl often contains up to 5 rings, up to 4 rings, up to 3 rings, up to 2 rings, or one ring. The aryl group usually has up to 30 carbon atoms, up to 24 carbon atoms, up to 18 carbon atoms, up to 12 carbon atoms, or 6 carbon atoms. Examples of aryl groups having a single ring or multiple fused rings include, but are not limited to, phenyl, anthryl, naphthyl, acenaphthyl, phenanthryl, phenanthrenyl, perylenyl, and anthracenyl. A single bond, methylene group (i.e., —C(Rb)2— where each Rb is independently hydrogen, alkyl, or aryl), carbonyl group (i.e., —(CO)—), or combinations thereof can connect multiple rings. Examples of aryl groups having multiple connected rings include, but are not limited to, anthraquinonyl, anthronyl, biphenyl, terphenyl, 9,10-dihydroanthracenyl, and fluorenyl.",
        "In other arylsulfinate salts, the Ar1 group in Formula I can be an unsubstituted or substituted heteroaryl that has a five to seven member aromatic ring that includes one or more heteroatoms independently selected from S, O, N, or combinations thereof in the ring. The heteroaryl can have a single ring or can have multiple rings connected or fused together. Any additional connected or fused rings can be carbocyclic or contain a heteroatom and can be saturated or unsaturated. The heteroaryl group often has up to 5 rings, up to 4 rings, up to 3 rings, up to 2 rings, or one ring. The heteroaryl typically contains up to 30 carbon atoms. In some embodiments, the heteroaryl contains up to 20 carbon atoms, up to 10 carbon atoms, or up to 5 carbon atoms. Examples of heteroaryl groups include, but are not limited to, quinolinyl, isoquinolinyl, quinazolinyl, quinoxalinyl, cinnolinyl, benzofuranyl, benzomercaptophenyl, benzoxazolyl, benzothiazolyl, benzimidazolyl, indolyl, phthalazinyl, benzothiadiazolyl, benzotriazinyl, phenazinyl, phenanthridinyl, acridinyl, azaphenanthrenyl, and indazolyl.",
        "The Ar1 group in Formula I, in some embodiments, can be unsubstituted with an electron withdrawing group or an electron withdrawing group in combination with an electron donating group. Electron donating groups can be selected, for example, from a primary amino, secondary amino, tertiary amino, hydroxy, alkoxy, aryloxy, alkyl, or combinations thereof. Electron withdrawing groups can be selected, for example, from a halo, cyano, fluoroalkyl, perfluoroalkyl, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, aminocarbonyl, or combinations thereof.",
        "In some embodiments, the Ar1 group includes an electron withdrawing group that is conjugated to the sulfinate group. For example, the Ar1 group can be a phenyl substituted with an electron withdrawing group selected from halo, cyano, fluoroalkyl, perfluoroalkyl, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, aminocarbonyl, or combinations thereof. In some arylsulfinate anions, the electron withdrawing group is selected from cyano, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, aminocarbonyl, or combinations thereof. In other arylsulfinate anions, the electron withdrawing group is a halo group. In still other embodiments, the Ar1 group substituents include an electron withdrawing group in addition to an electron donating group. For example, the Ar1 group substituents can include an alkyl and an electron withdrawing group.",
        "Specific examples of the arylsulfinate anion of Formula I include, but are not limited to, 4-chlorobenzenesulfinate, 4-cyanobenzenesulfinate, 4-ethoxycarbonylbenzenesulfinate, trifluoromethylbenzenesulfinate, 3-trifluoromethylbenzenesulfinate, 1-naphthalenesulfinate, 2-naphthalenesulfinate, and 1-anthraquinonesulfinate.",
        "The arylsulfinate salts have a cation with at least one carbon atom and either a positively charged nitrogen atom or a positively charged phosphorus atom. In some embodiments, the cation of the arylsulfinate salt is of Formula II",
        "where R1 is an alkyl or aryl and each R4 is independently hydrogen, alkyl, or aryl. The R1 and R4 groups can be unsubstituted or substituted. An alkyl group can be substituted with a hydroxy. An aryl can be substituted with an alkyl, hydroxy, or combinations thereof.",
        "In some examples of Formula II, R1 and each R4 group are independently a C2-30 alkyl that is unsubstituted or substituted with a hydroxy. For example, R1 and each R4 independently can be an alkyl group having up to 20, up to 10, up to 8, up to 6, or up to 4 carbon atoms. The alkyl group often has at least 2, at least 3, at least 4, at least 6, or at least 8 carbon atoms. The alkyl group can have 4 to 30, 8 to 30, 3 to 10, 4 to 10, 4 to 8, or 4 to 6 carbon atoms in some compounds. In a specific example, the cation of the arylsulfinate salt is a tetrabutylammonium ion.",
        "In other examples of Formula II, R1 and two R4 groups are each independently a C2-30 alkyl that can be unsubstituted or substituted with a hydroxy. The remaining R4 group is hydrogen. In still other examples, R1 and one R4 group are each independently a C4-30 alkyl that is unsubstituted or substituted with a hydroxy; and the two remaining R4 groups are hydrogen. In yet other examples, R1 is a C8-30 alkyl that is unsubstituted or substituted with a hydroxy; and the R4 groups are hydrogen.",
        "The R1 group and each of the R4 groups in Formula II independently can be an aryl group that is unsubstituted or substituted with an alkyl or hydroxy. An exemplary cation is tetraphenylammonium ion. In another example, R1 and one R4 independently are an aryl group that is unsubstituted or substituted with an alkyl or hydroxy; and the two remaining R4 groups are hydrogen. An exemplary cation is diphenylammonium ion.",
        "In other embodiments, the cation of the arylsulfinate salt is a ring structure that includes a four to twelve member heterocyclic group with a positively charged nitrogen atom. The heterocyclic group can be saturated or unsaturated and can contain up to three heteroatoms selected from nitrogen, oxygen, sulfur, or combinations thereof (i.e., there is one positively charged nitrogen atom and up to two other heteroatoms selected from nitrogen, oxygen, sulfur, or combinations thereof). The ring structure can be unsubstituted or have a substituent selected from an alkyl, aryl, acyl, alkoxy, aryloxy, halo, mercapto, amino, hydroxy, azo, cyano, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, or combinations thereof.",
        "The heterocyclic group in the cationic ring structure can be a single ring, bicyclic, or can be fused to another cyclic or bicyclic group. The fused cyclic or bicyclic group can be saturated or unsaturated and can have 0 to 3 heteroatoms. The ring structure can include up to 30 carbon atoms, up to 24 carbon atoms, up to 18 carbon atoms, up to 12 carbon atoms, up to 6 carbon atoms, or up to 4 carbon atoms and up to 6 heteroatoms, up to 4 heteroatoms, up to 2 heteroatoms, or 1 heteroatom. In some embodiments, the ring structure is a 4 to 12 member heterocyclic group that is a fused to an aromatic ring having 0 to 3 heteroatoms.",
        "Suitable examples of five member heterocyclic groups that contain a positively charged nitrogen atom include, but are not limited to, a pyrrolium ion, pyrazolium ion, pyrrolidinium ion, imidazolium ion, triazolium ion, isoxazolium ion, oxazolium ion, thiazolium ion, isothiazolium ion, oxadiazolium ion, oxatriazolium ion, dioxazolium ion, and oxathiazolium ion. These ions can be unsubstituted or substituted with an alkyl, aryl, acyl, alkoxy, aryloxy, halo, mercapto, amino, hydroxy, azo, cyano, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, or combinations thereof. In some applications, the cation is an imidazolium ion or oxazolium ion that is unsubstituted or substituted.",
        "The five member heterocyclic groups can be fused to another cyclic group. In some exemplary ring structures, a five membered heterocyclic group is fused to an aromatic group. Exemplary ring structures include, but are not limited to, an indole ion, indazolium ion, benzopyrrolidinium ion, benzimidazolium ion, benzotriazolium ion, benzisoxazolium ion, benzoxazolium ion, benzothiazolium ion, benzisothiazolium ion, benzoxadiazolium ion, benzoxatriazolium ion, benzodioxazolium ion, benzoxathiazolium ion, carbozolium ion, and purinium ion. These ions can be unsubstituted or substituted with an alkyl, aryl, acyl, alkoxy, aryloxy, halo, mercapto, amino, hydroxy, azo, cyano, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, or combinations thereof. In some applications, the cation is a benzoxazolium ion or a benzothiazolium ion that is unsubstituted or substituted.",
        "Suitable examples of six member heterocyclic groups that contain a positively charged nitrogen atom include, but are not limited to, a pyridinium ion, pyridazinium ion, pyrimidinium ion, pyrazinium ion, piperazinium ion, triazinium ion, oxazinium ion, piperidinium ion, oxathiazinium ion, oxadiazinium ion, and morpholinium ion. These ions can be unsubstituted or substituted with an alkyl, aryl, acyl, alkoxy, aryloxy, halo, mercapto, amino, hydroxy, azo, cyano, or carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, or combinations thereof. In some applications, the cation is a pyridinium ion or a morpholinium ion that is unsubstituted or substituted.",
        "The six member heterocyclic groups can be fused to another cyclic group. In some exemplary ring structures, a six membered heterocyclic group is fused to an aromatic group. Exemplary ring structures include, but are not limited to, isoquinolinium ion, quinolinium ion, cinnolinium ion, quinazolinium ion, benzopyrazinium ion, benzopiperazinium ion, benzotriazinium ion, benzoxazinium ion, benzopiperidinium ion, benzoxathiazinium ion, benzoxadizinium ion, benzomorpholinium ion, naphtyridinium ion, and acridinium ion. These ions can be unsubstituted or substituted with an alkyl, aryl, acyl, alkoxy, aryloxy, halo, mercapto, amino, hydroxy, azo, cyano, or carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, or combinations thereof.",
        "Suitable examples of seven member heterocyclic groups that contain a positively charged nitrogen atom include, for example, an azepinium ion and diazepinium ion. These ions can be unsubstituted or substituted with an alkyl, aryl, acyl, alkoxy, aryloxy, halo, mercapto, amino, hydroxy, azo, cyano, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, or combinations thereof.",
        "Examples of heterocyclic groups that are bicyclic include, but are not limited to, N-alkylated or N-protonated 1,4-diazabicyclo [2.2.2] octane and N-alkylated or N-protonated 1-azabicyclic[2.2.2] octane that is unsubstituted or substituted with an alkyl, aryl, acyl, alkoxy, aryloxy, halo, mercapto, amino, hydroxy, azo, cyano, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, or combinations thereof.",
        "In other embodiments, the cation of the arylsulfinate salt contains a positively charged phosphorus atom of Formula III",
        "where each R2 is independently an alkyl or aryl that is unsubstituted or substituted. An alkyl group can be substituted with a hydroxy. An aryl can be substituted with an alkyl, hydroxy, or combinations thereof.",
        "In some examples of Formula III, all of the R2 groups are aryl groups. For example, the cation is a tetraphenylphosphonium ion. In other examples, one, two, or three of the R2 groups are an aryl with the remaining R2 group or groups being a C2-30 alkyl.",
        "Some of the arylsulfinate salts can have an anion of Formula IV",
        "and a cation that includes a positively charged nitrogen atom. In Formula IV, R3 can be in an ortho, para, or meta position of the benzene ring and is an electron withdrawing group selected from halo, cyano, fluoroalkyl, perfluoroalkyl, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, or aminocarbonyl. In some compounds, R3 is selected from cyano, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, or aminocarbonyl. In other compounds, R3 is a halo, cyano, or alkoxycarbonyl group.",
        "Specific examples Formula IV where R3 is located in the para position of the phenyl ring include 4-cyanobenzenesulfinate, 4-chlorobenzenesulfinate, 4-ethoxycarbonylbenzenesulfinate, and 4-trifluoromethylbenzenesulfinate. A specific example of R3 located in the meta position of the phenyl ring includes 3-trifluoromethylbenzenesulfinate.",
        "For some applications, the arylsulfinate salt includes an anion of Formula IV and a cation that is a tetraalkylammonium ion. The alkyl groups of the tetraalkylammonium ion can be the same or different and typically contain 2 to 30 carbon atoms. For example, the alkyl groups can contain 4 to 30 carbon atoms, 8 to 30 carbon atoms, 3 to 10 carbon atoms, 4 to 10 carbon atoms, 4 to 8 carbon atoms, or 4 to 6 carbon atoms. Specific arylsulfinate salts include, but are not limited to, tetrabutylammonium 4-chlorobenzenesulfinate, tetrabutylammonium 4-cyanobenzenesulfinate, tetrabutylammonium 4-ethoxycarbonylbenzenesulfinate, tetrabutylammonium 4-trifluoromethylbenzenesulfinate, and tetrabutylammonium 3-trifluoromethylbenzenesulfinate.",
        "Other specific examples of arylsulfinate salts include, but are not limited to, tetrabutylammonium 1-naphthalenesulfinate, tetrabutylammonium 2-naphthalenesulfinate, tetrabutylammonium 1-anthraquinonesulfinate, 1-ethyl-3-methylimidazolium 4-cyanobenzenesulfinate, N,N-morpholinium 4-cyanobenzenesulfinate, 3-ethyl-2-methylbenxoxazolium 4-cyanobenzenesulfinate, 1-methyl-4-aza-1-azoniabicyclo [2.2.2]octane 4-cyanobenzenesulfinate, and N-hexadecylpyridinium 4-cyanobenzenesulfinate.",
        "In some embodiments, the arylsulfinate salts are colored and absorb visible radiation. For example, the arylsulfinate salts can have a yellow color. Examples of colored arylsulfinate salts include, but are not limited to, those having a cation that is benzenesulfinate substituted with an electron withdrawing group selected from cyano, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, aminocarbonyl, or combinations thereof. Other colored arylsulfinate salts include those having a cation with multiple fused rings such as, for example, 1-naphthalenesulfinate, 2-naphthalenesulfinate, and 1-anthroquinonesulfinate.",
        "Some arylsulfinate salts have an oxidation potential in N,N-dimethylformamide of 0.0 to +0.4 volts, +0.08 to +0.4 volts, +0.08 to +0.3 volts, or +0.08 to +0.3 volts versus a silver/silver nitrate reference electrode. The oxidation potential can be determined using cyclic voltammetry. The compound of interest is typically dissolved in a non-aqueous solvent (i.e., N,N-dimethylformamide) containing a supporting electrolyte (i.e., 0.1 moles/liter tetrabutylammonium hexafluorophosphate). The resulting solution is purged with an inert gas such as argon. A three-electrode configuration is used that includes a working electrode (i.e., a glassy carbon electrode), a reference electrode (i.e., a silver wire in a 0.01 moles/liter solution of silver nitrate dissolved in acetonitrile), and a counter electrode (i.e., a platinum wire). The oxidation potential is the voltage corresponding to the maximum current for the oxidation reaction.",
        "Another component of the composition is a triarylsulfonium salt. The triarylsulfonium ion typically is of Formula V",
        "where each Ar3 and Ar4 are independently a C6-30 aryl or a C3-30 heteroaryl that is unsubstituted or substituted; L is a divalent linking group selected from a single bond, oxo, thio, sulfinyl, carbonyl, sulfonyl, methylene, or imino; p is an integer equal to or greater than 1; and m is an integer equal to 0 or 1. The arylsulfonium ions can be substituted with up to 30 carbon atoms and up to 10 heteroatoms selected from N, S, O, P, As, Si, Sb, B, Ge, Te, or Se. In some exemplary triarylsulfonium ions, there are no substituents. In other exemplary triarylsulfonium ions, a substituent has up to 5, up to 3, or up to 1 heteroatom. The number of carbon atoms in a substituent can be, for example, up to 20, up to 10, up to 8, up to 6, up to 4, or up to 3. The charge on the cation can be altered depending on the substituents. In some embodiments, p is equal to 1 or 2.",
        "Each Ar3 and Ar4 can be an aromatic group having a single or multiple rings. Examples of single ring aromatic groups include, but are not limited to, phenyl, thienyl, or furanyl. Examples of multiple ring aromatic groups include, but are not limited to, naphthyl, benzothienyl, dibenzothienyl, benzofuranyl, and dibenzofuranyl. The rings can be unsubstituted or substituted.",
        "In some embodiments of Formula V, there is no linking group L between two of the aromatic groups (i.e., m is equal to 0). A specific example of a triarylsulfonium ion lacking a linking group is triphenylsulfonium. Specific examples of triarylsulfonium ions having a linking group (i.e., m is equal to 1) include, but are not limited to,",
        "With some triarylsulfonium ions, the cations can react with each other to form cations having a higher molecular weight. For example, a triphenylsulfonium salt can include",
        "or combinations thereof. Suitable arylsulfonium salts are further described in U.S. Pat. Nos. 2,807,648, 4,069,054 and 4,216,288; and U.S. patent application Ser. No. 10/328,520, the disclosures of which are incorporated herein by reference in their entirety.",
        "Suitable substituents for the arylsulfonium ions include, but are not limited to, alkyl (e.g., methyl, ethyl, butyl, dodecyl, and tetracosanyl); alkylcarbonyloxy (e.g., acetoxy and cyclohexanecarbonyloxy); alkynyl (e.g., ethynyl); alkoxy (e.g., methoxy, ethoxy, and butoxy); alkoxycarbonyl (e.g., methoxycarbonyl and ethoxycarbonyl); alkylthio (e.g., methylthio and ethylthio); arylthio (e.g., phenylthio); aralkyl (e.g., benzyl); alkenyl (e.g., ethenyl and allyl); aryl (e.g., cyclopentadienyl, phenyl, tolyl, naphthyl, indenyl, anthracenyl, phenanthrenyl, and perylenyl); arylcarbonyloxy (e.g., benzoyloxy); arylcarbonylamido (e.g., benzamido); aryloxy (e.g., phenoxy); aryloxycarbonyl (e.g., phenoxycarbonyl); alkoxysulfonyl (e.g., methoxysulfonyl and butoxysulfonyl); aryloxysulfonyl (e.g., phenoxysulfonyl); alkylsulfonamido (e.g., ethylsulfonamido); N-alkylaminocarbonyl (e.g., N-methylaminocarbonyl, N,N-dimethylaminocarbonyl); N-arylaminocarbonyl (e.g., N-phenylaminocarbonyl); N-alkylsulfamyl (e.g., N-methylsulfamyl); N-arylsulfamyl (e.g., N-phenylsulfamyl); alkylsulfonyl (e.g., methylsulfonyl); arylsulfonyl (e.g., phenylsulfonyl); perfluoroalkyl (e.g., trifluoromethyl, perfluoroethyl, and perfluorobutyl); perfluoroalkysulfonyl (e.g., trifluoromethylsulfonyl, perfluoroethylsulfonyl, and perfluorobutylsulfonyl); azo; boryl; halo (e.g., chloro, bromo, iodo, and fluoro); hydroxy; mercapto; diarylarsino (e.g., diphenylarsino); diarylstibino (e.g., diphenylstibino); trialkylgermano (e.g., trimethylgermano); trialkylsiloxy (e.g., trimethylsiloxy); of combinations thereof.",
        "In some embodiments, the triarylsulfonium ion is unsubstituted or substituted with an acyl, alkyl, alkylthio, arylthio, alkylcarbonylamido, aryl, alkoxy, halo, aryloxy, or combinations thereof.",
        "Specific examples of triarylsulfonium ions include triphenylsulfonium, diphenylnaphthylsulfonium, tritolysulfonium, anisyldiphenylsulfonium, 4-butoxyphenyldipenylsulfonium, 4-tert-butylphenyldiphenylsulfonium, 4-chlorophenyldiphenylsulfonium, tris(4-phenoxyphenyl)sulfonium, 4-acetonylphenyldiphenylsulfonium, tris(4-thiomethoxyphenyl)sulfonium, 4-acetamidophenyldiphenylsulfonium, and the like.",
        "The anion of the triarylsulfonium salt is typically chosen to provide suitable solubility in various solvents such as alcohols, ethylenically unsaturated monomers, or combinations thereof. In some applications, the triarylsulfonium salt has a solubility in an alcohol or ethylenically unsaturated monomer in an amount of at least 0.05 mole/liter, at least 0.07 moles/liter, at least 0.08 moles/liter, at least 0.09 moles/liter, or at least 0.1 moles/liter. Suitable anions of the triarylsulfonium salts include, but are not limited to, AsF6−, SbF6−, BF4−, PF6−, CF3SO3−, HC(SO2CF3)2 −, C(SO2CF3)3−, N(SO2CF3)2−, tetraphenylborate, tetra(pentafluorophenyl)borate, tetra(3,5-bistrifluoromethylphenyl) borate, p-toluenesulfonate, and the like. In some embodiments, the anions are selected from BF4−, PF6−, AsF6−, SbF6−, or combinations thereof. In other embodiments, the anion is an arylsulfinate according to Formula I as described above.",
        "The triarylsulfonium salts are often commercially available in the form of a solution. For example, triarylsulfonium SbF6− is commercially available as a 50 weight percent solution in propylene carbonate from Dow Chemical Co., Midland Mich. (UVI-6974) and from Sartomer Company, Exton, Pa. (CD-1010). Triarylsulfonium PF6− is commercially available as a 50 weight percent solution in propylene carbonate from Dow Chemical Co., Midland, Mich. (UVI-6990) and from Sartomer Company, Exton, Pa. (CD-1011).",
        "The composition can further include monomers that are capable of being polymerized using a free-radical polymerization reaction. The monomers typically contain at least one ethylenically unsaturated double bond. The monomers, for example, can be monoacrylates, diacrylates, polyacrylates, monomethacrylates, dimethacrylates, polymethacrylates, or combinations thereof. Exemplary monomers include methyl acrylate, methyl methacrylate, ethyl acrylate, ethyl methacrylate, isopropyl acrylate, isopropyl methacrylate, n-hexyl acrylate, stearyl acrylate, allyl acrylate, glycerol acrylate, glycerol diacrylate, glycerol triacrylate, ethyleneglycol diacrylate, diethyleneglycol diacrylate, triethyleneglycol diacrylate, 1,3-propanediol diacrylate, 1,3-propanediol dimethacrylate, trimethylolpropane triacrylate, 1,2,4-butanetriol trimethacrylate, 1,4-cyclohexanediol diacrylate, pentaerythritol triacrylate, pentaerythritol tetraacrylate, pentaerythritol tetramethacrylate, sorbitol hexaacrylate, bis[1-(2-acryloxy)]-p-ethoxyphenyldimethylmethane, bis[1-(3-acryloxy-2-hydroxy)]-p-propoxyphenyldimethylmethane, and trishydroxyethyl-isocyanurate trimethylacrylate. The monomers also can be bis-acrylates and bis-methacrylates of polyethylene glycol having an average molecular weight (Mn) of 200 to 500; copolymerizable mixtures of acrylated monomers such as those described in U.S. Pat. No. 4,652,274, the disclosure of which is incorporated herein by reference in its entirety; acrylated monomers such as those described in U.S. Pat. No. 4,642,126, the disclosure of which is incorporated herein by reference in its entirety; unsaturated amides such as methylene bis-arylamide, methylene bis-methacrylamide, 1,6-hexamethylene bis-acrylamide, diethylene triamine tris-acrylamide, and beta-methacrylaminoethyl methacrylate; and vinyl monomers such as styrene, diallyl phthalate, divinyl succinate, divinyl adipate, and divnylphthalate. Mixtures of two or more monomers can be used, if desired.",
        "In some embodiments, the compositions include a hydroxy-containing material. Hydroxy-containing material, for example, can be an alcohol, a hydroxy-containing monomer, or combinations thereof. In some applications, hydroxy-containing materials tend to bleach the photopolymerizable composition; such bleached compositions often can be activated using ultraviolet light but not visible light.",
        "The triarylsulfonium salt and arylsulfinate can both be selected to provide solubility in the monomer or monomer mixture. The triarylsulfonium and the arylsulfinate salts can be present in an amount effective to enable free radical polymerization of the ethylenically unsaturated monomers. The amount of each salt can affect the kinetics of the photopolymerization reaction. The rate of the polymerization reaction typically increases with an increased concentration of the salts.",
        "In some applications, the triarylsulfonium salt and the arylsulfinate salt can each be present in an amount up to 4 weight percent based on the weight of the monomer. The amount of the salts can be the same or different. In some embodiments, the triarylsulfonium salt and the arylsulfinate salt are each present in an amount up to 3 weight percent, up to 2 weight percent, up to 1 weight percent, or up to 0.5 weight percent based on the weight of the monomers. For example, the triarylsulfonium salt and the arylsulfinate salt can each be present in an amount of 0.1 to 4 weight percent, 0.1 to 3 weight percent, 0.1 to 2 weight percent, or 0.5 to 1 weight percent based on the weight of the monomers.",
        "Another aspect of the invention provides a composition that includes monomers capable of undergoing free radical polymerization reactions (i.e., ethylenically unsaturated monomers) and a triarylsulfonium arylsulfinate salt. The triarylsulfonium and arylsulfinate ions are the same as described above in more detail.",
        "The compositions can contain a wide variety of additives depending on the desired use of the polymerized material. Suitable additives include solvents, diluents, resins, binders, plasticizers, inorganic and organic reinforcing or extending fillers, thixotropic agents, UV absorbers, medicaments, and the like. In some embodiments, these materials are chosen such that they do not competitively absorb actinic radiation that is needed to excite the arylsulfinate salts.",
        "In some embodiments, the components of the compositions can be selected to provide a useful combination of cure speed, cure depth and shelf life. Some compositions can cure well even when loaded with large amounts of fillers. The compositions can be used to form foams, shaped articles, adhesives, filled or reinforced composites, abrasives, caulking and sealing formulations, casting and molding formulations, potting and encapsulating formulations, impregnating and coating formulations, and the like.",
        "Suitable applications for the compositions include, but are not limited to, graphic arts imaging (e.g., for color proofing systems, curable inks, and silverless imaging), printing plates (e.g., for projection plates and laser plates), photoresists, solder masks for printed circuit boards, coated abrasives, magnetic media, photocurable adhesives (e.g., for orthodontics and general bonding applications), photocurable composites (e.g., for autobody repair and dental restoratives), protective coatings, and abrasion resistant coatings. The compositions are also suitable for use in a multi-photon process, where high intensity/short pulse lasers are used in combination with suitable dyes and co-reactants to produce polymerizable compositions that are useful for imaging, microreplication and stereolithographic applications. The compositions also can be used in other applications that are known to those skilled in the art.",
        "Polymerization Methods",
        "The invention also provides methods for photopolymerizing ethylenically unsaturated monomers using free radical polymerization reactions.",
        "The photopolymerization method includes irradiating a photopolymerizable composition with actinic radiation until the photopolymerizable composition gels or hardens. The photopolymerizable composition includes monomers capable of undergoing free radical polymerization reactions (i.e., ethylenically unsaturated monomers) and a photoinitiator system. The photoinitiator system includes a triarylsulfonium salt and an arylsulfinate salt. In some applications of the photoinitiator systems, the components can be mixed together and stored for at least one day prior to use.",
        "The arylsulfinate salt has an anion of Formula I\n\nAr1—SO2−  I\n\nand a cation that contains at least one carbon atom and either a positively charged nitrogen atom or a positively charged phosphorus atom. The Ar1 group in Formula I is a substituted phenyl, an unsubstituted or substituted C7-30 aryl, or an unsubstituted or substituted C3-30 heteroaryl. A substituted Ar1 group can have a substituent that is an electron withdrawing group or an electron withdrawing group in combination with an electron donating group. Suitable arylsulfinate salts are described above.",
        "In some embodiments, the arylsulfinate salt has an anion that is a substituted benzenesulfinate, 1-naphthalenesulfinate, 2-naphthalenesulfinate, or 1-anthraquinonesulfinate and the cation is a tetraalkylammonium ion. A substituent on the arylsulfinate anion can be an electron withdrawing group or an electron withdrawing group in combination with an electron donating group. Exemplary arylsulfinates include, but are not limited to, tetrabutylammonium 4-chlorobenzenesulfinate, tetrabutylammonium 4-cyanobenzenesulfinate, tetrabutylammonium 4-ethoxycarbonylbenzenesulfinate, tetrabutylammonium 4-trifluoromethylbenzenesulfinate, tetrabutylammonium 3-trifluoromethylbenzenesulfinate, tetrabutylammonium 1-naphthalenesulfinate, tetrabutylammonium 2-naphthalenesulfinate, and tetrabutylammonium 1-anthraquinonesulfinate.",
        "Other specific examples of arylsulfinate salts include, but are not limited to, 1-ethyl-3-methylimidazolium 4-cyanobenzenesulfinate, N,N-morpholinium 4-cyanobenzenesulfinate, 3-ethyl-2-methylbenxoxazolium 4-cyanobenzenesulfinate, 1-methyl-4-aza-1-azoniabicyclo [2.2.2]octane 4-cyanobenzenesulfinate and N-hexadecylpyridinium 4-cyanobenzenesulfinate.",
        "The triarylsulfonium ion is often of Formula V",
        "where each Ar3 and Ar4 are each independently a C6-30 aryl or a C3-30 heteroaryl that is unsubstituted or substituted; L is a divalent linking group selected from a single bond, oxo, thio, sulfinyl, carbonyl, sulfonyl, methylene, or imino, p is an integer equal to or greater than 1; and m is an integer equal to 0 or 1. The arylsulfonium ion can be unsubstituted or substituted with one or more substituents, each substituent having up to 30 carbon atoms and up to 10 heteroatoms selected from N, S, O, P, As, Si, Sb, B, or Ge. The substituents can be selected, for example, from alkyl, alkylcarbonyloxy, alkynyl, alkoxy, alkoxycarbonyl, alkylthio, arylthio, aralkyl, alkenyl, aryl, arylcarbonyloxy, arylcarbonylamido, alkylcarbonylamido, aryloxy, aryloxycarbonyl, alkoxysulfonyl, aryloxysulfonyl, alkylsulfonamido, N-alkylaminocarbonyl, N-arylaminocarbonyl, N-alkylsulfamyl, N-arylsulfamyl, alkylsulfonyl, arylsulfonyl, perfluoroalkyl, perfluoroalkysulfonyl, azo, boryl, halo, hydroxy, mercapto, diarylarsino, diarylstibino, trialkylgermano, trialkylsiloxy, or combinations thereof. Suitable triarylsulfonium salts are those described above in more detail.",
        "Exemplary triarylsulfonium salts can have cation selected from",
        "or combinations thereof that are unsubstituted or substituted with alkyl, alkylcarbonyloxy, alkynyl, alkoxy, alkoxycarbonyl, alkylthio, arylthio, aralkyl, alkenyl, aryl, arylcarbonyloxy, arylcarbonylamido, alkylcarbonylamido, aryloxy, aryloxycarbonyl, alkoxysulfonyl, aryloxysulfonyl, alkylsulfonamido, N-alkylaminocarbonyl, N-arylaminocarbonyl, N-alkylsulfamyl, N-arylsulfamyl, alkylsulfonyl, arylsulfonyl, perfluoroalkyl, perfluoroalkysulfonyl, azo, boryl, halo, hydroxy, mercapto, diarylarsino, diarylstibino, trialkylgermano, trialkylsiloxy, or combinations thereof. Suitable anions of the triarylsulfonium salts include, but are not limited to, AsF6−, SbF6−, BF4−, PF6−, CF3SO3−, HC(SO2CF3)2−, C(SO2CF3)3−, N(SO2CF3)2−, tetraphenylborate, tetra(pentafluorophenyl)borate, and tetra(3,5-bistrifluoromethylphenyl)borate, p-toluenesulfonate, and the like. In some embodiments, the anion is selected from PF6−, AsF6−, SbF6−, or combinations thereof.",
        "Suitable monomers are those that are capable of free radical polymerization reactions and typically include ethylenically unsaturated monomers such as monoacrylates, monomethacrylates, diacrylates, dimethacrylates, polyacrylates, polymethacrylates, or combinations thereof.",
        "The triarylsulfonium salts typically do not directly react with the arylsulfinate electron donors in the absence of actinic radiation, at least not at room temperature. The photoinitiator system can be activated by exposure of the photopolymerizable composition to actinic radiation. The actinic radiation typically has a wavelength of at least 250, at least 300, at least 325, at least 350, at least 400, at least 425, or at least 450 nanometers. The actinic radiation typically has a wavelength less than 1000, less than 900, less than 850, or less than 800 nanometers. For example, the actinic radiation can be in the range of about 250 to 1000 nanometers, in the range of 300 to 1000 nanometers, in the range of 350 to 1000 nanometers, in the range of 300 to 850 nanometers, in the range of 350 to 800 nanometers, in the range of 250 to 850 nanometers, in the range of 250 to 800 nanometers, in the range of 400 to 800 nanometers, in the range of 425 to 800 nanometers, or in the range of 450 to 800 nanometers.",
        "Absorption of actinic radiation results in the formation of an initiating radical. The initiating radical reacts with an ethylenically unsaturated monomer to form a higher molecular weight radical that can react with other monomers resulting in the formation of yet higher molecular weight radicals leading to the formation of a polymeric material. In some instances, the polymeric material is cross-linked.",
        "In some embodiments, visible light can be used to excite the arylsulfinate salt and activate the photoinitiator system. This can be advantageous because relatively inexpensive light sources can be used. Light sources emitting in the visible region of the electromagnetic spectrum tend to be less expensive than those emitting, for example, in the ultraviolet region. Other light sources that include ultraviolet radiation or a combination of ultraviolet and visible radiation can be used. Typical light sources include, but are not limited to, mercury vapor discharge lamps, carbon arcs, tungsten lamps, xenon lamps, sunlight, lasers, light emitting diodes, and the like.",
        "Another aspect of the invention provides photopolymerization methods that include irradiating a photopolymerizable composition with actinic radiation until the photopolymerizable composition gels or hardens. The photopolymerizable composition includes monomers capable of undergoing free radical polymerization reactions (i.e., ethylenically unsaturated monomers) and a triarylsulfonium arylsulfinate salt.",
        "In some embodiments, the triarylsulfonium arylsulfinate salt has an anion according to Formula I\n\nAr1—SO2−  I\n\nwhere Ar1 is a substituted phenyl, an unsubstituted or substituted C7-30 aryl, or an unsubstituted or substituted C3-30 heteroaryl. A substituted Ar1 group can have a substituent that is an electron withdrawing group or an electron withdrawing group in combination with an electron donating group. The cation of the triarylsulfonium arylsulfinate salt is according to Formula V",
        "where each Ar3 and Ar4 are each independently a C6-30 aryl or a C3-30 heteroaryl that is unsubstituted or substituted; L is a divalent linking group selected from a single bond, oxo, thio, sulfinyl, carbonyl, sulfonyl, methylene, or imino; p is an integer equal to or greater than 1; and m is an integer equal to 0 or 1. The arylsulfonium ion can be unsubstituted or substituted with one or more substituents, each substituent having up to 30 carbon atoms and up to 10 heteroatoms selected from N, S, O, P, As, Si, Sb, B, or Ge. The substituents can be selected, for example, from alkyl, alkylcarbonyloxy, alkynyl, alkoxy, alkoxycarbonyl, alkylthio, arylthio, aralkyl, alkenyl, aryl, arylcarbonyloxy, arylcarbonylamido, alkylcarbonylamido, aryloxy, aryloxycarbonyl, alkoxysulfonyl, aryloxysulfonyl, alkylsulfonamido, N-alkylaminocarbonyl, N-arylaminocarbonyl, N-alkylsulfamyl, N-arylsulfamyl, alkylsulfonyl, arylsulfonyl, perfluoroalkyl, perfluoroalkysulfonyl, azo, boryl, halo, hydroxy, mercapto, diarylarsino, diarylstibino, trialkylgermano, trialkylsiloxy, or combinations thereof. Suitable triarylsulfonium ions are those described above in more detail.",
        "The triarylsulfonium arylsulfinate salt can have a cation selected from",
        "or combinations thereof that are unsubstituted or substituted with one or more substituents. Suitable substituents include alkyl, alkylcarbonyloxy, alkynyl, alkoxy, alkoxycarbonyl, alkylthio, arylthio, aralkyl, alkenyl, aryl, arylcarbonyloxy, arylcarbonylamido, alkylcarbonylamido, aryloxy, aryloxycarbonyl, alkoxysulfonyl, aryloxysulfonyl, alkylsulfonamido, N-alkylaminocarbonyl, N-arylaminocarbonyl, N-alkylsulfamyl, N-arylsulfamyl, alkylsulfonyl, arylsulfonyl, perfluoroalkyl, perfluoroalkysulfonyl, azo, boryl, halo, hydroxy, mercapto, diarylarsino, diarylstibino, trialkylgermano, trialkylsiloxy, or combinations thereof.",
        "Exemplary anions of the triarylsulfonium arylsulfinate salt include a substituted benzenesulfinate, 1-naphthalenesulfinate, 2-naphthalenesulfinate, or 1-anthraquinonesulfinate, or combinations thereof. Substituents on the arylsulfinate include an electron withdrawing group or an electron withdrawing group in combination with an electron donating group. Electron donating groups can be selected, for example, from a primary amino, secondary amino, tertiary amino, hydroxy, alkoxy, aryloxy, alkyl, combinations thereof. Electron withdrawing groups can be selected, for example, from a halo, cyano, fluoroalkyl, perfluoroalkyl, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, aminocarbonyl, or combinations thereof.",
        "Exemplary arylsulfinate anions include, but are not limited to, 4-chlorobenzenesulfinate, 4-cyanobenzenesulfinate, 4-ethoxycarbonylbenzenesulfinate, 4-trifluoromethylbenzenesulfinate, 3-trifluoromethylbenzenesulfinate, 1-naphthalenesulfinate, 2-naphthalenesulfinate, and 1-anthraquinonesulfinate.",
        "The photoinitiator system can be activated by exposure of the photopolymerizable composition to actinic radiation having a wavelength of at least 250, at least 300, at least 325, at least 350, at least 400, at least 425, or at least 450 nanometers. The actinic radiation typically has a wavelength less than 1000, less than 900, less than 850, or less than 800 nanometers. For example, the actinic radiation can be in the range of about 250 to about 1000 nanometers, in the range of 300 to 1000 nanometers, in the range of 350 to 1000 nanometers, in the range of 300 to 850 nanometers, in the range of 350 to 800 nanometers, in the range of 250 to 850 nanometers, in the range of 250 to 800 nanometers, in the range of 400 to 800 nanometers, in the range of 425 to 800 nanometers, or in the range of 450 to 800 nanometers.",
        "Compounds",
        "Another aspect of the invention provides triarylsulfonium arylsulfinate salts. The triarylsulfonium arylsulfinate salt has an anion of Formula I\n\nAr1—SO2−  I\n\nThe Ar1 group in Formula I is a substituted phenyl, an unsubstituted or substituted C7-30 aryl, or an unsubstituted or substituted C3-30 heteroaryl. A substituted Ar1 group can have a substituent that is an electron withdrawing group or an electron withdrawing group in combination with an electron donating group. Suitable Ar1 groups for arylsulfinate ions of Formula I are described above.",
        "Electron donating groups can be selected, for example, from a primary amino, secondary amino, tertiary amino, hydroxy, alkoxy, aryloxy, alkyl, or combinations thereof. Electron withdrawing groups can be selected, for example, from a halo, cyano, fluoroalkyl, perfluoroalkyl, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, aminocarbonyl, or combinations thereof.",
        "In some embodiments, the arylsulfinate ions of Formula I include, but are not limited to, 1-naphthalenesulfinate, 2-naphthalenesulfinate, and 1-anthraquinonesulfinate that are unsubstituted or substituted with an electron withdrawing group or an electron withdrawing group in combination with an electron donating group. In other embodiments, the triarylsulfonium arylsulfinate salt has an anion according to Formula IV",
        "",
        "where R3 is an electron withdrawing group selected from halo, cyano, fluoroalkyl, perfluoroalkyl, carboxy, alkoxycarbonyl, aryloxycarbonyl, halocarbonyl, formyl, carbonyl, sulfo, alkoxysulfonyl, aryloxysulfonyl, perfluoroalkylsulfonyl, alkylsulfonyl, azo, alkenyl, alkynyl, dialkylphosphonato, diarylphosphonato, aminocarbonyl, or combinations thereof. The electron withdrawing group R3 can be located, for example, in an ortho or para position of the benzene ring. Specific examples include 4-cyanobenzenesulfinate, 4-chlorobenzenesulfinate, 4-ethoxycarbonylbenzenesulfinate, and 4-trifluoromethylbenzenesulfinate. In other examples, R3 can be located in a meta positions of the benzene ring. A specific example includes 3-trifluoromethylbenzenesulfinate.",
        "Suitable triarylsulfonium ions are described above. The triarylsulfonium arylsulfinate salt typically has a cation according to Formula V",
        "",
        "where each Ar3 and Ar4 are each independently a C6-30 aryl or a C3-30 heteroaryl that is unsubstituted or substituted; L is a divalent linking group selected from a single bond, oxo, thio, sulfinyl, carbonyl, sulfonyl, methylene, or imino; p is an integer equal to or greater than 1; and m is an integer equal to 0 or 1. The arylsulfonium ion can be unsubstituted or substituted. The triarylsulfonium ion can be unsubstituted or substituted with one or more substituents, each substituent having up to 30 carbon atoms and up to 10 heteroatoms selected from N, S, O, P, As, Si, Sb, B, or Ge. Suitable substituents include alkyl, alkylcarbonyloxy, alkynyl, alkoxy, alkoxycarbonyl, alkylthio, arylthio, aralkyl, alkenyl, aryl, arylcarbonyloxy, arylcarbonylamido, alkylcarbonylamido, aryloxy, aryloxycarbonyl, alkoxysulfonyl, aryloxysulfonyl, alkylsulfonamido, N-alkylaminocarbonyl, N-arylaminocarbonyl, N-alkylsulfamyl, N-arylsulfamyl, alkylsulfonyl, arylsulfonyl, perfluoroalkyl, perfluoroalkysulfonyl, azo, boryl, halo, hydroxy, mercapto, diarylarsino, diarylstibino, trialkylgermano, trialkylsiloxy, or combinations thereof.",
        "In some embodiments, the triarylsulfonium ion is selected from",
        "or combinations thereof that are unsubstituted or substituted with one or more substituents. Suitable substituents include alkyl, alkylcarbonyloxy, alkynyl, alkoxy, alkoxycarbonyl, alkylthio, arylthio, aralkyl, alkenyl, aryl, arylcarbonyloxy, arylcarbonylamido, alkylcarbonylamido, aryloxy, aryloxycarbonyl, alkoxysulfonyl, aryloxysulfonyl, alkylsulfonamido, N-alkylaminocarbonyl, N-arylaminocarbonyl, N-alkylsulfamyl, N-arylsulfamyl, alkylsulfonyl, arylsulfonyl, perfluoroalkyl, perfluoroalkysulfonyl, azo, boryl, halo, hydroxy, mercapto, diarylarsino, diarylstibino, trialkylgermano, trialkylsiloxy, or combinations thereof.",
        "Specific compounds include, but are not limited to, triphenylsulfonium 4-cyanobenzenesulfinate, triphenylsulfonium 4-cyanobenzenesulfinate, triphenylsulfonium 4-ethoxycarbonylbenzenesulfinate, triphenylsulfonium 4-trifluoromethylbenzenesulfinate, triphenylsulfonium 3-trifluoromethylbenzenesulfinate, triphenylsulfonium 1-naphthalenesulfinate, triphenylsulfonium 2-naphthalenesulfinate, and triphenylsulfonium 2-anthraquinonesulfinate.",
        "The triarylsulfonium arylsulfinate salts typically have a solubility of at least 0.05 moles/liter, at least 0.07 moles/liter, at least 0.08 moles/liter, at least 0.09 moles/liter, or at least 0.1 moles/liter in a variety of solvents and ethylenically unsaturated monomers. Thus, the triarylsulfonium arylsulfinate salts are often not limited to applications that include aqueous formulations or aqueous systems with a large amount (e.g., 30 to 70 weight percent) of a cosolvent such as an alcohol.",
        "The triarylsulfonium arylsulfinate salt can be activated by exposure to actinic radiation having a wavelength in the range of 250 to 1000 nanometers, in the range of 300 to 1000 nanometers, in the range of 350 to 1000 nanometers, in the range of 250 to 850 nanometers, in the range of 250 to 800 nanometers, in the range of 400 to 800 nanometers, in the range of 425 to 800 nanometers, or in the range of 450 to 800 nanometers. Although not intending to be bound by theory, it is believed that the arylsulfinate ion typically absorbs actinic radiation to form an excited arylsulfinate ion. The excited arylsulfinate ion can transfer an electron to the triarylsulfonium ion resulting in the formation of an arylsulfinate radical. The arylsulfinate radical typically can photodegrade and form a radical that can initiate free radical polymerization reactions.",
        "In some embodiments, the triarylsulfonium arylsulfinate salts can be stored as a neat compound at room temperature without undergoing oxidative degradation. For example, some of the triarylsulfonium arylsulfinate salts can be stored for greater than one day, greater than 2 days, greater than 1 week, greater than 2 weeks, or greater than 1 month. The time required to oxidize 50 percent of the compound (t1/2) at room temperature (i.e., 20° C. to 25° C.) can be used to compare the relative ease of oxidative degradation of various triarylsulfonium arylsulfinate salts. The t1/2 is calculated based on pseudo-first order kinetics as described in K. A. Connors, Chemical Kinetics: The Study of Reaction Rates in Solution, chapter 2, VCH, New York, 1990.",
        "Unless otherwise noted:",
        "the solvents and reagents were or can be obtained from Aldrich Chemical Co., Milwaukee, Wis. or may be synthesized by known methods;",
        "electrochemical instrumentation for cyclic voltammetry was obtained from Princeton Applied Research, Oak Ridge, Tenn.;",
        "N,N-dimethylformamide was obtained from EM Science, Gibbstown, N.J.;",
        "as used herein, the term “SR339” refers to 2-phenoxyethyl acrylate and was obtained from Sartomer Co., Inc., Exton, Pa.;",
        "as used herein, the term SR238 refers to 1,6-hexanediol diacrylate and was obtained from Sartomer Co., Inc.",
        "triarylsulfonium chloride was obtained as an aqueous solution from Aceto Corp., Lake Success, N.Y.",
        "Measurement of Oxidation Potentials",
        "The electrochemical measurements of the exemplary arylsulfinates were made using an EG&G PARC Model 175 Universal Programmer, interfaced to a Princeton Applied Research Model 173 potentiostat/galvanostat fitted with a Princeton Applied Research Model 179 Digital Coulometer and Model 178 Electrometer. The signal was digitized using a Model DI-151R5 Waveform Recording System (available from DATAQ Instruments, Inc., Akron, Ohio) and then stored and analyzed on a Dell OptiPlex XM 590 pc. Scans were run at 100 mV/sec scan rate.",
        "The electrochemical measurements were made using a three-electrode configuration: a reference electrode, a working electrode, and a counter electrode. The reference electrode was a fritted electrode (obtained from Sargent Welch, Buffalo Grove, Ill.) that was filled with 0.01M AgNO3 in acetonitrile and fitted with a silver wire 1 mm in diameter by approximately 19 cm in length. The counter electrode was a platinum wire 1.0 mm in diameter and approximately 16 cm long (overall length) formed into a coil having a coil diameter of approximately 10 mm and a coil length of about 7.5 cm. The working electrode was a glassy carbon electrode, approximately 3.5 mm in diameter (obtained from BAS, Inc., West Lafayette, Ind.). The glassy carbon electrode was polished using first a 3.0 micron aluminum oxide powder/deionized water slurry, then a 0.3 micron alpha alumina powder/deionized water slurry. The polishing powders were obtained from Buehler LTD, Evanston, Ill.",
        "The cell was a 50 mL four neck round bottom flask. Each electrode was sealed in to the flask using the appropriately sized rubber septum. The fourth inlet was used to introduce an argon purge to remove oxygen and keep atmospheric moisture out of the cell.",
        "The supporting electrolyte was tetrabutylammonium hexafluorophosphate (TBA PF6) (obtained from Southwestern Analytical Chemicals, Inc., Austin, Tex.). The TBA PF6 was dried overnight in a vacuum oven at 80-90° C. before each experiment. The solvent was N,N-dimethylformamide (DMF), and it was used as received without further purification. The solvent was transferred to the electrochemical cell via syringe under an argon atmosphere to minimize atmospheric moisture uptake.",
        "Electrochemical measurements were made by first preparing a 0.1 molar solution of TBA PF6 in DMF. This solution was added to the cell, which contained a small magnetic stir bar, as argon gas was flowing through the cell. After the reference and counter electrodes were connected to the instrumentation, the working electrode was polished as described above and was then inserted into the cell. A background scan was conducted before the exemplary compounds were added to the cell. Then, approximately 10 mg of the compound was added to the cell and, after it had dissolved, the measurement was made to record the oxidation potential. The potential was determined as the voltage at peak current on the first scan. In this configuration, the oxidation potential of ferrocene in an identical electrolyte solution appeared at +0.1 volts versus the reference electrode.",
        "Preparation of Triarylsulfonium Salts",
        "Triarylsulfonium hexafluorophosphate and triarylsulfonium hexafluoroantimonate were prepared using a metathesis procedure in which the commercially available aqueous triarylsulfonium chloride solution was mixed with an aqueous solution of an alkali metal or an ammonium hexafluorophosphate or antimonate. The mixture was then extracted with methylene chloride and the extract was dried over a solid drying agent such as CaSO4 and was then concentrated to dryness using a rotary evaporator. The products were further dried using a vacuum oven.",
        "An intimate mixture of 4-carboxybenzenesulfonamide (188 g) and PCl5 (430 g) was made by combining the solids in a resealable plastic bag and manually kneading and shaking the bag. The mixture was transferred to a round bottom flask that was fitted with a magnetic stir bar and a hose adapter connected to a source of nitrogen gas. The flask was slowly heated to 60° C. in an oil bath and was held at 60° C. for 5 hours as the mixture was stirred. The hose adapter was then connected to a water aspirator through a trap that was cooled with dry ice and the temperature of the oil bath was increased to 110° C. while the flask was evacuated and liquid distilled into the trap. When the rate of distillation slowed, the hose adapter was again connected to the nitrogen source and the temperature of the oil bath was raised to 155° C. After an additional 13 hours, the hose adapter was again connected to a water aspirator through a trap and more liquid was distilled. The reaction flask was then allowed to cool to room temperature, during which time the brown product solidified. The crude product was vacuum distilled, using a Kugelrhor distillation apparatus at a temperature of 150° C. and a pressure of 0.07 mmHg, into a collection bulb that was cooled in an ice bath. The solid yellow distillate was washed from the collection bulb with CH2Cl2 and that solution was concentrated to dryness with a rotary evaporator to afford 167.4 g of product.",
        "A mixture of sodium 4-carboxybenzenesulfonate (75 g) in deionized water (1200 mL) was heated to 60° C. until the solid was dissolved. This solution was passed through a column of a strongly acidic ion-exchange resin (available under the trade designation AMBERLITE IR-120(PLUS) from Rohm and Haas Co., Philadelphia, Pa.) that had been acidified by washing sequentially with deionized water, concentrated HCl and deionized water until the pH of the eluate was approximately 5.5. The column was then washed with deionized water until a total of 2L of eluate was collected. The deionized water was removed with a rotary evaporator and the resultant intermediate was dried in a vacuum oven overnight at 50° C.",
        "The intermediate was then dissolved in 1L of anhydrous ethanol in a round bottom flask fitted with a magnetic stir bar, a condenser and a hose adapter that was attached to a source of nitrogen gas. This solution was stirred and heated overnight in an oil bath at 100° C. An additional 500 mL of ethanol was added to the flask and heating and stirring was continued for an additional 4 hours. The solution was allowed to cool to room temperature and was neutralized with alcoholic KOH to the bromothymol blue endpoint. The product precipitated from the solution and was isolated by vacuum filtration and was washed with anhydrous ethanol. The solid was dried overnight at room temperature to afford 75.1 g of product.",
        "A round bottom flask, fitted with a magnetic stir bar and a hose adapter connected to a source of nitrogen gas, was charged with a solution of potassium 4-ethoxycarbonylbenzenesulfonate (75.1 g) dissolved in a 3:1 (v/v) mixture of acetonitrile (300 mL) and sulfolane (100 mL). As the solution was stirred, POCl3 (55 mL) was added slowly and the stirring mixture was heated at 75° C. under a nitrogen atmosphere for 3 hours. The heterogeneous reaction mixture was allowed to cool to room temperature and was then concentrated using a rotary evaporator. The flask was then cooled in an ice bath and ice was added to the mixture in the flask. The product crystallized as a white solid and was filtered and washed with cold deionized water. The product was dried under vacuum at room temperature and 3 mmHg for 2 hours to afford 76 g of white solid.",
        "Sodium benzenesulfinates were prepared by hydrolysis of the substituted benzenesulfonyl chlorides that were prepared as described in Preparative Examples 1 and 2. Each substituted benzenesulfonyl chloride was stirred for 3 hours at 75° C. in deionized water, at a concentration of 0.2 g of substituted benzenesulfonyl chloride per milliliter of deionized water, with 2.5 equivalents of Na2SO3 and 2.5 equivalents of NaHCO3 in a round bottom flask. Each reaction mixture was then allowed to cool to room temperature and was then cooled in a refrigerator to 10° C. Each cold solution was acidified with concentrated sulfuric acid until the pH was less than 1.",
        "Each precipitated solid was extracted into ethyl acetate and then the organic phase was evaporated to dryness using a rotary evaporator to afford the substituted benzenesulfinic acid as a colorless solid. Each of the solid substituted benzenesulfinic acids was dissolved in methanol to give approximately 10 weight percent solutions. Deionized water was then added dropwise to each solution until a precipitate just formed. Sufficient methanol was then added to the solution until all of the solid dissolved. Each aqueous methanol solution was neutralized with a 1M aqueous solution of alkali metal hydroxide, as indicated in Table 1, to afford the alkali metal salt of the substituted benzenesulfinate, which was isolated by removal of the solvent with a rotary evaporator. The data are given in Table 1.",
        "TABLE 1\n\n\n\n\n\n\n\nPreparative Examples 4-5\n\n\n\n\n\n\n\n\n\n\n\n\n\nWt.\n\n\n\n\nPre-\n\nBenzene-\n\nWt.\n\n\nparative\nBenzenesulfonyl\nsulfonyl\n\nBenzene-\n\n\nExample\nchloride\nchloride\nMOH\nsulfinate\n\n\n\n\n\n4\n4-Cyano\n11.68 g\nNaOH\n9.30 g\n\n\n5\n4-Ethoxycarbonyl\n 6.46 g\nLiOH\n5.35 g",
        "Tetrabutylammonium benzenesulfinate were prepared from the corresponding alkali metal sulfinates. Each alkali metal sulfinate was dissolved in deionized water to give a 0.1M solution that was acidified with concentrated sulfuric acid to afford the sulfinic acid as a colorless precipitate. Each mixture was extracted into ethyl acetate and then the organic solution was evaporated to dryness using a rotary evaporator. Each resultant solid was dissolved in 50% (v/v) aqueous methanol and this solution was titrated with an aqueous solution of tetrabutylammonium hydroxide. Each mixture was evaporated to dryness using a rotary evaporator to afford the product as a yellow oil. The 1H and 13C NMR spectra of each compound were consistent with the assigned structure. Details of these preparations and the oxidation potential of each compound are given in Table 2.",
        "TABLE 2\n\n\n\n\n\n\n\nPreparative Examples 6-7\n\n\n\n\n\n\n\n\n\nPreparative Example\n\n\n\n\n\n\n\n\n\n\n6\n7\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlkali Metal Benzenesulfinate\n4-Cyano\n4-Ethoxycarbonyl\n\n\n\n\n\n\n\n\n\n\n\nWt. Alkali Metal Benzenesulfinate\n2.00\ng\n0.58\ng\n\n\nWt. Tetrabutylammonium\n4.18\ng\n1.27\ng\n\n\nBenzenesulfinate\n\n\nEox\n0.15\nV\n0.11\nV",
        "A round bottom flask was charged with 20.0 g 1-naphthalenesulfonyl chloride, 33.36 g Na2SO3, 22.24 g NaHCO3 and 350 mL deionized water. The mixture was stirred and heated to 65° C. under a nitrogen atmosphere for 2 hours, after which time the mixture was allowed to cool to room temperature and was then further cooled in a refrigerator. The cold mixture was acidified with concentrated H2SO4 which resulted in the formation of a precipitate. The mixture was extracted three times with 100 mL of ethyl acetate. The organic extracts were combined and the solvent was removed with a rotary evaporator to give a colorless solid that was immediately dissolved in 240 mL of 1:1 (v/v) methanol-deionized water in a beaker. The solution was titrated with a solution of 40% aqueous tetrabutylammonium hydroxide until the pH of the solution was 7.2. The solvent was removed with a rotary evaporator and the product was further dried in a vacuum oven at room temperature to afford 36.4 g of a yellow waxy solid.",
        "A round bottom flask was charged with 24.73 g of 2-naphthalenesulfonyl chloride, 41.25 g Na2SO3, 41.25 g NaHCO3 and 350 mL deionized water. The mixture was stirred and heated to 65° C. under a nitrogen atmosphere for 2 hours, after which time the mixture was allowed to cool to room temperature and was then further cooled in a refrigerator. The cold mixture was acidified with concentrated H2SO4, which resulted in the formation of a precipitate.",
        "The mixture was extracted three times with 100 mL of ethyl acetate. The organic extracts were combined and the solvent was removed with a rotary evaporator to give a colorless solid that was immediately dissolved in 240 mL of 1:1 (v/v) methanol-deionized water in a beaker. The solution was titrated with a solution of 40% aqueous tetrabutylammonium hydroxide until the pH of the solution was 7.2. The solvent was removed with a rotary evaporator and the product was further dried in a vacuum oven at room temperature to afford 46.9 g of a yellow waxy solid.",
        "A 500 mL 3-neck round bottom flask, fitted with a mechanical stirrer, thermometer and reflux condenser with a drying tube, was charged with diphenyl sulfoxide (20.2 g) and benzene (200 mL). To the stirred mixture was added AlCl3 (80.1 g) in several portions and this mixture was stirred and heated to reflux for 23 hours. The reaction mixture was then allowed to cool to room temperature and was slowly poured into a mixture of concentrated aqueous HCl (150 mL) and ice in a beaker. This mixture was then filtered and the aqueous layer of the filtrate was separated. The aqueous layer was extracted four times with benzene (50 mL). The aqueous phase was separated and was transferred to a flask that was fitted with a magnetic stir bar. While the aqueous solution was vigorously stirred, NaSbF6 (28.5 g) was added to the flask in several portions. The resultant precipitate was filtered, washed with deionized water and dried in air for 3 days to afford 14.0 g of product.",
        "Two separate mixtures of SR339, each with 1 weight percent each of triarylsulfonium hexafluoroantimonate and the substituted tetrabutylammonium benzenesulfinate of Preparative Examples 6 or 7, were prepared. For Example 1, 1.1 weight percent of tetrabutylammonium 4-cyanobenzenesulfinate was used, whereas for Example 2, 1.0 weight percent of tetrabutylammonium 4-ethoxycarbonylbenzenesulfinate was used. Each sample was evaluated for rate and extent of cure by photo differential scanning calorimetry (photo-DSC) using a model DSC2920 calorimeter (available from TA Instruments, New Castle, Del.) with light from a 100 W medium pressure mercury that was filtered through a Model GG400 long pass filter (available from Esco Products, Oak Ridge, N.J.). The results are given in Table 3.",
        "TABLE 3\n\n\n\n\n\n\n\nCuring of Examples 1-2\n\n\n\n\n\n\n\n\n\n\n\n\nSubstituted\n\n\n\n\n\n\ntetrabutyl-\n\n\n\nammonium\nInitial\nTime to peak\nTotal\n\n\n\nbenzene-\nSlope\nmaximum\nevolved\n\n\nExample\nsulfinate\n(W/g-min)\n(min)\nheat (J/g)\n\n\n\n\n\n1\n4-Cyano\n32.8\n0.41\n363.6\n\n\n2\n4-Ethoxy-\n21.3\n0.47\n314.7\n\n\n\ncarbonyl",
        "A mixture of SR339 and 1 weight percent of Ar3S+SbF6− was prepared. The sample was evaluated for rate and extent of cure by photo differential scanning calorimetry (photo-DSC) using a model DSC2920 calorimeter (available from TA Instruments, New Castle, Del.) with light from a 100 W medium pressure mercury lamp that was filtered through a Model GG400 long pass filter (available from Esco Products, Oak Ridge, N.J.). The results are given in Table 4.",
        "TABLE 4\n\n\n\n\n\n\n\nCuring of Comparative Example 1\n\n\n\n\n\n\n\n\n\n\nComparative\nInitial Slope\nTime to peak\nTotal evolved\n\n\nExample\n(W/g-min)\nmaximum (min)\nheat (J/g)\n\n\n\n\n\n1\n0\n0\n0",
        "Two separate mixtures of SR339, each with 1.0 weight percent of the tetrabutylammonium benzenesulfinate of Preparative Examples 6 or 7, were prepared. Each sample was evaluated for rate and extent of cure by photo differential scanning calorimetry according to the method of Comparative Example 1. The results are given in Table 5.",
        "TABLE 5\n\n\n\n\n\n\n\nCuring of Comparative Examples 2-3\n\n\n\n\n\n\n\n\n\n\n\n\nSubstituted\n\n\n\n\n\n\ntetrabutyl-\n\n\n\nammonium\nInitial\nTime to peak\nTotal\n\n\nComparative\nbenzene-\nSlope\nmaximum\nevolved\n\n\nExample\nsulfinate\n(W/g-min)\n(min)\nheat (J/g)\n\n\n\n\n\n2\n4-Cyano\n0\n0\n0\n\n\n3\n4-Ethoxy-\n0\n0\n0\n\n\n\ncarbonyl",
        "A mixture of SR339 with 1.0 weight percent of triarylsulfonium hexafluorophosphate and 1.0 weight percent of tetrabutylammonium 4-cyanobenzenesulfinate was prepared in a screw-cap vial. The mixture was purged with nitrogen gas for 45 seconds and then the vial was sealed and the sample was irradiated with a 100 W quartz-tungsten-halogen (QTH) light source (model I-100, available Cuda Fiberoptics, Jacksonville, Fla.) by holding and slowly agitating the vial approximately 2 cm in front of the light source. The light source shutter was fully open. Cure time was considered to be the time that it took for the solution viscosity to increase so that the liquid no longer flowed in the vial as the vial was agitated. The mixture was cured in 5 seconds.",
        "A mixture of SR339 with 1.0 weight percent of triarylsulfonium hexafluorophosphate was prepared in a screw-cap vial. The mixture was purged with nitrogen gas for 45 seconds and then the vial was sealed and the sample was irradiated as described in Example 3. Cure time was considered to be the time that it took for the solution viscosity to increase so that the liquid no longer flowed in the vial as the vial was agitated. The mixture was cured in 24 seconds.",
        "A mixture of SR339 with 1.0 weight percent of triarylsulfonium hexafluorophosphate and 1.0 weight percent of tetrabutylammonium 4-cyanobenzenesulfinate, was prepared in a screw-cap vial. The mixture was purged with nitrogen gas for 45 seconds and then the vial was sealed and the sample was irradiated with a Model 5560 dental curing light (obtained from 3M Company, St. Paul, Minn.) by holding and slowly agitating the vial approximately 2 cm in front of the light source. Cure time was considered to be the time that it took for the solution viscosity to increase so that the liquid no longer flowed in the vial as the vial was agitated. The mixture was cured in 40 seconds.",
        "A mixture of SR339 with 1.0 weight percent of triarylsulfonium hexafluorophosphate was prepared in a screw-cap vial. The mixture was purged with nitrogen gas for 45 seconds and then the vial was sealed and the sample was irradiated as described in Example 4. Cure time was considered to be the time that it took for the solution viscosity to increase so that the liquid no longer flowed in the vial as the vial was agitated. The mixture did not cure. After 40 seconds the mixture still flowed in the vial.",
        "The commercially available aqueous solution of triarylsulfonium chloride was dried using a rotary evaporator and then a vacuum oven. A mixture of dry triarylsulfonium chloride (1.0 g) and anhydrous ethanol (10 mL) was magnetically stirred at 40° C. for one hour. The mixture was then filtered through a pad of a filter aid (available under the trade designation CELITE from Aldrich Chemical Co., Milwaukee Wis.) in a fritted glass filter funnel. To the filtrate was added a solution of sodium 4-cyanobenzenesulfinate (0.52 g) in anhydrous ethanol (10 mL) and this mixture was magnetically stirred at room temperature for 1 hour. The mixture was filtered and the solvent was removed using a rotary evaporator. The residue was dissolved in methylene chloride and this solution was filtered. The solvent was removed using a rotary evaporator to afford 1.54 g of product as a hygroscopic solid.",
        "Two separate mixtures of SR339, each with 1 weight percent each of triarylsulfonium 4-cyanobenzenesulfinate, were prepared. Each sample was evaluated for rate and extent of cure by photo differential scanning calorimetry (photo-DSC) using a model DSC2920 calorimeter (available from TA Instruments, New Castle, Del.) with light from a 100 W medium pressure mercury that was either unfiltered or was filtered through a Model GG400 long pass filter (available from Esco Products, Oak Ridge, N.J.) according to the data in Table 3. The results are given in Table 3.",
        "TABLE 3\n\n\n\n\n\n\n\nCuring of Examples 6-7\n\n\n\n\n\n\n\n\n\n\n\n\n\nInitial Slope\nTime to peak\nTotal evolved\n\n\nExample\nFilter\n(W/g-min)\nmaximum (min)\nheat (J/g)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n6\nNone\n209.5\n0.13\n359.8\n\n\n7\nGG400\n33.2\n0.33\n335.3",
        "A mixture of SR238 with 1.0 weight percent of triphenylsulfonium hexafluoroantimonate and 1.0 weight percent of tetrabutylammonium naphthalene-1-sulfinate was prepared in a screw-cap vial. The solution was purged with nitrogen gas for 45 seconds and then vial was sealed and the sample was irradiated as described in Example 4. The mixture was cured in 6 seconds.",
        "A mixture of SR238 with 1.0 weight percent of triphenylsulfonium hexafluoroantimonate and 1.0 weight percent of tetrabutylammonium naphthalene-2-sulfinate was prepared in a screw-cap vial. The solution was purged with nitrogen gas for 45 seconds and then vial was sealed and the sample was irradiated as described in Example 4. The mixture was cured in 7 seconds.",
        "Four separate mixtures of SR339, each with 1 weight percent of propylene carbonate and 1 weight percent each of the naphthalene sulfinates of Preparative Examples 8 or 9, were prepared. For Examples 10 and 11, triphenylsulfonium naphthalene-1-sulfinate was used, whereas for Examples 12 and 13, triphenylsulfonium naphthalene-2-sulfinate was used. Each sample was evaluated for rate and extent of cure by photo differential scanning calorimetry (photo-DSC) using the method of Examples 6-7. The results are given in Table 4.",
        "TABLE 4\n\n\n\n\n\n\n\nCuring of Examples 10-13\n\n\n\n\n\n\n\n\n\n\n\n\n\nTetrabutyl-\n\n\n\n\n\n\n\nammonium\n\nInitial\nTime to peak\nTotal\n\n\nExam-\nNaphthalene\n\nSlope\nmaximum\nevolved\n\n\nple\nsulfinate\nFilter\n(W/g-min)\n(min)\nheat (J/g)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n10\nNaphthalene-1-\nNone\n381\n0.09\n420\n\n\n\nsulfinate\n\n\n11\nNaphthalene-1-\nGG400\n14.2\n0.47\n383\n\n\n\nsulfinate\n\n\n12\nNaphthalene-2-\nNone\n242\n0.10\n388\n\n\n\nsulfinate\n\n\n13\nNaphthalene-2-\nGG400\n0.15\n0.81\n277\n\n\n\nsulfinate"
    ],
    "citations": [
        "3556794",
        "3573922",
        "3607272",
        "3623875",
        "3627656",
        "3642487",
        "3708296",
        "3729313",
        "3741769",
        "3788858",
        "3808006",
        "4069054",
        "4069055",
        "4182035",
        "4216288",
        "4250053",
        "4250311",
        "4257915",
        "4259075",
        "4356296",
        "4366228",
        "4394403",
        "4455147",
        "4499251",
        "4503169",
        "4537940",
        "4539382",
        "4642126",
        "4650913",
        "4652274",
        "4665217",
        "4695251",
        "4752338",
        "4755620",
        "4859572",
        "4871786",
        "4872936",
        "4908227",
        "4959297",
        "4966934",
        "4971892",
        "4983644",
        "5076844",
        "5084586",
        "5089374",
        "5105006",
        "5124417",
        "5130347",
        "5154762",
        "5256447",
        "5304585",
        "5486544",
        "5501727",
        "5530038",
        "5545676",
        "5607663",
        "5662887",
        "5866630",
        "5876208",
        "5888491",
        "5998495",
        "6017660",
        "6030606",
        "6187833",
        "6204302",
        "6312668",
        "6331080",
        "6387981",
        "6444725",
        "6458868",
        "6528555",
        "6566413",
        "6572693",
        "6624236",
        "6759177",
        "6777460",
        "7026367",
        "7030169",
        "7064152",
        "2003/0054288",
        "2003/0166816",
        "0 237 233",
        "0 373 384",
        "0 375 160",
        "0 661 034",
        "0 712 622",
        "1 051 961",
        "1 269 967",
        "2002-341519",
        "WO 00/38619",
        "WO 00/42092",
        "WO 01/07444",
        "WO 01/30306",
        "WO 01/30307",
        "WO 01/92271",
        "WO 02/092021"
    ],
    "us_classification": "522 31",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "C",
            "classification_class": "08",
            "subclass": "F",
            "main_group": "2",
            "subgroup": "46"
        }
    ]
}