{
    "title": "Delta sigma modulator analog-to-digital converters with quantizer output prediction and comparator reduction",
    "abstract": "The quantizers of delta sigma modulators in the signal processing systems described herein use a reduced set of comparators for quantization by predetermining and maintaining a maximum per cycle deviation d between a loop filter output signal V",
    "inventors": [
        "Melanson"
    ],
    "document_number": "07298305",
    "publication_date": "20071120",
    "assignees": [
        "Cirrus Logic, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A signal processing system comprising:",
            "components": [
                {
                    "component": "an analog-to-digital delta sigma modulator comprising:",
                    "subcomponents": [
                        "a quantizer output predictor comprising a low pass filter to generate a predicted quantizer output signal, wherein the predicted quantizer output signal is an estimate of a quantizer input signal for time t based upon at least one or more previous delta sigma modulator output signals;",
                        "a loop filter to generate a loop filter output signal for time t; and",
                        "a quantizer, coupled to the loop filter, to generate a quantizer output signal based on the quantizer input signal, wherein the quantizer input signal comprises a difference between the loop filter output signal for time t and the predicted quantizer output signal for time t."
                    ]
                },
                {
                    "component": "a quantizer output predictor comprising a low pass filter to generate a predicted quantizer output signal, wherein the predicted quantizer output signal is an estimate of a quantizer input signal for time t based upon at least one or more previous delta sigma modulator output signals;",
                    "subcomponents": []
                },
                {
                    "component": "a loop filter to generate a loop filter output signal for time t; and",
                    "subcomponents": []
                },
                {
                    "component": "a quantizer, coupled to the loop filter, to generate a quantizer output signal based on the quantizer input signal, wherein the quantizer input signal comprises a difference between the loop filter output signal for time t and the predicted quantizer output signal for time t.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The signal processing system of claim 1 wherein the quantizer comprises:",
            "components": [
                {
                    "component": "M comparators, wherein M represents a number of comparators determined from a maximum quantizer level deviation d, and the maximum quantizer level deviation d represents a maximum deviation of the loop filter output signal at time t from the predicted quantizer output signal for time t.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The signal processing system of claim 2 wherein M is determined in accordance with:",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                },
                {
                    "component": "wherein d represents a maximum deviation of the loop filter output signal at time t from the predicted quantizer output signal for time t.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The signal processing system of claim 1 further comprising:",
            "components": [
                {
                    "component": "a compensation module to correct the quantizer output signal with a digital version of the predicted quantizer output signal for time t and to generate a delta sigma modulator output signal q(n).",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The signal processing system of claim 1 wherein the delta sigma modulator is configured to generate a delta sigma modulator output signal q(n) from the quantizer output signal, and the quantizer output predictor comprises a low pass filter to generate the predicted quantizer output signal for discrete time n based upon at least two past delta sigma modulator output signals determined prior to discrete time n.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The signal processing system of claim 1 wherein the quantizer output predictor comprises a low pass filter to average at least two previous delta sigma modulator output signals.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The signal processing system of claim 6 wherein the low pass filter is a finite impulse response filter having a filter function to determine the predicted quantizer output signal (q",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The signal processing system of claim 6 wherein the low pass filter is an infinite impulse response filter having a filter function to determine the predicted quantizer output signal (q",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The signal processing system of claim 1 wherein the predicted quantizer output signal q",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The signal processing system of claim 1 further comprising:",
            "components": [
                {
                    "component": "a computation module, coupled to the quantizer output predictor and the loop filter, to determine the difference between the loop filter output signal for time t and the predicted quantizer output signal for time t.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The signal processing system of claim 1 wherein the delta sigma modulator has N quantization levels and the quantizer has M comparators, wherein N and Mare integers and M<N.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The signal processing system of claim 1 wherein the quantizer further comprises:",
            "components": [
                {
                    "component": "a plurality of comparators, each of the comparators having an input terminal to receive the quantizer input signal and an input terminal to receive a respective reference signal; and",
                    "subcomponents": []
                },
                {
                    "component": "a comparator offset converter, coupled to the multiple comparators, to reroute respective reference signals from a first arrangement of comparator input terminals during a first time period to a second arrangement of comparator input terminals during a second time period.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A method of processing a signal using an analog-to-digital delta sigma modulator, the method comprising:",
            "components": [
                {
                    "component": "generating a predicted quantizer output signal with a low pass filter, wherein the predicted quantizer output signal is an estimate of a quantizer input signal for time t based upon at least one or more previous delta sigma modulator output signals;",
                    "subcomponents": []
                },
                {
                    "component": "generating a loop filter output signal for time t; and",
                    "subcomponents": []
                },
                {
                    "component": "generating a quantizer output signal based on the quantizer input signal, wherein the quantizer input signal comprises a difference between the loop filter output signal for time t and the predicted quantizer output signal for time t.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 13 wherein generating the quantizer output signal further comprises generating the quantizer output signal using a quantizer that includes M comparators, M represents a number of comparators determined from a maximum quantizer level of deviation d, maximum quantizer level deviation d represents a maximum deviation of the loop filter output signal at time t from the predicted quantizer output signal for time t and M is determined in accordance with:",
            "components": [
                {
                    "component": "",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 13 further comprising:",
            "components": [
                {
                    "component": "adding a digital version of the predicted quantizer output signal for time t to the quantizer output signal to generate a delta sigma modulator output signal q(n).",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 13 further comprising:",
            "components": [
                {
                    "component": "generating a delta sigma modulator output signal q(n) from a digital version of the predicted quantizer output signal for time t and the quantizer output signal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 13 further comprising:",
            "components": [
                {
                    "component": "generating a delta sigma modulator output signal q(n) from the quantizer output signal:",
                    "subcomponents": []
                },
                {
                    "component": "wherein generating a quantizer output signal further comprises generating the predicted quantizer output signal for discrete time n based upon at least two past delta sigma modulator output signals determined prior to discrete time n.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 13 wherein generating a predicted quantizer output signal further comprises:",
            "components": [
                {
                    "component": "low pass filtering at least two previous delta sigma modulator output signals.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 18 wherein low pass filtering at least two previous delta sigma modulator output signals comprises using a finite impulse response filter function to determine the predicted quantizer output signal (q",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method of claim 18 wherein low pass filtering at least two previous delta sigma modulator output signals comprises using an infinite impulse response filter function to determine the predicted quantizer output signal (q",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The method of claim 13 wherein the predicted quantizer output signal q",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The method of claim 13 further comprising:",
            "components": [
                {
                    "component": "receiving reference signals on a first arrangement of input terminals of respective comparators of the delta sigma modulator during a first period of time; and",
                    "subcomponents": []
                },
                {
                    "component": "rerouting the reference signals to a second arrangement of input terminals of the respective comparators of the delta sigma modulator during a second period of time.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. A signal processing system comprising:",
            "components": [
                {
                    "component": "an analog-to-digital delta sigma modulator comprising:",
                    "subcomponents": [
                        "an input to receive an input signal;",
                        "a filter coupled to the input; and",
                        "a quantizer coupled to the filter to quantize an output of the filter, wherein the quantizer comprises:",
                        "M comparators, wherein each comparator is configured (i) to receive the input signal, (ii) to receive a respective reference signal that approximates the input signal, and (iii) generate comparison data representing a comparison between the input signal and the received reference signal, wherein M is an even integer and M≧2; and",
                        "an N-level reference signal generator, coupled to the M-comparators, to (i) generate each respective reference signal based on content of the comparison data and (ii) provide each respective reference signal to the M comparators, wherein N is an integer and N>M."
                    ]
                },
                {
                    "component": "an input to receive an input signal;",
                    "subcomponents": []
                },
                {
                    "component": "a filter coupled to the input; and",
                    "subcomponents": []
                },
                {
                    "component": "a quantizer coupled to the filter to quantize an output of the filter, wherein the quantizer comprises:",
                    "subcomponents": [
                        "M comparators, wherein each comparator is configured (i) to receive the input signal, (ii) to receive a respective reference signal that approximates the input signal, and (iii) generate comparison data representing a comparison between the input signal and the received reference signal, wherein M is an even integer and M≧2; and",
                        "an N-level reference signal generator, coupled to the M-comparators, to (i) generate each respective reference signal based on content of the comparison data and (ii) provide each respective reference signal to the M comparators, wherein N is an integer and N>M."
                    ]
                },
                {
                    "component": "M comparators, wherein each comparator is configured (i) to receive the input signal, (ii) to receive a respective reference signal that approximates the input signal, and (iii) generate comparison data representing a comparison between the input signal and the received reference signal, wherein M is an even integer and M≧2; and",
                    "subcomponents": []
                },
                {
                    "component": "an N-level reference signal generator, coupled to the M-comparators, to (i) generate each respective reference signal based on content of the comparison data and (ii) provide each respective reference signal to the M comparators, wherein N is an integer and N>M.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The signal processing system of claim 23 wherein the N-level successive approximator further comprises:",
            "components": [
                {
                    "component": "processing modules having logic to limit each reference signal to within plus or minus a maximum expected deviation of the input signal from a predicted value quantization output value.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The signal processing system of claim 23 wherein the N-level successive approximator further comprises:",
            "components": [
                {
                    "component": "processing modules to process the comparison data and generate a select signal to select a value for each reference signal; and",
                    "subcomponents": []
                },
                {
                    "component": "a reference generator to receive the select signal and provide each reference signal to the M comparators.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The signal processing system of claim 25 wherein the reference generator comprises:",
            "components": [
                {
                    "component": "series coupled impedances; and",
                    "subcomponents": []
                },
                {
                    "component": "a multiplexer having multiple inputs coupled to receive respective voltage references generated across the impedances.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The signal processing system of claim 23 wherein each of the M comparators includes multiple inputs to receive a respective input signal and a respective reference signal, the signal processing system further comprising:",
            "components": [
                {
                    "component": "a comparator offset voltage reducer to change which of the respective reference signals that each of the M comparators receives during subsequent periods of time.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The signal processing system of claim 23 wherein the filter comprises continuous time filter components.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The signal processing system of claim 23 wherein the filter comprises discrete time filter components.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. A method comprising:",
            "components": [
                {
                    "component": "receiving a quantizer input signal with first inputs of M comparators of a quantizer of an analog-to-digital delta sigma modulator, wherein M is an even integer and M≧2;",
                    "subcomponents": []
                },
                {
                    "component": "receiving a respective reference signal on each of second inputs of the M comparators;",
                    "subcomponents": []
                },
                {
                    "component": "generating comparison data with each of the M-comparators representing a comparison between the quantizer input signal and the respective reference signal; and",
                    "subcomponents": []
                },
                {
                    "component": "generating each reference signal, wherein the reference signal is based on content of the comparison data, the reference signal has one of N possible levels for each comparison, and N is an integer and N>M.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The method of claim 30 wherein generating each reference signal further comprises:",
            "components": [
                {
                    "component": "limiting each reference signal to within plus or minus a maximum expected deviation of the quantizer input signal from a value of a preceding quantizer input signal occurring in a past predetermined length of time.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. The method of claim 30 wherein generating each reference signal further comprises:",
            "components": [
                {
                    "component": "processing the comparison data to generate a select signal to select a value for each reference signal;",
                    "subcomponents": []
                },
                {
                    "component": "receiving the select signal; and",
                    "subcomponents": []
                },
                {
                    "component": "providing each reference signal to the M comparators in accordance with the select signal.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. The method of claim 30 wherein the quantizer input signal is a continuous time signal.",
            "components": []
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The method of claim 30 wherein the quantizer input signal is a discrete time signal.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. The method of claim 30 wherein M equals a number of levels of an expected maximum quantization level variation of the input signal from an immediately preceding input signal.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. An apparatus comprising:",
            "components": [
                {
                    "component": "means for receiving a quantizer input signal with first inputs of M comparators of a quantizer of an analog-to-digital delta sigma modulator, wherein M is an even integer and M≧2;",
                    "subcomponents": []
                },
                {
                    "component": "means for receiving a respective reference signal on each of second inputs of the M comparators;",
                    "subcomponents": []
                },
                {
                    "component": "means for generating comparison data with each of the M-comparators representing a comparison between the quantizer input signal and the respective reference signal; and",
                    "subcomponents": []
                },
                {
                    "component": "means for generating each reference signal, wherein the reference signal is based on content of the comparison data, the reference signal has one of N possible levels for each comparison, and N is an integer and N>M.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This patent application cross-references U.S. application Ser. No. 11/388,436 entitled “Delta Sigma Modulators with Comparator Offset Noise Conversion” by inventor John Melanson, filed on Mar. 24, 2006 and U.S. application Ser. No. 11/388,425 entitled “Delta Sigma Modulator Analog-to-Digital Converters with Multiple Threshold Comparisons during a Delta Sigma Modulator Output Cycle” by inventor John Melanson, filed on Mar. 24, 2006, now U.S. patent application Ser No. 7,221,303, issued on May 22, 2007.",
        "1. Field of the Invention",
        "The present invention relates in general to the field of information processing, and more specifically to a signal processing system and method for reducing comparators in delta sigma modulator, analog-to-digital comparators using quantizer output prediction.",
        "2. Description of the Related Art",
        "Many signal processing systems include delta sigma modulators to quantize an input signal into one or more bits. Delta sigma modulators trade-off increased noise in the form of quantization error in exchange for high sample rates and noise shaping. “Delta-sigma modulators” are also commonly referred to using other interchangeable terms such as “sigma-delta modulators”, “delta-sigma converters”, “sigma delta converters”, and “noise shapers”.",
        "FIG. 1 depicts an analog-to-digital converter (ADC) delta sigma modulator 100 that receives an analog input signal x(t) and converts the input signal x(t) into a series of low resolution, digital output pulses q(n), where t represents a continuous time variable and n denotes a discrete time variable. The average amplitude over time of the series of low resolution pulses is q(n). In general, the delta sigma modulator 100 quantizes a difference between the current input signal x(t) and an analog version of the previous quantizer output signal, i.e. q(t−1). In the feedback loop of delta sigma modulator 100, a digital-to-analog converter (DAC) 108 converts each delayed (z−1) output signal q(n−1) into an analog signal q(t−1). The feedback loop of delta sigma modulator 100 also includes dynamic element matching 106 to correct nonlinearities in the DAC 108 signal q(n−1).",
        "The noise shaping loop filter 102 processes a difference between input signal x(t) and the delayed output signal q(t−1) to generate a loop filter output signal/quantizer input signal VLF. During each output cycle of delta sigma modulator operation, quantizer 104 quantizes signal VLF to generate output signal q(n), generally in the form of digital data. When loop filter 102 is a continuous time filter, the quantizer 104 represents a relatively low-accuracy ADC converter operating at an oversampling rate, such as a rate of 64:1. Quantizer 104 can provide multi-bit or one-bit output quantization levels. The quantization level step size, Δ, represents the difference between each quantization level. One-bit quantizers have only two quantization levels specified as {−α/2, α/2} or {−1,1}. Shreier and Temes, Understanding Delta-Sigma Signal Converters, IEEE Press, 2005 (referred to herein as “Shreier & Temes”) describes conventional delta-sigma modulators in more detail.",
        "Multi-bit ADC delta sigma modulators exhibit some well-known advantages over single bit ADC delta sigma modulators such as reduced quantization noise. However, quantizer design continues to represent one of the significant challenges confronting delta sigma modulator designers.",
        "FIG. 2 depicts a flash-type quantizer 200, which represents one embodiment of quantizer 104. Quantizer 200 includes r comparators 202.0-202.r−1, each having a first input connected to the output of loop filter 102 to receive quantizer input signal VLF. “r” is a positive integer representing the number of comparators in delta sigma modulator 100. Each of the comparators 202.0-202.r−1 includes a second input to receive respective reference voltages V0 through Vr−1. The reference voltages serve as reference signals to quantize the quantizer input signal VLF. A resistor string reference ladder of r−1 resistors 204.1-204.r−1 of value R generates uniform voltage drops across at least reference resistors 204.1-204.r−1 to generate respective reference voltages V0 through Vr−1. The end resistors 204.0 and 204.r have values that can be used to scale the quantization levels (also referred to as a “quantizer step”). For example, the largest quantizer threshold may be 1.2 V, but the available reference may be 2.5 V, so resistors 204.0 and 204.r are set to achieve the desired scale. A reference voltage of +Vref to −Vref is applied across the reference resistors 204.0-204.r. +/−Vref is, for example, +/−1.5 Volts (V).",
        "Each of comparators 202.0-202.r−1 compares the quantizer input signal VLF with respective reference voltages V0 through Vr−1. The ith comparator 202.i generates a logical zero (e.g. 0 V) when the ith reference voltage Vi is less than or equal to the loop filter output/quantizer input signal VLF and a logical one (e.g. +2.5 V) when Vi>VLF. Once during each cycle of quantizer 104 operation, digital encoder 206 encodes the output signals of comparators 202.0-202.r−1 into a digital (discrete) output signal q(n).",
        "Increasing the number of comparators in quantizer 104, i.e. increasing the value of r, yields a higher quality output signal q(n) (e.g. less quantization noise) and higher signal bandwidth capabilities. Each time r doubles, delta sigma modulator 100 typically achieves a 6 dB quantization noise improvement. However, disadvantages also accompany increasing the number of comparators in quantizer 104. For example, increasing the number of comparators requires more physical area to implement and more power to operate. Additionally, increasing the number of comparators decreases voltage spacing between adjacent reference voltages Vi and Vi+1 and increases the relative effects of non-idealities, such as comparator offset voltages.",
        "Comparator offset voltages represent the minimum direct current (DC) input voltage that would have to be applied to input terminals of the comparator to cause the comparator to transition state. Thus, comparator offset voltages can cause error in the comparator outputs, especially when the difference between the reference input signals of adjacent comparators is small. Accordingly, as the relative effects of quantizer non-idealities increase, the nonidealities cause increasing delta sigma modulator error. The non-linearity can cause harmonic distortion, especially at high signal frequencies, increased noise, and modulation of noise with the direct current (DC) input level, all of which are undesirable.",
        "An example with the number of comparators equal to r=16 illustrates effects of comparator nonidealities. Assuming seventeen (17) quantization levels, normalized to −8, −7, −6, . . . , −1, 0, +1, +2, . . . , +8, the input reference voltages V0 through V15 to respective comparators 202.0-202.r−1 are normalized values of −7.5, −6.5, −5.5, . . . , −0.5, +0.5, . . . , +5.5, +6.5, +7.5. Each actual reference voltage Vi scales with the analog system reference voltage Vref. For example, if level −8 corresponds to −1.5 V and level +8 corresponds to +1.5 V, then the respective comparator input voltage references V0 through V15 for comparators 202.0-202.r−1 are −7.5/8*1.5, −6.5/8*1.5, . . . , +6.5/8*1.5, and +7.5/8*1.5V. Thus, as the number of comparators increases the voltage reference spacing decreases. It follows that as the number of comparators increases, eventually non-linearities of the flash-type quantizer 200 counteract any advantage obtained by increasing the number of comparators. Additionally, in an integrated circuit, chip area is valuable. Increasing the number of comparators requires more chip area and, thus, can become a dominant disadvantage.",
        "FIG. 3 depicts a tracking ADC quantizer 300, which represents another embodiment of quantizer 104. The tracking ADC quantizer 300 is described in detail in Dorrer et al., A 3-mW 74-dB SNR 2-MHz Continuous-Time Delta-Sigma ADC With a Tracking ADC Quantizer in 0.13-μm CMOS, IEEE Journal of Solid-State Circuits, Vol. 40, No. 12, December 2005. The quantizer 300 reduces the number of comparators to three comparators 302.0, 302.1, and 302.2, a counter 304, an R-string reference ladder 306, and a switching matrix 308 to connect the reference voltages V0, V1, and V2 to the inputs of comparators 302.0, 302.1, and 302.2. When the loop filter 102 output voltage VLF has a value of 1 least significant bit (LSB) or less, only the middle comparator 302.1 will change state, and the state of counter 304 remains unchanged. For VLF signal changes larger than 1 LSB, adjacent comparators 302.2 or 302.0 will change state depending upon whether the change is greater than or less than the previous state. The logic 310 detects this state change and increases the output of counter 304 or decreases the output of counter 304 depending upon whether comparator 302.2 or 302.0 changed state. By changing the state of counter 304, the reference voltages V0, V1, and V2 to respective comparators 302.0, 302.1, and 302.2 are tracked to the new output value of counter 304. In each cycle of operation of delta sigma modulator 300, the output signal q(n) of quantizer 300 is generated by using the result of counter 304 and the output signal of comparators 302.0, 302.1, and 302.2.",
        "Despite developments in quantizer technology, ADC delta sigma modulator quantizer design can still be improved to reduce the number of comparators used in comparable ADC delta sigma modulator quantizer designs and the effects of comparator non-idealities.",
        "In one embodiment of the present invention, a signal processing system includes an analog-to-digital delta sigma modulator. The analog-to-digital delta sigma modulator includes a quantizer output predictor. The quantizer output predictor includes a low pass filter to generate a predicted quantizer output signal, wherein the predicted quantizer output signal is an estimate of a quantizer input signal for time t based upon at least one or more previous delta sigma modulator output signals. The delta sigma modulator also includes a loop filter to generate a loop filter output signal for time t. The delta sigma modulator also includes a quantizer, coupled to the loop filter, to generate a quantizer output signal based on the quantizer input signal, wherein the quantizer input signal comprises a difference between the loop filter output signal for time t and the predicted quantizer output signal for time t.",
        "In another embodiment of the present invention, a method of processing a signal using an analog-to-digital delta sigma modulator includes generating a predicted quantizer output signal with a low pass filter, wherein the predicted quantizer output signal is an estimate of a quantizer input signal for time t based upon at least one or more previous delta sigma modulator output signals. The method also includes generating a loop filter output signal for time t. The method further includes generating a quantizer output signal based on the quantizer input signal, wherein the quantizer input signal comprises a difference between the loop filter output signal for time t and the predicted quantizer output signal for time t.",
        "In a further embodiment of the present invention, a signal processing system includes an analog-to-digital delta sigma modulator. The delta sigma modulator includes an input to receive an input signal and a filter coupled to the input. The delta sigma modulator further includes a quantizer coupled to the filter to quantize an output of the filter. The quantizer further includes M comparators, wherein each comparator is configured (i) to receive the input signal, (ii) to receive a respective reference signal that approximates the input signal, and (iii) generate comparison data representing a comparison between the input signal and the received reference signal, wherein M is an even integer and M≧2, an N-level reference signal generator, coupled to the M-comparators, to (i) generate each respective reference signal based on content of the comparison data and (ii) provide each respective reference signal to the M comparators, wherein N is an integer and N>M. In at least one embodiment, N>M+2.",
        "In another embodiment of the present invention, a method includes receiving a quantizer input signal with first inputs of M comparators of a quantizer of an analog-to-digital delta sigma modulator, wherein M is an even integer and M≧2. The method further includes receiving a respective reference signal on each of second inputs of the M comparators and generating comparison data with each of the M-comparators representing a comparison between the quantizer input signal and the respective reference signal. The method also includes generating each reference signal, wherein the reference signal is based on content of the comparison data, the reference signal has one of N possible levels for each comparison, and N is an integer and N>M.",
        "In a further embodiment of the present invention, an apparatus includes means for receiving a quantizer input signal with first inputs of M comparators of a quantizer of an analog-to-digital delta sigma modulator, wherein M is an even integer and M≧2. The apparatus also includes means for receiving a respective reference signal on each of second inputs of the M comparators and means for generating comparison data with each of the M-comparators representing a comparison between the quantizer input signal and the respective reference signal. The apparatus further includes means for generating each reference signal, wherein the reference signal is based on content of the comparison data, the reference signal has one of N possible levels for each comparison, and N is an integer and N>M.",
        "The present invention may be better understood, and its numerous objects, features and advantages made apparent to those skilled in the art by referencing the accompanying drawings. The use of the same reference number throughout the several figures designates a like or similar element.",
        "FIG. 1 (labeled prior art) depicts an analog-to-digital converter (ADC) delta sigma modulator.",
        "FIG. 2 (labeled prior art) depicts a flash-type quantizer of a delta sigma modulator.",
        "FIG. 3 (labeled prior art) depicts a tracking ADC quantizer.",
        "FIG. 4 depicts one embodiment of a reduced comparator delta sigma modulator.",
        "FIG. 5 depicts a reduced comparator quantizer.",
        "FIG. 6 depicts a consolidated computation module, DAC, and reduced comparator quantizer.",
        "FIG. 7 depicts a reduced comparator quantizer with a comparator offset noise converter.",
        "FIG. 8 depicts a consolidated computation module, DAC, and reduced comparator quantizer with a comparator offset noise converter.",
        "FIG. 9 depicts a signal processing system with a reduced comparator delta sigma modulator.",
        "The quantizers of delta sigma modulators in the signal processing systems described herein use a reduced set of comparators for quantization by predetermining and maintaining a maximum per cycle deviation d between a loop filter output signal VLF(t) and a predicted quantizer output signal qest. In at least one embodiment, a maximum quantizer level deviation d is defined in terms of a number of quantization levels. Thus, the number of comparators in a quantizer needed to quantize the quantizer input signal Vin(t) is based on the maximum quantizer level deviation d.",
        "In at least one embodiment, the predicted quantizer output signal qest is based on previous quantizer output signals. The predicted quantizer output signal qest is effectively subtracted from the loop filter output signal VLF(t) to generate a quantizer input signal Vin(t). In at least one embodiment, the predicted quantizer output signal qest is designed to ensure that the resulting quantizer input signal Vin(t) is in the range of −d to +d. Quantization of the quantizer input signal Vin(t) generates a preliminary quantizer output signal c(n) based on the output signals of the comparators of the quantizer. The delta sigma modulator generates a final delta sigma modulator (DSM) output signal q(n) by adding predicted quantizer output signal qest to the preliminary quantizer output signal c(n).",
        "In addition to using fewer comparators than available quantization output levels N, in at least one embodiment, the quantizers use an even number of comparators M, in contrast to comparable conventional reduced comparator ADC tracking quantizer designs using M+1 number of comparators, where N and M are integers and M<N. An even number of comparators provides comparator reduction efficiencies over the conventional ‘odd-number’ comparator reduction design while obtaining equivalent quantization results.",
        "FIG. 4 depicts one embodiment of a reduced comparator delta sigma modulator 400 that includes a reduced comparator quantizer 402 to quantize an output signal VLF(t) of loop filter 404. In one embodiment, loop filter 404 is jth order analog filter, where j is an integer greater than one (1). The quantizer output signal q(n)z−1 (i.e. q(n−1) is fed back through optional dynamic element matching elements (DEMs) 406 and digital-to-analog converter (DAC) 408 to generate a feedback loop filter input signal q(t−1)). Loop filter 404 provides noise shaping to a difference between delta sigma modulator input signal x(t) and q(t−1). Embodiments of loop filter 404, DEMs 406, and DAC 408 are described in more detail in Shreier & Temes.",
        "Delta sigma modulator 400 includes a quantizer output predictor 410 to generate the predicted quantizer output signal qest. In at least one embodiment, the quantizer output predictor 410 is a digital low pass filter. The quantizer output predictor 410 can be either a finite infinite response (FIR) filter or an infinite impulse response (IIR) filter. Generally, for optimal delta sigma modulator performance, the filter function of the quantizer output predictor 410 is matched to the noise transfer function (NTF) of the loop filter 404. The quantizer output predictor 410 is preferably designed to generate a predicted quantizer output signal qest. The value of predicted quantizer output signal qest generally ensures that the quantizer input signal Vin(t) is in the range of −d to +d. “d” represents a maximum quantizer level deviation between predicted quantizer output signal qest and loop filter output signal VLF(t). In at least one embodiment, the maximum quantizer level deviation d is defined in terms of a number of quantization levels. However, if the quantizer only rarely steps by an amount that exceeds +/−d (for example, when d≈floor(d)), then it may be acceptable to use only a number of comparators intended to quantize quantizer input signal Vin(t)+/−d. Some performance degradation can be expected and can be determined by simulation.",
        "The quantizer output predictor 410 can be a relatively simple or an optimized filter. However, it has been found that relatively simple low pass filters perform nearly as well as optimized filters. The following low pass filters have been determined to perform well for delta sigma modulator 400:",
        "LPF\n          =\n          \n            \n              \n                q\n                ⁡\n                \n                  (\n                  \n                    n\n                    -\n                    1\n                  \n                  )\n                \n              \n              +\n              \n                q\n                ⁡\n                \n                  (\n                  \n                    n\n                    -\n                    2\n                  \n                  )\n                \n              \n            \n            2\n          \n        \n        ,\n      \n    \n    \n      \n        [\n        \n          Filter\n          ⁢\n          \n            \n          \n          ⁢\n          1\n        \n        ]\n      \n    \n  \n  \n    \n      \n        \n          LPF\n          =\n          \n            \n              \n                q\n                ⁡\n                \n                  (\n                  \n                    n\n                    -\n                    1\n                  \n                  )\n                \n              \n              +\n              \n                q\n                ⁡\n                \n                  (\n                  \n                    n\n                    -\n                    2\n                  \n                  )\n                \n              \n              +\n              \n                q\n                ⁡\n                \n                  (\n                  \n                    n\n                    -\n                    3\n                  \n                  )\n                \n              \n              +\n              \n                q\n                ⁡\n                \n                  (\n                  \n                    n\n                    -\n                    4\n                  \n                  )\n                \n              \n            \n            4\n          \n        \n        ,\n      \n    \n    \n      \n        [\n        \n          Filter\n          ⁢\n          \n            \n          \n          ⁢\n          2\n        \n        ]\n      \n    \n  \n  \n    \n      \n        \n          LPF\n          =\n          \n            \n              \n                1\n                8\n              \n              ⁢\n              \n                q\n                ⁡\n                \n                  (\n                  \n                    n\n                    -\n                    1\n                  \n                  )\n                \n              \n            \n            +\n            \n              \n                7\n                8\n              \n              ⁢\n              \n                LPF\n                ⁡\n                \n                  (\n                  \n                    n\n                    -\n                    1\n                  \n                  )\n                \n              \n            \n          \n        \n        ,\n        and\n      \n    \n    \n      \n        [\n        \n          Filter\n          ⁢\n          \n            \n          \n          ⁢\n          3\n        \n        ]\n      \n    \n  \n  \n    \n      \n        LPF\n        =\n        \n          \n            \n              1\n              8\n            \n            ⁢\n            \n              q\n              ⁡\n              \n                (\n                \n                  n\n                  -\n                  2\n                \n                )\n              \n            \n          \n          +\n          \n            \n              7\n              8\n            \n            ⁢\n            \n              \n                LPF\n                ⁡\n                \n                  (\n                  \n                    n\n                    -\n                    1\n                  \n                  )\n                \n              \n              .\n            \n          \n        \n      \n    \n    \n      \n        [\n        \n          Filter\n          ⁢\n          \n            \n          \n          ⁢\n          4\n        \n        ]\n      \n    \n  \n\n\n\n\nwhere “LPF” is the low pass filter output, wherein “LPF” is the low pass filter output, “q(n−k)” represents the quantizer output signal immediately preceding quantizer output signal q(n−(k−1)), wherein k is an integer representing the amount of delay. For example, “q(n−1)” represents the quantizer output signal immediately preceding quantizer output signal q(n), “q(n−2)” represents the quantizer output signal immediately preceding q(n−1), and so on. Filters [1] and [2] are exemplary FIR filters, and filters [3] and [4] are exemplary IIR filters. Minimizing the time to obtain the low pass filter output LPF is advantageous since in a real time signal processing environment, the delta sigma modulator 400 has only a limited amount of time to determine a quantization output signal q(n). Filter [4] can determine the low pass filter LPF output in only two delta sigma modulator output cycles and, thus, is useful for pipelined delta sigma modulator embodiments.",
        "Many other simple and optimized filters can be used with coefficients that allow the filters to closely match the NTF of loop filter 404 and ensure a maximum quantizer level deviation d that reduces the number of comparators in reduced comparator quantizer 402 to a number that is less than the number of quantization levels. The coefficient choices may be varied. For example, for the IIR filters, ⅛ and ⅞ may be changed to respectively 1/16 and 15/16, ¼ or ¾, and so on to obtain the best observed performance. Utilizing the immediately prior quantizer output signal q(n÷1) is the simplest predictor to implement. However, using subsequent quantizer output signals to determine predicted quantizer output signal qest, as set forth in filters [1]-[4], reduce the range of quantizer input signal Vin(t) possibilities and, thus, the number of comparators used by reduced comparator quantizer 402.",
        "After generation of each quantizer output signal q(n), quantizer output predictor 410 generates a digital predicted quantizer output signal qest(n). In at least one embodiment, the predicted quantizer output signal qest=floor(LPF+0.5) for an even number of comparators in reduced comparator quantizer 402, and qest=floor(LPF) for an odd number of comparators in reduced comparator quantizer 402, where LPF is the low pass filter output of the quantizer output predictor 410. The “floor” function truncates the operand down to the nearest integer. For example, floor(7.9)=7, floor(7.4)=7, and so on. The function “floor(x+0.5)” is a rounding function. For an even number of comparators, the reduced comparator quantizer 402 has an odd number of possible preliminary quantizer outputs c(n). The rounding function allows the comparators of reduced comparator quantizer 402 to center around the predicted quantizer input signal Vins(t).",
        "The predicted quantizer output signal qest(n) is fed back to DAC 412 to generate an analog predicted quantizer output signal qest(t). Computation module 414, such as an analog summer, determines the quantizer input signal Vin(t) from the loop filter output signal VLF(t) minus the predicted quantizer output signal qest(t), i.e. Vin(t)=VLF(t)−qest(t). In at least one embodiment, the reduced comparator quantizer 402 quantizes quantizer input signal Vin(t) to generate a preliminary quantizer output signal c(n). The preliminary quantizer output signal c(n) is corrected by the predicted quantizer output signal qest(n), whose analog version qest(t) was subtracted from loop filter output signal VLF(t) to generate quantizer input signal Vin(t). Delta sigma modulator 400 includes a digital summing module 416 to generate the final quantizer output signal q(n) by adding the preliminary quantizer output signal c(n) to the predicted quantizer output signal qest(n).",
        "In at least one embodiment, to determine the maximum quantizer level deviation d, a simulator simulates delta sigma modulator 400 using multiple values of input signal x(t). The values of input signal x(t) chosen for simulation are values that will induce the largest deviations between successive quantizer input signals. In at least one embodiment, quantization of a full range of input signals x(t) are simulated in operation 502. After each loop filter output signal VLF(t) is generated, loop filter output signal VLF(t) is compared to predicted quantizer output signal qest(t) for each time t. In at least one embodiment, the number of comparators M to perform quantization in reduced comparator quantizer 402 is set forth in Equation [1]:\n\nM=ceiling(2*d)  [Equation 1]\n\nwhere M is the number of comparators in reduced comparator quantizer 402, d is the maximum quantizer level deviation determined during simulation, and the “ceiling(x)” function rounds the operand “x” up to the nearest integer. For example, ceiling(7.4)=8, ceiling(7.9)=8, and so on.",
        "Table 1 sets forth some examples of the number of comparators for reduced comparator quantizer 402 based on various values of maximum quantizer level deviation d and M=ceiling(2*d):",
        "TABLE 1\n\n\n\n\n\n\n\nNumber of\n\n\nMaximum Quantizer\n\nComparators\n\n\nLevel Deviation d\n(2 * d)\nM = ceiling(2 * d)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1.1\n2.2\n3\n\n\n1.6\n3.2\n4\n\n\n0.6\n1.2\n2",
        "In other embodiments, fewer comparators than indicated by Equation [1] can be used. For example, if the quantizer only rarely steps by 2, it may be acceptable to use only 2 comparators, which corresponds to +/−d=+/−1. Some performance degradation can be expected and can be determined by simulation.",
        "FIG. 5 depicts quantizer 500, which represents one embodiment of reduced comparator quantizer 402. Each of comparators 502.0 through 502.M−1 (“502.0-502.M−1”) includes an input terminal to receive quantizer input voltage Vin(t)=VLF(t)−qest(t). The comparators 502.0-502.M−1 also each include an input terminal to receive a respective reference signal Vr0, Vr1, . . . , VrM−1. During each delta sigma modulator output cycle, the comparators 502.0-502.M−1 compare the quantizer input signal Vin(t) to the respective reference signals generated by reference signal generator 506.",
        "Upon each comparison between the quantizer input signal Vin(t) and reference signals Vr0, Vr1, . . . , VrM−1, comparators 502.0 through 502.M−1 provide respective comparator output signals Vc0, Vc1, . . . , VcM−1 (collectively referred to as “comparison data”) that represent the outcome of the respective comparisons. In at least one embodiment, the comparator output signal Vci of the ith comparator 502.i is a logical one (1) if the input signal Vin(t) is greater than the reference signal provided to the ith comparator 502.i, and is a logical zero (0) if the input signal Vin is less than or equal to the reference signal provided to the ith comparator 502.i, where iε{0, 1, . . . , M−1}.",
        "For quantizer 500, in at least one embodiment, for an even number of comparators, the values of reference signals are +/−0.5 for the center two comparators with step sizes of +/1 between adjacent comparators. For example, for M=4 comparators, Vr0, Vr1, Vr2, and Vr3 in terms of normalized quantization levels are respectively −1.5, −0.5, +0.5, +1.5. For M=6 comparators, Vr0, Vr1, Vr2, Vr3, Vr4, and Vr5 are respectively −2.5, −1.5, −0.5, +0.5, +1.5, and +2.5. In at least one embodiment, for an odd number of comparators, the values of the center comparator is +0.5 with step sizes of +/1 between adjacent comparators. For example, for M=3 comparators, Vr0, Vr1, and Vr2, are respectively −0.5, +0.5, +1.5. For M=5 comparators, Vr0, Vr1, Vr2, Vr3, and Vr4 are respectively −1.5, −0.5, +0.5, +1.5, and +2.5.",
        "To generate the reference signals Vr0, Vr1, . . . , VrM−1, a reference voltage of +Vref to −Vref is applied across the reference resistors 504.0-504.M. “+/−Vref” is, for example, +/−1.5 Volts (V). The reference resistors 504.0-504.M are preferably designed, as understood by those of ordinary skill in the art, to have differential non-linearity and integral non-linearity characteristics that are acceptable for the intended use of reduced comparator quantizer 402. In other embodiments, reference signal generator 506 uses other types of impedances, such as capacitors, or other circuit component types to generate the selected reference signals Vr0, Vr1, . . . , VrM−1. In at least one embodiment, the reference signals are generated upon request using configurable components.",
        "The reduced comparator quantizer 402 includes a digital encoder 508 to (i) receive the comparator output signals Vc0, Vc1, . . . , VcM−1 and (ii) encode the comparator output signals Vc0, Vc1, . . . , VcM−1 as the preliminary quantizer output signal c(n). The value of preliminary quantizer output signal c(n) is in terms of relative quantization levels and is determined by comparison of quantizer input signal Vin(t) to the comparator output signals Vc0, Vc1, . . . , VcM−1. Table 2 sets forth exemplary determinations of preliminary quantizer output signal c(n) for Vr0=−0.5 and Vr1=+0.5 and M=2 comparators in reduced comparator quantizer 402:",
        "TABLE 2\n\n\n\n\n\nVc0\nVc1\nc(n)\n\n\n\n\n\n\n\n+1\n+1\n+1\n\n\n+1\n0\n0\n\n\n0\n0\n−1",
        "In at least one embodiment, the digital encoder 508 is a base 1 to base 2 (unary to binary) encoder. Delta sigma modulator 400 adds the predicted quantizer output signal qest(n) to c(n) to determine quantizer output signal q(n), as described above. Additionally, any offset can be used for preliminary quantization output signal c(n) and compensated for by reduced comparator quantizer 402.",
        "In at least one embodiment, reduced comparator quantizer 402 uses an even number of comparators 502.0-502.M−1 to exploit expected per cycle input signal Vin deviations. Thus, using an even number of comparators 502.0-502.M−1 provides comparator reduction efficiencies over the conventional ‘odd-number’ comparator reduction design while obtaining equivalent quantization results.",
        "FIG. 6 depicts a consolidated embodiment 600 of computation module 414, DAC 412, and reduced comparator quantizer 402. Multiplexers 602.0 through 602.M−1 each select one (1) reference signal from reference signal generator 506 based on the value of the respective select signals Sqest.0 through Sqest.M−1. The respective select signals Sq0 through SqM−1 are set to each select one reference signal from the set of reference signals Vr0, Vr1, . . . , VrM−1 that will allow digital encoder 604 to determine the value of quantizer output signal q(n). M comparators 606.0 through 606.M−1 can determine a quantizer output signal from M+1 possible quantizer output signals.",
        "For quantizer 600, in at least one embodiment, for an even number of comparators, the values of reference signals are qest+/−0.5 for the center two comparators with step sizes of +/1 between adjacent comparators. For example, for M=2 comparators, the possible next quantizer output signals are members of the set {qest−1, qest, qest+1}. Accordingly, select signals Sq0 and Sq1 are set to respectively select reference signals Vr0 and Vr1, and Vr1 and Vr1 in normalized quantization levels are equal to respectively qest−0.5 and qest+0.5. For M=4 comparators, the possible next quantizer output signals are members of the set {qest−2, qest−1, qest, qest+1, qest+2}. Accordingly, select signals Sq0, Sq1, Sq2, and Sq3 are set to respectively select reference signals Vr0, Vr1, Vr2, and Vr3, and Vr0, Vr1, Vr2, and Vr3 in normalized quantization levels are equal to respectively qest−1.5 and qest+0.5, qest−0.5, and qest+1.5.",
        "In at least one embodiment, for an odd number of comparators, the values of the center comparator is qest+0.5 with step sizes of +/1 between adjacent comparators. For example, for M=3 comparators, the possible next quantizer output signals are members of the set {qest−1, qest, qest+1, and qest+2}. Accordingly, select signals Sq0, Sq1, and Sq2 are set to respectively select reference signals Vr0, Vr1, and Vr2, and Vr0, Vr1, and Vr2 in normalized quantization levels are equal to respectively qest−0.5, qest+0.5, and qest+1.5.",
        "In a further example, for M=1 comparators, the possible next quantizer output signals are members of the set {qest, qest+1}. Accordingly, select signal Sq0 is set to select reference signal Vr0, and V0 in a normalized quantization level is equal to qest+0.5.",
        "Quantization levels outside the maximum number of quantization levels N available in a delta sigma modulator need not be considered. Thus, predicted estimates qest+/−[X] should not exceed the available quantization levels. For example, for a 17 level system, normalized quantization levels below −8 and above +8 need not be considered.",
        "The digital encoder 604 determines the preliminary quantizer output signal c(n) from the comparator output values Vc0 through VcM−1 and determines the quantizer output signal q(n) in the same manner as described above with reference to quantizer 500.",
        "FIG. 7 depicts quantizer 700, which represents one embodiment of reduced comparator quantizer 402. Quantizer 700 includes comparator offset noise conversion as, for example, described in co-pending U.S. patent application Ser. No. 11/388,436, filed concurrently with this application, entitled “Delta Sigma Modulators with Comparator Offset Noise Conversion”, inventor John L. Melanson, assignee Cirrus Logic, Inc., which is hereby incorporated by reference in its entirety.",
        "During subsequent periods of time, comparator offset converter 702 alters “reference signal-to-comparator input terminal” associations to reroute respective reference signals Vr0, Vr1, . . . , VrM−1 from one arrangement of comparator input terminals of at least two (2) of the comparators 502 to a different arrangement of comparator input terminals. In at least one embodiment, the comparator offset converter 702 randomly changes the arrangement of comparator input terminals from one time period to the next time period. In other words, the comparator offset converter 702 randomly alters the reference signal-to-comparator input terminal associations during subsequent time periods. The comparator offset converter 702 can maintain a 1:1 reference signal-to-comparator input terminal relationship, i.e., one input terminal of each comparator receives one reference signal.",
        "By maintaining the 1:1 ratio of reference signal-to-comparator input terminal and randomizing the reference signal-to-comparator input terminal associations, the comparator offset converter 702 effectively converts the comparator offset voltage nonlinearities into energies and frequencies that can be constructively processed and, in at least one embodiment, improve signal-to-noise ratios. In at least one embodiment, the comparator offset voltages are converted into additive multi-spectral noise, such as additive white noise. The multi-spectral noise can be part of system dithering or can be filtered out using, for example, a differential filter. Multi-spectral noise refers to noise whose energy is distributed among multiple frequencies with approximately equal energy levels. “White noise” is, in general, noise whose energy is approximately constant for each frequency within a given frequency range, such as 0 to ½ a delta sigma modulator sample rate.",
        "In at least one embodiment, the comparator voltage offset reducer 702 alters the routing of reference signals to input terminals of the comparators 502.0 through 502.M−1 during subsequent periods of time. The comparator offset converter 702 includes one or more multiplexers to change which of the respective reference signals Vr0, Vr1, . . . , VrM−1 that each of the one or more comparators 502.0 through 502.M−1 receives during subsequent periods of time.",
        "In at least one embodiment, the comparator voltage offset reducer 702 includes a chopping circuit. The chopping circuit includes multiplexers coupled to the input terminals of the comparators to effectively toggle the inputs of the comparators. The chopping circuit receives a random chopping control signal to cause the chopping circuit to randomly toggle the comparator input terminals. Toggling the comparator input terminals effectively converts the comparator offset voltage into additive multi-spectral noise, such as additive white noise. The chopping control signal can be exclusively OR'ed with each of the respective comparator outputs to restore proper polarity.",
        "In another embodiment, randomizing the reference signal-to-comparator input terminal associations and chopping circuits can be respectively utilized with a subset of the comparators 502.0 through 502.M−1 in an embodiment of reduced comparator quantizer 402. For example, in one embodiment, only reference signals to adjacent pairs of comparators are randomly altered and/or only a limited number of comparator input terminals are randomly chopped. This limited scope of randomization and chopping has lower complexity implementation but achieves only limited offset related performance improvements.",
        "In another embodiment, the chopping circuit and comparator offset converter are combined to obtain an even better whitening of the additive comparator offset.",
        "The reference signal-to-comparator input terminal associations are communicated to digital encoder 508 so that digital encoder 508 can properly generate preliminary quantizer output signal q(n).",
        "FIG. 8 depicts consolidated embodiment 800, which represents one embodiment of consolidated embodiment 600. The consolidated embodiment 800 also includes comparator voltage offset reducer 702. Comparator voltage offset reducer 702 functions in the same manner with respect to consolidated embodiment 800 as described above with respect to quantizer 600. The reference signal-to-comparator input terminal associations are communicated to digital encoder 604 so that digital encoder 604 can properly generate quantizer output signal q(n).",
        "FIG. 9 depicts a signal processing system 900 that includes reduced comparator delta sigma modulator 400. The signal processing system 900 is particularly useful for high-end audio applications. Signal processing system 900 processes an input signal x(t) generated by an input signal source 902. The input signal x(t) may be an audio signal, a video signal, an audio plus video signal, and/or other signal type. The input signal x(t) is, for example, an analog signal generated by a microphone. Generally, input signal x(t) undergoes some preprocessing 904 prior to being modulated by delta sigma modulator 400. Example preprocessing includes low pass filtering to attenuate out-of-band signals. Signal processing system 900 also generally includes post-processing 906, such as low-pass filtering the output signals q(n). Additional post-processing can include recording of the averaged, digital output onto a recording medium or providing the averaged, digital output to a device that utilizes digital signals such as a digital audio recorder and/or player.",
        "Although the present invention has been described in detail, it should be understood that various changes, substitutions and alterations can be made hereto without departing from the spirit and scope of the invention as defined by the appended claims."
    ],
    "citations": [
        "4470146",
        "4649371",
        "4918623",
        "5208594",
        "5870052",
        "6215427",
        "6239734",
        "6380881",
        "6642873",
        "6717542",
        "6809674",
        "6919837",
        "7058463",
        "7116260",
        "7209878",
        "7221303",
        "2003/0179124",
        "2006/0077090",
        "0402149",
        "WO2005011126"
    ],
    "us_classification": "341143",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "03",
            "subclass": "M",
            "main_group": "3",
            "subgroup": "00"
        }
    ]
}