{
    "title": "Liquid crystal display panel",
    "abstract": "A laminated spacer portion formed by laminating various thin films that constitute thin-film transistors is disposed in peripheral driver circuits. As a result, even in a structure in which part of a sealing member is disposed above the peripheral driver circuits, pressure exerted from spacers in the sealing member is concentrated on the laminated spacer portion, whereby destruction of a thin-film transistor of the peripheral driver circuits can be prevented caused by the pressure from the sealing portion.",
    "inventors": [
        "Zhang",
        "Teramoto"
    ],
    "document_number": "07298447",
    "publication_date": "20071120",
    "assignees": [
        "Semiconductor Energy Laboratory Co., Ltd."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An electric device having at least one liquid crystal display panel, said liquid crystal display panel comprising:",
            "components": [
                {
                    "component": "an active matrix circuit over a first region of a substrate;",
                    "subcomponents": []
                },
                {
                    "component": "at least one thin film transistor formed in said active matrix circuit, said at least one thin film transistor comprising a semiconductor layer and a gate electrode with a gate insulating film interposed therebetween;",
                    "subcomponents": []
                },
                {
                    "component": "a source or drain electrode electrically connected to said semiconductor layer;",
                    "subcomponents": []
                },
                {
                    "component": "a protrusion formed over a second region of said substrate, said protrusion comprising a first layer comprising a same material as said gate electrode a second layer comprising a same material as said source or drain electrode, and a third layer comprising a same material as said semiconductor layer; and",
                    "subcomponents": []
                },
                {
                    "component": "a sealing member over said protrusion,",
                    "subcomponents": []
                },
                {
                    "component": "wherein said first layer and said second layer overlap with each other and are insulated from each other.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The device according to claim 1 wherein said protrusion is higher than a portion where said thin film transistor is formed.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The device according to claim 1 wherein said protrusion has a function of a spacer.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The device according to claim 1 wherein said protrusion has more laminated layers than a portion where said thin film transistor is formed.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The device according to claim 1 wherein said thin film transistor is a top-gate type.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The device according to claim 1 wherein said device is one selected from the group consisting of a digital camera, an electric camera, a video movie, a personal computer, a navigation system, a projection image display apparatus, and a video camera.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The device according to claim 1 wherein said protrusion does not include a source or a drain electrode.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The device according to claim 1 wherein said first and second layers are insulated from each other by an insulating film comprising a same material as an interlayer insulating film that covers said gate electrode.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. An electric device having at least one liquid crystal display panel, said liquid crystal display panel comprising:",
            "components": [
                {
                    "component": "an active matrix circuit over a first region of a substrate, said circuit comprising at least one thin film transistor, said at least one thin film transistor comprising a gate electrode, a semiconductor layer, and a gate insulating film interposed therebetween,",
                    "subcomponents": []
                },
                {
                    "component": "a source or drain electrode electrically connected to said semiconductor layer;",
                    "subcomponents": []
                },
                {
                    "component": "a laminated spacer formed over a second region of said substrate; and",
                    "subcomponents": []
                },
                {
                    "component": "a sealing member over said laminated spacer,",
                    "subcomponents": []
                },
                {
                    "component": "wherein said laminated spacer comprises a first layer comprising a same material as said gate electrode, a second layer comprising a same material as said source or drain electrode, and a third layer comprising a same material as said semiconductor layer, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein said first layer and said second layer overlap with each other and are insulated from each other.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The device according to claim 9 wherein at least one spacer is included in said sealing member.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The device according to claim 9 wherein said gate electrode is formed over said semiconductor layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The device according to claim 9 wherein said source or drain electrode comprises a laminated structure of titanium and aluminum.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The device according to claim 9 wherein said device is one selected from the group consisting of a digital camera, an electric camera, a video movie, a personal computer, a navigation system, a projection image display apparatus, and a video camera.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The device according to claim 9 wherein said semiconductor layer comprises crystalline silicon.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The device according to claim 9 wherein said laminated spacer does not include a source or a drain electrode.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The device according to claim 9 wherein said first and second layers are insulated from each other by an insulating film comprising a same material as an interlayer insulating film that covers said gate electrode.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. An electric device having at least one liquid crystal display panel, said liquid crystal display panel comprising:",
            "components": [
                {
                    "component": "an active matrix circuit over a first region of a substrate, said circuit comprising at least one thin film transistor, said at least one thin film transistor comprising a gate electrode, a semiconductor layer, and a gate insulating film interposed therebetween,",
                    "subcomponents": []
                },
                {
                    "component": "a source or drain electrode electrically connected to said semiconductor layer;",
                    "subcomponents": []
                },
                {
                    "component": "a laminated spacer formed over a second region of said substrate; and",
                    "subcomponents": []
                },
                {
                    "component": "a sealing member over said laminated spacer,",
                    "subcomponents": []
                },
                {
                    "component": "wherein said laminated spacer comprises a first layer comprising a same material as said gate electrode, a second layer comprising a same material as said semiconductor layer, a third layer comprising a same material as said source or drain electrode, and a fourth layer comprising a same material as said gate insulating film, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein said first layer and said third layer overlap with each other and are insulated from each other.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The device according to claim 17 wherein at least one spacer is included in said sealing member.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The device according to claim 17 wherein said gate electrode is formed over said semiconductor layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The device according to claim 17 wherein said semiconductor layer comprises crystalline silicon.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The device according to claim 17 wherein said source or drain electrode comprises a laminated structure of titanium and aluminum.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The device according to claim 17 wherein said device is one selected from the group consisting of a digital camera, an electric camera, a video movie, a personal computer, a navigation system, a projection image display apparatus, and a video camera.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The device according to claim 17 wherein said laminated spacer does not include a source or a drain electrode.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The device according to claim 17 wherein said first and third layers are insulated from each other by an insulating film comprising a same material as an interlayer insulating film that covers said gate electrode.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. An electric device having at least one liquid crystal display panel, said liquid crystal display panel comprising:",
            "components": [
                {
                    "component": "an active matrix circuit over a first region of a substrate, said circuit comprising at least one thin film transistor, said at least one thin film transistor comprising a gate electrode, a semiconductor layer, and a gate insulating film interposed therebetween,",
                    "subcomponents": []
                },
                {
                    "component": "a source or drain electrode electrically connected to said semiconductor layer;",
                    "subcomponents": []
                },
                {
                    "component": "a laminated layer formed over a second region of said substrate; and",
                    "subcomponents": []
                },
                {
                    "component": "a sealing member over said laminated layer,",
                    "subcomponents": []
                },
                {
                    "component": "wherein said laminated layer comprises a first layer comprising a same material as said gate electrode, a second layer comprising a same material as said source or drain electrode, and a third layer as a same material as said semiconductor layer, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein said first layer and said second layer overlap with each other and are insulated from each other.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The device according to claim 25 wherein at least one spacer is included in said sealing member.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The device according to claim 25 wherein said gate electrode is formed over said semiconductor layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The device according to claim 25 wherein said source or drain electrode comprises a laminated structure of titanium and aluminum.",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The device according to claim 25 wherein said device is one selected from the group consisting of a digital camera, an electric camera, a video movie, a personal computer, a navigation system, a projection image display apparatus, and a video camera.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The device according to claim 25 wherein said semiconductor layer comprises crystalline silicon.",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The device according to claim 25 wherein said laminated layer does not include a source or a drain electrode.",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. The device according to claim 25 wherein said first and second layers are insulated from each other by an insulating film comprising a same material as an interlayer insulating film that covers said gate electrode.",
            "components": []
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. An electric device having at least one liquid crystal display panel, said liquid crystal display panel comprising:",
            "components": [
                {
                    "component": "an active matrix circuit over a first region of a substrate, said circuit comprising at least one thin film transistor, said at least one thin film transistor comprising a gate electrode, a semiconductor layer, and a gate insulating film interposed therebetween,",
                    "subcomponents": []
                },
                {
                    "component": "a source or drain electrode electrically connected to said semiconductor layer;",
                    "subcomponents": []
                },
                {
                    "component": "a laminated layer formed over a second region of said substrate; and",
                    "subcomponents": []
                },
                {
                    "component": "a sealing member over said laminated layer,",
                    "subcomponents": []
                },
                {
                    "component": "wherein said laminated layer comprises a first layer comprising a same material as said gate electrode, a second layer comprising a same material as said semiconductor layer, a third layer comprising a same material as said source or drain electrode, and a fourth layer comprising a same material as said gate insulating film, and",
                    "subcomponents": []
                },
                {
                    "component": "wherein said first layer and said third layer overlap with each other and are insulated from each other.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00034",
            "preamble": "34. The device according to claim 33 wherein at least one spacer is included in said sealing member.",
            "components": []
        },
        {
            "claim_number": "CLM-00035",
            "preamble": "35. The device according to claim 33 wherein said gate electrode is formed over said semiconductor layer.",
            "components": []
        },
        {
            "claim_number": "CLM-00036",
            "preamble": "36. The device according to claim 33 wherein said semiconductor layer comprises crystalline silicon.",
            "components": []
        },
        {
            "claim_number": "CLM-00037",
            "preamble": "37. The device according to claim 33 wherein said source or drain electrode comprises a laminated structure of titanium and aluminum.",
            "components": []
        },
        {
            "claim_number": "CLM-00038",
            "preamble": "38. The device according to claim 33 wherein said device is one selected from the group consisting of a digital camera, an electric camera, a video movie, a personal computer, a navigation system, a projection image display apparatus, and a video camera.",
            "components": []
        },
        {
            "claim_number": "CLM-00039",
            "preamble": "39. The device according to claim 33 wherein said laminated layer does not include a source or a drain electrode.",
            "components": []
        },
        {
            "claim_number": "CLM-00040",
            "preamble": "40. The device according to claim 33 wherein said first and third layers are insulated from each other by an insulating film comprising a same material as an interlayer insulating film that covers said gate electrode.",
            "components": []
        }
    ],
    "description": [
        "This is a continuation of U.S. application Ser. No. 08/877,919, filed Jun. 16, 1997, now U.S. Pat. No. 6,055,034.",
        "1. Field of the Invention",
        "The present invention relates to an active matrix liquid crystal display panel which is integral with peripheral driver circuits, as well as to various apparatuses using such a panel.",
        "2. Description of the Related Art",
        "An active matrix liquid crystal display panel is known in which an active matrix circuit and peripheral driver circuits for driving it are integrated on a glass substrate or a quartz substrate. In such an active matrix liquid crystal display panel, various measures have been taken to minimize the area of portions unnecessary for display, i.e., the area occupied by the peripheral driver circuits.",
        "On the other hand, in the liquid crystal display panel, a sealing member is provided in a peripheral portion to hold, i.e., confine a liquid crystal between a pair of substrates. As one measure to minimize the ares of portions unnecessary for display, it is now required to reduce the area occupied by the sealing member.",
        "The active matrix liquid crystal display panel which is integral with the peripheral driver circuits has a problem that failures likely occur in the peripheral driver circuits. This tendency is more remarkable in a configuration in which part of the sealing member is disposed above the peripheral driver circuits.",
        "This problem occurs in the following manner. The sealing member contains a kind of spacer called a filler to maintain the gap between the substrates. In general, the peripheral driver circuits have a very high degree of integration. In these circumstances, pressure is exerted from the filler on thin-film transistors and a wiring of the peripheral driver circuits which are located right under the filler (the pressure is estimated to be very strong locally), so that a line disconnection, a contact failure, and even a disconnection of a semiconductor layer are likely to occur.",
        "Although spherical substrate gap holding means called spacers are also used in the active matrix area, the occurrence of failures in the active matrix area due to the existence of the spacers is not so serious as in the peripheral driver circuits, because the degree of integration is low in the active matrix area.",
        "An object of the present invention is to minimize the area of portions other than a pixel matrix circuit in an active matrix liquid crystal display panel which is integral with peripheral driver circuits.",
        "Another object of the invention is to prevent destruction of a peripheral driver circuit due to pressure exerted from a sealing member even in the active matrix liquid crystal display panel that attains the above object.",
        "According to a first aspect of the invention, as shown in FIGS. 1A to 1D and 2 in the form of a specific manufacturing process, there is provided a liquid crystal display panel comprising an active matrix circuit (pixel circuit); a peripheral driver circuit, the active matrix circuit and the peripheral driver circuit being integrated on the same substrate 101; a sealing member (indicated by numeral 206 in FIG. 2), part of the sealing member being disposed above the peripheral driver circuit; thin-film transistors formed in the peripheral driver circuit; and a protrusion (laminated spacer) formed in the peripheral driver circuit, the protrusion being a lamination of materials that constitute the thin-film transistors, the protrusion being projected (see FIG. 1D) from portions where the thin-film transistors are disposed.",
        "According to a second aspect of the invention, as shown in FIGS. 1A to 1D and 2 in the form of a specific manufacturing process, there is provided a liquid crystal display panel comprising an active matrix circuit (pixel circuit); a peripheral driver circuit, the active matrix circuit and the peripheral driver circuit being integrated on the same substrate 101; a sealing member (indicated by numeral 206 in FIG. 2), part of the sealing member being disposed above the peripheral driver circuit; thin-film transistors formed in the peripheral driver circuit; and a protrusion (laminated spacer) formed in the peripheral driver circuit in addition to the thin-film transistors, the protrusion being a lamination of materials that constitute the thin-film transistors, the protrusion being higher (see FIG. 1D) than portions where the thin-film transistors are disposed.",
        "According to a third aspect of the invention, as shown in FIGS. 1A to 1D and 2 in the form of a specific manufacturing process, there is provided a liquid crystal display panel comprising an active matrix circuit (pixel circuit); a peripheral driver circuit, the active matrix circuit and the peripheral driver circuit being integrated on the same substrate 101; a sealing member (indicated by numeral 206 in FIG. 2), part of the sealing member being disposed above the peripheral driver circuit; thin-film transistors formed in the peripheral driver circuit; and a protrusion formed in the peripheral driver circuit in addition to the thin-film transistors, the protrusion being a lamination of materials that constitute the thin-film transistors, the protrusion having a function of a spacer.",
        "According to a fourth aspect of the invention, as shown in FIGS. 1A to 1D and 2 in the form of a specific manufacturing process, there is provided a liquid crystal display panel comprising an active matrix circuit (pixel circuit); a peripheral driver circuit, the active matrix circuit and the peripheral driver circuit being integrated on the same substrate 101; a sealing member (indicated by numeral 206 in FIG. 2), part of the sealing member being disposed above the peripheral driver circuit; thin-film transistors formed in the peripheral driver circuit; and a laminated portion (laminated spacer) formed in the peripheral driver circuit in addition to the thin-film transistors, the laminated portion having more laminated layers (see FIG. 1D) than portions where the thin-film transistors are disposed in the peripheral driver circuit.",
        "As shown in FIGS. 1A to 1D and 2, the protrusion (laminated spacer) is formed by laminating all the thin films that constitute the pixel circuit and the peripheral driver circuits, the latter circuits having a high degree of integration. With this structure, pressure exerted from spacers 204 in the sealing member 206 is concentrated on the protrusion. As a result, the thin-film transistors and the wiring of the peripheral driver circuits can be prevented from being damaged.",
        "FIGS. 1A to 1D are sectional views showing a manufacturing process of an active matrix liquid crystal panel according to Embodiment 1 of the present invention;",
        "FIG. 2 is a sectional view showing the active matrix liquid crystal panel according to Embodiment 1 of the invention; and",
        "FIGS. 3A to 3E show apparatuses to which a liquid crystal display panel of the invention is applied according to Embodiment 3.",
        "This embodiment is directed to an active matrix liquid crystal display panel which is integral with peripheral driver circuits. FIGS. 1A to 1D and 2 show its manufacturing process.",
        "This embodiment is directed to manufacture of a liquid crystal display panel that is constituted of a pixel circuit (active matrix circuit) and peripheral driver circuits for driving it. For example, the peripheral driver circuits are composed of a shift register circuit, a buffer circuit, and a sampling circuit.",
        "First, a base film (not shown) is formed on a glass substrate 101. Alternatively, a quartz substrate may be used. In this embodiment, a 3,000-Å-thick silicon oxide film is formed by plasma CVD as the base film.",
        "A 500-Å-thick amorphous silicon film (not shown) is then formed by low-pressure thermal CVD.",
        "A crystalline silicon film is obtained by crystallizing the amorphous silicon film by illuminating it with laser light. Other means may be used to obtain a crystalline silicon film.",
        "The thus-obtained crystalline silicon film is patterned into a pattern 102, a pattern indicated by numerals 103 to 105, and a pattern indicated by numerals 106 to 108. The pattern 102 will become a semiconductor pattern to constitute a laminated spacer 1000. The pattern indicated by numerals 103 to 105 will become an active layer pattern of a thin-film transistor in a peripheral driver circuit 1001. The pattern indicated by numerals 106 to 108 will become an active layer pattern of a thin-film transistor in a pixel circuit (active matrix circuit) 1002.",
        "The laminated spacer is a laminated protrusion of all the components that are formed intentionally in the TFT substrate. If the laminated spacer is disposed in a peripheral driver circuit, pressure from the spacers for holding the substrate gap is concentrated on the laminated spacer. As a result, pressure exerted on thin-film transistors and a wiring that constitute the peripheral driver circuits can be reduced.",
        "In this embodiment, it is assumed that all the illustrated thin-film transistors are of an n-channel type. In general, the peripheral driver circuits are constituted of n-channel and p-channel thin-film transistors. On the other hand, n-channel or p-channel transistors are used in the pixel circuit.",
        "After the patterning of the semiconductor layer, a gate insulating film 109 is formed, and then an aluminum film (not shown) for forming gate electrodes (and gate lines extending therefrom) is formed on the gate insulating film 109. In this embodiment, a 4,000-Å-thick aluminum film is formed by sputtering by using an aluminum target containing scandium at 0.18 wt %.",
        "The thus-formed aluminum film is patterned into aluminum patterns 110 to 112. The pattern 110 is an aluminum pattern to constitute the laminated spacer. The pattern 111 is a gate electrode of the thin-film transistor in the peripheral driver circuit. The pattern 112 is a gate electrode of the thin-film transistor in the pixel circuit.",
        "Subsequently, 1,000-Å-thick anodic oxide films 113 to 115 are formed by anodization in which the aluminum patterns 110 to 112 are used as the anodes. Thus, the state of FIG. 1A is obtained.",
        "Silicon nitride films may be used instead of anodic oxide films. As a further alternative, oxide films (plasma oxide films) may be formed by plasma processing in an oxidizing atmosphere.",
        "In the state of FIG. 1A, a 3,000-Å-thick silicon nitride film as a first interlayer insulating film 116 is formed by plasma CVD (see FIG. 1B).",
        "After contact holes are formed, a multilayer metal film in which an aluminum film is interposed between titanium films is formed by sputtering.",
        "The three-layer metal film is patterned into a pattern 117, a source electrode 118, a drain electrode 119, a source electrode 120, and a drain electrode 121. The pattern 117 will become part of the laminated spacer. Thus, the state of FIG. 1B is obtained.",
        "Thereafter, a 15,000-Å-thick resin layer 122, specifically a polyimide layer, as a second interlayer insulating film is formed by spin coating. The use of the resin layer 122 is advantageous in that its surface can be made flat.",
        "Subsequently, a 3,000-Å-thick titanium film is formed by sputtering, and then patterned into a pattern 124 and a pattern 125. The pattern 124 is a titanium film pattern to become part of the laminated spacer. The pattern 125 is a black matrix (BM), which has a function of shielding the thin-film transistors in the pixel circuit from light.",
        "Then, a 3,000-Å-thick resin layer 126, specifically a polyimide layer, as a third interlayer insulating film 126 is formed by spin coating.",
        "After contact holes are formed, a 1,000-Å-thick ITO film is formed over the entire surface by sputtering. The ITO film is patterned into a pattern 127 and an ITO pixel electrode 128. The pixel electrode 128 is in contact with the drain electrode 121. An auxiliary capacitance is formed in a region where the pixel electrode 128 and the black matrix 125 coextend. Thus, the state of FIG. 1D is obtained.",
        "The ITO pattern 127 is also left, as a dummy, in the laminated spacer portion. This makes the laminated spacer portion the thickest in the entire substrate structure. That is, the laminated spacer portion is provided as a protrusion which is wider than a given area and in which all the components are laminated.",
        "Subsequently, an opposed glass substrate 201 (or a quartz substrate) is prepared as shown in FIG. 2. An opposed electrode 202 and an orientation film 203 are formed on the opposed glass substrate 201.",
        "Reference numeral 206 denotes a sealing member, and numerals 204 and 205 denote spacers included in the sealing member 206. A liquid crystal 207 is sealed within the liquid crystal cell by the sealing member 206.",
        "In the structure shown in FIG. 2, pressure exerted from the spacers 204 and 205 is concentrated on the laminated spacer portion. This is because the laminated spacer portion is a highest protrusion having a certain area.",
        "The coextending portion of the black matrix 125 and the pixel electrode 128 in the pixel circuit is equal in height (i.e., thickness) to the laminated spacer portion. However, since the coextending portion has only a small area and the degree of integration is low in the pixel circuit, the occurrence of wiring disconnections and TFT failures due to pressure exerted from the spacer 208 is negligible.",
        "The structure of FIG. 2 is particularly advantageous in that line disconnections and operation failures of TFTs can be prevented in the peripheral driver circuit regions where the degree of integration is high.",
        "As described above, by providing the laminated spacer in the active matrix liquid crystal display panel which is integral with the peripheral driver circuits, the peripheral driver circuits can be prevented from being damaged by pressure exerted from spacers that are included in the sealing member even if part of the sealing member is disposed above the peripheral driver circuits.",
        "This embodiment is directed to a case where the invention is applied to a configuration in which not only the peripheral driver circuits hut also various processing circuits and memory circuits are integrated on the same substrate.",
        "The structure called “system on panel” has been proposed as an advanced version of the liquid crystal display panel which is integral with the peripheral driver circuits. In this new structure, various processing circuits and memory circuits as well as the active matrix circuit and the peripheral driver circuits are integrated on the same substrate. This structure is intended to reduce the size of an information processing terminal by integrating its functions on a single glass substrate.",
        "Also in this structure, it is required to reduce the area of the portions other than the pixel circuit (active matrix circuit). This necessarily requires a structure in which the sealing member is overlapped with various integrated circuits which constitute various processing circuits and memory circuits.",
        "To satisfy this requirement, the laminated spacer as described in the first embodiment may be provided in such integrated circuits, whereby the integrated circuits constituting various processing circuits and memory circuits which are high in the degree of integration can be prevented from being damaged by pressure exerted from spacers in the sealing member.",
        "An active matrix liquid crystal display panel which is integral with peripheral driver circuits according to the invention can be incorporated in various apparatuses.",
        "The use of the invention in an active matrix liquid crystal display panel which is integral with peripheral driver circuits is very advantageous because in such a panel the peripheral driver circuits are required to have a high degree of integration.",
        "FIG. 3A shows a digital still camera, an electronic camera, or an imaging apparatus called “video movie” which can deal with motion pictures.",
        "This apparatus has a function of electronically storing pictures taken by a CCD camera (or some other proper imaging means) that is incorporated in a camera section 2002. The apparatus also has a function of displaying a picture thus taken on a liquid crystal display panel 2003 that is incorporated in a main body 2001. The apparatus is operated by using operation buttons 2004.",
        "By applying the invention to this apparatus, the non-display area of the liquid crystal display panel 2003 can be minimized, which enables miniaturization of the apparatus.",
        "FIG. 3B shows a portable personal computer (information processing apparatus). Provided with a liquid crystal display panel 2104 in a cover 2102 that is attached to a main body 2101 and possible to open and close, this apparatus allows a user to input various information or perform operations for various computations through a keyboard 2103.",
        "FIG. 3C shows a case where a flat panel display is used in a car navigation system (information processing apparatus). The car navigation system consists of an antenna section 2304 and main body 2301 that incorporates a liquid crystal display panel 2302.",
        "Switching among various pieces of information needed for navigation is performed by operation buttons 2303. A remote controller (not shown) is commonly used for various operations.",
        "FIG. 3D shows an example of a projection image display apparatus. As shown in FIG. 3D, light emitted from a light source 2402, formed in a main body 2401, optically modulated into an image by a liquid crystal display panel 2403. The image is reflected projected onto a screen 2406 after being reflected by mirrors 2404 and 2405.",
        "FIG. 3E shows an example in which a main body 2501 of a video camera (imaging apparatus) is provided with a display device called a view finder.",
        "The view finder is generally composed of a liquid crystal display panel 2502 and an eyepiece unit 2503 which displays an image.",
        "The video camera of FIG. 3E is operated by using operation buttons 2504, and pictures are recorded on a magnetic tape that is accommodated in a tape holder 2505. Pictures taken by a camera (not shown) is displayed on the liquid crystal display panel 2502. Pictures recorded on the magnetic tape are displayed on the display panel 2502.",
        "In the video camera of FIG. 3E, it is required to minimize the area of the portions of the liquid crystal display panel 2502 other than the display region (pixel region). Therefore, the employment of the configuration as described in the first embodiment is very advantageous.",
        "As described above, the area of the portions other than the pixel matrix circuit can be minimized in an active matrix liquid crystal display panel which is integral with peripheral driver circuits.",
        "It becomes possible to prevent destruction of a peripheral driver circuit due to pressure exerted from the sealing member even in the active matrix liquid crystal display panel in which the area of the non-display portions is minimized."
    ],
    "citations": [
        "4640584",
        "4983429",
        "5148301",
        "5179460",
        "5323042",
        "5396356",
        "5504601",
        "5572046",
        "5619358",
        "5621553",
        "5650664",
        "5684555",
        "5739549",
        "5745202",
        "5745208",
        "5784132",
        "5798812",
        "5889291",
        "5929948",
        "5955744",
        "5995189",
        "6055034",
        "6115097",
        "6249333",
        "58-085478",
        "62-205320",
        "63-026631",
        "02-242230",
        "03-024634",
        "05-127181",
        "6-138488",
        "06-138488",
        "6-186579",
        "06-186588",
        "06-258661",
        "06-258662",
        "6-308505",
        "06-308510",
        "08-076145"
    ],
    "us_classification": "349155",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "02",
            "subclass": "F",
            "main_group": "1",
            "subgroup": "1339"
        }
    ]
}