{
    "title": "Automatic adaptation of fundamental channel reserved power threshold",
    "abstract": "A method for operating a base station to service data communications in a cell/sector of a digital cellular wireless system. Data user forward link transmit power within the cell/sector is allocated. A data user Fundamental Channel (FCH) forward link transmit power reserve level upper limit (f",
    "inventors": [
        "Paranchych",
        "Khafizov"
    ],
    "document_number": "07299064",
    "publication_date": "20071120",
    "assignees": [
        "Nortel Networks Limited"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for servicing data communications in a cell/sector of a digital cellular wireless system, the method comprising:",
            "components": [
                {
                    "component": "allocating data user forward link transmit power within the cell/sector, wherein the data user forward link transmit power is a total forward link transmit power that may be allocated to data users within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "setting a data user Fundamental Channel (FCH) forward link transmit power reserve level upper limit that is a maximum portion of the data user forward link transmit power that may be reserved for allocation to data users on FCHs within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "setting a data user FCH forward link transmit power reserve level to a value that is less than or equal to the data user FCH forward link transmit power reserve level upper limit;",
                    "subcomponents": []
                },
                {
                    "component": "allocating FCHs to the data users within the cell/sector upon request;",
                    "subcomponents": []
                },
                {
                    "component": "deallocating the FCHs to the data users within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "allocating Supplemental Channels (SCHs) to the data users within the cell/sector upon request, wherein the SCHs are allocated so that the data user FCH forward link transmit power reserve level is maintained;",
                    "subcomponents": []
                },
                {
                    "component": "deallocating the SCHs to the data users within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "based upon at least one current data user operating condition in the cell/sector, adjusting the data user FCH forward link transmit power reserve level; and",
                    "subcomponents": []
                },
                {
                    "component": "preventing the data user FCH forward link transmit power reserve level from exceeding the data user FCH forward link transmit power reserve level upper limit.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , further comprising:",
            "components": [
                {
                    "component": "setting a data user FCH forward link transmit power reserve level lower limit that is a minimum portion of the data user forward link transmit power that may be reserved for the FCH allocation to the data users within the cell/sector; and",
                    "subcomponents": []
                },
                {
                    "component": "preventing the data user FCH forward link transmit power reserve level from being less than the data user FCH forward link transmit power reserve level lower limit.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 , wherein based upon at least one current data user operating condition in the cell/sector, adjusting the data user FCH forward link transmit power reserve level comprises:",
            "components": [
                {
                    "component": "when a data call is admitted successfully, decreasing the data user FCH forward link transmit power reserve level by a first step size; and",
                    "subcomponents": []
                },
                {
                    "component": "when a data call is blocked, increasing the data user FCH forward link transmit power reserve level by a second step size.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 3 , wherein the first step size is proportional to a desired probability of data call blocking, and the second step size is selected to limit the maximum rate at which the data user FCH forward link transmit power reserve level can increase.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 , wherein based upon at least one current operating condition in the cell/sector, adjusting the data user FCH forward link transmit power reserve level is performed to meet a desired blocking probability.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 1 , wherein based upon at least one current operating condition in the cell/sector, adjusting the data user FCH forward link transmit power reserve level comprises adjusting the data user FCH forward link transmit power reserve level to a level that exceeds a current usage level of data user FCH forward link transmit power by a configurable multiplicative constant.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 1 , further comprising supporting one or more versions of the 1xRTT communication standard and other wireless communication standards (e.g., 1xEV-DV, UMTS, etc.).",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A base station that wirelessly services a plurality of voice users and a plurality of data users within a cell/sector of a digital cellular wireless system, the base station comprising:",
            "components": [
                {
                    "component": "an antenna;",
                    "subcomponents": []
                },
                {
                    "component": "a Radio Frequency unit coupled to the antenna; and",
                    "subcomponents": []
                },
                {
                    "component": "at least one digital processor coupled to the Radio Frequency unit that executes software instructions causing the base station to:",
                    "subcomponents": []
                },
                {
                    "component": "allocate data user forward link transmit power within the cell/sector, wherein the data user forward link transmit power is a total forward link power that may be allocated to data users within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "set a data user Fundamental Channel (FCH) forward link transmit power reserve level upper limit that is a maximum portion of the data user forward link transmit power that may be reserved for allocation to data users on FCHs within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "set a data user FCH forward link transmit power reserve level to a value that is less than or equal to the data user FCH forward link transmit power reserve level upper limit;",
                    "subcomponents": []
                },
                {
                    "component": "allocate FCHs to the data users within the cell/sector upon request;",
                    "subcomponents": []
                },
                {
                    "component": "deallocate the FCHs to the users within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "allocate Supplemental Channels (SCHs) to data users within the cell/sector upon request, wherein the SCHs are allocated so that the data user FCH forward link transmit power reserve level is maintained;",
                    "subcomponents": []
                },
                {
                    "component": "deallocate the SCHs to the data users the within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "adjust the data user FCH forward link transmit power reserve level based upon at least one current data user operating condition in the cell/sector; and",
                    "subcomponents": []
                },
                {
                    "component": "prevent the data user FCH forward link transmit power reserve level from exceeding the data user FCH forward link transmit power reserve level upper limit.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The base station of claim 8 , wherein the base station further operates to:",
            "components": [
                {
                    "component": "set a data user FCH forward link transmit power reserve level lower limit that is a minimum portion of the data user forward link transmit power that may be reserved for the FCH allocation to the data users within the cell/sector; and",
                    "subcomponents": []
                },
                {
                    "component": "prevent the data user FCH forward link transmit power reserve level from being less than the data user FCH forward link transmit power reserve level lower limit.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The base station of claim 8 , wherein in adjusting the data user FCH forward link transmit power reserve level based upon at least one current operating condition in the cell/sector, the base station operates to:",
            "components": [
                {
                    "component": "decrease the data user FCH forward link transmit power reserve level by a first step size when a data call is admitted successfully; and",
                    "subcomponents": []
                },
                {
                    "component": "increase the data user FCH forward link transmit power reserve level by a second step size when a data call is blocked.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The base station of claim 10 , wherein the first step size is proportional to a desired probability of data call blocking, and the second step size is selected to limit the maximum rate at which the data user FCH forward link transmit power reserve level can increase.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The base station of claim 8 , wherein in adjusting the data user FCH forward link transmit power reserve level based upon at least one current operating condition in the cell/sector, the base station operates to meet a desired blocking probability.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The base station of claim 8 , wherein in adjusting the data user FCH forward link transmit power reserve level based upon at least one current operating condition in the cell/sector, the base station operates to adjust the data user FCH forward link transmit power reserve level to a level that exceeds a current usage level of data user FCH forward link transmit power by a configurable multiplicative constant.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The base station of claim 8 , wherein the base station supports one or more versions of the 1xRTT communication standard.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A base station comprising:",
            "components": [
                {
                    "component": "means for allocating data user forward link transmit power within a cell/sector, wherein the data user forward link transmit power is a total forward link power that may be allocated to data users within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "means for setting a data user Fundamental Channel (FCH) forward link transmit power reserve level upper limit that is a maximum portion of the data user forward link transmit power that may be reserved for FCH allocation to the data users within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "means for setting a data user FCH forward link transmit power reserve level to a value that is less than or equal to the data user FCH forward link transmit power reserve level upper limit;",
                    "subcomponents": []
                },
                {
                    "component": "means for allocating FCHs to the data users within the cell/sector upon request;",
                    "subcomponents": []
                },
                {
                    "component": "means for deallocating the FCHs to the data users within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "means for allocating Supplemental Channels (SCHs) to data users within the cell/sector upon request, wherein the SCHs are allocated so that the data user FCH forward link transmit power reserve level is maintained;",
                    "subcomponents": []
                },
                {
                    "component": "means for deallocating the SCHs to the data users within the cell/sector;",
                    "subcomponents": []
                },
                {
                    "component": "means for adjusting the data user FCH forward link transmit power reserve level based upon at least one current data user operating condition in the cell/sector; and",
                    "subcomponents": []
                },
                {
                    "component": "means for preventing the data user FCH forward link transmit power reserve level from exceeding the data user FCH forward link transmit power reserve level upper limit.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The base station of claim 15 , further comprising:",
            "components": [
                {
                    "component": "means for setting a data user FCH forward link transmit power reserve level lower limit that is a minimum portion of the data user forward link transmit power that may be reserved for FCH allocation to the data users within the cell/sector; and",
                    "subcomponents": []
                },
                {
                    "component": "means for preventing the data user FCH forward link transmit power reserve level from being less than the data user FCH forward link transmit power reserve level lower limit.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The base station of claim 15 , wherein the means for adjusting the data user FCH forward link transmit power reserve level based upon at least one current data user operating condition in the cell/sector comprise:",
            "components": [
                {
                    "component": "means for decreasing the data user FCH forward link transmit power reserve level by a first step size when a data call is admitted successfully; and",
                    "subcomponents": []
                },
                {
                    "component": "means for increasing the data user FCH forward link transmit power reserve level by a second step size when a data call is blocked.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The base station of claim 17 , wherein the first step size is proportional to a desired probability of data call blocking, and the second step size is selected to limit the maximum rate at which the data user FCH forward link transmit power reserve level can increase.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The base station of claim 15 , wherein the means for adjusting the data user FCH forward link transmit power reserve level based upon at least one current data user operating condition in the cell/sector operate to meet a desired blocking probability.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The base station of claim 15 , wherein the means for adjusting the data user FCH forward link transmit power reserve level based upon at least one current data user operating condition in the cell/sector adjust the data user FCH forward link transmit power reserve level to a level that exceeds a current usage level of data user FCH forward link transmit power by a configurable multiplicative constant.",
            "components": []
        }
    ],
    "description": [
        "1. Technical Field",
        "The present invention relates generally to cellular wireless systems; and more particularly to the transmission of data communications in cellular wireless systems.",
        "2. Related Art",
        "Cellular wireless systems support wireless communication services in many populated areas of the world. While cellular wireless systems were initially constructed to service voice communications, they are now called upon to support data communications as well. The demand for data communication services has exploded with the acceptance and widespread use of the Internet. While data communications have historically been serviced via wired connections, wireless users are now demanding that their wireless units also support data communications. Many wireless subscribers now expect to be able to “surf” the Internet, access their email, and perform other data communication activities using their cellular phones, wireless personal data assistants, wirelessly linked notebook computers, and/or other wireless devices. The demand for wireless system data communications will only increase with time. Thus, wireless systems are currently being created/modified to service these burgeoning data communication demands.",
        "Significant performance issues exist when using a wireless system to service data communications. Wireless systems were initially designed to service the well-defined requirements of voice communications. Generally speaking, voice communications require a sustained bandwidth over a period of several minutes. Data communications, on the other hand, have very different performance requirements. Data communications are typically bursty, discontinuous, and may require a relatively high bandwidth during data transfer, which may be very short (on the order of a few seconds). To understand the difficulties in servicing data communications within a wireless system, consider the structure and operation of a cellular wireless system.",
        "Cellular wireless systems include a “network infrastructure” that wirelessly communicates with wireless subscriber units within a respective service coverage area. The network infrastructure typically includes a plurality of base stations dispersed throughout the service coverage area, each of which supports wireless communications within a respective cell (or set of sectors). The base stations couple to base station controllers (BSCs), with each BSC serving a plurality of base stations. Each BSC couples to a mobile switching center (MSC). Each BSC also typically directly or indirectly couples to the Internet.",
        "In operation, a wireless subscriber unit communicates with one (or more) of the base stations. A BSC coupled to the serving base station routes voice communications between the MSC and the serving base station. The MSC routes the voice communication to another MSC or to the public switched telephone network (PSTN). BSCs route data communications between a servicing base station and a packet data network that may couple to the Internet.",
        "The wireless link between the base station and the wireless subscriber unit is defined by one of a plurality of operating technologies and standards, e.g., AMPS, TDMA, CDMA, GSM, etc. These operating standards, as well as new 3G and 4G operating standards, define the manner in which the wireless link may be allocated, setup, serviced and torn down. These operating standards must set forth operations that will be satisfactory in servicing both voice and data communications. Each of these next generation systems will be called upon to support high-speed data communications.",
        "In currently deployed digital cellular networks, e.g., 1xRTT networks, both voice and data communications are supported via wireless digital communications. Depending upon particular service provider criteria, base station resources within a cell/sector are divided between voice and data users. In most systems, the service provider desires to limit call blocking for voice users. To accomplish this goal, the number of Walsh codes and the amount of transmit power that may be allocated to data users is limited. 1xRTT systems support two types of forward links for data service, Fundamental Channels (FCHs) and Supplemental Channels (SCHs). FCHs provide the basic data service to data users. SCHs are bursty higher bandwidth channels that are rapidly allocated and deallocated as cell/sector conditions permit. A data user is “blocked” when it cannot be allocated a FCH, i.e., when sufficient data user resources are unavailable for such an allocation.",
        "In order to address this undesirable operation, in 1xRTT systems, each base station is controlled to reserve a certain percentage of available data user resources for FCHs. One technique involves reserving a percentage of available forward link transmit power in a base station for FCHs. Another technique involves reserving Walsh codes for FCH allocation. However, neither of these techniques considers cell/sector loading and the unique needs of wireless subscriber units operating in such a cell/sector.",
        "A need therefore exists for allocation of available data user cell/sector resources among data users to increase throughput but to minimize data user blocking.",
        "Thus, to overcome the shortcomings of the prior operations, among other shortcomings, a method for servicing data communications in a cell/sector of a digital cellular wireless system dynamically allocates available data user forward transmit power within a cell/sector. This method may be performed in an effort to maximize cell/sector data throughput and to meet a desired level of data user call blocking. The method includes first allocating data user forward link transmit power within the cell/sector, wherein the data user forward link transmit power is the total forward link transmit power that may be allocated to data users within the cell/sector. The method then includes setting a data user Fundamental Channel (FCH) forward link transmit power reserve level upper limit (fd,max) that is a maximum portion of the data user forward link transmit power that may be reserved for allocation to data users on FCHs within the cell/sector. Next, the method includes initializing a data user FCH forward link transmit power reserve level (fd) to a value that is less than or equal to the data user FCH forward link transmit power reserve level upper limit.",
        "The base station is then operated to allocate FCHs to data users within the cell/sector, deallocate FCHs to data users within the cell/sector, allocate SCHs to data users within the cell/sector, and to deallocate SCHs to data users within the cell/sector. In these operations, SCHs are allocated so that the data user FCH forward link transmit power reserve level is maintained. Further, based upon at least one current data user operating condition in the cell/sector, the data user FCH forward link transmit power reserve level fd is adjusted. In making these adjustments, the method prevents the data user FCH forward link transmit power reserve level fd from exceeding the data user FCH forward link transmit power reserve level upper limit.",
        "The method may also include setting a data user FCH forward link transmit power reserve level lower limit (fd,min) that is a minimum portion of the data user forward link transmit power that may be reserved for allocation to data users on FCHs within the cell/sector. When this further limitation is included, the method includes preventing the data user FCH forward link transmit power reserve level from being less than the data user FCH forward link transmit power reserve level lower limit. In any of the embodiments of the present invention, one or more versions of the 1xRTT communication standard may be supported.",
        "With the method of the present invention, in adjusting the data user FCH forward link transmit power reserve level fd based upon at least one current operating condition in the cell/sector, the method may be accomplished according to a number of embodiments. In a first embodiment of this operation, when a data call is admitted successfully, the method includes decreasing the data user FCH forward link transmit power reserve level fd by a first step size. Further, with this first embodiment, when a data call is blocked, the method includes increasing the data user FCH forward link transmit power reserve level fd by a second step size. In this first embodiment, the first step size may be proportional to a desired probability of data call blocking. Further, the second step size may be selected to meet a desired maximum rate at which the FCH forward link transmit power reserve level is allowed to increase. In a second embodiment of this operation, adjusting the data user FCH forward link transmit power reserve level includes adjusting the data user FCH forward link transmit power reserve level fd to a level that exceeds a current usage level of data user FCH forward link transmit power by a configurable proportionality factor. This second embodiment will minimize data user FCH blocking until the limit fd,max is reached.",
        "According to a third embodiment of the present invention when a FCH allocation request is received, calculations are performed to determine the average FCH transmit power currently in use, i.e., total active FCH transmit power divided by the number of active FCH users. Then, a determination is made as to whether the requested FCH allocation, if made, would cause the FCH forward link transmit power to exceed fd. If so, it is next determined whether fd can be increased and, if it can, fd is increased by a first amount. If not, it is next determined whether fd can be increased and, if it can, fd is increased by a second amount. The third embodiment may be performed such that fd is increased by a lesser amount when the FCH can be allocated than when it cannot be allocated. Alternately, the third embodiment may be performed such that fd is increased by a greater amount when the FCH can be allocated than when it cannot be allocated.",
        "A base station may be operated to accomplish the operations of the present invention. Further, a base station controller (or other cellular wireless system component) may be employed to control the operation of its base stations. Other features and advantages of the present invention will become apparent from the following detailed description of the invention made with reference to the accompanying drawings.",
        "A better understanding of the present invention can be obtained when the following detailed description of the preferred embodiment is considered in conjunction with the following drawings, in which:",
        "FIG. 1 is a system diagram illustrating a portion of a cellular wireless system constructed according to the present invention;",
        "FIG. 2 is a logic diagram illustrating operation according to the present invention;",
        "FIG. 3 is a flow chart illustrating in detail a first embodiment of the operations of FIG. 2;",
        "FIG. 4 is a flow chart illustrating in detail a second embodiment of the operations of FIG. 2;",
        "FIG. 5 is a graph illustrating the operation of a cell/sector in a cellular wireless system having a fixed data user FCH forward link transmit power reserve level;",
        "FIG. 6 is a graph illustrating the operation of a cell/sector in a cellular wireless system having a variable data user FCH forward link transmit power reserve level according to the present invention;",
        "FIG. 7 is a block diagram illustrating a Base Station Controller (BSC) constructed according to the present invention;",
        "FIG. 8 is a block diagram illustrating a base station constructed according to the present invention;",
        "FIG. 9 is a flow chart illustrating in detail a third embodiment of the operations of the present invention; and",
        "FIG. 10 is a flow chart illustrating in detail a fourth embodiment of the operations of the present invention.",
        "FIG. 1 is a system diagram illustrating a portion of a digital cellular wireless system 100 constructed according to the present invention. The cellular wireless system 100 includes a wireless network infrastructure 102, base station controllers (BSCs) 152 and 154, and base stations 103, 104, 105, and 106. The wireless network infrastructure 102 couples to the Internet 114. The wireless network infrastructure 102 also couples to the Public Switched Telephone Network (PSTN) 110. In one embodiment of the present invention, the wireless network infrastructure 102 is circuit switched, couples directly to the PSTN 110, and couples to the Internet 114 via an interworking function (IWF) 108. In another embodiment of the present invention, the wireless network infrastructure 102 is packet switched, couples directly to the PSTN 110, and couples to the Internet 114 via a packet data serving node (PDSN) 112.",
        "Each of the base stations 103-106 services a cell/set of sectors within which it supports wireless communications. Wireless links that include both forward link components and reverse link components support wireless communications between the base stations and their serviced wireless subscriber units. These wireless links support digital data communications, VoIP communications, and other digital multimedia communications. The cellular wireless system 100 may also be backward compatible in supporting analog operations as well. The cellular wireless system 100 supports the 1xRTT CDMA 2000 standard and, in other embodiments, supports other digital cellular communication standards.",
        "Wireless subscriber units 116, 118, 126, 128, 130, 132, 134, and 136 couple to the cellular wireless system 100 via wireless links with the base stations 103-106. As illustrated, wireless subscriber units may include cellular telephones 116 and 118, laptop computers 126 and 134, desktop computers 128 and 136, and data terminals 130 and 132. However, the wireless system supports communications with other types of wireless subscriber units as well.",
        "The cellular wireless system 100 operates according to a CDMA standard that has been modified according to the present invention, e.g., 1xRTT (including CDMA 2000A and CDMA 2000B operations), W-CDMA, or another CDMA standard that has been modified according to the operations described herein. The cellular wireless system supports both voice and data traffic. However, operations according to the present invention relate to the service of high-rate data communications. As is generally known, devices such as laptop computers 126 and 134, desktop computers 128 and 136, data terminals 130 and 132, and cellular telephones 116 and 118, are enabled to “surf” the Internet 114, transmit and receive data communications such as email, transmit and receive files, and to perform other data operations. Many of these data operations have significant download data-rate requirements while the upload data-rate requirements are not as severe.",
        "A user of a particular wireless subscriber unit may subscribe to a service that requires relatively high bandwidth. In order to service these high-speed data communication requirements, in particular the larger download data-rate requirements, the IS-95B, and 1xRTT standards contemplate multiple download channels, i.e., fundamental traffic channels (FCHs) and supplemental traffic channels (SCHs). The SCH is a channel that is allocated to a particular wireless subscriber unit to augment the FCH. In some standards, the SCH provides variable rate data service, e.g., 19.2 kbps, 38.4 kbps, 76.8 kbps, 153.6 kbps, and 307.2 kbps, among other data rates.",
        "The data rate that can be provided via a particular SCH is based upon the signal quality as seen by a serviced wireless subscriber unit. The signal quality will depend upon the distance of the wireless subscriber unit from its servicing base station, the maximum transmit power that the servicing base station can provide for the channel, the propagation path characteristics from the base station to the wireless subscriber unit, and the noise present at the wireless subscriber unit, among other factors. Thus, if the signal quality that may be provided is high, the SCH will support a relatively higher data rate by using a relatively higher symbol rate. If the signal quality that may be provided is low, the SCH will support a relatively lower data rate by using a lower symbol rate.",
        "Various techniques have been developed to manage FCHs and SCHs in such a cellular wireless system 100. One such technique is included in the operations referred to as the Radio Resource Management (RRM) operations. Using the RRM operations, considering the signal quality available as well as a number of other considerations, a supportable data rate for the SCH is determined. Considerations in determining the supportable data rate include the available transmit power, system-wide interference levels, resources available in the BSC and the base station, and other considerations. The supportable data rate for the given channel is expected to yield a particular Frame Error Rate (FER) for serviced physical layer data frames, e.g., 1%, 5%, etc. In a conventional system, the supportable data rate is used for the SCH and provides data throughput at the supportable data rate with the expected FER.",
        "Thus, for example, if data terminal 132 is downloading a large data file, receiving streaming audio, or watching an audiovisual presentation, for example, base station 105 will service its wireless data communications. Both the FCH and one or more SCHs are employed to service this wireless data communication for the data terminal 132. Using conventional techniques, the RRM operations would yield a supportable data rate to use for the SCH servicing the data communications. At this supportable data rate for the SCH, an expected FER would result, e.g., 1%, 5%, etc. The BSC 152 and the base station 105 would work in cooperation to service these data communications at the supportable data rate. However, if a SCH is being serviced and another data user requests access to the cellular wireless system 100, it may not be able to service the data user request and the data user will be blocked.",
        "The RRM allows the operator of the cellular wireless system 100 to specify a maximum power usage for both voice and data. These limits are referred to as Tv and Td, respectively. The RRM also allows the operator to specify a fraction of the forward link data user transmit power that is reserved for data user FCH use. This fraction is denoted fd. Reservation of some power for FCHs decreases the probability that a single data user can prevent the admission of other data users during a high-power SCH burst. However reserving power for FCHs decreases the probability of blocking at the expense of a decrease in the pool of power available for SCHs, and therefore at the expense of the peak data rate available to data users. Simulation work performed by the inventors of the present invention indicates that the value of fd that yields 1% data call blocking varies considerably, from a low of 10%, to a high in excess of 40%, depending upon the mixture of voice users and data users in a particular cell/sector. Generally, as a serviced cell/sector changes from being dominated by voice traffic to being dominated by data traffic, the RF loading that gives the highest throughput decreases from 70% (for nearly all voice) to 50% (for nearly all data). Table 1 provides relevant information for this study, including the fraction of reserved data FCH power, fd. Based upon this study, it has been concluded that it is difficult for operators to properly choose fd, since a value that achieves low blocking and high throughput under one set of conditions (or at one time of the day), may be a poor choice in different conditions, or at a different time.",
        "TABLE 1\n\n\n\n\n\n\n\nOptimum fd Values for Different Voice and Data Traffic Mixtures.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCarried\nCarried\n\n\n\n\nPer-User\n\n\n\n\n\n\nVoice\nData\n\n\nNum\n\nRate\n\n\nLoading\n(erlangs)\n(kb/s)\nTFCH\nTSCH\nMobiles\nBlocking\n(kb/s)\nTv\nTd\nfd\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n40%\n0.00\n164\n75.0%\n52.5%\n92\n1.0%\n151\n 0%\n100% \n30%\n\n\n40%\n2.28\n133\n65.0%\n58.5%\n75\n0.6%\n156\n13%\n87%\n10%\n\n\n40%\n7.40\n45\n55.0%\n49.5%\n25\n0.0%\n159\n27%\n73%\n10%\n\n\n40%\n8.81\n0\n\n\n\n\n\n100% \n 0%\n\n\n50%\n0.00\n185\n75.0%\n43.4%\n106\n1.0%\n111\n 0%\n100% \n42%\n\n\n50%\n2.28\n175\n65.0%\n48.4%\n99\n1.0%\n132\n13%\n87%\n26%\n\n\n50%\n6.62\n125\n55.0%\n49.5%\n70\n0.7%\n147\n27%\n73%\n10%\n\n\n50%\n11.49\n54\n45.0%\n40.5%\n30\n0.1%\n150\n40%\n60%\n10%\n\n\n50%\n14.68\n0\n\n\n\n\n\n100% \n 0%\n\n\n60%\n0.00\n152\n75.0%\n33.8%\n93\n1.0%\n51\n 0%\n100% \n55%\n\n\n60%\n1.66\n128\n65.0%\n26.8%\n80\n1.0%\n38\n13%\n87%\n59%\n\n\n60%\n5.09\n95\n55.0%\n19.0%\n59\n1.0%\n30\n27%\n73%\n66%\n\n\n60%\n9.83\n76\n45.0%\n19.7%\n46\n1.0%\n56\n40%\n60%\n56%\n\n\n60%\n14.04\n54\n35.0%\n24.5%\n31\n1.0%\n106\n53%\n47%\n30%\n\n\n60%\n20.55\n0\n\n\n\n\n\n100% \n 0%\n\n\n70%\n0.00\n132\n75.0%\n22.5%\n88\n2.9%\n12\n 0%\n100% \n70%\n\n\n70%\n1.09\n126\n65.0%\n6.5%\n86\n7.9%\n10\n13%\n87%\n90%\n\n\n70%\n4.35\n105\n55.0%\n5.5%\n72\n9.7%\n10\n27%\n73%\n90%\n\n\n70%\n7.40\n86\n45.0%\n13.5%\n60\n13.4%\n12\n40%\n60%\n70%\n\n\n70%\n11.49\n60\n35.0%\n3.5%\n42\n11.3%\n10\n53%\n47%\n90%\n\n\n70%\n15.76\n33\n25.0%\n2.5%\n24\n17.1%\n10\n67%\n33%\n90%\n\n\n70%\n26.42\n0\n\n\n\n\n\n100% \n 0%",
        "Thus, according to the present invention, a method of automatically adjusting the power reserved for data FCHs is presented. The algorithm slowly adjusts the fd value in each sector independently so that the FCH reserved power is as small as possible while still keeping the blocking low (below some target value). This has the effect of maximizing per-user throughput, which is a critical component of subscriber grade of service. In prior systems, fd is a single data-filled value, distributed to all base stations (BTSs). According to the present invention, this single value is replaced with a maximum and a minimum value, fd,max and fd,min, and an algorithm to control a time-dependent value of fd between these extremes is enacted. The automatic adaptation of fd can be disabled by reverting to the fixed value that is currently used. Also, the adaptive algorithm can be set conservatively, by setting fd,max and fd,min close to each other, and close to the fixed value of fd recommended previously.",
        "According to the present invention, the time-variant fd is initialized to fd,max or fd,min, or somewhere in between, as desired. To adapt the value of fd between the limits, there are a number of possibilities. In each case, if the algorithm causes the value of fd to fall above fd,max or below fd,min, the algorithm caps the dynamic value.",
        "According to a first embodiment of the present invention, a method similar to that used by outer loop power control is employed to keep the FCH blocking rate at a certain percentage. Each time that a data call is admitted successfully, fd is decreased by some quantity PB·Δ, where PB is the desired probability of blocking, and Δ is some step size. When a data call is blocked, fd is increased by Δ. These operations keep the long-term value of fd at the lowest level that can maintain the desired blocking probability.",
        "According to a second embodiment of the present invention, fd is adjusted based upon a measure of the current fraction of available data power used by FCHs. For example, if the measured fraction of available data power used by FCHs is fd,meas, then set fd=A*fd,meas, where A is some multiple (greater than one) that ensures extra power for the admission of new FCHs. This operation essentially keeps the blocking probability at zero while the dynamic value of fd is between its upper and lower limits.",
        "FIG. 2 is a logic diagram illustrating operation according to the present invention. Operation commences with first allocating a base station's data user forward link transmit power within the cell/sector, wherein the data user forward link transmit power is the total forward link transmit power that may be allocated to data users within the cell/sector (step 202). The method then includes setting a data user FCH forward link transmit power reserve level upper limit fd,max that is a maximum portion of the data user forward link transmit power that may be reserved for allocation to data users on FCHs within the cell/sector (step 204). The method then optionally includes setting a data user FCH forward link transmit power reserve level lower limit fd,min (step 206). fd,min is a minimum portion of the data user forward link transmit power that may be reserved for allocation to data users on FCHs within the cell/sector. Next, the method includes setting an initial data user FCH forward link transmit power reserve level fd to a value that is less than or equal to the data user FCH forward link transmit power reserve level upper limit and, if a data user FCH forward link transmit power reserve level lower limit is implemented, greater than or equal to the data user FCH forward link transmit power reserve level lower limit (step 208).",
        "Operation then proceeds to step 210 where the base station services its cell/sector(s) (step 210). From step 210, the base station is operated to allocate FCHs to data users within the cell/sector, deallocate FCHs to data users within the cell/sector, allocate SCHs to data users within the cell/sector, and to deallocate SCHs to data users within the cell/sector. In these operations, SCHs are allocated so that the data user FCH forward link transmit power reserve level is maintained. Further, based upon at least one current data user operating condition in the cell/sector, the data user FCH forward link transmit power reserve level fd is adjusted. In making these adjustments, the method prevents the data user FCH forward link transmit power reserve level fd from violating fd,max and fd,min.",
        "From step 210, the base station may receive a FCH request (step 212). If a FCH is available for the requesting data user (as determined at step 214), the FCH is allocated (step 216) and operation proceeds to step 230. If a FCH is not available (as determined at step 214), the data user is blocked and operation proceeds to step 230. Embodiments of the operations of step 230 are illustrated in FIGS. 3, 4, and 9.",
        "From step 210, the base station may receive a SCH request (step 218). If a SCH is available for the requesting data user (as determined at step 220), the SCH is allocated (step 222) for a period of time, and operation proceeds to step 230. If a SCH is not available (as determined at step 220), the requesting data user is blocked from the SCH and operation proceeds to step 210.",
        "From step 210, the base station may also release a FCH (step 226). When the FCH is released, the FCH is deallocated (step 228) and operation proceeds to step 240. At step 240, the base station (or base station controller) adjusts fd, if required. In adjusting fd, any adjustment is performed so not as to violate fd,max and fd,min and in an effort to maximize cell/sector throughput while and also in an effort to minimize data user FCH blocking. One embodiment of the operations of step 240 is illustrated further with reference to FIG. 10.",
        "From step 210, the base station may also release a SCH (step 232). When the SCH is released, the SCH is deallocated (step 234) and operation proceeds to step 210.",
        "With the method of the present invention, in adjusting the data user FCH forward link transmit power reserve level fd based upon at least one current operating condition in the cell/sector, the method may be accomplished according to a number of embodiments. In a first embodiment of this operation, when a data call is admitted successfully, the method includes decreasing the data user FCH forward link transmit power reserve level fd by a first step size. Further, with this first embodiment, when a data call is blocked, the method includes increasing the data user FCH forward link transmit power reserve level fd by a second step size. In this first embodiment, the first step size may be proportional to a desired probability of data call blocking. Further, the second step size may be selected to meet a desired maximum rate at which the FCH forward link transmit power reserve level is allowed to increase. In a second embodiment of this operation, adjusting the data user FCH forward link transmit power reserve level includes adjusting the data user FCH forward link transmit power reserve level fd to a level that exceeds a current usage level of data user FCH forward link transmit power by a configurable proportionality factor. This second embodiment will minimize data user FCH blocking until the limit fd,max is reached.",
        "FIG. 3 is a flow chart illustrating in detail a first embodiment of the operations of FIG. 2. In particular FIG. 3 illustrates a first embodiment of the operations of step 230 of FIG. 2. With this first embodiment, a determination is first made whether to modify fd (step 302). If fd does not require modification, operation returns to step 210. However, if fd does require modification, a determination is next made as to whether most recently a FCH was allocated or a FCH was blocked (step 304). If the FCH was most recently allocated, the method next determines whether fd can be decreased, i.e., is it equal to fd,min(step 306). If fd cannot be decreased, operation proceeds to step 210. If fd can be decreased, it is decreased by a first step size (step 308). If in step 308 the resulting value of fd is lower than fd,min, the value of fd is set equal to fd,min, after which operation returns to step 210.",
        "If the FCH was most recently blocked, the method next determines whether fd can be increased, i.e., is it equal to fd,max (step 310). If fd cannot be increased, operation proceeds to step 210. If fd can be increased, it is increased by a second step size (step 312). If in step 312 the resulting value of fd is larger than fd,max, the value of fd is set equal to fd,max, after which operation returns to step 210. In this first embodiment, the first step size may be proportional to a desired probability of data call blocking. Further, the second step size may be selected to meet a desired maximum amount at which the FCH forward link transmit power reserve level is allowed to increase at one time.",
        "FIG. 4 is a flow chart illustrating in detail a second embodiment of the operations of FIG. 2. In a second embodiment of this operation, adjusting the data user FCH forward link transmit power reserve level includes adjusting the data user FCH forward link transmit power reserve level fd to a level that exceeds a current usage level of data user FCH forward link transmit power by a configurable proportionality factor. This second embodiment will minimize data user FCH blocking until the limit fd,max is reached.",
        "With the second embodiment step 230 therefore includes first determining whether a FCH was allocated (step 402). If not, operation proceeds to step 408. If so, it is next determined whether fd can be increased, i.e., is it equal to fd,max (step 404). If fd cannot be increased, operation proceeds to step 210. If fd can be increased, it is increased by a step size that makes fd proportional to the new total FCH data power by a proportionality constant A (step 406). If in step 406 the resulting value of fd is larger than fd,max, the value of fd is set equal to fd,max, after which operation returns to step 210. If it was determined in step 402 that an FCH was not allocated, it is next determined whether a FCH was deallocated (step 408). If not, operation proceeds to step 210. If so, it is next determined whether fd can be decreased, i.e., is it equal to fd,min (step 410). If fd can be decreased it is decreased by a step size that makes fd proportional to the new total FCH data power by a proportionality constant A (step 412). If in step 412 the resulting value of fd is smaller than fd,min, the value of fd is set equal to fd,min.",
        "FIG. 5 is a graph illustrating the operation of a cell/sector in a cellular wireless system having a fixed data user FCH forward link transmit power reserve level. With fd being fixed, a data user will be blocked from being allocated a FCH when the actual allocated FCH transmit power reaches fd. Not only will the data user be blocked, the data user may be blocked for no reason simply due to the setting of fd. That is, there may be excess power and Walsh codes available to serve the blocked user, resulting in an underutilization of resources.",
        "FIG. 6 is a graph illustrating the operation of a cell/sector in a cellular wireless system having a variable data user FCH forward link transmit power reserve level according to the present invention. With the operation of FIG. 6, fd is dynamically set between fd,min and fd,max based upon system conditions. With these operations, because fd is dynamically altered based upon system conditions, data user FCH blockage is minimized and data throughput for the cell/sector is maximized.",
        "FIG. 7 is a block diagram illustrating a Base Station Controller (BSC) constructed according to the present invention. The structure and operation of BSCs is generally known. The BSC 152 (or 154) services circuit switched and/or packet switched operations. In some cases, the BSC 152 is called upon to convert data between circuit switched and data switched formats, depending upon the types of equipment coupled to the BSC 152. The components illustrated in FIG. 7, their function, and the interconnectivity may vary without departing from the teachings of the present invention.",
        "The BSC 152 includes a processor 704, dynamic RAM 706, static RAM 708, EPROM 710, and at least one data storage device 712, such as a hard drive, optical drive, tape drive, etc. These components intercouple via a local bus 717 and couple to a peripheral bus 719 via an interface 718. Various peripheral cards couple to the peripheral bus 719. These peripheral cards include a wireless network infrastructure interface card 720, a base station manager interface card 724, at least one selector card 728, an MSC interface card 730, and a plurality of BTS interface cards 734 and 738.",
        "The wireless network infrastructure interface card 720 couples the BSC 152 to wireless network infrastructure 102. The base station manager interface card 724 couples the BSC 152 to a Base Station Manager 726. The selector card 728 and MSC interface card 730 couple the BSC 152 to an MSC/HLR/VLR 732. The BTS interface cards 734 and 738 couple the BSC 152 to base stations 105 and 106, respectively.",
        "FCH Operating Instructions (FCHOI) 716 and 714, along with the BSC 152 hardware, enable the BSC 152 to manage the FCH operating parameters of base stations 105 and 106 that it controls. The FCHOI 716 are loaded into the storage unit 712 and, upon execution, some or all of the FCHOI 714 are loaded into the processor 704 for execution. During this process, some of the FCHOI 716 may be loaded into the DRAM 706.",
        "FIG. 8 is a block diagram illustrating a base station constructed according to the present invention. The base station 103 (104, 105, or 106) includes a processor 804, dynamic RAM 806, static RAM 808, EPROM 810, and at least one data storage device 812, such as a hard drive, optical drive, tape drive, etc. These components (which may be contained on a peripheral processing card or module) intercouple via a local bus 817 and couple to a peripheral bus 820 (which may be a back plane) via an interface 818. Various peripheral cards couple to the peripheral bus 820. These peripheral cards include a BSC interface card 824, which couples the base station 802 to its servicing BSC 152.",
        "Digital processing cards 826, 828 and 830 couple to Radio Frequency (RF) units 832, 834, and 836, respectively. Each of these digital processing cards 826, 828, and 830 performs digital processing for a respective sector, e.g., sector 1, sector 2, or sector 3, serviced by the base station 802. The RF units 832, 834, and 836 couple to antennas 842, 844, and 846, respectively, and support wireless communication between the base station 802 and wireless subscriber units. Further, the RF units 832, 834, and 836 operate according to the present invention. The base station 802 may include other card(s) 840 as well.",
        "FCH Operating Instructions (FCHOI) 816 and 814 enable the BSC 802 to perform the operations of the present invention. The FCHOI 816 are loaded into the storage unit 812 and, upon their execution, some or all of the FCHOI 814 are loaded into the processor 804 for execution. During this process, some of the FCHOI 816 may be loaded into the DRAM 806.",
        "FIG. 9 is a flow chart illustrating in detail a third embodiment of the operations of step 230 of the present invention. According to the third embodiment, after the allocation of a FCH, calculations are performed to determine the average FCH transmit power currently in use, i.e., total active FCH transmit power divided by the number of active FCH users (step 904). Then, a determination is made as to whether a FCH can be allocated, i.e., if the requested FCH allocation is made would cause the FCH forward link transmit power to exceed fd, e.g., is T+q<fd (step 906). If the requested FCH allocation cannot be made, it is next determined whether fd can be increased (step 908) and, if it can, fd is increased by a first amount (step 910). If fd cannot be increased, as determined at step 908, and from step 910, operation returns to step 210. If the requested FCH allocation can be made, it is next determined whether fd can be increased (step 912) and, if it can, fd is increased by a second amount (step 914) from both step 912 and step 914 operation proceeds to step 210 after the FCH allocation is made at step 916. The third embodiment may be performed such that fd is increased by a lesser amount when the FCH can be allocated than when it cannot be allocated. Alternately, the third embodiment may be performed such that fd is increased by a greater amount when the FCH can be allocated than when it cannot be allocated.",
        "FIG. 10 is a flow chart illustrating in detail a fourth embodiment of the operations of the present invention. In particular, the operations of FIG. 10 described one embodiment of the operations that were generally described at step 240 of FIG. 2. With these operations, calculations are first performed to determine the average FCH transmit power currently in use, i.e., total active FCH transmit power divided by the number of active FCH users (step 1000). Then, a determination is made as to whether fd is to be modified (step 1002). If not, operation returns to step 210. If so, it is next determined whether fd can be decreased (step 1004). If so, fd is decreased by a step size, e.g., fd=fd−T/N (step 1006). If not, operation returns to step 210. Further, after fd is decreased at step 1006, operation returns to step 210.",
        "The invention disclosed herein is susceptible to various modifications and alternative forms. Specific embodiments therefore have been shown by way of example in the drawings and detailed description. It should be understood, however, that the drawings and detailed description thereto are not intended to limit the invention to the particular form disclosed, but on the contrary, the invention is to cover all modifications, equivalents and alternatives falling within the spirit and scope of the present invention as defined by the claims."
    ],
    "citations": [
        "6609007",
        "6975609",
        "2002/0160783",
        "2002/0198014"
    ],
    "us_classification": "455522",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "04",
            "subclass": "B",
            "main_group": "7",
            "subgroup": "00"
        }
    ]
}