{
    "title": "Copper-containing formulation for plant disease control",
    "abstract": "The present invention relates to a copper-containing formulation for plant disease-control which comprises divalent copper and polyphosphate residues, wherein the amount of the polyphosphate residues per one chemical equivalent of the divalent copper is higher than one chemical equivalent. The copper-containing formulation of the present invention shows an excellent disease-control effect without causing any chemical injury of the plant.",
    "inventors": [
        "Arimoto",
        "Hagiwara",
        "Uchida",
        "Ota"
    ],
    "document_number": "07297349",
    "publication_date": "20071120",
    "assignees": [
        "Riken",
        "Otsuka Chemical Co., Ltd"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A copper-containing composition comprising:",
            "components": [
                {
                    "component": "divalent copper,",
                    "subcomponents": []
                },
                {
                    "component": "polyphosphate residue(s), and",
                    "subcomponents": []
                },
                {
                    "component": "a surfactant;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the polyphosphate residue is at least one member selected from the group consisting of a pyrophosphate residue, tripolyphosphate residue, tetrapolyphosphate residue, trimetaphosphate residue, and tetrametaphosphate residue;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the amount of the polyphosphate residues per one chemical equivalent of the divalent copper is higher than one chemical equivalent and not more than 4 chemical equivalents;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the surfactant is at least one member selected from the group consisting of polyoctyl polyaminoethyl glycine, alkyl polyaminoethyl glycine hydrochlorides, and 2-alkyl-N-carboxymethyl-N-hydroxyethyl imidazolium betaine; or is at least one member selected from the group consisting of C",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The composition of claim 1 , wherein the polyphosphate residue is at least one member selected from the group consisting of a pyrophosphate residue, tripolyphosphate residue, and tetrapolyphosphate residue.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The composition of claim 1 , wherein the counter ions for the polyphosphate residues are alkali metal ions.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The composition of claim 1 ,",
            "components": [
                {
                    "component": "which comprises sodium or potassium pyrophosphate in a molar ratio of 1.05 to 2.2 per 2.0 moles of copper sulfate;",
                    "subcomponents": []
                },
                {
                    "component": "which comprises sodium or potassium tripolyphosphate in a molar ratio of 1.05 to 2.7 per 2.5 moles of copper sulfate;",
                    "subcomponents": []
                },
                {
                    "component": "which comprises sodium or potassium tetrapolyphosphate in a molar ratio of 1.05 to 3.2 per 3.0 moles of copper sulfate; or",
                    "subcomponents": []
                },
                {
                    "component": "which comprises sodium or potassium tetrametaphosphate in a molar ratio of 1.05 to 2.0 per 2.0 moles of copper sulfate.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The composition of claim 1 , which includes copper sulfate and an alkali metal salt of polyphosphoric acid.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The composition of claim 1 , further comprising a dispersant.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The composition of claim 1 , which has a pH ranging from 5.0 to 7.5 and a copper concentration ranging from 35 to 500 mg/L.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The composition of claim 1 , wherein the surfactant is at least one member selected from the group consisting of polyoctyl polyaminoethyl glycine, alkyl polyaminoethyl glycine hydrochlorides, and 2-alkyl-N-carboxymethyl-N-hydroxyethyl imidazolium betaine.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The composition of claim 1 , wherein the amount of the surfactant to be used ranges from 0.005 to 20 parts by mass per one part by mass of the copper compound.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The composition of claim 1 at a concentration and in an amount sufficient to treat a plant disease, wherein said disease is late blight of tomato, leaf mold of tomato, downy mildew of tomato, downy mildew of cucumber, anthracnose of cucumber, powdery mildew of cucumber, scab of pear, black spot of pear, fruit spot of apple, blotch of apple, angular and/or circular leaf spot of persimmon, anthracnose of persimmon, anthracnose of grape, leaf spot of grape, ripe rot of grape, downy mildew of grape, scab of orange, melanose of citrus fruits, melanose of orange, anthracnose of watermelon, downy mildew of cabbage, Sclerotinia rot of cabbage, late blight of potato, downy mildew of common onion, or Alternaria leaf spot of common onion.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The composition of claim 1 , which includes copper sulfate and sodium or potassium pyrophosphate.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The composition of claim 11 , wherein the surfactant is at least one member selected from the group consisting of C",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The composition of claim 12 , which further comprises at least one member selected from the group consisting of synthetic silica and clay.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The composition of claim 1 , which includes:",
            "components": [
                {
                    "component": "copper sulfate,",
                    "subcomponents": []
                },
                {
                    "component": "sodium pyrophosphate,",
                    "subcomponents": []
                },
                {
                    "component": "at least one member selected from the group consisting of alkyl polyaminoethyl glycine hydrochloride, and 2-alkyl-N-carboxymethyl-N-hydroxyethyl-imidazolium betaine, and",
                    "subcomponents": []
                },
                {
                    "component": "at least one member selected from the group consisting of synthetic silica and clay.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A method for controlling plant disease, which comprises applying to a plant a copper-containing composition comprising:",
            "components": [
                {
                    "component": "divalent copper,",
                    "subcomponents": []
                },
                {
                    "component": "polyphosphate residue(s), and",
                    "subcomponents": []
                },
                {
                    "component": "a surfactant;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the polyphosphate residue is at least one member selected from the group consisting of a pyrophosphate residue, tripolyphosphate residue, tetrapolyphosphate residue, trimetaphosphate residue, and tetrametaphosphate residue;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the amount of the polyphosphate residues per one chemical equivalent of the divalent copper is higher than one chemical equivalent and not more than 4 chemical equivalents;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the surfactant is at least one member selected from the group consisting of polyoctyl polyaminoethyl glycine, alkyl polyaminoethyl glycine hydrochlorides, and 2-alkyl-N-carboxymethyl-N-hydroxyethyl imidazolium betaine; or is at least one member selected from the group consisting of C",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 15 , wherein in said composition the polyphosphate residue is at least one member selected from the group consisting of pyrophosphate residues, tripolyphosphate residues, and tetrapolyphosphate residues.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 15 , wherein in said composition the counter ions for the polyphosphate residues are alkali metal ions.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The method of claim 15 , wherein said composition comprises:",
            "components": [
                {
                    "component": "sodium or potassium pyrophosphate in a molar ratio of 1.05 to 2.2 per 2.0 moles of copper sulfate;",
                    "subcomponents": []
                },
                {
                    "component": "sodium or potassium tripolyphosphate in a molar ratio of 1.05 to 2.7 per 2.5 moles of copper sulfate;",
                    "subcomponents": []
                },
                {
                    "component": "sodium or potassium tetrapolyphosphate in a molar ratio of 1.05 to 3.2 per 3.0 moles of copper sulfate; or",
                    "subcomponents": []
                },
                {
                    "component": "sodium or potassium tetrametaphosphate in a molar ratio of 1.05 to 2.0 per 2.0 moles of copper sulfate.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 15 , wherein said composition includes copper sulfate and an alkali metal salt of polyphosphoric acid.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method of claim 15 , wherein said composition further comprises a dispersant.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The method of claim 15 , wherein said composition has a pH ranging from 5.0 to 7.5 and a copper concentration ranging from 35 to 500 mg/L.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The method of claim 15 , wherein the surfactant in said composition is at least one member selected from the group consisting of polyoctyl polyaminoethyl glycine, alkyl polyaminoethyl glycine hydrochlorides, and 2-alkyl-N-carboxymethyl-N-hydroxyethyl imidazolium betaine.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The method of claim 15 , wherein the amount of the surfactant in said composition ranges from 0.005 to 20 parts by mass per one part by mass of the copper compound.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The method of claim 15 , wherein the plant disease is late blight of tomato, leaf mold of tomato, downy mildew of tomato, downy mildew of cucumber, anthracnose of cucumber, powdery mildew of cucumber, scab of pear, black spot of pear, fruit spot of apple, blotch of apple, angular and/or circular leaf spot of persimmon, anthracnose of persimmon, anthracnose of grape, leaf spot of grape, ripe rot of grape, downy mildew of grape, scab of orange, melanose of citrus fruits, melanose of orange, anthracnose of watermelon, downy mildew of cabbage, Sclerotinia rot of cabbage, late blight of potato, downy mildew of common onion, or Alternaria leaf spot of common onion.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The method of claim 15 , wherein the composition is in the form of an aqueous solution having a pH of 4.5 to 8.0.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The method of claim 15 , wherein the copper concentration in the composition upon the application to the plant ranges from 20 to 2,000 mg/L.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The method of claim 15 , wherein said composition includes copper sulfate, and sodium or potassium pyrophosphate.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. The method of claim 15 , wherein in said composition the surfactant is at least one member selected from the group consisting of C",
            "components": []
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The method of claim 28 , wherein said composition further comprises at least one member selected from the group consisting of synthetic silica and clay.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The method of claim 15 , wherein said composition includes copper sulfate, sodium pyrophosphate, at least one member selected from the group consisting of alkyl polyaminoethyl glycine hydrochloride, and 2-alkyl-N-carboxymethyl-N-hydroxyethyl-imidazolium betaine, and at least one member selected from the group consisting of synthetic silica and clay.",
            "components": []
        }
    ],
    "description": [
        "The present application is a continuation of International Application PCT/JP03/10793 filed on Aug. 26, 2003, which claims priority to Japanese Patent Application No. 2002-244743, filed Aug. 26, 2002.",
        "The present invention relates to a copper-containing formulation for plant disease control.",
        "Copper sulfate generates copper ions in an aqueous solution thereof and shows a very strong bactericidal action or effect. Therefore, it has been used as an agricultural chemical over not less than 100 years, while making use of the foregoing characteristic properties. However, the copper ion likewise has a strong action of causing damage from agricultural chemicals (a phytotoxicity or a chemical injury) on a plant body. For this reason, there have been proposed a variety of means to use the same while masking the most use of the strong bactericidal action thereof and preventing any adverse effect thereof on the plant body. An example thereof is to mix copper sulfate with quick lime and the mixture has long been known as Bordeaux mixture and has been put in practical use. In this respect, however, the influence of the copper may vary depending on the kinds of plants. Accordingly, not only it would be necessary to change the mixing ratio of copper sulfate and quick lime for every particular plants, but also a technology of a high level would be required for the preparation of each particular mixture.",
        "To this end, there has been designed the so-called premix Bordeaux. In this premix, a basic copper chloride or a basic copper sulfate is substituted for copper sulfate to thus inhibit any release of copper ions from the same. However, copper ions are rapidly released out of the premix due to, for instance, rainwater and this may give rise to damages from the agricultural chemical, in most of cases, even when using such premix Bordeaux. For this reason, calcium carbonate (such as a product sold under the trade name of kurefunon (calcium carbonate content: 95%)) is added to a spraying solution to further increase the basicity thereof and to thus prevent any release of copper ions from the premix. However, it is difficult to completely prevent the occurrence of any damage from agricultural chemicals even if the basicity of the premix is thus increased due to, for instance, a rainfall immediately after the spray of the same. In such a formulation, the release of copper ions is prevented by making the formulation basic and therefore, if the formulation is acidified by, for instance, acid rain, a large quantity of copper ions are released from the same and this would in turn lead to the occurrence of any damage from agricultural chemicals.",
        "As has been discussed above, any conventional copper-containing formulations have been made strongly basic to thus prevent any release of copper ions for fear that any damage from agricultural chemicals may occur. Accordingly, in order to achieve or ensure a desired plant disease control effect, such a formulation should be sprayed on plants in a large quantity on the order of, for instance, 5 kg/ha. If a copper-containing formulation has been sprayed thereon over a long period of time, copper may accumulated in the soil and the release of the copper accumulated in the soil would cause the pollution of watercourses and drinking water.",
        "When copper sulfate is mixed with sodium pyrophosphate or potassium pyrophosphate in water in a molar ratio of 2:1, copper pyrophosphate is formed, which is hardly soluble in water. Thus, the copper pyrophosphate is hardly soluble in water and therefore, it has never been used as an active component for an agricultural chemical. Moreover, it has been known that the copper pyrophosphate may be converted into a water-soluble one through the formation of a double salt or a complex salt with sodium pyrophosphate. Up to this time, however, there has not been any report concerning the bactericidal activity of this reaction product against vegetable pathogenic bacteria and/or fungi.",
        "Japanese Un-Examined Patent Publication (hereunder referred to as “J.P. KOKAI”) Hei 8-165213 discloses the effect of copper metaphosphate on Escherichia coli. In this respect, however, the copper metaphosphate is one prepared by heating ammonium dihydrogen phosphate and copper oxide at 800° C. and therefore, it comprises meta-phosphoric acid and copper in amounts of equal chemical equivalents.",
        "J.P. KOKAI Hei 6-40806 discloses a bactericidal and insecticide composition containing a coated agricultural chemical prepared by coating 100 pars by mass of an effective component for the agricultural chemical with 0.1 to 10 parts by mass of a fatty acid ester of an aliphatic polyhydric alcohol and/or a phospholipids and 0.01 to 10 parts by mass of a pasting or sizing agent. As such a component for the agricultural chemical, there is listed, for instance, copper sulfate and examples of such pasting agents disclosed therein are sodium polyphosphate, potassium polyphosphate and sodium metaphosphate, but the mixing ratio of copper sulfate to, for instance, sodium polyphosphate is quite low and more specifically, the mixing rate of copper sulfate and, for instance, sodium polyphosphate is 0.01 to 10 parts by mass of the latter relative to 100 parts by mass of the former.",
        "It is an object of the present invention to provide a copper-containing formulation for plant disease control, which has an excellent plant disease controlling effect without being accompanied by any damages from the agricultural chemical (any chemical injury).",
        "The inventors of this invention added 2.0 moles of copper sulfate and more than 1.0 mole of sodium pyrophosphate (in a chemical equivalent ratio of higher than 1:1) to water and examined the activity of the resulting liquid against plant pathogenic bacteria and/or fungi without any post-treatment. As a result, they have found that the bactericidal effect thereof is quite high, that the risk of causing damages from agricultural chemical is considerably reduced and that the liquid can inhibit the occurrence of any disease injury due to mould against which the conventional inorganic copper-containing formulations do not show any control activity.",
        "The present invention has been completed on the basis of the foregoing findings and accordingly, the present invention herein provides the following copper-containing formulations for plant disease control:\n\n    1. A copper-containing formulation for plant disease control comprising divalent copper and polyphosphate residues, wherein the amount of the polyphosphate residues per one chemical equivalent of the divalent copper is higher than one chemical equivalent.\n    2. The copper-containing formulation for plant disease control as set forth in the foregoing item 1, wherein the polyphosphate residue is at least one member selected from the group consisting of pyrophosphate residues, tripolyphosphate residues, tetrapolyphosphate residues, trimetaphosphate residues, and tetrametaphosphate residues.\n    3. The copper-containing formulation for plant disease control as set forth in the foregoing item 1 or 2, wherein the counter ions for the polyphosphate residues are alkali metal ions.\n    4. The copper-containing formulation for plant disease control as set forth in any one of the foregoing items 1 to 3, wherein the amount of the polyphosphate residues per one chemical equivalent of the divalent copper is higher than one chemical equivalent and not more than 4 chemical equivalents.\n    5. The copper-containing formulation for plant disease control as set forth in any one of the foregoing items 1 to 4, wherein it comprises copper sulfate and an alkali metal salt of polyphosphoric acid.\n    6. The copper-containing formulation for plant disease control as set forth in any one of the foregoing items 1 to 5, wherein it further comprises a surfactant.\n    7. The copper-containing formulation for plant disease control as set forth in the foregoing item 6, wherein the surfactant is at least one member selected from the group consisting of amphoteric surfactants, nonionic surfactants, and anionic surfactants.\n    8. The copper-containing formulation for plant disease control as set forth in the foregoing item 6, wherein the surfactant is an amphoteric surfactant.\n    9. The copper-containing formulation for plant disease control as set forth in the foregoing item 6, wherein the amphoteric surfactant is at least one member selected from the group consisting of polyoctyl polyaminoethyl glycine, alkyl polyaminoethyl glycine hydrochloride, and 2-alkyl-N-carboxymethyl-N-hydroxyethyl imidazolium betaine.\n    10. The copper-containing formulation for plant disease control as set forth in any one of the foregoing items 6 to 9, wherein the amount of the surfactant to be used ranges from 0.005 to 20 parts by mass per one part by mass of the copper compound.\n    11. The copper-containing formulation for plant disease control as set forth in any one of the foregoing items 1 to 10, wherein the plant disease injury is late blight of tomato, leaf mold of tomato, downy mildew of tomato, downy mildew of cucumber, anthracnose of cucumber, powdery mildew of cucumber, scab of pear, black spot of pear, fruit spot of apple, blotch of apple, angular and/or circular leaf spot of persimmon, anthracnose of persimmon, anthracnose of grape, leaf spot of grape, ripe rot of grape, downy mildew of grape, scab of orange, melanose of citrus fruits, melanose of orange, anthracnose of watermelon, downy mildew of cabbage, Sclerotinia rot of cabbage, late blight of potato, downy mildew of common onion, or Alternaria leaf spot of common onion.",
        "The conventional copper-containing formulations have been investigated such that the solubility thereof in water is reduced for fear of excess release of copper ions therefrom. For this reason, the copper-containing formulation has been basified. However, when the formulation is acidified, excess copper ions are easily dissolved out of or released from the formulation and accordingly, the occurrence of chemical injuries cannot be avoided. The inventors of this invention have thus conducted studies to develop a formulation having a composition essentially free of any excess release of copper ions and as a result, have found that the foregoing object of the present invention can be accomplished by a copper-containing formulation for plant disease control comprising divalent copper and polyphosphate residues in an amount of higher than one chemical equivalent per one chemical equivalent of the divalent copper.",
        "Examples of divalent copper-containing compounds used in the copper-containing formulation according to the present invention include copper sulfate, copper chloride, copper nitrate, copper acetate and copper polyphosphate, with copper sulfate being particularly preferred. These copper-containing compounds may be those having water of crystallization or anhydrous ones.",
        "Examples of polyphosphate residues used in the copper-containing formulation of the present invention include pyrophosphate residues, tripolyphosphate residues, tetrapolyphosphate residues, tri-metaphosphate residues, tetrametaphosphate residues, hexametaphosphate residues and mixtures comprising at least two kinds thereof. Among these, more preferably used herein are pyrophosphate residues, tripolyphosphate residues and tetrapolyphosphate residues. Examples of counter ions for the polyphosphate residues preferably used herein are alkali metal ions, with sodium or potassium ions being more preferred. In this respect, the combination of the foregoing polyphosphate residue and the counter ion thereof is herein also referred to as “polyphosphoric acid salt”.",
        "The present invention relates to a copper-containing formulation comprising divalent copper and polyphosphate residues, which is characterized in that the amount of the polyphosphate residues per one chemical equivalent of the divalent copper is higher than one chemical equivalent and preferably higher than one chemical equivalent and not more than 4 chemical equivalents. This is because if the amount of the polyphosphate residues is not more than one chemical equivalent per one chemical equivalent of the divalent copper, the resulting formulation may be liable to cause damage from agricultural chemical, while if it exceeds 4 chemical equivalent, the resulting formulation may be liable to show a reduced plant disease control effect. The alkali metal salt of polyphosphoric acid added to the copper-containing formulation according to the present invention may have an action of controlling the release of copper ions from the formulation.",
        "In this connection, the chemical equivalents of the foregoing components will be described below with reference to the following chemical formula:\n\nH4P2O7+4NaOH→Na4P2O7+4H2O",
        "One mole of pyrophosphoric acid reacts with 4 moles of sodium hydroxide to give one mole of sodium pyrophosphate and 4 moles of water. More specifically, the amount of pyrophosphate residues present in one mole of pyrophosphoric acid corresponds to 4 chemical equivalents since the ionic valence of a pyrophosphate residue is 4, while that of sodium residue or ion present in one mole of sodium hydroxide corresponds to one chemical equivalent since the ionic valence of sodium ion is 1. Accordingly, the chemical equivalent of, for instance, divalent copper and tetravalent polyphosphate residue can be calculated from the ionic valence thereof. In other words, one mole of divalent copper (Cu2+) is equal to 2 chemical equivalent and one mole of pyrophosphate residue corresponds to 4 chemical equivalents since the ionic valence of the pyrophosphate residue (P2O7−4) is 4.",
        "The following are preferred embodiments of the copper-containing formulations of the present invention.",
        "A copper-containing formulation for plant disease control comprises copper sulfate and sodium or potassium pyrophosphate in which the mixing ratio thereof as expressed in terms of the molar ratio is such that the amount of the pyrophosphate preferably ranges from 1.01 to 4.0, more preferably 1.01 to 3.0 and most preferably 1.05 to 2.2 per 2.0 moles of copper sulfate.",
        "A copper-containing formulation for plant disease control comprises copper sulfate and sodium or potassium tripolyphosphate in which the mixing ratio thereof as expressed in terms of the molar ratio is such that the amount of the tripolyphosphate preferably ranges from 1.01 to 4.0, more preferably 1.01 to 3.0 and most preferably 1.05 to 2.7 per 2.5 moles of copper sulfate.",
        "A copper-containing formulation for plant disease control comprises copper sulfate and sodium or potassium tetrapolyphosphate in which the mixing ratio thereof as expressed in terms of the molar ratio is such that the amount of the tetrapolyphosphate preferably ranges from 1.01 to 4.0, more preferably 1.01 to 3.0 and most preferably 1.05 to 3.2 per 3.0 moles of copper sulfate.",
        "A copper-containing formulation for plant disease control comprises copper sulfate and sodium or potassium tetrametaphosphate in which the mixing ratio thereof as expressed in terms of the molar ratio is such that the amount of the tripolyphosphate preferably ranges from 1.01 to 4.0, more preferably 1.01 to 3.0 and most preferably 1.05 to 2.0 per 2.0 moles of copper sulfate.",
        "When the polyphosphate used is one having a distribution in its polymerization degree such as sodium hexametaphosphate (for instance, Graham's salt), the molecular formula thereof is assumed to be (NaPO3)n and the molecular weight thereof is thus defined to be 102. For this reason, in the copper-containing formulation for plant disease control comprising copper sulfate and sodium hexametaphosphate, the latter is incorporated into the formulation in an amount of higher than 204 g, preferably ranging from 214 to 408 g and more preferably 214 to 306 g per 1.0 mole of copper sulfate.",
        "The copper-containing formulation for plant disease control according to the present invention may further comprise, in addition to the foregoing copper-containing compound and polyphosphoric acid salt, at least one additive commonly used in a formulation when putting it into practical use as an agricultural chemical selected from the group consisting of, for instance, a surfactant [for instance, a nonionic surfactant (such as a linear alkyl polyoxyethylene ether and a polyoxyethylene castor oil), an anionic surfactant (such as an alkane sulfonic acid salt and an alkene sulfonic acid salt), a cationic surfactant (such as a dialkyl-dimethyl ammonium chloride and a benzalkonium salt), an amphoteric surfactant (such as a sulfo-betaine), a glycerin fatty acid ester (such as fatty acid monoglyceride), and a propylene glycol fatty acid ester], and a dispersant [for instance, synthetic silica (such as CARPLEX available from Shionogi & Co., Ltd. and NIPSEAL NS-T available from Nippon Silica Industries, Ltd.), and a mineral carrier such as kaolin, diatomaceous earth, talc and bentonite].",
        "Such surfactants preferably used herein include, for instance, amphoteric surfactants, nonionic surfactants and anionic surfactant and specific examples thereof are amphoteric surfactants, for instance, polyoctyl polyaminoethyl glycine (such as a product available from Toho Chemical Industry Co., Ltd. under the trade name of OVAZOLINE B (containing 60% by mass of an effective component)), alkyl polyaminoethyl glycine hydrochlorides (such as a product available from Sanyo Chemical Industries, Ltd. under the trade name of LEVON U (containing 50% by mass of an effective component)), 2-alkyl-N-carboxymethyl-N-hydroxyethyl imidazolium betaines (such as a product available from Toho Chemical Industry Co., Ltd. under the trade name of OVAZOLINE 552 (containing 50% by mass of an effective component)); nonionic surfactants, for instance, glycerin monopalmitate; and anionic surfactants, for instance, sodium alkenyl-sulfonates (such as a product available from Toho Chemical Industry Co., Ltd. under the trade name of SOLPOL 5115). Preferably used herein as such surfactants further include, for instance, amphoteric surfactants and specific examples thereof include polyoctyl polyaminoethyl glycine, alkyl polyaminoethyl glycine hydrochlorides, and 2-alkyl-N-carboxymethyl-N-hydroxyethyl imidazolium betaines, with polyoctyl polyaminoethyl glycine and alkyl polyaminoethyl glycine hydrochlorides being particularly preferred.",
        "The amount of these surfactants used herein ranges from 0.005 to 20 parts by mass, more preferably 0.01 to 10 parts by mass and particularly preferably 0.02 to 5 parts by mass per one part by mass of the copper-containing compound. The amounts of other additives in general range from about 0.01 to about 2.5 parts by mass per one part by mass of the copper-containing compound.",
        "The present invention will hereunder be described in more detail with reference to copper-containing formulations for plant disease control each comprising copper sulfate and sodium pyrophosphate by way of example, but the present invention is not restricted to these specific examples at all.",
        "Copper pyrophosphate is formed in an aqueous solution containing copper sulfate and sodium pyrophosphate in a mixing ratio of 2:1. This copper pyrophosphate is a quite stable compound and it has been reported that the solubility thereof in water is about 10−5 M. However, this compound has a high solubility in an acidic solution and a large amount of copper ions are released from the compound into the solution.",
        "On the other hand, when mixing copper sulfate and sodium pyrophosphate in such a mixing rate of higher than one mole of the latter per 2 moles of the former, the amount of pyrophosphate ions relative to that of divalent copper ions increases in the resulting solution and it is considered that the pyrophosphate ions are partially converted into copper sodium pyrophosphate and/or copper hydrogen pyrophosphate.",
        "As has been discussed above, in a solution in which copper sulfate and sodium pyrophosphate are mixed together in such a mixing rate of higher than one mole of the latter relative to 2 moles of the former, it is considered that a complicated equilibrium relation is established between, for instance, copper pyrophosphate, sodium pyrophosphate, copper ions, sodium ions, pyrophosphate ions, copper sodium pyrophosphate and copper hydrogen pyrophosphate. This is considered to be the reason why a damage from agricultural chemical is caused by a copper-containing formulation which comprises not more than one mole of sodium pyrophosphate relative to 2 moles of copper sulfate, while a higher plant disease control effect can be ensured, without causing any chemical injury, when using a copper-containing formulation which comprises higher than one mole of sodium pyrophosphate relative to 2 moles of copper sulfate.",
        "The divalent copper ion has a high ability of linking with other compounds and it can easily be linked with, for instance, an amino acid adhered to the surface of a plant body to thus lose its activity of controlling plant disease. Moreover, if it reaches the interior of a plant body, it can link with a variety of plant components and thus becomes a cause of any damage from agricultural chemical.",
        "Since the copper-containing formulation of the present invention has a considerably low ability of damaging a plant body and a considerably high effect of controlling plant disease and it is effective for a large number of plant diseases, it is suggested that the formulation shows a high ability of transferring into plant pathogens. Moreover, in case of the copper-containing formulation currently used as an agricultural chemical, the copper ion concentration thereof is small under the alkaline conditions, but it becomes high under acidic conditions and this would lead to the occurrence of damage from agricultural chemical. On the other hand, in case of the copper-containing formulation of the present invention, the copper ion concentration thereof undergoes a quite small change even when the pH value of the solution is changed and therefore, the formulation of the present invention has a quite low probability of causing chemical injuries.",
        "The foregoing is not a phenomenon peculiar to the combination of copper sulfate and sodium pyrophosphate and this is a phenomenon also observed even for the foregoing combinations of other polyphosphoric acid compounds with copper sulfate or other copper-containing compound.",
        "The copper-containing formulation of the present invention is in general used in the form of an aqueous solution and the pH value of this aqueous solution preferably ranges from 4.5 to 8.0 and more preferably 5.0 to 7.5.",
        "It is suitable that the copper concentration of the copper-containing formulation upon the spray thereof preferably ranges from 20 to 2000 mg/L and more preferably 35 to 500 mg/L.",
        "The copper-containing formulation of the present invention shows disease-preventing and disease-treating effects and is effective not only for the plant disease injuries due to bacteria, but also plant disease injuries due to fungi (mould). Moreover, the formulation of the invention may likewise be used as a disinfectant for seeds such as those of crops, for instance, wheat and barley and pulses; those of vegetables such as cucumber, tomato, lettuce and spinach; those of flowers such as pansy and morning glories; and those of rootcrops such as potato. Accordingly, the copper-containing formulation of the present invention also includes seed's disinfectant.",
        "Examples of plant disease injuries to which the copper-containing formulation according to the present invention can effectively be applied include late blight of tomato, leaf mold of tomato, downy mildew of tomato, downy mildew of cucumber, anthracnose of cucumber, powdery mildew of cucumber, scab of pear, black spot of pear, fruit spot of apple, blotch of apple, angular and/or circular leaf spot of persimmon, anthracnose of persimmon, anthracnose of grape, leaf spot of grape, ripe rot of grape, downy mildew of grape, scab of orange, melanose of citrus fruits, melanose of orange, anthracnose of watermelon, downy mildew of cabbage, Sclerotinia rot of cabbage, late blight of potato, downy mildew of common onion, or Alternaria leaf spot of common onion.",
        "The dosage form of the copper-containing formulation according to the present invention is preferably a water dispersible powder and it is converted into an aqueous solution upon its practical use. In this respect, it is preferred to prepare such an aqueous solution using a spreader or a wetting agent. Such a spreader used at this stage may be any one insofar as it can be used in the copper-containing formulation and specific examples thereof are polyoxyethylene alkyl ethers (for instance, a product available from Hokko Chemical Industry Co., Ltd. under the trade name of HYTEN A) and polyoxyethylene resin acids (for instance, a product available from Nippon Noyaku Co., Ltd. under the trade name of SPRAYSTICKER).",
        "The sites of plants to be sprayed with the copper-containing formulation according to the present invention are above-ground parts of the plants and the formulation is sprayed on the sites during the growing season and dormant stage.",
        "The amount of the formulation to be sprayed preferably ranges from 0.01 to 5 kg/ha and more preferably 0.2 to 1 kg/ha as expressed in terms of the amount of copper present therein.",
        "The present invention will hereunder be described in more specifically with reference to the following Examples.",
        "To copper sulfate, there was added potassium pyrophosphate in an amount of 0.8, 0.9, 1.0, 1.05, 1.1, 1.2, 1.4, 1.6, 1.8, 2.0, 2.2 or 2.4 moles per 2.0 moles of the copper sulfate and these components were sufficiently admixed together using a stirring machine.",
        "To copper sulfate, there was added sodium pyrophosphate in an amount of 0.8, 0.9, 1.0, 1.05, 1.1, 1.2, 1.4, 1.6, 1.8, 2.0, 2.2 or 2.4 moles per 2.0 moles of the copper sulfate and these components were sufficiently admixed together using a stirring machine.",
        "To copper sulfate, there was added sodium tripolyphosphate in an amount of 0.8, 0.9, 1.0, 1.05, 1.1, 1.2, 1.5, 2.0, 2.3, 2.5, 2.7 or 2.4 moles per 2.5 moles of the copper sulfate and these components were sufficiently admixed together using a stirring machine.",
        "To copper sulfate, there was added potassium tripolyphosphate in an amount of 0.8, 0.9, 1.0, 1.05, 1.1, 1.2, 1.5, 2.0, 2.5, 3.0, 3.2 or 3.5 moles per 3.0 moles of the copper sulfate and these components were sufficiently admixed together using a stirring machine.",
        "Test for Disease Prevention Effects",
        "Each of the copper-containing formulations prepared in Examples 1 to 4 was diluted with water so that the concentration thereof was equal to 6 mg/100 ml as expressed in terms of the amount of copper to thus prepare each corresponding test solution. This solution of an agricultural chemical was sprayed on the leaves of a plant, spores of a pathogenic fungus (zoospores) were inoculated through the spray thereof after drying the solution and then the plant was kept in a moist chamber (maintained at a temperature of 20° C. for late blight of tomato and downy mildew of cucumber, or 25° C. for anthracnose of cucumber or melanose of citrus fruits, and a humidity of 100%). Then the number of lesions generated was determined after 3 days from the inoculation for the late blight of tomato and the downy mildew of cucumber, after 4 days from the inoculation for the anthracnose of cucumber and after 5 days from the inoculation for the melanose of citrus fruits and the results thus obtained were compared with those observed for the control (a group free of any treatment with the foregoing agricultural solutions) to thus calculate each preventive value. In case of powdery mildew of cucumber, each test solution obtained by diluting each formulation to the foregoing concentration was sprayed on the leaves of cucumber seedlings, on which lesions had been formed, followed by the maintenance thereof at 25° C. and the determination of the number of lesions after 10 days to thus determine the preventive value.\n\nPreventive Value (%) =[1−(number of lesions observed for each treated group)/(number of lesions observed for the control group)]×100",
        "The following Table 1 shows the results observed in the foregoing test for controlling a variety of plant disease injuries obtained using the formulation prepared in Example 1; the following Table 2 shows the results observed in the foregoing test for controlling a variety of plant disease injuries obtained using the formulation prepared in Example 2; the following Table 3 shows the results observed in the foregoing test for controlling a variety of plant disease injuries obtained using the formulation prepared in Example 3; and the following Table 4 shows the results observed in the foregoing test for controlling a variety of plant disease injuries obtained using the formulation prepared in Example 4.",
        "In the following Tables, the disease injuries to which the test solutions are applied (disease injuries tested) are as follows:",
        "1: late blight of tomato; 2: downy mildew of cucumber; 3: anthracnose of cucumber; 4: melanose of citrus fruits; 5: powdery mildew of cucumber.",
        "TABLE 1\n\n\n\n\n\n\n\nEx.\n\n\n\n1:CuSO4/\nDisease Injuries Tested\n\n\n\n\n\n\n\n\n\n\n\n\nK4P2O7\n1\n2\n3\n4\n5\n\n\n\n\n\n2.0:0.8\n    85+++\n    92+++\n    88+++\n    93+++\n    87+++\n\n\n2.0:0.9\n    87+++\n    91+++\n    86+++\n    89+++\n    83+++\n\n\n2.0:1.0\n  94++\n  94++\n  94++\n  91++\n  82++\n\n\n 2.0:1.05\n98−\n97−\n99−\n95−\n97−\n\n\n2.0:1.1\n100− \n100− \n100− \n99−\n99−\n\n\n2.0:1.2\n100− \n100− \n98−\n99−\n100− \n\n\n2.0:1.4\n98−\n96−\n97−\n95−\n97−\n\n\n2.0:1.6\n92−\n94−\n97−\n93−\n96−\n\n\n2.0:1.8\n98−\n97−\n98−\n99−\n100− \n\n\n2.0:2.0\n98−\n96−\n98−\n96−\n97−\n\n\n2.0:2.2\n97−\n95−\n98−\n93−\n97−\n\n\n2.0:2.4\n91−\n93−\n89−\n92−\n90−",
        "TABLE 2\n\n\n\n\n\n\n\nEx.\n\n\n\n2:CuSO4/\nDisease Injuries Tested\n\n\n\n\n\n\n\n\n\n\n\n\nNa4P2O7\n1\n2\n3\n4\n5\n\n\n\n\n\n2.0:0.8\n    67+++\n    54+++\n    48+++\n    66+++\n    23+++\n\n\n2.0:0.9\n    85+++\n    60+++\n    48+++\n    78+++\n    45+++\n\n\n2.0:1.0\n  90++\n  92++\n  78++\n  87++\n  90++\n\n\n 2.0:1.05\n99−\n98−\n95−\n99−\n99−\n\n\n2.0:1.1\n99−\n100− \n100− \n97−\n99−\n\n\n2.0:1.2\n97−\n94−\n96−\n92−\n97−\n\n\n2.0:1.4\n95−\n93−\n99−\n92−\n90−\n\n\n2.0:1.6\n94−\n92−\n91−\n94−\n97−\n\n\n2.0:1.8\n95−\n98−\n92−\n97−\n94−\n\n\n2.0:2.0\n100− \n100− \n99−\n99−\n100− \n\n\n2.0:2.2\n94−\n97−\n98−\n94−\n96−\n\n\n2.0:2.4\n89−\n87−\n82−\n94−\n91−",
        "TABLE 3\n\n\n\n\n\n\n\nEx.\n\n\n\n3:CuSO4/\nDisease Injuries Tested\n\n\n\n\n\n\n\n\n\n\n\n\nNa5P3O10\n1\n2\n3\n4\n5\n\n\n\n\n\n2.5:0.8\n    78+++\n    49+++\n    50+++\n    58+++\n    46+++\n\n\n2.5:0.9\n    79+++\n    58+++\n    53+++\n    66+++\n    60+++\n\n\n2.5:1.0\n  86++\n  90++\n  78++\n  84++\n  77++\n\n\n 2.5:1.05\n98−\n99−\n97−\n96−\n98−\n\n\n2.5:1.1\n100− \n100− \n99−\n98−\n100− \n\n\n2.5:1.2\n97−\n95−\n99−\n94−\n96−\n\n\n2.5:1.5\n90−\n95−\n93−\n96−\n93−\n\n\n2.5:2.0\n94−\n96−\n93−\n92−\n96−\n\n\n2.5:2.3\n96−\n98−\n94−\n99−\n94−\n\n\n2.5:2.5\n99−\n99−\n98−\n100− \n100− \n\n\n2.5:2.7\n96−\n94−\n92−\n94−\n95−\n\n\n2.5:3.0\n89−\n86−\n90−\n85−\n80−",
        "TABLE 4\n\n\n\n\n\n\n\nEx.\n\n\n\n4:CuSO4/\nDisease Injuries Tested\n\n\n\n\n\n\n\n\n\n\n\n\nK6P4O13\n1\n2\n3\n4\n5\n\n\n\n\n\n3.0:0.8\n    66+++\n    45+++\n    64+++\n    74+++\n    44+++\n\n\n3.0:0.9\n    70+++\n    62+++\n    74+++\n    78+++\n    57+++\n\n\n3.0:1.0\n  88++\n  92++\n  87++\n  90++\n  91++\n\n\n 3.0:1.05\n94−\n100− \n98−\n99−\n96−\n\n\n3.0:1.1\n100− \n100− \n99−\n99−\n97−\n\n\n3.0:1.2\n99−\n96−\n99−\n96−\n95−\n\n\n3.0:1.5\n90−\n93−\n98−\n93−\n96−\n\n\n3.0:2.0\n89−\n90−\n93−\n95−\n99−\n\n\n3.0:2.5\n96−\n94−\n93−\n97−\n92−\n\n\n3.0:3.0\n100− \n100− \n100− \n98−\n99−\n\n\n3.0:3.2\n98−\n96−\n94−\n99−\n99−\n\n\n3.0:3.5\n90−\n88−\n90−\n86−\n80−\n\n\n\n\n\n\n\n\n\nThe symbol positioned behind each preventive value means the extent of the damage from each test solution (those appearing in the following Tables are the same as those used in the foregoing Tables also):\n\n    −: There is not observed any lesion due to phytotoxicity (no damage from each particular test solution);\n    +: There are observed a small number of lesions due to phytotoxicity;\n    ++: There are observed a fairly large number of lesions due to phytotoxicity;\n    +++: There are observed a considerable number of lesions due to phytotoxicity.\n\nConsideration of Results:",
        "Regarding the compositions of the formulation used in Example 1, severe chemical injuries were observed for the test solutions each comprising copper sulfate and potassium pyrophosphate at a molar ratio of copper sulfate to potassium pyrophosphate ranging from 2.0:0.8 to 2.0:1.0. On the other hand, there was not observed any chemical injury for the test solutions each having such a molar ratio ranging from 2.0:1.05 to 2.0:2.4. There were observed excellent disease-control effects for the test solutions each having such a molar ratio ranging from 2.0:1.05 to 2.0:2.2.",
        "Regarding the compositions of the formulation used in Example 2, severe chemical injuries were observed for the test solutions each comprising copper sulfate and sodium pyrophosphate at a molar ratio of copper sulfate to sodium pyrophosphate ranging from 2.0:0.8 to 2.0:1.0. On the other hand, there was not observed any chemical injury for the test solutions each having such a molar ratio ranging from 2.0:1.05 to 2.0:2.4. There were observed excellent disease-control effects for the test solutions each having such a molar ratio ranging from 2.0:1.05 to 2.0:2.2.",
        "Regarding the compositions of the formulation used in Example 3, severe chemical injuries were observed for the test solutions each comprising copper sulfate and sodium tripolyphosphate at a molar ratio of copper sulfate to sodium tripolyphosphate ranging from 2.5:0.8 to 2.5:1.0. On the other hand, there was not observed any chemical injury for the test solutions each having such a molar ratio ranging from 2.5:1.05 to 2.5:3.0. There were observed excellent disease-control effects for the test solutions each having such a molar ratio ranging from 2.5:1.05 to 2.5:2.7.",
        "Regarding the compositions of the formulation used in Example 4, severe chemical injuries were observed for the test solutions each comprising copper sulfate and potassium tetrapolyphosphate at a molar ratio of copper sulfate to potassium tetrapolyphosphate ranging from 3.0:0.8 to 3.0:1.0. On the other hand, there was not observed any chemical injury for the test solutions each having such a molar ratio ranging from 3.0:1.05 to 3.0:3.5. There were observed excellent disease-control effects for the test solutions each having such a molar ratio ranging from 3.0:1.05 to 3.0:3.2.",
        "Test for Disease Prevention Effects (Comparison with Z-Bordeaux Mixture and KOCIDE Bordeaux Mixture)",
        "There were prepared test solutions, or the formulations prepared in Examples 1 and 2, whose molar ratio of copper sulfate to polyphosphoric acid were 2.0:1.1 and 2.0:2.0; those prepared from Z-Bordeaux Mixture (available from TOMONOAGRICA) and KOCIDE Bordeaux Mixture (available from Shionogi & Co., Ltd.) having practical spray concentrations and copper concentrations (6 mg/100 ml) identical to those of the formulations of Examples 1 and 2 having the foregoing molar ratio. Each test solution was sprayed on the seedlings of tomato, the seedlings were then inoculated with zoospores of the causal bacteria for late blight of tomato after the air-drying of the test solution, the seedlings were kept in a moist chamber maintained at 20° C. (having a humidity of 100%), and then the number of lesions formed on the leaves due to the disease was determined after 4 days from the inoculation to thus calculate the preventive value for each test solution. The results thus obtained are summarized in the following Tables 5 and 6:",
        "TABLE 5\n\n\n\n\n\n\n\nTest Result 1: Comparison of Effects and Chemical Injuries\n\n\nObserved at the Practical Concentrations\n\n\n\n\n\n\n\n\n\n\n\nSample (Molar Ratio:\nDilution\nCu Concn.\nPreventive\nChemical\n\n\nCu/Polyphosphoric acid)\nFactor\n(mg/100 ml)\nValue (%)\nInjury\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx. 1 (2:1.1)\n×2000\n6\n100\n−\n\n\nEx. 1 (2:2.0)\n×2000\n6\n98\n−\n\n\nEx. 2 (2:1.1)\n×2000\n6\n99\n−\n\n\nEx. 2 (2:2.0)\n×2000\n6\n99\n−\n\n\nZ-Bordeaux Mixture\n ×500\n64\n99\n++\n\n\nKOCIDE Bordeaux\n×1000\n50\n100\n+++\n\n\nMixture\n\n\nFree of Any Treatment\n—\n—\n0\n−",
        "TABLE 6\n\n\n\n\n\n\n\nTest Result 2: Comparison of Effects and Chemical Injuries\n\n\nObserved at a copper concentration of 6 mg/100 ml\n\n\n\n\n\n\n\n\n\n\nSample (Molar Ratio:\nCu Concn.\nPreventive\nChemical\n\n\nCu/Polyphosphoric acid)\n(mg/100 ml)\nValue (%)\nInjury\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx. 1 (2:1.1)\n6\n99\n−\n\n\nEx. 1 (2:2.0)\n6\n98\n−\n\n\nEx. 2 (2:1.1)\n6\n100\n−\n\n\nEx. 2 (2:2.0)\n6\n99\n−\n\n\nZ-Bordeaux Mixture\n6\n28\n−\n\n\nKOCIDE Bordeaux Mixture\n6\n35\n−\n\n\nFree of Any Treatment\n−\n0\n−",
        "The data listed in Tables 5 and 6 indicate that the copper-containing formulation of the invention shows a high preventive value at a low concentration without causing any chemical damage, while Z-Bordeaux and KOCIDE Bordeaux mixtures should be used in high concentrations to achieve high preventive values and in this case, they cause chemical injuries. The data also indicate that, in the latter case, if they are used in low concentrations to prevent the occurrence of any chemical injury, they are not practical since the preventive values achieved at such low concentrations are too low.",
        "The following Table 7 shows the copper contents, dilution factors and application doses of the formulations of Examples 1 and 2, and Z-Bordeaux and KOCIDE Bordeaux mixtures; and the copper concentrations observed when the concentrations of these samples are adjusted to corresponding application doses:",
        "TABLE 7\n\n\n\n\n\nSample\nCu\n\n\n\n\n\n(Molar Ratio: Cu/\nContent\nDilution\nAppln. Dose\nCu Concn.\n\n\nPoly− phosphoric acid)\n(%)\nFactor\n(mg/100 ml)\n(mg/100 ml)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx. 1 (2:1.1)\n12\n×2000\n50\n6\n\n\nEx. 1 (2:2.0)\n12\n×2000\n50\n6\n\n\nEx. 2 (2:1.1)\n12\n×2000\n50\n6\n\n\nEx. 2 (2:2.0)\n12\n×2000\n50\n6\n\n\nZ-Bordeaux Mixture\n32\n ×500\n640\n64\n\n\nKOCIDE Bordeaux\n50\n×1000\n500\n50\n\n\nMixture",
        "Test for Chemical Injury of Agricultural Chemical Formulations with Respect to Various Kinds of Plants",
        "Test sample solutions of the present invention, and Z-Bordeaux and KOCIDE Bordeaux mixtures which had been diluted to predetermined concentrations were sprayed on seedlings of a variety of plants at copper concentrations specified in the following Table and the seedlings were kept in a moist chamber maintained at 20° C. (having a humidity of 100%). Then the degrees of chemical injuries generated on the leaves of the seedlings were compared with one another after a predetermined period of time (4 days). The results thus obtained are summarized in the following Table 8:",
        "TABLE 8\n\n\n\n\n\n\n\n\n\nCu Concn.\nDegree of Chemical Injury\n\n\n\n\n\n\n\n\n\n\n\n\nSample\n(mg/100 ml)\nTomato\nCucumber\nOrange\nLettuce\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx. 1 (2:1.1)\n6\n−\n−\n−\n−\n\n\nEx. 1 (2:2.0)\n6\n−\n−\n−\n−\n\n\nEx. 2 (2:1.1)\n6\n−\n−\n−\n−\n\n\nEx. 2 (2:2.0)\n6\n−\n−\n−\n−\n\n\nZ-Bordeaux\n64\n++\n+\n++\n+++\n\n\nMixture\n\n\nKOCIDE\n50\n++\n++\n+++\n+++\n\n\nBordeaux Mixture",
        "As a result, it was found that there was not observed any chemical injury for the copper-containing formulations of the present invention, while Z-Bordeaux and KOCIDE Bordeaux mixtures caused severe chemical injuries.",
        "Copper-containing formulations were prepared according to the mixing ratios specified in the following Table 9. In this Table, the unit of each numerical value is part by mass.",
        "TABLE 9\n\n\n\n\n\n\n\n\n\nExample No.\n\n\n\n\n\n\n\n\n\n\n\n5\n6\n7\n\n\n\n\n\n\n\n\n\n\n\nCopper Compound\n\n\n\n\n\n\n\n\n\n\nCuSO4\n36.9\n—\n33.1\n\n\nCuSO4•5H2O\n—\n34.7\n—\n\n\n\n\n\n\n\nPolyphosphoric acid salt\n\n\n\n\n\n\n\n\n\n\nNa4P2O7\n33.8\n—\n33.1\n\n\nK4P2O7\n—\n29.7\n—\n\n\n\n\n\n\n\nSurfactant\n\n\n\n\n\n\n\n\n\n\nC12~C14-Alkenylsulfonate (SOLPOL 5115)\n7.4\n—\n—\n\n\nPolyoxyethylene styryl-phenyl ether\n—\n4.9\n—\n\n\n(SOLPOL 5080)\n\n\nSodium Naphthalene-sulfonate-formalin\n—\n1.0\n0.1\n\n\ncondensate (DEMOL N)\n\n\nPropylene glycol mono-oleate (LIKEMAL P-100)\n1.0\n—\n—\n\n\n\n\n\n\n\nDispersant\n\n\n\n\n\n\n\n\n\n\nWhite carbon (NIPSEAL NS-T)\n19.7\n—\n—\n\n\nSodium benzoate\n—\n29.7\n33.1\n\n\nClay (HIRAKI BP)\n1.2\n—\n—\n\n\nKaolin\n—\n—\n0.6",
        "The abilities of the formulations prepared in Examples 5 to 7 to control late blight of tomato and downy mildew of cucumber were examined according to the method described above. The results thus obtained are summarized in the following Table 10.",
        "TABLE 10\n\n\n\n\n\n\n\n\n\nPreventive Value (%)\n\n\n\n\n\n\n\n\n\n\n\nCu Concn.\nlate blight of\ndowny mildew of\n\n\nSample\n(mg/100 ml)\ntomato\ncucumber\n\n\n\n\n\n\n\n\n\n\n\n\n\nEx. 5\n6\n100\n100\n\n\nEx. 5\n4\n88\n92\n\n\nEx. 6\n6\n98\n96\n\n\nEx. 6\n4\n81\n87\n\n\nEx. 7\n6\n97\n95\n\n\nEx. 7\n4\n83\n92\n\n\nZ-Bordeaux\n64\n100\n99\n\n\nZ-Bordeaux\n42\n72\n68\n\n\nKOCIDE Bordeaux\n50\n97\n99\n\n\nKOCIDE Bordeaux\n33\n65\n76",
        "There were sufficiently mixed 35.6% by mass of copper sulfate, 32.6% by mass of sodium pyrophosphate, 14.0% by mass of an amphoteric surfactant, 16.6% by mass of synthetic silica (white carbon) and 1.2% by mass of clay (HIRAKI BP) using a stirring machine to thus form a copper-containing formulation. In this respect, the amphoteric surfactant used was polyoctyl polyaminoethyl glycine (a product containing 60% by mass of this component and available from Toho Chemical Industry Co., Ltd. under the trade name of OVAZOLINE B).",
        "There were sufficiently mixed 35.6% by mass of copper sulfate, 32.6% by mass of sodium pyrophosphate, 14.0% by mass of an amphoteric surfactant, 16.6% by mass of synthetic silica (white carbon) and 1.2% by mass of clay (HIRAKI BP) using a stirring machine to thus form a copper-containing formulation. In this respect, an alkyl polyaminoethyl glycine hydrochloride (a product containing 50% by mass of this component and available from Sanyo Chemical Industries, Ltd. under the trade name of LEBON U) was used herein as the amphoteric surfactant.",
        "There were sufficiently mixed 35.6% by mass of copper sulfate, 32.6% by mass of sodium pyrophosphate, 30.6% by mass of synthetic silica (white carbon) and 1.2% by mass of clay (HIRAKI BP) using a stirring machine to thus form a copper-containing formulation.",
        "There were sufficiently mixed 35.6% by mass of copper sulfate, 32.6% by mass of sodium pyrophosphate, 14.0% by mass of an amphoteric surfactant, 16.6% by mass of synthetic silica (white carbon) and 1.2% by mass of clay (HIRAKI BP) using a stirring machine to thus form a copper-containing formulation. In this respect, a 2-alkyl-N-carboxymethyl-N-hydroxyethyl-imidazolium betaine (a product containing 50% by mass of this component and available from Toho Chemical Industry Co., Ltd. under the trade name of OVAZOLINE 552) was used herein as the amphoteric surfactant.",
        "There were sufficiently mixed 35.6% by mass of copper sulfate, 32.6% by mass of sodium pyrophosphate, 1.0% by mass of a nonionic surfactant, 29.6% by mass of synthetic silica (white carbon) and 1.2% by mass of clay (HIRAKI BP) using a stirring machine to thus form a copper-containing formulation. In this respect, glycerin monopalmitate was used herein as the nonionic surfactant.",
        "There were sufficiently mixed 35.6% by mass of copper sulfate, 32.6% by mass of sodium pyrophosphate, 7.1% by mass of an anionic surfactant, 23.5% by mass of synthetic silica (white carbon) and 1.2% by mass of clay (HIRAKI BP) using a stirring machine to thus form a copper-containing formulation. In this respect, sodium alkenyl sulfonate (a product available from Toho Chemical Industry Co., Ltd. under the trade name of SOLPOL 5115) was used herein as the anionic surfactant.",
        "The copper-containing formulations prepared in Examples 8 to 10 were diluted with water to a concentration of 9 mg/100 ml as expressed in terms of the amount of copper to thus form solutions of agricultural chemicals (sample solutions) and the resulting samples were inspected for the degree of progression of lesions or downy mildew of cucumber. More specifically, each of these sample solutions was sprayed on the leaves of cucumber, spores of a causal fungus (zoospores) of this disease were inoculated through the spray thereof after drying the solution and then the plant was kept in a moist chamber (maintained at a temperature of 20° C. and a humidity of 100%). Thereafter, the score of lesions generated was determined. The results thus obtained are summarized in the following Table 13. The data shown in Table 13 indicate that the formulations of Examples 8 and 9 containing amphoteric surfactants incorporated into the same are superior in the degree of progression of lesions to the formulation of Example 10 free of any amphoteric surfactant.",
        "TABLE 13\n\n\n\n\n\n\n\n\nScore of lesions\n\n\n\n\ndetermined after\n\n\n\n\n5 days from the\n\n\n\nSample\nspore-inoculation\n\n\n\n\n\n\n\n\n\nCopper-containing formulation of Ex. 8\n2, 2, 3\n\n\n\nCopper-containing formulation of Ex. 9\n1, 2, 2\n\n\n\nCopper-containing formulation of Ex. 10\n4, 4, 4\n\n\n\nFree of any treatment (control)\n5, 5, 5\n\n\n\n\n\n\n\nIn Table 13, the evaluation standards for the score of lesions are as follows:\n\n\n\n0: The area occupied by lesions is 0%;\n\n\n\n1: The area occupied by lesions is not more than 25%;\n\n\n\n2: The area occupied by lesions is more than 25% and not more than 50%;\n\n\n\n3: The area occupied by lesions is more than 50% and not more than 75%;\n\n\n\n4: The area occupied by lesions is more than 75% and less than 100%;\n\n\n\n5: The area occupied by lesions is 100% (the entire leaves are completely withered).",
        "The copper-containing formulations prepared in Examples 10 to 13 were likewise inspected for the degree of progression of lesions or downy mildew of cucumber according to the procedures identical to those used in Test Example 5. As a result, it was found that the degree of progression of lesions was most strongly inhibited by the formulation of Example 11 which comprised an amphoteric surfactant incorporated therein. The inhibition of the degree of progression of lesions was likewise observed for the formulation prepared in Example 10, 12 or 13 as compared with that observed for the control.",
        "TABLE 14\n\n\n\n\n\n\n\n\nScore of lesions\n\n\n\n\ndetermined after\n\n\n\n\n5 days from the\n\n\n\nSample\nspore-inoculation\n\n\n\n\n\n\n\n\n\nCopper-containing formulation of Ex. 10\n3, 4\n\n\n\nCopper-containing formulation of Ex. 11\n1, 1, 3\n\n\n\nCopper-containing formulation of Ex. 12\n4, 4\n\n\n\nCopper-containing formulation of Ex. 13\n3, 3, 4\n\n\n\nFree of any treatment (control)\n5, 5, 5\n\n\n\n\n\n\n\n\n\n\nIn Table 14, the evaluation standards for the score of lesions are the same as those used in Table 13.",
        "The copper-containing formulation of the present invention shows a considerably low ability to cause chemical injury, has a considerably high disease-control effect and shows such a control effect on a quite wide range of diseases."
    ],
    "citations": [
        "2657178",
        "3976594",
        "4906462",
        "640284",
        "0 752 484",
        "0 891 711",
        "2 264 717",
        "60-260506",
        "2-96508",
        "8-3009",
        "10-158101"
    ],
    "us_classification": "424606",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "01",
            "subclass": "N",
            "main_group": "59",
            "subgroup": "20"
        }
    ]
}