{
    "title": "Method and system for purging a dispensed fluid within a fluid dispensing system including a filter-free connector apparatus",
    "abstract": "A connector apparatus is provided which is configured to replace a separation module in a system for dispensing a fluid. When it is desired to purge the system of a dispensed fluid, the connector apparatus, having the same configuration of an inlet and an outlet as the separation module, replaces the separation module and a purging fluid is passed through the system.",
    "inventors": [
        "Campbell",
        "Niermeyer"
    ],
    "document_number": "07296582",
    "publication_date": "20071120",
    "assignees": [
        "Entegris, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A process for purging a fluid dispensing system of a fluid within said system, said system including means for pumping said fluid, the process comprising:",
            "components": [
                {
                    "component": "positioning a connector apparatus in a module receptor of said system, the module receptor being adapted for having a separation module positioned in the module receptor when the fluid dispensing system is dispensing fluid, the separation module for which the module receptor is adapted comprising a filter and an outer surface comprising a configuration of at least three connectors on a top end of the separation module, the at least three connectors including at least one inlet and at least one outlet for allowing the separation module to connect to a fluid connector member of said system;",
                    "subcomponents": []
                },
                {
                    "component": "connecting a first set of at least three connectors on an outer surface of the connector apparatus to a second set of at least three connectors on a quick-connect manifold that includes the fluid connector member and is in fluid communication with the means for pumping, the second set of at least three connectors of the quick-connect manifold extending through the fluid connector member and being spaced apart and parallel to one another and arranged to provide simultaneous connection and sealing of the at least three connectors on the top end of the separation module;",
                    "subcomponents": []
                },
                {
                    "component": "the connector apparatus comprising the same configuration of at least three connectors on its outer surface as the configuration of at least three connectors on the outer surface of said separation module;",
                    "subcomponents": []
                },
                {
                    "component": "said connector apparatus including a filter free fluid pathway connecting the at least three connectors of the first set of at least three connectors, the first set of at least three connectors including at least one inlet and at least one outlet;",
                    "subcomponents": []
                },
                {
                    "component": "and activating said means for pumping to pass a fluid throughout said system to purge said system.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The process of claim 1 wherein the connector apparatus comprises a body configured to be received by the module receptor of the fluid dispensing system.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The process of claim 1 wherein the connector apparatus comprises a flange that is configured to be received in a slot of the dispensing system.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The process of claim 1 wherein the fluid for purging the fluid dispensing system is the same as or different from a fluid dispensed from the system.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A process for purging a fluid dispensing system of a fluid within said system, said system including a dispenser pump for dispensing fluid from said system, and a feed pump for introducing said fluid into said system and for delivering said fluid to said dispenser pump, the process comprising:",
            "components": [
                {
                    "component": "positioning a connector apparatus in a module receptor of said system, the module receptor being adapted for having a separation module positioned in the module receptor when the fluid dispensing system is dispensing fluid, the separation module for which the module receptor is adapted comprising a filter and an outer surface comprising a configuration of at least three connectors on a top end of the separation module, the at least three connectors including at least one inlet and at least one outlet for allowing the separation module to connect to a fluid connector member of said system, the separation module being interposed between said dispenser pump and said feed pump for separating fluid delivered by said feed pump to said dispenser pump;",
                    "subcomponents": []
                },
                {
                    "component": "connecting a first set of at least three connectors on an outer surface of the connector apparatus to a second set of at least three connectors on a quick-connect manifold that includes the fluid connector member and is in fluid communication with the dispenser pump and the feed pump, the second set of at least three connectors of the quick-connect manifold extending through the fluid connector member and being spaced apart and parallel to one another and arranged to provide simultaneous connection and sealing of the at least three connectors on the top end of the separation module;",
                    "subcomponents": []
                },
                {
                    "component": "the connector apparatus comprising the same configuration of at least three connectors on its outer surface as the configuration of at least three connectors on the outer surface of said separation module; said connector apparatus including a filter free fluid pathway connecting the at least three connectors of the first set of at least three connectors, the first set of at least three connectors including at least one inlet and at least one outlet;",
                    "subcomponents": []
                },
                {
                    "component": "and activating said feed pump and said dispenser pump to pass a fluid throughout said system to purge said system.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The process of claim 5 wherein the connector apparatus comprises a body configured to be received by the module receptor of the fluid dispensing system.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The process of claim 5 wherein the connector apparatus comprises a flange that is configured to be received in a slot of the dispensing system.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The process of claim 5 wherein the fluid for purging the fluid dispensing system is the same as or different from a fluid dispensed from the system.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A process for purging a fluid dispensing system of a fluid within said system, said system including a dispenser pump for dispensing fluid from said system, and a feed pump for introducing said fluid into said system and for delivering said fluid to said dispenser pump, the process comprising:",
            "components": [
                {
                    "component": "disconnecting a separation module from a location in the fluid dispensing system, the separation module comprising a filter and an outer surface comprising a configuration of at least three connectors on a top end of the separation module, the at least three connectors including at least one inlet and at least one outlet for allowing the separation module to connect to a fluid connector member of said system, the separation module being interposed between said dispenser pump and said feed pump for separating fluid delivered by said feed pump to said dispenser pump;",
                    "subcomponents": []
                },
                {
                    "component": "positioning a connector apparatus in a module receptor of said system, the module receptor being adapted for having the separation module positioned in the module receptor when the fluid dispensing system is dispensing fluid;",
                    "subcomponents": []
                },
                {
                    "component": "connecting a first set of at least three connectors on an outer surface of the connector apparatus to a second set of at least three connectors on a quick-connect manifold that includes the fluid connector member and is in fluid communication with the feed pump and the dispenser pump, the second set of at least three connectors of the quick-connect manifold extending through the fluid connector member and being spaced apart and parallel to one another and arranged to provide simultaneous connection and sealing of the at least three connectors on the top end of the separation module;",
                    "subcomponents": []
                },
                {
                    "component": "the connector apparatus comprising a configuration of at least three connectors on its outer surface substantially similar to the configuration of at least three connectors on the outer surface of said removed separation module, said connector apparatus including a filter free fluid pathway connecting the at least three connectors of the first set of at least three connectors, the first set of at least three connectors including at least one inlet and at least one outlet; and",
                    "subcomponents": []
                },
                {
                    "component": "activating said feed pump and said dispenser pump to pass a fluid throughout said system, including through said connector apparatus, to purge said system.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The process of claim 9 wherein the fluid for purging the fluid dispensing system is the same as or different from a fluid dispensed from the system.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A process for purging a fluid dispensing system of a fluid within said system, comprising:",
            "components": [
                {
                    "component": "providing a connector apparatus that includes a body defining an internal volume that is substantially filter-free, an outer surface of the body including a first set of at least three connectors comprising at least one inlet connector and at least one outlet connector, the at least three connectors of the first set being in fluid communication through the substantially filter-free internal volume;",
                    "subcomponents": []
                },
                {
                    "component": "positioning the connector apparatus in a module receptor of said system, the module receptor being adapted for having a separation module positioned in the module receptor when the fluid dispensing system is dispensing fluid, the separation module for which the module receptor is adapted comprising a filter and an outer surface comprising a configuration of at least three connectors on a top end of the separation module, the at least three connectors including at least one inlet and at least one outlet for allowing the separation module to connect to a fluid connector member of said system;",
                    "subcomponents": []
                },
                {
                    "component": "engaging the first set of at least three connectors of the connector apparatus with a second set of at least three connectors on a quick-connect manifold that includes the fluid connector member, the second set of at least three connectors of the quick-connect manifold extending through the fluid connector member and being spaced apart and parallel to one another and arranged to provide simultaneous connection and sealing of the at least three connectors on the top end of the separation module; and",
                    "subcomponents": []
                },
                {
                    "component": "passing a purging fluid throughout the system including the connector apparatus, resulting in the fluid dispensing system being purged in a manner free of a separation module.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The process of claim 11 wherein the fluid for purging the fluid dispensing system is the same as or different from a fluid dispensed from the system.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A process for purging a fluid dispensing system of a fluid within said system, comprising:",
            "components": [
                {
                    "component": "providing a fluid dispensing system including a dispenser pump for dispensing fluid from the system, and a feed pump for introducing a fluid into the system and for delivering the fluid to the dispenser pump;",
                    "subcomponents": []
                },
                {
                    "component": "positioning a connector apparatus in a module receptor of said system, the module receptor being adapted for having a separation module positioned in the module receptor when the fluid dispensing system is dispensing fluid, the separation module for which the module receptor is adapted comprising a filter and an outer surface comprising a configuration of at least three connectors on a top end of the separation module, the at least three connectors including at least one inlet and at least one outlet for allowing the separation module to connect to a fluid connector member of said system, the separation module being interposed between said dispenser pump and said feed pump for separating fluid delivered by said feed pump to said dispenser pump;",
                    "subcomponents": []
                },
                {
                    "component": "connecting a first set of at least three connectors on an outer surface of the connector apparatus to a second set of at least three connectors on a quick-connect manifold that includes the fluid connector member and is in fluid communication with the dispenser pump and the feed pump, the second set of at least three connectors of the quick-connect manifold extending through the fluid connector member and being spaced apart and parallel to one another and arranged to provide simultaneous connection and sealing of the at least three connectors on the top end of the separation module;",
                    "subcomponents": []
                },
                {
                    "component": "the connector apparatus comprising the same configuration of at least three connectors on its outer surface as the configuration of at least three connectors on the outer surface of the separation module;",
                    "subcomponents": []
                },
                {
                    "component": "said connector apparatus including a filter free fluid pathway connecting the at least three connectors of the first set of at least three connectors, the first set of at least three connectors including at least one inlet and at least one outlet;",
                    "subcomponents": []
                },
                {
                    "component": "and activating the feed pump and the dispenser pump to pass a fluid throughout said system to purge said system.",
                    "subcomponents": []
                }
            ]
        }
    ],
    "description": [
        "This application is a Continuation of U.S. Ser. No. 10/079,360 filed Feb. 20, 2002, pending which is a divisional application of U.S. Ser. No. 09/113,837, filed Jul. 10, 1998, now U.S. Pat. No. 6,378,907 which is a continuation-in-part of application U.S. Ser. No. 08/678,795, filed Jul. 12, 1996, now U.S. Pat No. 6,068,770. This application is also related to Ser. No. 11/045,726, filed Jan. 28, 2005, entitled “Connector Apparatus and System Including Connector Apparatus”, and to U.S. Ser. No. 10/440,458, filed May 16, 2003, which is a Continuation application of U.S. Ser. No. 10/079,360, filed Feb. 20, 2002, which is a Divisional of Ser. No. 09/113,837 filed Jul. 10, 1998 (U.S. Pat. No. 6,378,907), which is a Continuation-in-Part of Ser. No. 08/678,795, filed Jul. 12, 1996 (U.S. Pat. No. 6,068,770), the entire teachings of all of which are hereby incorporated herein by reference.",
        "This invention relates to a connector apparatus for connecting elements of a fluid transfer system and to the system including the connector apparatus. Fluid separation devices having an easily replaceable and disposable fluid separation module have been used to control contamination in industrial processes for many years. Such devices are an integral part of the manufacture of many products including pharmaceuticals, food stuffs and beverages. However, nowhere is the need for effective contamination control greater than in the semiconductor fabrication industry. With circuit details in the submicron range and with further feature size reductions inevitable, the need for control of particulate, ionic, organic and other contaminants in semiconductor process fluids is essential. Also, because semiconductor devices are fabricated in clean rooms, it is important to minimize the potential of contaminating the manufacturing environment. For this reason, disposable fluid separation devices are preferable in semiconductor fabrication processes in order to minimize contamination of the process lines as well as the clean room.",
        "Examples of semiconductor process fluids which are processed at the point of use (POU) include those chemicals used in photolithographic processing (photochemicals). Photochemicals include materials such as primers, adhesion promoters, photoresists, edge bead removers, antireflective coatings, developers, dielectrics, and the like. Such chemicals are commonly dispensed onto the silicon wafer by a specialized pump and subsequently dispersed into a uniform thin film using a process called spin coating. The purity of these chemicals at the POU is essential to producing acceptable product yields.",
        "Fluid separation devices are in general of two types. In the first type, the separation element that includes a filter is a replaceable component, while the pressure vessel which houses the element, i.e., the housing, is reusable. The housing also contains appropriate fluid connections to the rest of the fluid processing system. Replacing the fluid separation element requires opening the housing, removing the separation element, installing the replacement separation element into the housing and closing the housing. There are many disadvantages to this type of fluid separation device. First, the replacement operation is time consuming, especially if access to the housing is restricted. Secondly, because the housing contains a quantity of the fluid being processed and because the fluid separation element is usually saturated with the fluid, spillage of the fluid usually occurs. In the case of hazardous fluids, spills can be a threat to the well-being of personnel in the area as well as potentially damaging to nearby equipment and facilities. Finally, the opening of the housing exposes the internal surfaces of the fluid processing system to unwanted contamination from the surrounding environment.",
        "The second type of separation device is one in which the separation element is permanently attached to the housing, which also contains appropriate fluid connections to the rest of the fluid processing system, to form an integrated module. In this case, replacement involves disconnecting the entire separation module from the fluid processing system and reconnecting a replacement module to the system. In this manner replacement is easier, exposure of the operator to hazardous chemicals is minimized, the reliability of the connection is significantly improved, and contamination of the fluid processing system by the environment is reduced. The type of separation device is referred to as a disposable module, since the whole module is removed and disposed of whenever the separation element requires replacement regardless of what connector design is employed. Disposable modules usually require that multiple connections be made sequentially, a minimum of two connections, and more typically three or four. Threaded fasteners are cumbersome and sometimes difficult to engage; factors which involve the subsequent consumption of additional time and effort. Furthermore, the module has to be held in place while the connections are being made, which makes the connection event even more difficult since it requires performing two actions at the same time (i.e., holding the module in place and attaching each connector sequentially). Finally, in those applications in which the permanent connections to the fluid processing system are not rigid, as for example, when flexible tubing is used, liquid has a tendency to be discharged as the connections disengage. All of these problems exacerbate the time and effort required to replace a disposable module, in addition to still allowing for exposure of personnel to hazardous materials, and contamination of the manufacturing environment.",
        "For these reasons, some disposable separation modules have been designed with features that allow them to be connected quickly and easily to the fluid processing system in a “quick-connect” fashion. These types of quick-connect modules provide for a set of connectors that sealingly engage with a single, simple stroke or action, to a mating set of connectors attached to a reusable substrate. Different types of mechanisms have been designed to accomplish quick-connect retention, all of which heretofore have required some form of relative motion between the male connector and its female counterpart, most commonly a twisting action.",
        "Periodically, the fluid delivery systems utilizing a disposable separation module must be flushed of the liquid composition being delivered in order to prepare the system for delivery of another liquid composition. Since the separation module contains retentate from the initially processed liquid composition, it must be replaced during the flushing procedure. Also, because a separation module is an integral part of the fluid delivery system, one must be included in the system during flushing. The separation module utilized during the flushing procedure must be replaced after flushing since it contains retentate from the initial liquid composition removed from the system during the flushing step. This procedure is undesirable since the separation module is expensive.",
        "Accordingly, it would be desirable to provide a means for flushing a liquid delivery system of processed liquid which does not require a separation module. In addition, it would be desirable to provide such a means which permits addition of a separation module to the system without otherwise changing the system.",
        "The present invention provides a connector apparatus which can be substituted for a separation module in a system for dispensing a filtered fluid composition. The connector apparatus includes fluid inlet means configured in the same pattern as the fluid inlet means and fluid outlet means of the separation module. The connector apparatus is nonworking in that it performs no function other than transferring fluid therethrough.",
        "The present invention also provides a system for purging a fluid from a fluid dispensing system which includes a feed pump, a dispensing pump and the connector apparatus of this invention.",
        "The foregoing and other objects, features and advantages of the invention will be apparent from the following more particular description of preferred embodiments of the invention, as illustrated in the accompanying drawings in which like reference characters refer to the same parts throughout the different views. The drawings are not necessarily to scale, emphasis instead being placed upon illustrating the principles of the invention.",
        "FIG. 1 is a perspective view of a fluid dispensing apparatus which includes a separation module.",
        "FIG. 2 is a perspective view of a manifold and separation module of the apparatus of FIG. 1.",
        "FIGS. 3a and 3b are perspective views of the module of FIG. 2 showing the connections of the separation module with a module receptor.",
        "FIGS. 4a, 4b, 4c and 4d show a connector apparatus of this invention.",
        "FIG. 5 illustrates a system for dispensing a filtered fluid which utilizes the connector apparatus of this invention.",
        "FIGS. 6a, 6b and 6c show a holder for the connector apparatus of this invention.",
        "A description of preferred embodiments of the invention follows.",
        "This connector apparatus of this invention is useful for purging a fluid from a fluid dispensing system which includes a pump. The fluid dispensing system can include a single pump or a plurality of pumps such as a two pump system comprising a dispensing pump and a feed pump. Such a system, when dispensing a fluid includes a separation module having a separation element which separates unwanted components of the fluid from the fluid composition being dispensed. The connector apparatus of this invention replaces a separation module having a filter means by disconnecting the separation module from fluid inlet means and fluid outlet means of the module from conduits in the system which connect to the inlet means and the outlet means. The connector apparatus of this invention has the same configuration of inlets and outlets on its outer surface as on the outer surface of the separation module it replaces so that it is compatible with the remainder of the fluid dispensing system.",
        "The present invention will be particularly described herein with reference to a two pump fluid dispensing system including a feed pump, a dispensing pump and a separation module having a particular configuration of inlet means and outlet means. However, it is to be understood that the present invention can be utilized in a fluid dispensing system having a separation module regardless of the outer surface configuration of inlet means and outlet means on the surface of the separation module. For example, the connector apparatus of this invention can be utilized to replace a filtration module including a filter and a filter housing as disclosed in U.S. Pat. Nos. 5,167,837 and 5,516,429 which are incorporated herein by reference. In addition, it is to be understood that the connector apparatus of this invention also is useful in a fluid dispensing system utilizing a single pump or more than two pumps.",
        "The connector apparatus of this invention provides the substantial advantages of avoiding the need for a separation module including a separation element, when purging a fluid dispensing system. In addition, the volume capacity of the connector apparatus can be minimized to the volume needed to transport fluid therethrough so that the purge fluid needed for the system can be substantially less than the interior volume of the separation module.",
        "An example of the application of this invention is in the point of use (POU) purification of photochemicals used in the microelectronics manufacturing industry. Photochemical dispense pumps and POU fluid separation devices are typically found in a drawer mounted beneath the spin coating apparatus. There are sometimes as many as eight pumps per drawer, severely limiting access to POU fluid separation devices which may be close-coupled to the dispense pumps to eliminate extraneous external plumbing and potential fluid contamination. Particularly suitable dispense pump and separation devices are those in which the pump and separation device form an integrated system as disclosed in U.S. Pat. No. 5,262,068 whose disclosure is incorporated by reference. User-friendly separation modules capable of being connected in a quick-connect fashion would be preferable in this application.",
        "A fluid dispensing apparatus useful with the connector apparatus of the present invention is shown in FIGS. 1, 2 and 3. FIG. 1 shows a perspective view of photochemical dispense system 1, which includes disposable separation module 2, manifold block 3, pump means housing 4 and module receptor 5. The pump means housing 4 contains a feed pump and a dispensing pump (FIG. 5). Also shown is pump controller 6 which controls the electronic and pneumatic signals directed to and from the pump. The dispense system is similar in design and operation to that disclosed in U.S. Pat. No. 5,262,069. The manifold block 3, which is attached to pump 4, is reusable and designed to matingly accept and retain module 2 as will be described in more detail below.",
        "FIG. 2 is a perspective view of disposable module 2 and a partially sectioned view of the lower portion of manifold 3, showing details of the features that make module 2 capable of connecting to manifold block 3 in a quick-connect fashion. Module 2 has three female fluid connectors 21 on the top end of the module and in fluid communication with the separation element (not shown) within housing 23. The separation element may be of the flat sheet membrane type as described in U.S. Pat. No. 5,262,068, or more preferably may be comprised of hollow fiber membranes of the type described in commonly assigned U.S. Pat. No. 5,762,789, which is incorporated herein by reference. The connectors 21 are spaced apart, parallel and exclusive to each other, so as to enable them to sealingly engage in quick-connect fashion to mating male connectors 25 on manifold block 3. Male connectors 25 are tubular extensions of the fluid passageways of pump 4, and are disposed on the lowermost portion of pump 4. Fluid tight sealing of the mating connector pairs 21 and 25 is accomplished by means of 0-rings 26 attached to each of male connectors 25. Flange 22, attached to housing 23, positions the entire module 2 and further provides the module's alignment to manifold block 3 in conjunction with module receptor 5, and as such, assists in the retention of module 2 in sealing engagement to manifold block 3. In this particular embodiment flange 22 includes projections 24 to aid in precisely locating module 2 within the module receptor 5 which is designed to accept the disposable module. The size, shape and location of connectors 21 and flange 22 on module 2 are such as to make module 2 capable of being connected into manifold block 3 in a quick-connect fashion in conjunction with module receptor 5. One of the connectors 21 comprises a fluid inlet to the housing 23. A second connector 21 comprises a fluid outlet from the housing 23. A third connector 21 comprises a vent for removing gas from the housing 23. When venting of gas is not a requirement, a valve or the like in a conduit in fluid communication with the vent connector can be utilized to close fluid flow through the vent connector.",
        "FIGS. 3a and 3b are perspective views of module receptor 5 (shown removed from the pump 4 in these views), which is attached to manifold block 3 showing module 2 positioned within receptor 5. The flange 22 mates with a pair of slots 32 in the body of receptor. The module receptor is attached to the manifold block 3 by hinges 33 which permit a limited range of substantially linear vertical movement which enables the disposable module 2 to be sealingly engaged with, and alternatively disengaged from the male connectors 25 on the manifold block. The module receptor is further attached to the pump 4 by a spring-loaded latch 34, one end of which forms a handle 34a with the opposite end thereof having a semicircular cutout 34b which interlocks with notch 35 on retainer post 36 which is affixed to the manifold block. This arrangement retains the module in sealing engagement with the pump after installation. The latch 34 is able to slide horizontally (i.e., in and out of the plane of FIG. 3b) in order to unlock from the notch on the retainer post thereby allowing the receptor 5 to pivot downwardly on hinges 33 for module replacement. When the mating connectors are disengaged, cutout 34b rests under tension against retainer post 36.",
        "The process of replacing disposable filtration module 2 is accomplished by pulling the handle 34a forward, i.e., in a direction that is substantially perpendicular to the direction of motion required for engaging the female connectors 21 to the male connectors 25. This unlocks latch 34 from retainer post 36 and permits the unhinged end of module receptor 5 to be freed from the pump 4, thereby allowing the entire module 2 to pivot downward on hinges 33 a distance sufficient to move connectors 21 on the module out of sealing engagement with mating connectors 25 on manifold block 3. With the module receptor 5 in this lowered position, module 2 may be removed from the dispense system by sliding it out of the slots 32. A replacement filtration module may then be inserted into the slots followed by pivoting module receptor 5 upward to engage connectors 21 into sealing engagement with mating connectors 25 on the manifold block. When replacement module 2 is in sealing engagement with mating connectors 25, cutout 34b automatically locks into notch 35 thereby retaining the filtration module in sealing engagement to the manifold block during fluid processing conditions.",
        "As seen from the foregoing description of the removal and installation of filtration module 2, the engagement and sealing of mating connections 21 and 25 is effected by a first substantially linear motion which is parallel to the axis defining the body of the connectors. The interlocking of the matable elements and consequent retention of the module is then accomplished without relative motion between the mating connectors by a second substantially linear motion which is perpendicular to the first motion corresponding to engagement and sealing of the connectors. Also, it is clear that the present quick-connect arrangement provides simultaneous connection and sealing of all the connectors on the top of the disposable filtration module 2. However, it is apparent that the benefits so derived apply equally even if the module receptor 5 were swung in a greater arc and even if the mating connectors were engaged somewhat sequentially so long as the engagement and retention is effected rapidly and easily enough to be considered a “quick-connect”.",
        "As shown in FIGS. 4a, 4b and 4c, the connector apparatus of this invention 40 includes a flange 22a having the same configuration as flange 22 (FIG. 2) and projections 24a having the same configurations as projections 24. Connectors 21a have the same configuration and spacing as connectors 21 (FIG. 2) and sealingly engage with male connectors 25 as described above with reference to FIG. 2.",
        "As shown in FIG. 4d, the internal volume of the connector apparatus 42 is significantly less than that of disposable separation module 2. This result is derived from the fact that connector apparatus is a nonworking apparatus and the volume therethrough can be reduced to the volume of conduits 42, 43, 44 and 45.",
        "The operation of the fluid dispensing system including the disposable filtration module 2 will be described with reference to FIG. 5. In a first step, a feed pump 50 draws a liquid into a feed chamber of pump 50 from a storage volume (not shown) through conduit 51 when inlet valve 52 is open. In a second step, isolation valve 53 and barrier valve 54 are open and inlet valve 52 is closed and pump 50 is activated to push liquid through conduit 55 into module 2. Filtered liquid is removed from module 2 through conduit 58 under the influence of pump 50. A dispenser chamber in dispense pump 60 thereby is filled with filtered liquid.",
        "In a third step, barrier valve 54 is closed and vent valve 62 is opened. The feed pump 50 is activated to push a small amount of liquid and any microbubbles therein out of module 2 through conduit 64.",
        "In a fourth step, the barrier valve 54 is closed and the purge valve 66 is opened and dispense pump 60 pushes a small amount of liquid from the dispense chamber in pump 60 and back to the inlet source 68 through conduit 70. This step ensures that the dispense fluid is free of potential microbubbles.",
        "In a fifth step, purge valve 66 is closed and isolate valve 53 is opened and the feed pump 50 and system are allowed to reach ambient pressure. At this point, the system is ready to dispense liquids.",
        "In a sixth step, the outlet valve 72 is opened and the dispenser pump 60 is activated to dispense liquid therefrom through outlet conduit 74 onto wafer 76. In this fluid dispensing process, the feed pump 50 and dispenser pump 60 can be operated independently of each other.",
        "When the dispense system is ready to be purged of the liquid composition being dispensed such as when it is desired to dispense a second liquid composition, module 2 is replaced with connector apparatus 40. The six steps described above for dispensing a liquid then are repeated with a purging liquid in order to purge the entire system of the dispense liquid. It is to be understood that any alternative sequence of steps which assures that purging liquid is passed through the entire system to assure purging of the dispense liquid can be utilized.",
        "After the system is purged, the connector apparatus of this invention is replaced with a fresh module 2 and the above-described dispersing process is repeated to purge the system of the purging fluid and to effect dispensing of a second dispense liquid composition.",
        "Referring to FIGS. 6a, 6b and 6c, a holder 80 is shown which is configured to secure connector 40 (FIG. 4a) in position to effect fluid communication with a fluid delivery system (not shown). The holder 80 includes two arms 82 pivotally connected to flange 84 at connection 86. The arms 82 are secured in position with respect to the flange 84, as shown in FIG. 6b by spring loaded arm 88 having an arm 90 which is forced into an opening 92 in flange 84 by spring 94.",
        "Release of the arm 90 from the flange 84 is effected by pulling on arm 88 which then permits the arms 82 to be pivoted about connection 86 as shown in FIG. 6c. The connector 40 then is positioned within slots 96 in each arm 82 which accommodates flange 22a (FIG. 4a) so that the connectors 21a are positioned to be in sealing fluid communication with the connectors 98 when arm 90 is locked in hole 92. Each connector 98 then can be placed in fluid communication with conduits (not shown) by means of connectors 100.",
        "While this invention has been particularly shown and described with references to preferred embodiments thereof, it will be understood by those skilled in the art that various changes in form and details may be made therein without departing from the scope of the invention encompassed by the appended claims."
    ],
    "citations": [
        "136631",
        "420209",
        "468390",
        "872174",
        "872707",
        "891718",
        "898214",
        "940334",
        "967516",
        "1070110",
        "1186068",
        "1221682",
        "1389012",
        "1786066",
        "1886398",
        "2997180",
        "3052863",
        "3107601",
        "3214195",
        "3399776",
        "3469863",
        "3485516",
        "3493115",
        "3519133",
        "3560377",
        "3628662",
        "3706184",
        "3727764",
        "3734851",
        "3802564",
        "3812659",
        "3935106",
        "3947080",
        "3950251",
        "4089549",
        "4174231",
        "4269219",
        "4283284",
        "4298358",
        "4321911",
        "4344777",
        "4404103",
        "4411783",
        "4416775",
        "4494775",
        "4498989",
        "4500426",
        "4522717",
        "4524807",
        "4529512",
        "4535997",
        "4555130",
        "4559136",
        "4568456",
        "4610781",
        "4629563",
        "4636307",
        "4654142",
        "4664420",
        "4698154",
        "4719012",
        "4735716",
        "4759571",
        "4806240",
        "4820174",
        "4846800",
        "4857189",
        "4857191",
        "4861476",
        "4870961",
        "4879032",
        "4900065",
        "4900449",
        "4904382",
        "4932987",
        "4944776",
        "4964984",
        "4966699",
        "5022986",
        "5041220",
        "5057131",
        "5066391",
        "5069780",
        "5076925",
        "5085772",
        "5096230",
        "5108598",
        "5125691",
        "5133858",
        "5139668",
        "5139669",
        "RE34050",
        "5143575",
        "5160042",
        "5160615",
        "5167814",
        "5167837",
        "5172998",
        "5178758",
        "5180490",
        "5192499",
        "5221473",
        "5230760",
        "5230812",
        "5262068",
        "5262069",
        "5316347",
        "5320752",
        "5324483",
        "5341832",
        "5342518",
        "5344194",
        "5373595",
        "5380437",
        "5383690",
        "5387339",
        "5389260",
        "5397462",
        "5397468",
        "5399263",
        "5401401",
        "5413711",
        "5417459",
        "5435915",
        "5437483",
        "5449454",
        "5453184",
        "5462675",
        "5468388",
        "5468390",
        "5474683",
        "5478119",
        "5486288",
        "5505842",
        "5507530",
        "5516429",
        "5525225",
        "5558371",
        "5601710",
        "5605624",
        "5620599",
        "5632894",
        "5651887",
        "5667679",
        "5702597",
        "5725623",
        "5744047",
        "5762787",
        "5762789",
        "5779903",
        "5782791",
        "5816621",
        "5824217",
        "5842724",
        "5842888",
        "5858224",
        "5911879",
        "5922196",
        "5925025",
        "5927759",
        "5944990",
        "5951862",
        "5984371",
        "6024229",
        "D423081",
        "6048454",
        "6059318",
        "6059797",
        "6068770",
        "6139738",
        "6142170",
        "6159366",
        "6176904",
        "6251270",
        "6290523",
        "6378907",
        "6387271",
        "6523861",
        "6533933",
        "6547284",
        "6581974",
        "6634509",
        "6635119",
        "6715643",
        "6733250",
        "6752159",
        "6840548",
        "6902671",
        "2002/0060189",
        "2002/0163187",
        "3100564",
        "35 21 536",
        "29618092",
        "197 17 054 A 1",
        "0 231 862",
        "0 269 054",
        "0390 715",
        "0 408 375",
        "0 492 627",
        "0 492 627",
        "0 535 546",
        "0 231 862",
        "0 616 826",
        "0 492 627",
        "0 815 928",
        "0 818 228",
        "0 887 100",
        "1 057 493",
        "2 633 368",
        "2 745 043",
        "344502",
        "2 137 110",
        "2 314 516",
        "56-122893",
        "57-27588",
        "61-119686",
        "62-234512",
        "7-17434",
        "3-115092",
        "417805",
        "4094705",
        "52793",
        "HEI 5-15421",
        "5-154200",
        "5-154201",
        "6-106164",
        "6-147383",
        "H6-39008",
        "6042921",
        "729003",
        "7194905",
        "7232015",
        "7110323",
        "8024856",
        "8052465",
        "10005746",
        "200077588",
        "WO93-16315",
        "WO 01/64312",
        "WO 02/22232",
        "WO 03-022388"
    ],
    "us_classification": "134 221",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "08",
            "subclass": "B",
            "main_group": "9",
            "subgroup": "00"
        }
    ]
}