{
    "title": "Information fusion with Bayes networks in computer-aided detection systems",
    "abstract": "This invention provides an information fusion method for multiple indicators of cancers detected with multiple channels. Each channel consists of specifically tuned detectors, features, classifiers and Bayes networks. The outputs of the Bayes networks are probabilities of malignancy for the detections passing the corresponding classifier.",
    "inventors": [
        "Collins",
        "Mitchell",
        "Worrell"
    ],
    "document_number": "07298877",
    "publication_date": "20071120",
    "assignees": [
        "ICad, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of detecting malignancy of a lesion, comprising the steps of:",
            "components": [
                {
                    "component": "computing evidence from each lesion based on specific type of said lesion using multiple lesion-specific channels, wherein each channel comprises a lesion-type specific tuned detector, lesion-type specific feature and lesion-type specific classifier;",
                    "subcomponents": []
                },
                {
                    "component": "providing said evidence to a lesion-type specific Bayes network; and",
                    "subcomponents": []
                },
                {
                    "component": "computing a probability of malignancy for each lesion.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 wherein said evidence comprises collocation to detected lesions, a ranking of each lesion relative to other lesions in an image, and a discriminant score associated with the lesion.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 wherein each of said probabilities is compared to a threshold.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 3 including performing a case-based-ranking, based on the probability value for each lesion, on all lesions passing the threshold, wherein a predetermined number of lesions having the highest probability value are retained.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 wherein said lesions comprise specific lesion types, said step of computing evidence comprises computing lesion-type specific evidence, and said lesion-type specific evidence is provided to lesion-type specific Bayes networks for computing lesion-type specific probabilities.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The method of claim 5 wherein each of said probabilities is compared to a lesion-type specific threshold.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 6 including determining whether two lesions of different lesion-types are collocated and, if collocated, selecting the lesion of the collocated lesions having the greater probability value.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 7 wherein said two lesions of different lesion-types comprise a mass lesion and a spiculation lesion.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The method of claim 8 including performing a case-based-ranking, based on the probability value for each lesion, on all of the lesions passing the lesion-type specific thresholds, wherein a predetermined number of lesions having the highest probability value are retained.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The method of claim 9 including limiting the number of calcification lesions retained to a first predetermined number, limiting the combined number of mass lesions and spiculation lesions retained to a second predetermined number, and displaying the remaining retained lesions.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. In a CAD system for detecting suspicious lesions, a method of selecting lesions for final display comprising the steps of:",
            "components": [
                {
                    "component": "calculating a probability of malignancy for each lesion based on specific type of said lesion using multiple lesion-specific channels, wherein each channel comprises a lesion-type specific tuned detector, lesion-type specific feature, lesion-type specific classifier and lesion-type specific Bayes network; and",
                    "subcomponents": []
                },
                {
                    "component": "using the probability of malignancy as a selection criteria affecting a final display of suspicious lesions.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The method of claim 11 wherein the probability of malignancy is computed based on evidence derived from each lesion and provided to a Bayes network.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 12 wherein said evidence comprises collocation of detected lesions, a ranking of each lesion relative to other lesions in an image, and a discriminant score associated with the lesion.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The method of claim 11 wherein the lesions are rank-ordered by probability of malignancy, and a predetermined maximum number of lesions having the highest probability value, with reference to all lesions in a case, are retained.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 14 wherein a subset of the predetermined maximum number of lesions of a specific lesion type, is retained.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The method of claim 11 wherein the lesions are rank-ordered by probability of malignancy, and a predetermined maximum number of lesions having the highest probability value, with reference to all lesions in an image, are retained.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The method of claim 16 wherein a subset of the predetermined maximum number of lesions of a specific lesion type, is retained.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. A method of detecting malignancy of a lesion, comprising the steps of:",
            "components": [
                {
                    "component": "using multiple independent lesion-type specific detectors to detect lesions, lesion-type specific features and lesion-type specific classifiers to detect lesions;",
                    "subcomponents": []
                },
                {
                    "component": "computing lesion-type specific evidence corresponding to each detected lesion;",
                    "subcomponents": []
                },
                {
                    "component": "providing said lesion-type specific evidence to lesion-type specific Bayes networks; and",
                    "subcomponents": []
                },
                {
                    "component": "computing a lesion-type specific probability value relating to malignancy for at least some of said detected lesions.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The method of claim 18 wherein the step of computing a lesion-type specific probability value for at least some of said detected lesions comprises computing said probability value for each lesion of a particular lesion-type independently of lesion-type specific evidence associated with lesions of a different lesion-type.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The method of claim 18 wherein said lesion-type specific Bayes networks independently compute probability values for calcification, mass and spiculation lesions.",
            "components": []
        }
    ],
    "description": [
        "This invention claims benefit of U.S. Provisional filing, Ser. No. 60/333,825, filed Nov. 20, 2001.",
        "1. Field of the Invention",
        "This invention pertains to methods of combining multiple types of information in computer-aided detection (CAD) systems.",
        "2. Description of the Prior Art",
        "Mammographic CAD systems have existed in research environments since the 1960's. Currently available systems find indicators of cancer in mammograms. Typical indicators are clusters of microcalcifications, masses, and spiculated masses. Each indicator may be detected with a specific processing channel. Each channel provides a set of detected regions considered as potentially cancerous. Various methods have been described for combining sets of detections from multiple channels.",
        "The issue of combining multiple detectors in a CAD system has been addressed in prior US patents. Rogers et al, in U.S. application Ser. No. 09/602,762 describe a method for combining outputs of microcalcification and density channels. Case Based Ranking (CBR) limits the total number of marks in a case by retaining only the “best” subset. Additional limits are applied to the total number of marks per image and the total number of each type of mark allowed on any one image of the case. In application Ser. No. 09/602,762, the ranking is based on a difference of discriminants score, which is proportional to the probability of cancer.",
        "Roehrig et al, in U.S. Pat. No. 6,198,838 describe a method for combining outputs of two independent channels: mass detector and spiculation detector. Each detector processes the image, detects regions of interest (ROIs), and computes sets of mass and spiculation feature vectors characterizing the ROI. The combining method taught by Roehrig consists of concatenating mass and spiculation information into a feature vector, then applying it to a classifier. ROIs passing the classifier are then displayed as final detections.",
        "In Roehrig et al, the simple concatenation of features from distinct channels has one very undesirable effect. The probability distributions of the cancer/not cancer concatenated feature are more confusable than either of the original feature vectors. This is because both spiculated and non-spiculated lesions are represented by a single feature vector consisting of mass and spiculation elements. The features specific for spiculatedness will be “noiselike” for regions of interest containing masses. Similarly, the massness features will be noiselike for regions containing spiculations. Assuming an equal number of massness and spiculatedness features, half of the features for any lesion will be noise. The end result is a reduction in classifier accuracy in a fielded system.",
        "Viewed from a different perspective, the classifier is forced to consider masses and spiculated masses as a single “cancer” category. Since feature vectors derived from independent and possibly orthogonal sources, the values of feature vectors in the “cancer” category are dispersed over a larger volume of feature space than would be required if the separate classifiers were applied for the mass and spiculated mass channels.",
        "To achieve higher classification accuracy in CAD systems, there is clearly a need for an improved method to combine lesion information.",
        "The present invention provides a means for computing a probability of malignancy for a lesion by combining multiple types of lesion information and, in particular, provides a system and method for combining information obtained from detections relating to different lesion-types to provide an output comprising a final display of suspicious lesions. Plural channels are provided for detecting and processing information specific to each lesion-type and, in the preferred embodiment, the channels correspond to calcifications, masses and spiculations. Each channel includes a tuned detector, classifier, and Bayes network wherein the outputs of the Bayes networks are probabilities of malignancy. The malignancies are rank ordered in a rule based post-processing operation to provide the final display of suspicious lesions.",
        "According to one aspect of the invention, a method of detecting malignancy of a lesion is provided, comprising the steps of: computing evidence from each lesion, providing the evidence to a Bayes network, and computing a probability of malignancy for each lesion.",
        "According to another aspect of the invention, a method for use in a CAD system for providing detections of suspicious lesions is provided, wherein the method provides for selection of lesions for final display and comprises the steps of: calculating a probability of malignancy for each lesion, and using the probability of malignancy as a selection criteria affecting a final display of suspicious lesions.",
        "According to yet another aspect of the invention, a method of detecting malignancy of a lesion is provided, comprising the steps of: using independent lesion-type specific detectors to detect lesions, computing lesion-type specific evidence corresponding to each detected lesion, providing the lesion-type specific evidence to lesion-type specific Bayes networks, and computing a lesion-type specific probability value relating to malignancy for at least some of the detected lesions.",
        "According to a further aspect of the invention, A method of enhancing image regions corresponding to spiculations comprising: providing a set of line kernels and a set of spiculation kernels, filtering a medical image with the set of line kernels to create a binary line response image and an angle orientation image, removing spurious lines from the line response image producing a pruned line image, separating lines in the pruned line image according to directions specified by the angle orientation image to produce a set of orientation specific line images, multiplying the orientation specific line images with the medical image to produce a set of intensity-weighted line images, filtering the intensity-weighted line images with the set of spiculation kernels to produce a set of spiculation response images, and storing the maximum spiculation response value at each pixel location, producing an image with enhanced spiculations.",
        "According to another aspect of the invention, a method for detecting spiculations in a medical image is provided, comprising: providing a set of line kernels and a set of spiculation kernels, filtering a medical image with the set of line kernels to create a binary line response image and an angle orientation image, removing spurious lines from the line response image producing a pruned line image, separating lines in the pruned line image according to directions specified by the angle orientation image to produce a set of orientation specific line images, multiplying the orientation specific line images with the medical image to produce a set of intensity-weighted line images, filtering the intensity-weighted line images with the set of spiculation kernels to produce a set of spiculation response images, storing the maximum spiculation response value at each pixel location, producing a spiculation image, and thresholding the spiculation image to produce image regions containing spiculations.",
        "Other objects and advantages of the invention will be apparent from the following description, the accompanying drawings and the appended claims.",
        "FIG. 1 is an overview of the invention.",
        "FIG. 2 shows a CAD system with independent channels, and information fusion by Bayes Networks and Case Based Ranking.",
        "FIG. 3 shows a system to detect spiculations.",
        "FIG. 4 is a block diagram of a line detection method.",
        "FIG. 5 illustrates line kernels.",
        "FIG. 6 is a block diagram for the method of generating orientation specific line images.",
        "FIG. 7 shows the method for removing spurious lines.",
        "FIG. 8 is a block diagram for the method of creating a spiculation image.",
        "FIG. 9 illustrates spiculation kernels.",
        "FIG. 10 is a block diagram for the spiculated region detector.",
        "FIG. 11 illustrates the architecture of the CAD system with Bayes Networks incorporated into each channel.",
        "FIG. 12 shows Bayes network topologies for the Calc, Mass, and Spiculation channels.",
        "FIG. 13 shows means and variances for Calc, Mass, and spiculation discriminant scores.",
        "FIG. 14 shows conditional probability tables of collocation for the Calc, Mass, and Spiculation channels.",
        "FIG. 15 is a flow chart for the Case Based Ranking method.",
        "The primary advantage of this invention is obtained by providing an information fusion method for multiple indicators of cancers detected with multiple channels. Each channel is lesion type specific and comprises specifically tuned detectors, features, classifiers and Bayes networks. The outputs of the Bayes networks are probabilities of malignancy for the detections passing the corresponding classifier. These probabilities are rank ordered in a rule based post-processing step to provide final CAD system outputs.",
        "FIG. 1 shows an overview of the system. Mammograms, 1000, are obtained during a radiologic exam. The output of the exam may be either a set of films or a set of digital images depending on the type of equipment used during the exam. When the mammograms are films, the CAD system, 2000, uses a film digitizer to generate digital images of each film for subsequent analysis. When the mammograms are created by a full field digital mammography (FFDM) system, the digitization step is not required and the CAD system operates directly on the digital images. The mammograms are processed by the CAD system, producing a set of output detections and associated attributes, 3000. In the prior art, as in Roehrig, such an output provides final detections. In this invention, additional attributes are associated with each detection which are then used to generate fusion information, 4000. The fusion information is input to a Bayesian Information Fusion step, 5000. In this step, probabilities of cancer, 6000, are computed for each detection. We will show that the union of the Generate Fusion Input Information and Bayesian Information Fusion steps, 4000 and 5000, with the preceding and subsequent steps is an important aspect of this invention. The detections are ranked by probabilities and cancer categories in the Case Based Ranking step, 7000. This step limits the number of detections to a maximum number per category per case, producing the final set of detections, 8000. Each element is now described in more detail.",
        "The invention applied to a CAD system is shown in FIG. 2. CAD systems typically provide separate channels for each category of cancer to be detected, as shown in the dashed box, 2000. Here we show a three channel system. The left channel detects and classifies microcalcification regions of interest (ROIs). The center channel detects and classifies mass ROIs. The right channel detects and classifies spiculation ROIs. The first two steps in each channel are to detect potential lesions and compute features for each ROI. The third step provides ROI classification within each channel. The classifiers output difference of discriminant scores for each ROI. Prior to computing context information, 4000, the number of detections per image is limited to a predetermined maximum value per category, not shown. This limiting improves the quality of subsequent context information. In a preferred embodiment, the microcalcification channel is limited to two detections per image, while the mass and spiculation channels are limited to three detections per image. The discriminant scores and other information comprise evidence input to corresponding Bayes networks, 5000, as the final step within each channel. The Bayes networks compute the probability of cancer for each ROI. The probability scores are passed to the Case Based Ranking step, 7000. Here, ROIs are rank ordered and rules applied for restricting the number of detections per case for different indicators of cancer. The output of post processing is a final set of ROIs, 8000. The final detections are displayed to assist a radiologist in the detection of cancer.",
        "The microcalcification and mass channels, the left and center channels in FIG. 2, have been described in U.S. application Ser. No. 09/602,762, filed Jun. 23, 2000, which application is assigned to the assignee of the present application and is incorporated herein by reference. Although context fusion is general and may be applied to a system with only two channels, such as mass and microcalcification, a preferred embodiment of the present application additionally includes a spiculation channel as the third indicator of cancer which is now described in further detail.",
        "An overview of the spiculation detector is shown in FIG. 3. Preprocessing, not shown here, is applied to the set of input images as described in U.S. application Ser. No. 09/602,762. The spiculation channel operates on images with approximately 175 micron pixel spacing. Line kernels of eight different orientations, 2310, are convolved with the input image, 1001, in step 2300. Lines are detected in the step 2400. Detected line images are formed at each of the eight orientations. The detected line images are then weighted by the original image intensity in step 2500.",
        "Weighting by original image intensity reduces the contribution of lines with low intensity. Using the raw intensity at any stage beyond the initial line detection is considered undesirable when striving for a robust system design. However, if the spiculation system had to rely solely on binary line images to detect spiculation it would result in many false positives detections in dim, low contrast regions. To eliminate this problem the line images are weighted by the original image intensity. In so doing, a variable level of importance is established to the line structure. The importance is directly related to the intensity of the detected lines.",
        "After weighting by original image intensity, the detected line images are then subsampled by a factor of four in each dimension, step 2600. A set of spiculation kernels, 2710, which detect regions of diametrically opposed radiating lines, are convolved with the subsampled line images in step 2700. Regions with large responses to the spiculation kernels are detected in step 2800, producing a set of spiculation ROIs, 2900. Each step in the spiculation detector is now described in more detail.",
        "An overview of the line detection algorithm is shown in FIG. 4. First, eight line kernels are convolved with the input image. The kernel orientations span 180 degrees in 22.5 degree steps. Each kernel consists of a single pixel width line at eight different orientations in a 9 by 9 pixel window, normalized to zero mean. The line kernels are shown in FIG. 5.",
        "Referring again to FIG. 4, convolving an input image, 1001, with the set of line kernels, 2401 through 2408, produces a set of eight filtered images, 2411 through 2418. Let the nth filtered image be denoted by In(x,y). Then, the line response image, L(x,y), and angle response image, A(x,y) are formed as:\n\nL(x,y)=maxn{In(x,y)}; n=1, . . . , 8  (1)\n\nA(x,y)=argmaxn{In(x,y)}; n=1, . . . , 8  (2)",
        "Equation 1 shows the value of the line response image at location (x,y) is selected as the maximum response across the eight filtered images at that location. Equation 2 shows the value of the angle response image at location (x,y) is the index of the filtered image that provided the maximum response.",
        "In step 2420 the maximum values from the set of filtered images at each (x,y) location are stored to form the line response image, 2430. In step 2440, the index of the filtered image providing the maximal response is stored, producing the angle orientation image, 2450.",
        "A local constant false alarm rate (CFAR) thresholding method is applied to detect lines from the line response image, as shown in FIG. 6. The local mean and standard deviation of the line response image, 2430, are computed in a 21 by 21 pixel neighborhood centered at pixel location (x,y) in step 2452. In step 2454, the pixel under test, L(x,y), is compared to a local threshold, in a preferred embodiment computed as the local mean plus 0.5 times the local standard deviation. If L(x,y) is greater than the threshold, location (x,y) of the local thresholded line image, 2456, is set to ‘1’, otherwise, location (x,y) is set to ‘0’.",
        "The local threshold line image may have unwanted lines detected at areas in the original image with high intensity or contrast, such as along the chest wall or the skin-air line. These types of spurious lines are removed in step, 2460, shown in FIG. 7.",
        "The line removal algorithm requires as inputs the breast mask, computed in a pre-processing step, the line response image, 2430, and the local threshold line image, 2456. The breast mask, a binary image with values of ‘1’ corresponding to regions of breast tissue and ‘0’ elsewhere, is eroded by N=31 pixels, in step 2642. Erosion produces a smaller, eroded breast mask, 2464, free from the artifacts that we are trying to remove. The global mean and standard deviation in the line response image is calculated from the area of the eroded breast mask in step 2465. The spurious lines are then detected and removed by determining the lines that are statistical outliers. A global threshold is computed, in a preferred embodiment, as\n\nT=global mean+3.5*global standard deviation\n\nand applied in step 2466. For pixels (x,y) in the line response image greater than the threshold T, the remove line mask image, 2467, at location (x,y) equals ‘1’. Otherwise location (x,y) of the remove line mask image equals ‘0’. In step 2468, the remove line image mask is applied to the local threshold line image, 2456. Pixels in the local threshold line image are cleared, that is set to ‘0’, at pixel locations for which the remove line mask image equals ‘1’. This step effectively removes spurious lines detected due to the chest wall and the skin-air line, producing a pruned line image, 2470.",
        "Referring again, to FIG. 6, the final step of the line detection method is to separate the lines by orientation, 2480. This is accomplished by associating each ‘on’ pixel in the pruned line image 2470 to an orientation using the angle orientation image, 2450. This step produces eight orientation specific line images, 2490, for subsequent use in the spiculation detector.",
        "A block diagram of the spiculation detection method is shown in FIG. 8.",
        "The role of the spiculation detector is to identify regions exhibiting diametrically opposed radiating line structure. The inputs to the spiculation detection method are the set of spiculation kernels, 2710 and the set of orientation specific line images, 2490. In a preferred embodiment, there are four sizes of spiculation kernels oriented at eight angles.",
        "Each orientation specific line image is convolved with an associated orientation specific spiculation kernel of specified edge length in step 2700. The response is accumulated across the range of orientations, step 2810. In this embodiment, four spiculation response images are created, one for each speculation kernel size. The set of spiculation response images are shown in box 2815. In step 2820, a spiculation image, 2825, is created by keeping the maximum response from the set of spiculation response images at each (x,y) pixel location. In step 2830, the index of the spiculation kernel providing the maximum response of step 2820 is stored, producing the winning kernel image, 2835.",
        "Referring to FIG. 9, each spiculation kernel consists of a disc with wedges at a specific orientation, corresponding to a line kernel orientation. In the hashed regions outside the disc, the kernel has zero contribution, the white wedges denote a constant positive contribution, and the wavy wedges denote a constant negative contribution. Each of the kernels are zero mean. The positive wedges span 45 degrees, and are oriented from 0 to 180 degrees in steps of 22.5 degrees. To detect a range of sizes, four sizes of spiculation kernels are used. The spiculation kernels are square windows with edge lengths, L, of 15, 25, 35, and 45 pixels.",
        "Given the spiculation image 2825, detections must be created. A block diagram of the method is given in FIG. 10. The region of interest (ROI) detector for the spiculation system is a global CFAR. The global mean, Gm, and standard deviation Gsd, are calculated over the breast tissue area of the spiculation response image in step 2840. If the spiculation response for a given pixel is greater than Gm+n1*Gsd, then the pixel is retained as part of an ROI. In a preferred embodiment, n1=4.5. Connected component analysis, step 2850, groups pixels satisfying the threshold into a set of distinct objects where an object is a set of adjacent pixels (4 or 8 connected), producing a set of binary detection masks, 2855. The binary detection masks indicate the location and extent of detections in the spiculation image. The detection masks are rectangular and bound each object from the connected component analysis. Pixels in the mask corresponding to image locations exceeding the threshold of step 2845 are set to ‘1’.",
        "The spiculation image is re-thresholded in step 2860. A second threshold is computed as Gm+n2*Gsd with n2=3.0. Connected component analysis of the re-thresholded image provides a second set of detections. Only those re-thresholded detections containing an object from the first thresholding are retained.",
        "The outputs are bounding boxes, 2870, and detection maps, 2880, for the re-thresholded objects. A detection map is a binary mask with ‘1’s indicating pixel locations corresponding to the re-thresholded object. The bounding box is specified as the row and column coordinates of the upper left and lower right corners of a rectangle sized to circumscribe the object.",
        "FIG. 11 shows how Bayes networks are used in this invention. The individual channels, 2010, 2020, and 2030, detect specific types of lesions. Features are computed and applied to corresponding classifiers, producing discriminant scores. The discriminant scores and other information are used as evidence, 4010, 4020, and 4030, for the Bayes networks, 5100, 5200, and 5300, within each channel. The Bayes networks compute probabilities of cancer given the evidence, 6100, 6200, and 6300. These probabilities are provided to a Case Based Ranking step, 7000, to produce final detections, 8000.",
        "Many different possible types of information are potentially useful as evidence to Bayes networks. In a preferred embodiment, shown in FIG. 11, steps 4010, 4020, and 4030 show two basic types of evidence: normalized difference of discriminants, and collocation indicators. Each of these are now described. Normalized differences of discriminants are computed as follows. First, classifiers are trained in each channel as described in application Ser. No. 09/602,762, producing two discriminant functions and a threshold value for each indicator of cancer. Within each channel, the true positive (TP) discriminant corresponds to the classifier representing that channel's category and the false positive (FP) discriminant to the non-TP categories. Discriminant scores are equivalent to distances from prototypical examples. For example, if in the calc channel a detection produces a small TP discriminant and a large FP discriminant, the detection is more likely to be a calc than not. Within each channel, the normalized difference is computed by first subtracting the TP from the FP discriminant. Then, the threshold value is subtracted from the difference of discriminants score and the result raised to a power transform value. In the calc and mass channel, the power transform value equals 0.35; in the spiculation channel, the power transform value is 0.25.",
        "Collocation indicators are binary units of evidence. A collocation indicator is set to ‘1’ if a detection in one channel overlaps a detection in another channel.",
        "The specific evidence used in the Bayes networks of each channel is now described.",
        "In the calc channel, the normalized difference of discriminants and a collocation indicator are input to the Calc Bayes network. The collocation indicator is ‘1’ for calc detections overlapping either a mass or spiculation detection. The topology of the Mass Bayes Network is shown in FIG. 12(a).",
        "In the mass channel, the normalized difference of discriminants and two collocation indicators are input to the Mass Bayes network. The first collocation indicator is ‘1’ for mass detections overlapping a microcalcification detection. The second collocation indicator is ‘1’ for mass detections overlapping a spiculation detection. The topology of the Mass Bayes Network is shown in FIG. 12(b).",
        "In the spiculation channel, the normalized difference of discriminants and two collocation indicators are input to the Spiculation Bayes network. The first collocation indicator is ‘1’ for spiculation detections overlapping a microcalcification detection. The second collocation indicator is ‘1’ for spiculation detections overlapping a mass detection. The topology of the Spiculation Bayes Network is shown in FIG. 12(c).",
        "The evidence for each ROI is supplied to the Bayes Network, and the probability of cancer is calculated for each ROI. The probability calculation requires conditional probability distributions or functions to be estimated from a set of training data. That is, the evidence is tabulated for detections of known “cancer” or “not cancer” categories. In a preferred embodiment, let the conditional distributions resulting from training data be as shown in FIGS. 13 and 14. The conditional distributions of the normalized difference of discriminants is assumed to be Gaussian, and therefore specified by mean and variance. FIG. 13 shows the mean and standard variance values for the three channels. The remaining evidence is discrete, and represented in conditional probability tables. FIG. 14 shows the conditional probability tables for the collocation evidence. Collocation is defined as the centroid of the first detection type being located inside the second detection type.",
        "When computing the probability of cancer for a lesion in an input image, the lesion's particular values of evidence are used to obtain conditional probability values from FIGS. 13 and 14. The probabilities of not cancer and cancer (i=0, 1) after evidence is considered, P(Ci|e1, e2, . . . , en), is given by",
        "Pr\n          ⁡\n          \n            (\n            \n              \n                \n                  C\n                  i\n                \n                |\n                \n                  e\n                  1\n                \n              \n              ,\n              \n                e\n                2\n              \n              ,\n              …\n              ⁢\n              \n                \n              \n              ,\n              \n                e\n                n\n              \n            \n            )\n          \n        \n        =\n        \n          \n            \n              p\n              ⁡\n              \n                (\n                \n                  \n                    e\n                    1\n                  \n                  |\n                  \n                    C\n                    i\n                  \n                \n                )\n              \n            \n            ⁢\n            \n              p\n              ⁡\n              \n                (\n                \n                  \n                    e\n                    2\n                  \n                  |\n                  \n                    C\n                    i\n                  \n                \n                )\n              \n            \n            ⁢\n            \n              \n            \n            ⁢\n            …\n            ⁢\n            \n              \n            \n            ⁢\n            \n              p\n              ⁡\n              \n                (\n                \n                  \n                    e\n                    n\n                  \n                  |\n                  \n                    C\n                    i\n                  \n                \n                )\n              \n            \n            ⁢\n            \n              Pr\n              ⁡\n              \n                (\n                \n                  C\n                  i\n                \n                )\n              \n            \n          \n          \n            \n              ∑\n              \n                j\n                =\n                0\n              \n              1\n            \n            ⁢\n            \n              \n                p\n                ⁡\n                \n                  (\n                  \n                    \n                      e\n                      1\n                    \n                    |\n                    \n                      C\n                      j\n                    \n                  \n                  )\n                \n              \n              ⁢\n              \n                p\n                ⁡\n                \n                  (\n                  \n                    \n                      e\n                      2\n                    \n                    |\n                    \n                      C\n                      j\n                    \n                  \n                  )\n                \n              \n              ⁢\n              \n                \n              \n              ⁢\n              …\n              ⁢\n              \n                \n              \n              ⁢\n              \n                p\n                ⁡\n                \n                  (\n                  \n                    \n                      e\n                      n\n                    \n                    |\n                    \n                      C\n                      j\n                    \n                  \n                  )\n                \n              \n              ⁢\n              \n                Pr\n                ⁡\n                \n                  (\n                  \n                    C\n                    j\n                  \n                  )\n                \n              \n            \n          \n        \n      \n    \n    \n      \n        (\n        3\n        )\n      \n    \n  \n\n\n\n\nwhere p(ek|Ci) is the conditional probability value of the kth element of evidence given the ith cancer category and is obtained from conditional distribution tables. The calculations will be demonstrated for the calc Bayes network. The mass and spiculation calculations are accomplished in the same fashion.",
        "The Calc Bayes Network, 5100, computes the probabilities of “not cancer” and “cancer” given Calc Evidence, 6100. These probabilities are computed as",
        "Pr\n          ⁡\n          \n            (\n            \n              \n                \n                  C\n                  i\n                \n                |\n                \n                  e\n                  1\n                \n              \n              ,\n              \n                e\n                2\n              \n            \n            )\n          \n        \n        =\n        \n          \n            \n              p\n              ⁡\n              \n                (\n                \n                  \n                    e\n                    1\n                  \n                  |\n                  \n                    C\n                    i\n                  \n                \n                )\n              \n            \n            ⁢\n            \n              p\n              ⁡\n              \n                (\n                \n                  \n                    e\n                    2\n                  \n                  |\n                  \n                    C\n                    i\n                  \n                \n                )\n              \n            \n            ⁢\n            \n              Pr\n              ⁡\n              \n                (\n                \n                  C\n                  i\n                \n                )\n              \n            \n          \n          \n            \n              ∑\n              \n                j\n                =\n                0\n              \n              1\n            \n            ⁢\n            \n              \n                p\n                ⁡\n                \n                  (\n                  \n                    \n                      e\n                      1\n                    \n                    |\n                    \n                      C\n                      j\n                    \n                  \n                  )\n                \n              \n              ⁢\n              \n                p\n                ⁡\n                \n                  (\n                  \n                    \n                      e\n                      2\n                    \n                    |\n                    \n                      C\n                      j\n                    \n                  \n                  )\n                \n              \n              ⁢\n              \n                Pr\n                ⁡\n                \n                  (\n                  \n                    C\n                    j\n                  \n                  )\n                \n              \n            \n          \n        \n      \n    \n    \n      \n        (\n        4\n        )\n      \n    \n  \n\n\n\n\nwhere Pr(C0) and Pr(C1) are probabilities of “not cancer” and “cancer”, assumed here to both equal 0.5. Assume the evidence for a calc detection are as follows: the calc detection is not collocated with a mass or spiculation detection and the calc classifier produces a discriminant value of 1.75. Thus, the first evidence value is ‘0’, and the conditional probabilities of “not cancer” and “cancer” are taken from Table 14(c) as p(e1=0|C0)=0.0948 and p(e1=0|C1)=0.1662. To obtain p(e2=1.75|C0), use the means and variances for the calc discriminant in Table 13(a). Evaluating the Gaussian probability density function with mean of 1.4661 and variance of 0.2282 at 1.75 gives",
        "p\n    ⁡\n    \n      (\n      \n        \n          e\n          2\n        \n        =\n        \n          1.75\n          |\n          \n            C\n            0\n          \n        \n      \n      )\n    \n  \n  =\n  \n    \n      \n        1\n        \n          \n            2\n            ⁢\n            \n              \n            \n            ⁢\n            \n              π\n              ⁡\n              \n                (\n                0.2282\n                )\n              \n            \n          \n        \n      \n      ⁢\n      \n        exp\n        (\n        \n          \n            \n              -\n              1\n            \n            2\n          \n          ⁢\n          \n            \n              \n                (\n                \n                  1.75\n                  -\n                  1.4661\n                \n                )\n              \n              2\n            \n            0.2282\n          \n        \n        )\n      \n    \n    =\n    0.6999\n  \n\n\n\n\nand\n\np(e2=1.75|C1)=0.5219.",
        "Using the values above, the conditional probabilities of “not cancer” and “cancer” given the particular evidence are computed according to Equation 4:",
        "Pr\n      ⁡\n      \n        (\n        \n          \n            \n              \n                C\n                0\n              \n              |\n              \n                e\n                1\n              \n            \n            =\n            0\n          \n          ,\n          \n            \n              e\n              2\n            \n            =\n            1.75\n          \n        \n        )\n      \n    \n    =\n    \n      \n        \n          0.0948\n          ·\n          0.6999\n          ·\n          0.5\n        \n        \n          \n            0.0948\n            ·\n            0.6999\n            ·\n            0.5\n          \n          +\n          \n            0.1662\n            ·\n            0.5219\n            ·\n            0.5\n          \n        \n      \n      =\n      0.8844\n    \n  \n\n\n\n\n  \n    \n      Pr\n      ⁡\n      \n        (\n        \n          \n            \n              \n                C\n                1\n              \n              |\n              \n                e\n                1\n              \n            \n            =\n            0\n          \n          ,\n          \n            \n              e\n              2\n            \n            =\n            1.75\n          \n        \n        )\n      \n    \n    =\n    \n      \n        \n          0.1662\n          ·\n          0.5219\n          ·\n          0.5\n        \n        \n          \n            0.0948\n            ·\n            0.6999\n            ·\n            0.5\n          \n          +\n          \n            0.1662\n            ·\n            0.5219\n            ·\n            0.5\n          \n        \n      \n      =\n      0.1156",
        "The calculations of both “not cancer” and “cancer” probabilities are shown here for completeness. However, only the probability of cancer is used in subsequent processing. Mass and spiculation probabilities are computed in the same fashion. The Bayes probabilities for each lesion from each channel are provided to the Case Based Ranking step, 7000.",
        "This section describes the context processing flow, ROI probability thresholding and case-based rank ordering. FIG. 15 shows an overall block diagram of the post-processing system. The processing is performed on each image of the case and surviving ROIs accumulate across the images in the case. Steps above the Image/Case line are performed on each image. These steps provide a set of case values for processing below the Image/Case line. The operation of the context and case processing section is now described.",
        "Once the probability of cancer is calculated using the Bayesian network, the detections within an image are analyzed separately for each detection type. First, the probability of cancer for each ROI is compared to a predetermined channel-specific threshold. All ROIs with “cancer” probabilities less than the threshold are removed. ROIs with “cancer” probabilities greater than a threshold are retained for subsequent processing. In a preferred embodiment, the thresholds are as shown in Table 1.",
        "TABLE 1\n\n\n\n\n\n\n\nBayes Thresholds.\n\n\n\n\n\n\n\n\n\n\nChannel\nThreshold\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCalc\n0.3\n\n\n\nMass\n0.29\n\n\n\nSpic\n0.44",
        "In the Mass and Spiculation channels, detections with probabilities greater than corresponding thresholds are retained. If the detections are collocated, the detection with the greater Bayes probability is retained. Otherwise, both are retained. Collocation is determined by computing the centroid of both ROIs. If the centroid of a first ROI is within the second ROI, collocation is declared. After this point, mass and spiculation ROIs are considered to be one type of detection, referred to as a “density” detection.",
        "All remaining ROIs are then jointly ranked by Bayes probabilities, largest to smallest, across the case in step 7100. If more than a predetermined maximum number, CR, of ROIs remain, only the first CR ranked ROIs are retained, step 7200. Additional restrictions are then applied to the number of calc and density ROIs in the case. Only the CC most probable calc detections are retained in step 7300. Similarly, only the CD most probable density ROIs are retained in step 7400. Recall, density ROIs are obtained from the combined list of mass and spiculation ROIs. The surviving ROIs are the final detections, and are displayed in step 8000.",
        "In a preferred embodiment, the maximum rank values are as shown in Table 2. The values in Table 2 are based on four image cases. If the actual number of images in a case does not equal four, rank limits may be recomputed.",
        "TABLE 2\n\n\n\n\n\n\n\nMaximum rank values in four image cases.\n\n\n\n\n\n\n\n\n\n\nCase Rank\nCase Rank\n\n\n\nParameter\nLimit\n\n\n\n\n\n\n\nCase\n10\n\n\n\nCalc\n10\n\n\n\nMass\n 5",
        "In a preferred embodiment, when only one image is in the case, limit the total number of marks to two; the calc and mass case rank limits also equal two. When the case consists of 2, 3, or four images, the rank limits of Table 2 apply. When the case consists of more than four images, the rank limits are recomputed as:\n\nCR=round(10*NumImages/4)\n\nCC=round(10*NumImages/4)\n\nCM=round(5*NumImages/4)\n\nwhere NumImages is the number of images in a case, and round( ) denotes rounding to the nearest integer.",
        "The final marks that may appear on an output are those passing both the probability thresholding and the case rank ordering from the context images.",
        "Although the present invention has been described in terms of specific embodiments which are set forth in detail, it should be understood that this is by illustration only and that the present invention is not necessarily limited thereto, since alternative embodiments not described in detail herein will become apparent to those skilled in the art in view of the above description, the attached drawings and the appended claims. Accordingly, modifications are contemplated which can be made without departing from either the spirit or the scope of the present invention."
    ],
    "citations": [
        "5260871",
        "5627907",
        "5661820",
        "5696884",
        "5704018",
        "5799100",
        "5802256",
        "5815591",
        "5999639",
        "6056690",
        "6075879",
        "6115488",
        "6138045",
        "6198838",
        "6205236",
        "6404908",
        "6529888",
        "6601055",
        "6738499",
        "6801645",
        "6810391",
        "7024399",
        "2003/0104499",
        "2003/0190602",
        "2003/0199685",
        "2006/0171573"
    ],
    "us_classification": "382128",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "06",
            "subclass": "K",
            "main_group": "9",
            "subgroup": "00"
        }
    ]
}