{
    "title": "Conductive terminal and the electrical connector using the conductive terminal",
    "abstract": "A conductive terminal and the electrical connector using the conductive terminal, the conductive terminal is received in a terminal channel defined in an insulative housing of the electrical connector which can transmit signal between an electronic component and a circuit board. The conductive terminal has a first wall, a second wall connecting with the first wall in a certain angle and a third wall connecting with the second wall in a certain angle and opposite to the first wall. The conductive terminal forms a mounting portion connecting with the solder ball. The mounting portion comprises a horizontal portion extending and bending from end of the first wall toward the third wall, and a vertical portion of the third wall and corresponding to the horizontal portion in a certain angle. The horizontal portion and the vertical portion adhere to the solder ball in two different directions so as to steadily locate the solder ball.",
    "inventors": [
        "Hao"
    ],
    "document_number": "07297007",
    "publication_date": "20071120",
    "assignees": [
        "Molex Incorporated"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A conductive terminal capable of being received in a terminal channel defined in an insulative housing and between an electronic component and a circuit board, via a solder ball, comprising:",
            "components": [
                {
                    "component": "at least one wall having first and second opposite ends;",
                    "subcomponents": []
                },
                {
                    "component": "a mounting portion electrically connecting with the circuit board via the solder ball, the mounting portion including a horizontal portion extending from said first end of said at least one wall, and a vertical portion extending from said first end of said at least one wall, the horizontal portion and the vertical portion contacting the solder ball while leaving a majority of the solder ball which is directly adjacent to the horizontal portion exposed to view by a user; and",
                    "subcomponents": []
                },
                {
                    "component": "a contact portion electrically connecting with the electronic component.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The conductive terminal of claim 1 in which the horizontal portion defines a recess in the surface of connecting with the solder ball so as to receive the solder ball.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The conductive terminal of claim 1 in which a gap is defined between the vertical portion and a side face of the horizontal portion near the vertical portion and when the solder ball melts, tin flows into the gap.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The conductive terminal of claim 1 , wherein the contact portion comprises a first spring arm and a second spring arm formed on said second end of said at least one wall, the first spring arm and the second spring arm form a spring receiving structure to connect with the electrical component.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The conductive terminal of claim 1 , wherein a handle is formed on said second end of said at least one wall.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. An electrical connector for connecting between an electronic component and a circuit board via a plurality of solder balls soldering onto the circuit bard, comprising:",
            "components": [
                {
                    "component": "an insulative housing forming a mounting surface adjacent to the circuit board and a receiving surface for supporting the electronic component, the insulative housing defining a plurality of terminal channels extending through the mounting surface and the receiving surface; and",
                    "subcomponents": []
                },
                {
                    "component": "a plurality of conductive terminals respectively received in the corresponding terminal channels, the conductive terminal having at least one wall having first and second opposite ends, a horizontal portion extending from said first end of said at least one wall, and a vertical portion extending from said first end of said at least one wall, the horizontal portion and the vertical portion forming a mounting portion and contacting the solder ball while leaving a majority of the solder ball which is directly adjacent to the horizontal portion exposed to view by a user.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The electrical connector of claim 6 in which the horizontal portion of the conductive terminal defines a recess in the surface of connecting with the solder ball so as to receive the solder ball.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The electrical connector of claim 6 in which the horizontal portion and the mounting surface of the insulative housing are approximately in a same plane, and the vertical portion is extending out of the mounting surface.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The electrical connector of claim 6 in which a gap is defined between the vertical portion and a side face of the horizontal portion near the vertical portion, and tin of the melting solder ball flows into the gap.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The electrical connector of claim 6 , wherein the conductive terminal comprises a first spring arm and a second spring arm formed on said second end of said at least one wall, and the first spring arm and the second spring arm are adjacent to form a spring receiving structure.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The electrical connector of claim 6 , wherein a handle is formed on said second end of said at least one wall adjacent to the receiving surface.",
            "components": []
        }
    ],
    "description": [
        "The present invention generally relates to a conductive terminal and, more particularly, to a conductive terminal used in an electrical connector which can transit signals between an electronic component and a circuit board via a solder ball connected with the circuit board.",
        "Referring to FIG. 1 to 3, as disclosed in T.W. patent application No. 087216147, publication No. 392975, an electrical connector 1 is a zero insertion force (“ZIF”) electrical connector for electrically interconnecting a central processing unit (“CPU”) and a mainboard used in computer device. The electrical connector 1 comprises an insulative housing 10 and a plurality of conductive terminals 2. Each of the conductive terminals 2 electrically connects with the circuit board 30 through surface mounting technology (“SMT”) by pre-setting a solder ball 23 onto an end thereof.",
        "The insulative housing 10 of the electrical connector 1 has a mounting surface 12 on the bottom surface thereof which is positioned proximate to the circuit board 30 and a receiving surface 11 on the top surface thereof for supporting the electronic component. The insulative housing 10 also defines a plurality of through holes 13 extending between the mounting surface 12 and the receiving surface 11.",
        "Each of the conductive terminals 2 respectively received in the corresponding through holes 13 forms a contact portion 20 extending toward the receiving surface 11 and an end portion 21 opposite extending to the mounting surface 12. The end portion 21 has a bottom surface 22 for soldering with the corresponding solder ball 23.",
        "To improve the success rate of pre-setting the solder ball 23 onto the end portion 21 of the conductive terminals 2, the end portion 21 forms a disk-shape plane approximately 90 degrees bending to the contact portion 20 so that the end portion 21 and the mounting surface 12 of the insulative housing 10 are approximately located in the same plane. The plane disk-shape end portion 21 provides a larger area of pre-setting the solder ball 23 so as to steadily pre-set the solder ball 23. In addition, a plurality of protrusions 25 is integrity extending from the side of the end portion 21 for preventing the solder ball 23 dropping from the bottom surface 22 of the end portion 21.",
        "To applying the SMT of pre-setting the solder ball 23, one end of the conductive terminal 2 must have a structure of easily locating and connecting the solder ball 23. The above method is only one of the resolving schemes with which the end portion of the conductive terminal 2 has different structures to locate and connect the solder ball 23. The present invention provides an improved conductive terminal to locate and connect the solder ball 23.",
        "An object of the present invention is to provide a conductive terminal that easily locates a solder ball and an electrical connector using the conductive terminals.",
        "Another object of the present invention is to provide a conductive terminal enhancing steadiness of soldering with a solder ball.",
        "The conductive terminals of the present invention are received in a plurality of terminal channels of an insulative housing of the electrical connector which can transmit signal between an electronic component and a circuit board. The conductive terminal has a first wall, a second wall connecting with the first wall in a certain angle and a third wall connecting with the second wall in a certain angle and opposite to the first wall. The conductive terminal forms a contact portion electrically connecting with the electronic component and a mounting portion electrically connecting with the circuit board via the solder ball. The mounting portion comprises a horizontal portion extending and bending from one end of the first wall toward the third wall, and an vertical portion on the third wall and corresponding to the horizontal portion in a certain angle. The horizontal portion and the vertical portion adhere to the solder ball in two different directions so as to steadily locate the solder ball.",
        "A gap is defined between the vertical portion and a side face of the horizontal portion near the vertical portion. When the solder ball melts, tin flows into the gap so as to enhance steadiness of soldering between the solder ball and the mounting portion.",
        "Other objects, features and advantages of the invention will be apparent from the following detailed description taken in connection with the accompanying drawings.",
        "The features of this invention which are believed to be novel are set forth with particularity in the appended claims. The invention, together with its objects and the advantages thereof, may be best understood by reference to the following description taken in conjunction with the accompanying drawings, in which like reference numerals identify like elements in the figures and in which:",
        "FIG. 1 is a partial sectional view illustrating a conventional electrical connector;",
        "FIG. 2 is a side partial sectional view illustrating of FIG. 1;",
        "FIG. 3 is a perspective view of a conductive terminal of the conventional electrical connector of FIG. 1;",
        "FIG. 4 is a perspective view of a conductive terminal inserting into an insulative housing of the present invention from under the insulative housing;",
        "FIG. 5 is a perspective-assembled view of FIG. 4 illustrating a solder ball located in a mounting portion of the conductive terminal of the present invention;",
        "FIG. 6 is a perspective view of a conductive terminal inserting into an insulative housing of the present invention from the above of the insulative housing; and",
        "FIG. 7 is a side view of the solder ball melting and connecting with the conductive terminal of the present invention.",
        "While the invention may be susceptible to embodiment in different forms, there is shown in the drawings, and herein will be described in detail, a specific embodiment with the understanding that the present disclosure is to be considered an exemplification of the principles of the invention, and is not intended to limit the invention to that as illustrated and described herein.",
        "Referring now to FIG. 4 and FIG. 5, a conductive terminal 4 of the present invention used in an electrical connector is similar with the prior art and connects between an electronic component (not shown) and a circuit board (not shown). The conductive terminal 4 pre-sets a solder ball 6 onto an end thereof.",
        "The electrical connector comprises an insulative housing 5 and a plurality of conductive terminals 4.",
        "The insulative housing 5 has a mounting surface 51 which is positioned proximate to the circuit board (such as motherboard of a computer) and a receiving surface 52 for supporting the electronic component (such as central processing unit, CPU). The insulative housing 5 defines a plurality of terminal channels 53 extending through the mounting surface 51 and the receiving surface 52. To easily illuminate, it is drawn in the FIGS. that the insulative housing 5 has a single terminal channel 53.",
        "Each conductive terminal 4 is respectively received in the corresponding terminal channels 53. The conductive terminal 4 has a first wall 41, a second wall 42 connecting with one side of the first wall 41 in an approximately 90 degrees angle and a third wall 43 connecting with the other side of the second wall 42 in an approximately 90 degrees angle and opposite to the first wall 41 in some distance. The connecting corner of the first wall 41 and the second wall 42 defines a plurality of hollows 44 so as to make the connecting corner of the first wall 41 and the second wall 42 have lower intensity and the first wall 41 easily bend along the hollows 44. Similarly, the connecting corner of the third wall 43 and the second wall 42 defines a plurality of hollows 44 so as to make the third wall 43 easily bend along the hollows 44 to the second wall 42. When the conductive terminal 4 is respectively received in the corresponding terminal channel 53, one end of the conductive terminal 4 adjacent to the mounting surface 51 forms a mounting portion 401 and the opposite end to the mounting portion 401 of the conductive terminal 4 adjacent to the receiving surface 52 forms a contact portion 402.",
        "The mounting portion 401 comprises a horizontal portion 45 extending and bending in an approximately 90 degrees from one end of the first wall 41 adjacent to the mounting surface 51 toward the third wall 43, and an vertical portion 46 extending from the third wall 43 and corresponding to the horizontal portion 45 in an approximately 90 degrees angle. Referring to FIG. 5, the horizontal portion 45 and the mounting surface 51 of the insulative housing 5 are approximately in a same plane. And the vertical portion 46 is extending out of the mounting surface 51 and forms a L-shaped structure with the horizontal portion 45 to locate the solder ball 6.",
        "The contact portion 402 comprises a first spring arm 47 formed on one side of the first wall 41 adjacent to the receiving surface 52 and a second spring arm 48 formed on one side of the second wall 42 adjacent to the receiving surface 52. A free end of the first spring arm 47 and a free end of the second spring arm 48 are adjacent to form a spring receiving structure to provide an insert arm of an electrical component (not shown) inserting. Because the contact portion 402 is not the point of novelty of the present invention and its principle of electrically connecting is similar with a corresponding structure of the conductive terminal of the ZIF electrical connector (not shown), here it is not illuminated in detail. Referring to FIG. 4 to FIG. 6, in assembly, the conductive terminal 4 can be inserted into the corresponding terminal channels 53 of the insulative housing 5 from the mounting surface 51 of the insulative housing 5 (referring to FIG. 4) and the conductive terminal 4 can also be inserted into the corresponding terminal channels 53 of the insulative housing 5 from the receiving surface 52 of the insulative housing 5 (referring to FIG. 6). When the conductive terminal 4 is inserted into the corresponding terminal channels 53 of the insulative housing 5 from the mounting surface 51 of the insulative housing 5, a user can hold the vertical portion 46 of the mounting portion 401 of the conductive terminal 4 during insertion. Contrary, when the conductive terminal 4 is inserted into the corresponding terminal channels 53 of the insulative housing 5 from the receiving surface 52 of the insulative housing 5, one end of the second wall 42 forms a handle 49 corresponding to the first spring arm 47 and the second spring arm 48. A user holds the handle 49 during insertion.",
        "Referring to FIG. 4 and FIG. 5, the mounting portion 401 of the conductive terminal 4 locates the solder ball 6 by its horizontal portion 45 and vertical portion 46. When the solder ball 6 contacts the surface of the horizontal portion 45, the vertical portion 46 prevents the solder ball 6 moving along the extending direction of the horizontal portion 45 because the vertical portion 46 is in an approximately 90 degrees and forms a L-shaped structure with the horizontal portion 45. Therefore, when the solder ball 6 is put into the L-shape space defined by the horizontal portion 45 and the vertical portion 46, the solder ball 6 respectively connects the horizontal portion 45 and the vertical portion 46, and locates by them in two different directions. So the solder ball 6 need not accurately align the surface of the horizontal portion 45 and easily to locate.",
        "In addition, to improve veracity of the solder ball 6 aligning, the horizontal portion 45 defines a recess 451. When the solder ball 6 connects with the horizontal portion 45, the solder ball 6 is received in the recess 451 of the horizontal portion 45 and enhances steadiness of locating the solder ball 6.",
        "Referring to FIG. 7, a gap 452 is defined between the vertical portion 46 and a side face of the horizontal portion 45 near the vertical portion 46. When the solder ball 6 melts, tin flows into the gap 452 so that the solder ball 6 not only can respectively solder with the surfaces of the horizontal portion 45 and the vertical portion 46 in two different directions but also some tin of the solder ball 6 fasten in the gap 452 by embedding so as to enhance steadiness of soldering between the solder ball 6 and the mounting portion 401 of the conductive terminal 4.",
        "The conductive terminal 4 has the first wall 41, the second wall 42 and the third wall 43. The conductive terminal 4 enhances steadiness of locating the solder ball 6 by the L-shape space defined by the horizontal portion 45 extending from the first wall 41 and the vertical portion 46 extending from the third wall 43. The gap 452 is defined between the vertical portion 46 and a side face of the horizontal portion 45 near the vertical portion 46 to provide tin of the melting solder ball 6 flows therein and enhance steadiness of soldering with the solder ball 6.",
        "Although the present invention has been illustrated and described with respect to exemplary embodiment thereof, it should be understood by those skilled in the art that the various changes, omissions and additions may be made therein and thereto without departing from the spirit and scope of the present invention as set forth in the appended claims."
    ],
    "citations": [
        "6257899",
        "6478599",
        "6478637",
        "6501665",
        "6530788",
        "6558182",
        "6695628",
        "7001190",
        "7052289"
    ],
    "us_classification": "439 83",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "01",
            "subclass": "R",
            "main_group": "12",
            "subgroup": "00"
        }
    ]
}