{
    "title": "Method and apparatus for monitoring load imbalance in a washing machine",
    "abstract": "A method of determining an imbalance condition in a horizontal axis washing machine comprises several steps, including establishing a speed profile for the washing machine, having at least three increasing speed steps, operating a motor to rotate the washing machine drum sequentially through the three speed steps, measuring the power output of the motor at each speed step, calculating an average power output by averaging the power output at the first and second speed steps, calculating the difference between the power output at the third step and the average power output, comparing the difference to a predetermined threshold difference value, and sending a signal indicative of an imbalance condition if the difference exceeds the threshold difference value.",
    "inventors": [
        "Zhang",
        "Xu",
        "Conrad",
        "Slabbekoorn"
    ],
    "document_number": "07296445",
    "publication_date": "20071120",
    "assignees": [
        "Whirlpool Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method of determining an imbalance condition in a washing machine having a rotatable drum driven by a variable speed motor, the method comprising the steps:",
            "components": [
                {
                    "component": "establishing a speed profile for the washing machine comprising at least three predetermined constant speed steps,",
                    "subcomponents": []
                },
                {
                    "component": "operating the motor to rotate the drum sequentially at the at least three predetermined constant speed steps,",
                    "subcomponents": []
                },
                {
                    "component": "measuring the power output of the motor at each of the at least three predetermined constant speed steps,",
                    "subcomponents": []
                },
                {
                    "component": "calculating an average power output by averaging the power output at the first and second speed steps,",
                    "subcomponents": []
                },
                {
                    "component": "calculating a difference between the power output at the third step and the average power output,",
                    "subcomponents": []
                },
                {
                    "component": "comparing the difference to a predetermined threshold difference value, and",
                    "subcomponents": []
                },
                {
                    "component": "sending a signal indicative of an imbalance condition if the difference exceeds the threshold difference value.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 wherein the signal causes a reduction in rotation speed of the drum to a level where the difference is equal to or less than the threshold difference value.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The method of claim 1 wherein the washing machine has a controller, and further comprises the step of determining an adapted power profile for the last speed step, wherein the controller in response to the signal causes the motor to track the adapted power profile.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The method of claim 1 wherein the speed profile has four speed steps.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The method of claim 1 wherein the washing machine is a horizontal axis washing machine.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. In a washing machine having a rotatable drum driven by a variable speed motor, a speed profile comprising predetermined constant speed steps, a predetermined maximum power output for each speed step, and a predetermined threshold difference value for each speed step above the second speed step, a method comprising the steps:",
            "components": [
                {
                    "component": "A. operating the motor to accelerate rotation of the drum to the first of the predetermined constant speed steps,",
                    "subcomponents": []
                },
                {
                    "component": "B. measuring a first power output of the motor at the first speed step,",
                    "subcomponents": []
                },
                {
                    "component": "C. comparing the measured first power output to the predetermined maximum power output for the first speed step,",
                    "subcomponents": []
                },
                {
                    "component": "D. sending a signal indicative of an imbalance condition if the measured first power output exceeds the predetermined maximum power output for the first speed step,",
                    "subcomponents": []
                },
                {
                    "component": "E. operating the motor to accelerate rotation of the drum to the second of the predetermined constant speed steps if the measured first power output does not exceed the predetermined maximum power output for the first speed step,",
                    "subcomponents": []
                },
                {
                    "component": "F. measuring a second power output of the motor at the second speed step,",
                    "subcomponents": []
                },
                {
                    "component": "G. calculating an average power output by averaging the power output at the first and second speed steps,",
                    "subcomponents": []
                },
                {
                    "component": "H. comparing the measured second power output to the predetermined maximum power output for the second step,",
                    "subcomponents": []
                },
                {
                    "component": "I. sending a signal indicative of an imbalance condition if the measured second power output exceeds the predetermined maximum power output for the second step,",
                    "subcomponents": []
                },
                {
                    "component": "J. operating the motor to accelerate rotation of the drum to a next of the predetermined constant speed steps if the measured second power output does not exceed the predetermined maximum power output for the second speed step,",
                    "subcomponents": []
                },
                {
                    "component": "K. measuring a next power output of the motor at the next predetermined constant speed step,",
                    "subcomponents": []
                },
                {
                    "component": "L. calculating a difference between the measured power output at the next predetermined constant speed step and the average power output,",
                    "subcomponents": []
                },
                {
                    "component": "M. comparing the measured next power output to the predetermined maximum power output for the next predetermined constant speed step,",
                    "subcomponents": []
                },
                {
                    "component": "N. sending a signal indicative of an imbalance condition if the measured power output exceeds the predetermined maximum power output for the next predetermined constant speed step,",
                    "subcomponents": []
                },
                {
                    "component": "O. comparing the difference in step L. to the predetermined threshold difference value for the next predetermined constant speed step,",
                    "subcomponents": []
                },
                {
                    "component": "P. sending a signal indicative of an imbalance condition if the difference in step L. exceeds the predetermined threshold difference value for the next predetermined constant speed step,",
                    "subcomponents": []
                },
                {
                    "component": "Q. operating the motor to accelerate the drum to the next of the predetermined constant speed steps if the difference in step L. does not exceed the predetermined threshold difference, and",
                    "subcomponents": []
                },
                {
                    "component": "R. repeating steps K. through Q. until a maximum reference speed is achieved.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 6 applied to a horizontal axis washing machine.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A washing machine having a rotatable drum, a variable speed motor for driving the drum, and a programmable controller for controlling the motor wherein the controller is programmed to operate the motor to rotate the drum sequentially through at least three predetermined constant speed steps of a predetermined speed profile, measure a power output of the motor at each of the at least three predetermined constant speed steps, calculate an average power output by averaging the power output at the first and second speed steps, calculate a difference between the power output at the third step and the average power output, compare the difference to a predetermined threshold difference value, and send a signal indicative of an imbalance condition if the difference exceeds the predetermined threshold difference value.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The washing machine of claim 8 wherein the speed profile has four speed steps.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The washing machine of claim 8 wherein the drum is on a horizontal axis so the washing machine is a horizontal axis washing machine.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The method of claim 1 further comprising the steps of:",
            "components": [
                {
                    "component": "measuring the power output of the motor at each of the at least three predetermined constant speed steps;",
                    "subcomponents": []
                },
                {
                    "component": "comparing the measured power output at each of the at least three predetermined constant speed steps to predetermined maximum power outputs for each of the at least three predetermined constant speed steps; and",
                    "subcomponents": []
                },
                {
                    "component": "sending a signal indicative of an imbalance condition if the measured power output exceeds the predetermined maximum power output for any of the at least three predetermined constant speed steps.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The washing machine of claim 8 wherein the controller measures the power output of the motor at each of the at least three predetermined constant speed steps, compares the measured power output at each of the at least three predetermined constant speed steps to predetermined maximum power outputs for each of the at least three predetermined constant speed steps, and sends a signal indicative of an imbalance condition if the measured power output exceeds the predetermined maximum power output for any of the at least three predetermined constant speed steps.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The method of claim 6 wherein the washing machine has a controller, and further comprises the step of determining an adapted power profile for the last predetermined constant speed step, wherein the controller in response to the signal causes the motor to track the adapted power profile.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The washing machine of claim 8 wherein the controller determines an adapted power profile for the last speed step, wherein the controller in response to the signal causes the motor to track the adapted power profile.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The method of claim 1 further comprising:",
            "components": [
                {
                    "component": "operating the motor to rotate the drum at a fourth predetermined constant speed step,",
                    "subcomponents": []
                },
                {
                    "component": "measuring the power output of the motor the fourth predetermined constant speed step,",
                    "subcomponents": []
                },
                {
                    "component": "calculating a second difference between the power output at the fourth predetermined constant speed step and the average power output,",
                    "subcomponents": []
                },
                {
                    "component": "comparing the second difference to a predetermined threshold difference value, and",
                    "subcomponents": []
                },
                {
                    "component": "sending a signal indicative of an imbalance condition if the second difference exceeds the threshold difference value.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The washing machine of claim 8 wherein the controller is further programmed to operate the motor to rotate the drum to a fourth predetermined constant speed step, measure a power output of the motor at the fourth predetermined constant speed step, calculate a second difference between the power output at the fourth predetermined constant speed step and the average power output, compare the second difference to a predetermined threshold difference value, and send a signal indicative of an imbalance condition if the second difference exceeds the predetermined threshold difference value.",
            "components": []
        }
    ],
    "description": [
        "1. Field of the Invention",
        "The present invention relates to a method and apparatus for detecting and correcting an unbalanced condition in the rotating drum of a washing machine. It is particularly applicable to a washing machine having a drum on an axis other than vertical.",
        "2. Description of the Related Art",
        "Washing machines utilize a generally cylindrical perforated basket for holding clothing and other articles to be washed that is rotatably mounted within an imperforate tub mounted for containing the wash liquid, which generally comprises water, detergent or soap, and perhaps other constituents. In some machines the basket rotates independently of the tub and in other machines the basket and tub both rotate. In this invention, the rotatable structure is referred to generically as a “drum”, including the basket alone, or the basket and tub, or any other structure that holds and rotates the clothing load. Typically, an electric motor drives the drum. Various wash cycles introduce into the clothing and extract from the clothing the wash liquid, usually ending with one or more spin cycles where final rinse water is extracted from the clothes by spinning the drum.",
        "It is common to categorize washing machines by the orientation of the basket. Vertical-axis washing machines have the basket situated to spin about a vertical axis relative to gravity. Horizontal-axis washing machines have the basket oriented to spin about an essentially horizontal axis, relative to gravity.",
        "Both vertical and horizontal-axis washing machines extract water from clothes by spinning the drum about their respective axes, such that centrifugal force extracts water from the clothes. Spin speeds are typically high in order to extract the maximum amount of water from the clothes in the shortest possible time, thus saving time and energy. But when clothing and water are not evenly distributed about the axis of the drum, an imbalance condition occurs. Typical spin speeds in a vertical axis washer are 600-700 RPM, and in a horizontal axis washer at 1100 or 1200 RPM. Moreover, demand for greater load capacity fuels a demand for larger drums. Higher spin speeds coupled with larger capacity drums aggravates imbalance problems in washing machines, especially in horizontal axis washers. Imbalance conditions become harder to accurately detect and correct.",
        "As the washing machine drum spins about its axis, there are generally two types of imbalances that it may exhibit: static imbalance and dynamic imbalance. FIGS. 1-4 illustrate schematically different configurations of imbalance in a horizontal axis washer comprising a drum 10 having a horizontal geometric axis 12. The drum 10 is suspended for rotation within a cabinet 14 having a front 16 (where access to the interior of the drum is normally provided) and a back 18. A drive point 19 (usually a motor shaft) is typically located at the back 18.",
        "FIGS. 1(a) and (b) show a static imbalance condition generated by a static off-balance load. Imagine a load 20 on one side of the drum 10, but centered between the front 16 and the back 18. A net moment torque t causes the geometric axis 12 to rotate about the axis of rotation 22 of the combined mass of the drum 10 and the load 20 at an angular velocity ω, resulting in displacement d of the drum 10. This displacement, if minor, is often perceived as a vibration at higher speeds. The suspension system is designed to handle such vibration under normal conditions. Static imbalances are detectable at relatively slow speeds such as 85 or 90 RPM.",
        "Dynamic imbalance is more complex and may occur independently of the existence of any static imbalance. FIGS. 2-4 illustrate several different conditions where dynamic imbalances exist. In FIGS. 2(a) and (b), imagine a dynamic off balance load of two identical masses 30, one on one side of the drum 10 near the front 16 and the other near the back 18. In other words, the masses 30 are on a line 32 skewed relative to the geometric axis 12. The net moment torque t1 about the geometric axis 12 is zero, so there is no static imbalance. However, there is a net moment torque t2 along the geometric axis 12, so that the drum will tend to wobble about some axis other than the geometric axis. If the moment is high enough, the wobble can be unacceptable.",
        "FIGS. 3(a) and (b) illustrates a combined static and dynamic imbalance caused by a front off-balance load. Imagine a single load 40 in the drum 10 toward the front 16. There is a net moment torque t1 about the geometric axis 12, resulting in a static imbalance. There is also a moment torque t2 along the geometric axis 12, resulting in a dynamic imbalance. The resulting motion of the drum is a combination of displacement and wobble.",
        "FIGS. 4(a) and (b) illustrates a combined static and dynamic imbalance caused by a back off-balance load. Imagine a single load 50 in the drum 10 toward the back 18. There is a net moment torque t1 about the geometric axis 12, resulting in a static imbalance. There is also a moment torque t2 along the geometric axis 12, resulting in a dynamic imbalance. The resulting motion of the drum is a combination of displacement and wobble.",
        "Unfortunately, dynamic imbalance is often detectable only at higher speeds. Both vertical and horizontal axis machines exhibit static imbalances, but dynamic imbalances are a greater problem in horizontal-axis machines. Imbalance-caused vibrations result in greater power consumption by the drive motor, excessive noise, and decreased performance.",
        "Many solutions have been advanced for detecting and correcting both static and dynamic imbalances. Correction is generally limited to aborting the spin, reducing the spin speed, or changing the loads in or on the basket. Detection presents the more difficult problem. It is known to detect vibration directly by employing switches, such as mercury or micro-switches, which are engaged when excessive vibrations are encountered. Activation of these switches is relayed to a controller for altering the operational state of the machine. It is also known to use electrical signals from load cells on the bearing mounts of the basket, which are sent to the controller. Other known methods sample speed variations during the spin cycle and relate it to power consumption. For example, it is known to have a controller send a PWM (Pulse Width Modulated) signal to the motor controller for the drum, and measure a feedback signal for RPM achieved at each revolution of the drum. Fluctuations in the PWM signal correspond to drum imbalance, at any given RPM. Yet other methods measure power or torque fluctuations by sensing current changes in the drive motor. Solutions for detecting static imbalances by measuring torque fluctuations in the motor abound. But there is no correlation between static imbalance conditions and dynamic imbalance conditions; applying a static imbalance algorithm to torque fluctuations will not accurately detect a dynamic imbalance. For example, an imbalance condition caused by a front off balance load (see FIG. 3) will be underestimated by existing systems for measuring static imbalances. Conversely, an imbalance condition caused by a back off balance load (see FIG. 4) will be overestimated by existing systems for measuring static imbalances.",
        "Moreover, speed, torque and current in the motor can all fluctuate for reasons unrelated to drum imbalance. Commonly owned U.S. Pat. No. 6,640,372 presents a solution to factoring out conditions unrelated to drum imbalance by establishing a stepped speed profile where average motor current is measured at each step and an algorithm is applied to predetermined thresholds for ascertaining an unbalanced state of the drum. Corrective action by the controller will reduce spin speed to minimize vibration. The particular algorithm in the '372 patent may be accurate for ascertaining static imbalances. However, is not entirely accurate for horizontal axis washing machines because it does not accurately ascertain the various dynamic imbalance conditions.",
        "There is yet another unacceptable condition of a rotating washer drum that involves neither a static or dynamic imbalance, but establishes a point distribution that can deform the drum. A point distribution condition is illustrated in FIG. 5(a) and (b). Imagine two identical loads 60 distributed evenly about the geometric axis 12, and on a line 52 normal to the geometric axis. There is no moment torque, either about the geometric axis 12, or along the geometric axis. Thus, there is no imbalance detectable at any speed. However, centrifugal force F acting on the loads 60 will tend to deform the drum. If the drum were a basket rotating inside a fixed tub as is common in many horizontal axis washers, the basket may deform sufficiently to touch the tub, degrading performance and causing unnecessary wear and noise.",
        "Another problem in reliably detecting imbalances in production washers regardless of axis is presented by the fact that motors, controllers, and signal noise vary considerably from unit to unit. Thus, for example, a change in motor torque in one unit may be an accurate correlation to a given imbalance condition in that unit, but the same change in torque in another unit may not be an accurate correlation for the same imbalance condition. In fact, the problems of variance among units and signal noise are common to any appliance where power measurements are based on signals that are taken from electronic components and processed for further use.",
        "There exists a need in the art for an imbalance detection system for a washing machine, particularly horizontal axis washing machines, which can effectively, efficiently, reliably and accurately sense any imbalance condition, and sense other obstructions that may adversely affect performance. Further, there is a need for accurately determining stable and robust power information that can accommodate variations in motors, controllers and signal noise from unit to unit.",
        "These problems and others are solved by the present invention of a method of determining an imbalance condition in a washing machine having a rotatable drum driven by a variable speed motor. The method comprises several steps, the first of which is establishing a speed profile for the washing machine, having at least three increasing speed steps. Then one operates the motor to rotate the drum sequentially through the three speed steps, measuring the power output of the motor at each speed step, calculating an average power output by averaging the power output at the first and second speed steps, calculating the difference between the power output at the third step and the average power output, comparing the difference to a predetermined threshold difference value, and sending a signal indicative of an imbalance condition if the difference exceeds the threshold difference value.",
        "Preferably, the signal causes a reduction in rotation speed of the drum to a level where the difference is equal to or less than the threshold difference value. Also, preferably, the washing machine will have a controller, so a step of determining an adapted power profile for the last speed step can be done, where the controller in response to the signal causes the motor to track the adapted power profile. The method is particularly applicable to a horizontal axis washer where the drum axis is not vertical.",
        "In another aspect of the invention, a washing machine having a rotatable drum driven by a variable speed motor, a predetermined speed profile comprising increasing speed steps, a predetermined maximum power output for each speed step, and a threshold difference value for each speed step above the second speed step, incorporates an improved method comprising the steps of",
        "A. operating the motor to accelerate rotation of the drum to the first of the increasing speed steps,",
        "B. measuring a first power output of the motor at the first speed step,",
        "C. comparing the measured first power output to the predetermined maximum power output for the first speed step,",
        "D. sending a signal indicative of an imbalance condition if the difference exceeds the predetermined maximum power output for the first speed step,",
        "E. operating the motor to accelerate rotation of the drum to the second of the increasing speed steps if the difference does not exceed the predetermined maximum power output for the first speed step,",
        "F. measuring a second power output of the motor at the second speed step,",
        "G. calculating an average power output by averaging the power output at the first and second speed steps,",
        "H. comparing the measured second power output to the predetermined maximum power output for the second step,",
        "I. sending a signal indicative of an imbalance condition if the difference exceeds the predetermined maximum power output for the second step,",
        "J. operating the motor to accelerate rotation of the drum to the next of the increasing speed steps if the difference does not exceed the predetermined maximum power output for the second speed step,",
        "K. measuring a next power output of the motor at the next speed step,",
        "L. calculating the difference between the power output at the next step and the average power output,",
        "M. comparing the measured next power output to the predetermined maximum power output for the next step,",
        "N. sending a signal indicative of an imbalance condition if the difference exceeds the predetermined maximum power output for the next step,",
        "O. comparing the difference in step L. to the predetermined threshold difference value for the next speed step if the difference does not exceed the predetermined threshold difference value for the next speed step,",
        "P. sending a signal indicative of an imbalance condition if the difference in step L. exceeds the predetermined threshold difference value for the next step, and",
        "Q. repeating steps J. through P. until a maximum reference speed is achieved.",
        "Preferably, the washing machine is a horizontal axis washing machine. In a further aspect, the invention includes a washing machine having a rotatable drum, a variable speed motor for driving the drum, and a programmable controller for controlling the motor. The controller is programmed to operate the motor to rotate the drum sequentially through at least three speed steps of a predetermined speed profile, measure the power output of the motor at each speed step, calculate an average power output by averaging the power output at the first and second speed steps, calculate the difference between the power output at the third step and the average power output, compare the difference to a predetermined threshold difference value, and send a signal indicative of an imbalance condition if the difference exceeds the threshold difference value.",
        "In the drawings:",
        "FIGS. 1(a) and (b) is a schematic illustration of the concept of static imbalance.",
        "FIGS. 2(a) and (b) is a schematic illustration of the concept of dynamic imbalance caused by a dynamic off balance load.",
        "FIGS. 3(a) and (b) is a schematic illustration of the concept of dynamic imbalance caused by a front off balance load.",
        "FIGS. 4(a) and (b) is a schematic illustration of the concept of dynamic imbalance caused by a back off balance load.",
        "FIGS. 5(a) and (b) is a schematic illustration of the concept of a point distribution condition.",
        "FIG. 6 is a perspective view of a horizontal axis washing machine where the invention can be applied.",
        "FIG. 7 is a graphic illustration of a speed profile and sampling windows according to the invention.",
        "FIG. 8 is a graphic illustration of a power profile superimposed on the speed profile of FIG. 7 in a balanced condition.",
        "FIG. 9 is a flow diagram schematically illustrating a method for detecting unbalance conditions according to the invention.",
        "FIG. 10 is a graphic illustration of power v. speed for four unbalanced loads and a balanced load after application of the method according to the invention.",
        "FIG. 11 is a graphic illustration similar to FIG. 7 showing the fourth speed step and adapted speed and power after corrective action for an unbalanced load.",
        "FIG. 12 schematically shows a circuit for measuring DC bus voltage of a motor control inverter according to the invention.",
        "FIG. 13 schematically shows a circuit for measuring DC bus current of a motor control inverter according to the invention.",
        "FIG. 14 is a flow chart illustrating an offset calibration method according to the invention.",
        "Imbalance Detection",
        "FIG. 6 shows a front load, horizontal axis washing machine 100 of the type most suited for the present invention. But for incorporating the method according to the invention in the washing machine 100, the physical structure is conventional. Internally, the washing machine 100 has a drum 102 comprising a rotating perforated basket 104, nested within an imperforate tub 106 that holds wash liquid during the various cycles of a washing process. It will be understood that the term “drum” refers to the rotatable structure that holds the clothing and wash liquid, whether that structure is the basket 104 alone or both the basket 104 and tub 106, or any other equivalent structure. A variable speed motor 108 typically drives the drum 102 with pulleys through either a direct drive system or a belt. The tub 106 is typically supported by a suspension system (not shown) that can include springs, dampers, and the like.",
        "During a spin cycle where water is extracted from clothes in the drum by centrifugal force, the drum 102 is accelerated to rotate at relatively high speeds, on the order of 1100 RPM. If the load in the drum 102 is unevenly distributed in a manner to create a static imbalance as in FIGS. 1(a) and (b) the drum will oscillate about its geometric axis. Such oscillation can be detected early in the spin cycle at low speed using known methods, e.g., the method disclosed in the '372 patent. If the oscillation exceeds a predetermined threshold, the machine can be slowed or stopped to correct the imbalance. This is an infrequent problem in horizontal axis machines, however, because the load tends to balance itself about the geometric axis during acceleration of the basket 104.",
        "Nevertheless, regardless of distribution of the load about the geometric axis, it is not unusual for the load to be distributed unevenly from one end of the drum 102 to the other, creating a dynamic imbalance as in FIGS. 2-4. Unlike static imbalance in a horizontal axis washer, a dynamic imbalance is not self-correcting and does not normally appear until higher speeds are achieved. If the imbalance is large enough and remains uncorrected, the resulting vibration, noise, and attendant risks are manifest. Also in larger capacity washers that can hold up to 10 Kg of mass, there is a risk that the basket will deform and touch the tub as the basket spins at high speed (see FIG. 5). The earlier an imbalance condition or a potential tub deformation can be detected, the earlier corrective action can be applied consistent with effective performance, and without significantly sacrificing speed.",
        "Accordingly, the present invention as illustrated in FIGS. 7-14 provides a method for detecting a dynamic imbalance early enough to effectively avoid unacceptable vibration conditions and optimize rotational speed for any given load.",
        "A predetermined speed profile 120 is established as shown in FIG. 7. The speed profile 120 is characterized by a series of steps 122, each step having a speed ramp 124 and a speed plateau 126. For the present embodiment, speed step 1 has a reference speed of 590 RPM, speed step 2 is 760 RPM, speed step 3 is 960 RPM and speed step 4 is the design speed of 1100 RPM for the spin cycle. Each speed ramp 124 is a dynamic period where the drum speed accelerates from a lower speed step to a higher speed step, and where the motor has to deliver a higher power (or torque) to accelerate the drum. Each speed plateau 126 is a static period where the drum achieves a constant speed, and where the motor must deliver only enough power to overcome system friction or drag and torque caused by an imbalance. Actual speed will generally follow the reference speed as the motor drives the drum, when the motor is controlled by a controller (not shown). FIG. 8 shows a sample power profile 128 superimposed on the speed profile 120 with a balanced load.",
        "In general, a washing machine can be considered a rigid body that is not an energy sink. Thus, the amount of energy absorbed by the machine's suspension system in passive mode is limited. When the energy absorbed by the suspension exceeds a threshold value, the excess energy will dissipate as vibration, noise and heat. In this case, the washer will behave abnormally. Thus, tracking the power profile 128 related to the speed profile 120 can indirectly monitor imbalance conditions in the washing machine 100.",
        "In this invention, an algorithm has been developed for monitoring real-time power. The power input information is calculated from the DC bus voltage and DC bus current of the motor control inverter (see the discussion below). A micro-controller or DSP is utilized to handle this signal processing. A variable speed motor control system drives the drum to track the reference speed profile in a closed loop status. A filtering technique is provided to reduce any noise impacts in signal processing (see below).",
        "Looking again at FIG. 7, the speed profile 120 has four speed steps 122 to reach the design spin speed. Each speed step 122 has a sampling window 130 defined over time, preferably during the speed plateau 126. Preferably, the starting time for each sampling window 130 is determined empirically for a given machine by running a maximum rated load for the machine over the speed profile 120 and ascertaining when the power profile 128 achieves stability after completion of the ramp up for each speed step. The sampling rate and total samples taken are preferably the same for all sampling windows. An average power level k can be calculated by",
        "P\n    k\n  \n  =\n  \n    \n      \n        ∑\n        \n          i\n          =\n          1\n        \n        n\n      \n      ⁢\n      \n        p\n        ki\n      \n    \n    n\n  \n\n\n\n\nwhere k=1, 2, 3, 4 for each respective sampling window, Pki=instantaneous power reading; and n=total sampling numbers.",
        "Thus, four power samples P1, P2, P3, and P4 as shown in FIG. 7 can be obtained during the spin cycle. Each power sample can be considered to have two parts. One part is the power for overcoming the system friction and drag. The other part is the power needed to overcome imbalance, whether static or dynamic. Although there is some interaction between the two parts, a distinction is a reasonable assumption in this case. The system friction and drag differs from washer to washer. But an imbalance condition differs from load to load in a given washer. The method according to the invention is robust enough to accommodate the variations in both parts.",
        "Looking now at FIG. 9, the inventive method will be described in greater detail. As mentioned, a speed profile for a given washing machine is predetermined. In addition, a maximum acceptable power, P1max, P2max, P3max, P4max, is predetermined for each speed step 122. These values are defined as the power at which the effects of imbalance for the washer are unacceptable and are determined empirically for the given model of washer. The method contemplates using two factors for ascertaining dynamic imbalance conditions: maximum power and incremental power. Moreover, it is assumed that there is an acceptable range of imbalance conditions (below Pmax) before corrective action must be taken. For imbalance conditions in an acceptable range, sampling at speed steps 1 and 2 will not trigger large effects of an unbalanced load (absent unacceptable static imbalance over Pmax). However, speed steps 3 and 4 will result in large effects. Thus, according to the method, the speed steps 3 and 4 are the steps to be carefully monitored for detecting abnormal dynamic conditions. Incremental power ΔP3 is the power needed to increase drum rotation from speed step 2 to speed step 3 and ΔP4 is the power needed to increase drum rotation from speed step 3 to speed step 4. Just as maximum power is determined empirically for each speed step, threshold incremental powers ΔP3L and ΔP4L are empirically determined for the incremental increases from speed steps 2 to 3 and 3 to 4, respectively.",
        "As the washing machine begins its spin cycle and after the drum 102 accelerates to the first speed step, P1 is calculated at the first sampling window. P1 is compared to P1max, to determine whether an unacceptable imbalance condition exists. If P1 is not less than P1max then the controller takes action to correct. Since at this low speed, any detected imbalance is more likely to be a static imbalance, the corrective action is most likely to be redistribution of the load (e.g., stopping the spin cycle to permit manually rearrange the clothes load, or automatically reordering the spin direction and speed.). If P1 is less than P1max then the controller takes the spin cycle to the next speed step 2.",
        "Here the incremental factor begins. P2 is calculated at the second sampling window, and P1 and P2 are averaged as",
        "P\n      _\n    \n    12\n  \n  =\n  \n    \n      \n        P\n        1\n      \n      +\n      \n        P\n        2\n      \n    \n    2\n  \n\n\n\n\nto determine an average power P12, which becomes a base power value for later calculations. For different system frictions, this value will be different. Meanwhile a comparison is made between P2 and P2max just in case an imbalance condition first appears in speed step 2. If P2 is not less than P2max then the control reduces the drum rotation to speed step 1, which is reprocessed. If P2 is less than P2max then the controller takes the spin cycle to the next speed step 3.",
        "When the drum rotation reaches speed step 3, the effect of any dynamic imbalance may begin to appear. P3 is calculated at the third sampling window, and the incremental power increase from step 2 to step 3 is calculated as A P3, using the formula ΔP3=P3− P12. A conventional comparison of P3 to P3max is made, as was done earlier for speed steps 1 and 2. In addition, the incremental power ΔP3 is compared to the threshold incremental power for speed step 3, ΔP3L, to ascertain whether a dynamic imbalance condition may appear at higher speeds. If ΔP3 is less than ΔP3L, then the controller takes the spin cycle to the next speed step 4. If, however, ΔP3 is greater than ΔP3L, then the drum rotation stays at speed step 3 for the remaining spin cycle. The controller may be programmed to alter the time at which the drum spins consistent with the lower rotation speed.",
        "When the drum rotation reaches speed step 4, P4 is calculated at the fourth sampling window, and the incremental power increase from step 3 to step 4 is calculated as ΔP4, using the formula ΔP4=P4− P12. A conventional comparison of P4 to P4max is made, as was done earlier for speed steps 1-3. In addition, the incremental power ΔP4 is compared to the threshold incremental power for speed step 4, ΔP4L, to ascertain whether a dynamic imbalance exists. If ΔP4 is less than ΔP4L, then the controller maintains the spin cycle at the reference speed for speed step 4. If, however, ΔP4 is greater than ΔP4L, then the controller will cause drum rotation to slow to speed step 3 or some other speed for the remaining spin cycle. The controller may be programmed to alter the time at which the drum spins consistent with the lower rotation speed.",
        "FIG. 10 illustrates a sample power level plot for five different loads taken through spin cycles in a single washing machine utilizing the method according to the invention, each load represented by a separate line and separate sampling points at each speed step. In addition, the dotted boxes represent ranges of acceptable power outputs for each speed step after application of the inventive method, consistent with acceptable balance conditions at each speed step. At speed steps 1 and 2, the effect of load imbalances does not show up significantly. At speed step 3, there is a big difference between small and large imbalances, but they are still within the acceptable range. When the drum rotation reaches speed step 4, some load imbalances are within the acceptable range. However, some of the load imbalances now exceed the range, and the controller must take corrective action to reduce vibration and noise, e.g. simply reducing rotation speed to a predetermined level.",
        "The method contemplates another speed adaptive control option called power control spinning. This option is graphically illustrated in FIG. 11. When the rotational speed accelerates to speed step 4 from speed step 3, a large power (or torque) is needed during the dynamic period T1. After T1, the speed should reach the reference speed, if without an imbalance. When there is a large power P4 after sampling (during T2), an unacceptable imbalance condition occurs. The controller will take action. An adaptive power reference will be defined by power average P12 and the incremental power ΔP4L. The motor controller drives the washer to track an adapted power profile P4ad. The drum speed is reduced to a proper speed. It is possible that a dynamic imbalance will self-correct, e.g. after water is extracted, whereupon the controller can increase speed again.",
        "Either of these two options for adaptive speed control can limit any unexpected operation to exist in a certain limited time. For example, in extreme conditions, the steel basket 104 could be stretched to touch the tub 106. If that were to occur, the power output will reach the maximum or ceiling value because of the large drag torque. In response, the controller can take action in N seconds to reduce the speed to a proper level. The time Tmax is the maximum running time when any unexpected operation could occur. Therefore, the controller can effectively monitor the washer operation status, predict and avoid performance problems before an imbalance condition causes severe degradation of performance or machine.",
        "While any manner of detecting power output from the motor may provide useful data for the foregoing method, it is preferable to ensure stable and robust power information. FIGS. 12-14 illustrate a calibration process for removing the offset due to parameter variations in motors and controller hardware boards. A filtering process is also provided for removing bad data points in real time, based on an appropriate sampling rate range for power calculation using voltage and current measurements at the motor inverter.",
        "Calibration",
        "According to the invention, power P for detecting the effects of unbalance loads for the foregoing method is calculated on the basis of the DC bus voltage Vbus and DC bus current Ibus of the motor control inverter. A supply voltage VDD is provided for a Digital Signal Processor (DSP). The DSP preferably measures the bus voltage Vbus and bus current Ibus at sampling points Vbus sample and Ibus sample simultaneously at a sampling rate of once every 50 microseconds or 20,000 times per second (20 KHz). In general, the sampling rate can be in a range of 20 to 50 KHz. FIGS. 12 and 13 show exemplary DC bus current and DC bus voltage sensing circuits, respectively. A+15V supply voltage is provided to a single source high bandwidth operational amplifier, such as the MC34072AD, produced by Motorola. It will be apparent that the components of the sensing circuits, such as resistors R1-R8 and capacitors C1-C4, may vary from one controller to another, resulting in an offset when measuring Idc from a given controller. Consequently, the power calculation of P may not be accurate from one controller to another. In practice, current offsets in measurements are unavoidable. As a result, some self calibration for cuffent offset is necessary for an accurate power calculation.",
        "Initial offset calibration occurs by automatically detecting both Vbus and Ibus as soon as the controller is powered on, determining the offset, and then making an adjustment to remove the offset. Detection at the normal sampling rate of 20-50KHz occurs during initialization of the motor controller where the induction motor is not driven (PWM is shut down), and DC bus voltage is set up. At the time of initialization, measured cuffent represents the current offset. The cuffent offset is thus measured at each sample and averaged over a variable number of times, preferably 216-512 (generally enough for accuracy). Preferably, a default value is n=512. Averaging occurs as follows:",
        "i\n    \n      off\n      -\n      set\n    \n  \n  =\n  \n    \n      \n        i\n        1\n      \n      +\n      \n        i\n        2\n      \n      +\n      …\n      +\n      \n        i\n        n\n      \n    \n    n",
        "After averaging the measured current (offset current) n times, a calibration value is calculated that, if applied to a sampled current when the motor is running, will result in a zero offset. Thereafter, in the calculations of power P based on sampled current and voltage as shown in FIG. 9, the calibration value is used to compensate for offsets. Referring now to FIG. 14, the flow of steps in the calibration according to the invention can be seen. Upon startup 200 of the motor controller, regardless of architecture, normal initialization occurs, e.g. initializing S/W modules, timers and other system parameters (202, 204, 206, 208). When the system reaches a predetermined interrupt 210, contexts are saved and interrupt flags are cleared. Then at 212 the system queries whether or not calibration has occurred. If not, then a loop commences where PWM signals are shutdown so that the motor does not start, and current sampling commences at the predetermined sampling rate (20-50 KHz). Offset values are calculated in accord with the running average ioff-set until the number of samples reaches n (preferably 216-512), at which time the calibration is complete and the flag for the query at 212 is set to true. At that point, the motor control scheme 214 will be started. It is during the motor control scheme that measurements of power P (adjusted for the offsets) in FIG. 9 occur.",
        "Filtering",
        "Noise is always a component of sampling signals received from the DC bus voltage and current circuits. Accuracy of power calculations can be enhanced by filtering data points affected by noise spikes. Such signals will have a sharp transition among sampling values. An adaptive moving window average filter according to the invention filters out such bad data points and is described herein.",
        "Suppose that at any instant k, the power average of the last n (for example, 256 points) samples of a data sequence is given by:",
        "p\n      k\n    \n    _\n  \n  =\n  \n    \n      1\n      n\n    \n    ⁢\n    \n      \n        ∑\n        \n          i\n          =\n          \n            k\n            -\n            n\n            +\n            1\n          \n        \n        k\n      \n      ⁢\n      \n        \n          p\n          i\n        \n        .",
        "Similarly, at the previous time instant, k−1, the power average of the last n samples is:",
        "p\n      \n        k\n        -\n        1\n      \n    \n    _\n  \n  =\n  \n    \n      1\n      n\n    \n    ⁢\n    \n      \n        ∑\n        \n          i\n          =\n          \n            k\n            -\n            n\n          \n        \n        \n          k\n          -\n          1\n        \n      \n      ⁢\n      \n        p\n        i",
        "Therefore,",
        "p\n          k\n        \n        _\n      \n      -\n      \n        \n          p\n          \n            k\n            -\n            1\n          \n        \n        _\n      \n    \n    =\n    \n      \n        \n          1\n          n\n        \n        ⁢\n        \n          (\n          \n            \n              \n                ∑\n                \n                  i\n                  =\n                  \n                    k\n                    -\n                    n\n                    +\n                    1\n                  \n                \n                k\n              \n              ⁢\n              \n                p\n                i\n              \n            \n            -\n            \n              \n                ∑\n                \n                  i\n                  =\n                  \n                    k\n                    -\n                    n\n                  \n                \n                \n                  k\n                  -\n                  1\n                \n              \n              ⁢\n              \n                p\n                i\n              \n            \n          \n          )\n        \n      \n      =\n      \n        \n          1\n          n\n        \n        ⁢\n        \n          (\n          \n            \n              p\n              k\n            \n            -\n            \n              p\n              \n                k\n                -\n                n\n              \n            \n          \n          )\n        \n      \n    \n  \n  ,\n\n\n\n\nwhich can be expressed as:",
        "p\n      k\n    \n    _\n  \n  =\n  \n    \n      \n        p\n        \n          k\n          -\n          1\n        \n      \n      _\n    \n    +\n    \n      \n        1\n        n\n      \n      ⁢\n      \n        (\n        \n          \n            p\n            k\n          \n          -\n          \n            p\n            \n              k\n              -\n              n\n            \n          \n        \n        )",
        "Thus, at any instant, a moving window of n values is used to calculate the power average of the data sequence. Three values can thus be continuously calculated for the moving window: Pk, Pk−1, and Pk+1. Furthermore, errors among the three power average values can be calculated compared continuously, as follows:\n\nek+1= Pk+1− Pk\n\nek= Pk− Pk−1\n\nek−1= Pk+1− Pk−1",
        "A running comparison of errors will identify which errors are large enough to be over a pre-set limit. In such case the associated sample that resulted in the large error should be treated as a bad point and will be discarded in the sense that the sample is not used and is no longer available for further processing. Thus, higher accuracy and stability are achieved. In the illustrated embodiments, discarding a bad sample means that neither the given current and voltage samples, nor the resultant power calculation is used in the imbalance detection routine of FIG. 9, nor is it used in the calibration method according to the invention, nor is it used further in establishing the moving window of the filtering process.",
        "While the invention has been specifically described in connection with certain specific embodiments thereof, it is to be understood that this is by way of illustration and not of limitation, and the scope of the appended claims should be construed as broadly as the prior art will permit."
    ],
    "citations": [
        "2001/0054204"
    ],
    "us_classification": "68 1206",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "D",
            "classification_class": "06",
            "subclass": "F",
            "main_group": "33",
            "subgroup": "00"
        }
    ]
}