{
    "title": "Wet electrostatic precipitator for treating oxidized biomass effluent",
    "abstract": "An apparatus for removing particulate matter from a biomass combustion gas stream, the apparatus having a mist-producing element that mixes a gas stream entering the apparatus with liquid droplets; a Wet Electrostatic Precipitator (WESP) section that includes ionizing electrodes that electrically charge the particulate matter and the intermixed liquid droplets and collecting surfaces under the influence of an electrical field which attract and remove electrically-charged particulate matter and intermixed liquid droplets from the gas stream; and a scrubbing section that provides for additional scrubbing of the gas.",
    "inventors": [
        "Ray",
        "West",
        "Altshuler",
        "Ginger"
    ],
    "document_number": "07297182",
    "publication_date": "20071120",
    "assignees": [
        "Eisenmann Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for removing particulate matter and scrubbing toxic gases from a biomass derived gas stream, the method comprising:",
            "components": [
                {
                    "component": "introducing a contaminated biomass derived gas stream into a housing;",
                    "subcomponents": []
                },
                {
                    "component": "spraying a fine liquid mist into the contaminated gas stream;",
                    "subcomponents": []
                },
                {
                    "component": "electrically charging particulates and droplets in the gas stream by passing the gas stream by at least one ionizing electrode in a Wet Electrostatic Precipitator (WESP) section;",
                    "subcomponents": []
                },
                {
                    "component": "collecting the electrically charged particulates and droplets on a collecting surface",
                    "subcomponents": []
                },
                {
                    "component": "draining the collected electrically charged particulates and droplets into a scrubbing section;",
                    "subcomponents": []
                },
                {
                    "component": "scrubbing the electrically charged particulates from the gas stream in a scrubbing section; and",
                    "subcomponents": []
                },
                {
                    "component": "changing the direction of the gas stream when it moves from the WESP section to the scrubbing section and when it moves from the scrubbing section to the WESP section.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The method of claim 1 , further comprising the injecting of an alkali solution into the gas stream in the scrubbing section.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. An apparatus for removing particulate matter and scrubbing toxic gases from a biomass derived gas stream, the apparatus comprising:",
            "components": [
                {
                    "component": "a mist-producing device that sprays liquid droplets into the gas stream;",
                    "subcomponents": []
                },
                {
                    "component": "a Wet Electrostatic Precipitator (WESP) section comprised of a plurality of ionizing and collecting electrodes;",
                    "subcomponents": []
                },
                {
                    "component": "a scrubbing section in flow communication with the WESP section;",
                    "subcomponents": []
                },
                {
                    "component": "a power supply having a high voltage switch and high voltage diodes electrically connected to the WESP section;",
                    "subcomponents": []
                },
                {
                    "component": "a scrubbing section located downstream of a first WESP section and upstream of a second WESP section in a common sump between the first WESP section and the second WESP section.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. An apparatus for removing particulate matter and scrubbing toxic gases from a biomass derived gas stream, the apparatus comprising:",
            "components": [
                {
                    "component": "a mist-producing device located within an inlet section, the mist producing device being capable of spraying liquid droplets into the gas stream;",
                    "subcomponents": []
                },
                {
                    "component": "a perforated distribution plate located downstream of the mist producing device;",
                    "subcomponents": []
                },
                {
                    "component": "an ozone induction zone located in the inlet section;",
                    "subcomponents": []
                },
                {
                    "component": "an ozone inlet nozzle located in the ozone induction zone;",
                    "subcomponents": []
                },
                {
                    "component": "a Wet Electrostatic Precipitator (WESP) section comprised of a plurality of ionizing and collecting electrodes;",
                    "subcomponents": []
                },
                {
                    "component": "a scrubbing section in flow communication with the WESP section; and",
                    "subcomponents": []
                },
                {
                    "component": "a power supply having a high voltage switch and high voltage diodes electrically connected to the WESP section.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. An apparatus for removing particulate matter and scrubbing toxic gases from a biomass derived gas stream, the apparatus comprising:",
            "components": [
                {
                    "component": "a mist-producing device that sprays liquid droplets into the gas stream;",
                    "subcomponents": []
                },
                {
                    "component": "a Wet Electrostatic Precipitator (WESP) section comprised of a plurality of ionizing and collecting electrodes;",
                    "subcomponents": []
                },
                {
                    "component": "a scrubbing section in flow communication with the WESP section;",
                    "subcomponents": []
                },
                {
                    "component": "a draining means for draining collected particulate matter from the WESP section into the scrubbing section; and",
                    "subcomponents": []
                },
                {
                    "component": "a gas stream that changes direction when moving from the WESP section to the scrubbing section and when moving from the scrubbing section to the WESP section; and",
                    "subcomponents": []
                },
                {
                    "component": "a power supply having a high voltage switch and high voltage diodes electrically connected to the WESP section.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The apparatus of claim 5 , wherein the scrubbing section has an electrically grounded gas scrubbing device.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The apparatus of claim 5 , wherein: the scrubbing section is located upstream of the WESP section.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The apparatus of claim 5 , wherein the scrubbing section is located downstream of a first WESP section and upstream of a second WESP section.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The apparatus of claim 5 , wherein the scrubbing section is comprised of:",
            "components": [
                {
                    "component": "at least one spray nozzle; and",
                    "subcomponents": []
                },
                {
                    "component": "a recirculating liquid pump.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The apparatus of claim 9 , wherein an alkali solution is injected into the gas stream via the at least one spray nozzle.",
            "components": []
        }
    ],
    "description": [
        "This patent application is a continuation-in-part of copending U.S. patent application Ser. No. 11/366,274, filed Mar. 2, 2006 entitled Dual Flow Wet Electrostatic Precipitator that claims the benefit of U.S. Provisional Patent Application No. 60/657,901 filed Mar. 2, 2005.",
        "This invention pertains to a Wet Electrostatic Precipitator (WESP) apparatus and method for removing particulate matter and environmentally hazardous gases produced from the combustion of biomass and biomass supplemented fuel sources. The invention also pertains to an apparatus having the capacity to continuously self-clean collected biomass derived particulate matter, while also scrubbing acid gases derived from biomass oxidation, and act as an electrode ozone generator or alternatively as a non-thermal plasma generator for biomass derived nitrous oxidation conversion in a single unitary device.",
        "There have been continuing attempts to improve techniques for removing fine particulates from biomass fuel oxidation-exhaust gas streams. The conventional method in biomass combustion has been to use boilers in conjunction with dry electrostatic precipitators to collect fly ash. The fly ash has often been comprised of partially combusted organic matter mixed in with the inorganic constituents. These semi-organic particles have traditionally precipitated on collecting surfaces in dry precipitators forming potential fire and maintenance hazards. Among the recent improvements is the utilization of condensing wet electrostatic precipitators wherein the particulates carried by an incoming gas stream are entrained in condensate formed on walls of the precipitator and are flushed from the walls for collection. Also known is a down-flow type of WESP in which the water droplets move concurrently with the gas and provide a cleaning action when deposited together with particles.",
        "Despite such improvements, however, there remains a need for an improved apparatus and methods for eliminating all or substantially all of a particulate matter from a gas stream. Furthermore, a need exists for removing particulate matter and environmentally hazardous gases produced from the combustion of biomass and biomass supplemented fuel sources. This invention seeks to provide such an apparatus.",
        "Conventional systems utilize three separate and distinct pieces of equipment in order to treat effluent gases from the oxidation of biomass derived fuels. These three pieces of equipment are an electrostatic precipitator, an acid gas scrubber, and a selective catalytic reduction reactor. In the conventional system, the electrostatic precipitator is used to remove, via electrostatic collection, biomass particulate matter resulting from the combustion of biomass. An acid gas scrubber located either upstream or downstream of the electrostatic precipitator is used to chemically introduce to the gasses strong reducing agents capable of chemically neutralizing the acid gas emissions that originate from the combustion of biomass. A selective catalytic reduction reactor is then required to treat the nitrogen oxide emissions originating from the combustion of biomass. This treatment of the nitrogen oxide emissions is done through the introduction of a strong reducing agent such as ammonia into the gas stream.",
        "These three separate pieces of equipment have various physical interconnections and multiple control connections that increase the cost and complexity of installation and operation. For this reason, a single apparatus that could perform the functions the three conventional pieces of equipment would be an important improvement in the art.",
        "The invention provides an apparatus for removing particulate matter and toxic gases from a gas stream containing particular matter. The apparatus is comprised of: a mist-producing device that mixes a gas stream entering the apparatus with liquid droplets; a Wet Electrostatic Precipitator (WESP) section that includes ionizing electrodes that electrically charge the particulate matter and the intermixed liquid droplets and collecting surfaces that are under the influence of an electrical field and therefore attract and remove electrically-charged particulate matter and intermixed liquid droplets from the gas stream; and a scrubbing section that is in flow communication with the WESP.",
        "FIG. 1 is a longitudinal, sectional view of an apparatus constructed in accordance with an embodiment of the present invention in which a common power source is used, for a dual WESP arrangement.",
        "FIG. 1A is an enlarged view of the connection between the charging station and the repelling stage of an ionizing electrode used in the down-flow embodiment of the WESP section of the present invention.",
        "FIG. 1B is an enlarged view of the connection between the charging station and the repelling stage of an ionizing electrode used in the up-flow embodiment of the WESP section of the present invention.",
        "FIG. 2 is a longitudinal, sectional view of an apparatus constructed in accordance with an embodiment of the present invention in which a dual power source is used, for a dual WESP arrangement.",
        "FIG. 3 is a longitudinal, sectional view of an apparatus constructed in accordance with an embodiment of the present invention in which a single power source is used, for a single down flow WESP arrangement followed by scrubbing section.",
        "FIG. 4 is a longitudinal, sectional view of an apparatus constructed in accordance with an embodiment of the present invention in which an integral scrubbing section is followed by an up-flow embodiment of a WESP section powered by a single source.",
        "FIG. 5 is a longitudinal, sectional view of an apparatus constructed in accordance with an embodiment of the present invention in which a single power source is used for an up-flow embodiment of the WESP section of the present invention followed by an integral scrubbing section.",
        "The invention, as shown in FIG. 1, involves an apparatus 10 comprised of an inlet transition 12 that includes a gas distribution perforated plate 14 and a fine liquid mist nozzle 16 located downstream of, and proximal to the inlet 12. A support structure 18 for ionizing electrodes is positioned downstream of the distribution plate 14. Support insulators 20 isolate negative ionizing electrodes from positive tubes while ionizing electrodes 22, having a charging stage with sharp corona generating points 26 and a smooth repelling stage 28, as shown in FIG. 1A, extend from the support structure 18.",
        "The ionizing electrodes 22 are preferably located centrally in the spaces defined by collecting surfaces 30 (“collectors”). These collecting surfaces 30 can be created by tubular or flat plate structures. Located below the collectors 30, and preferably in the bottom of a housing 32 is a sump for the down-flow section for collecting liquid. A drain nozzle 34 is also located in the vicinity of the sump.",
        "In one embodiment, the sump in the bottom of the housing 32 is separated by a dividing wall 36, in order to create a separate sump for the up-flow section and a recycle pump 38. Above the sump for the up-flow section are washing spray nozzles 40, which are followed by gas distribution plates 42, which are followed by ionizing electrodes 48 which include ionizing points 50 and a repelling stage 52, as shown in FIG. 1B. Juxtaposed around the ionizing electrodes 48 are up-flow WESP collectors 44. These collectors 44 may be of a hexagonal shape. The ionizing electrodes 48 of the up-flow section can be supported by the frame 54 and insulators 56. Wash nozzles 58 are preferably located above the frame 54. An outlet transition 60 is located downstream of the wash nozzles 58. High voltage power is supplied by a power supply 62. Moreover, one of the WESP units can be turned on or off, as required, using a high voltage switch 64. This high voltage switch 64 also incorporates high voltage diodes which prevent the sparking in the down-flow section from influencing the operation of the up-flow section. In the event the inlet gas contains high concentrations of submicron particles (i.e., more than 0.2 gr/acf for particles below 0.5 micron) that can create so-called corona current suppression, each section of the WESP will be powered by separate power supplies 62A and 62B as shown in FIG. 2.",
        "When in operation, an incoming gas stream “A” laden with solid particulates and acidic gases enters the inlet transition 12 that incorporates perforated plates 14 for gas distribution and the mist nozzle 16 that sprays a fine liquid mist onto the gas. Upon entering the down-flow WESP section, the solid particles along with the liquid droplets are charged in an ionizing stage, where the sharp points 26 create the flow of the negative ions. Under the influence of the electrical field, the charged particles and droplets migrate together towards the collecting surfaces 30. The collection process is most effective in the repelling stage, where the high voltage field is uniform between the collecting walls 30 and repeller 28.",
        "During the operation, most of the sparking and arcing caused by the charged particles passing through the electrical field take place between the sharp points 26 of the ionizing electrodes 22 and the walls of the collector 30, with practically no sparking taking place in the space between the smooth repeller 28 and the collector walls 30. This minimizes the production of small droplets, thereby reducing the amount of extra energy required to capture them in the up-flow section of the apparatus 10. It has been found that the greatest amount of ionizing current produced by the given length of the electrode takes place when the distance between two of the sharp points 26 is approximately half the distance from the end of the point to the closest collection wall. Furthermore, it has been found that the most efficient collection takes place when the diameter of the repeller 28 is ⅓ of the diameter of the collecting tube.",
        "The mixture of collected particles and water droplets moves substantially continuously downwards under the forces of gravity until they collect in the sump where they are drained out through the drain nozzle 34. In still another embodiment of the invention, the down-flow WESP section may have only an ionizing stage while the up-flow WESP section has only a collecting stage on their respective electrodes 22, 48 in order to maximize the potential of each section. It has been found that the best charging occurs when high pulsed voltage is passed through the sharp points 26 of the ionizing electrodes 22. Likewise, the best collection occurs when a uniformed electrical field of smooth voltage passes through the repeller 28. Therefore, in order to have an ionizing only stage in the down-flow WESP section, the section is supplied with a high pulsed voltage while a uniformed smooth voltage is supplied to the up-flow WESP section so as to allow for collection only in that section.",
        "During the operation, the gas A changes direction by about 90° at the bottom of the down-flow WESP section of the apparatus 10, as shown in FIGS. 1 and 2. This change of direction helps to separate big water droplets (e.g., more than 100 microns) from the gas stream A by allowing the big droplets to drop from the down-flow WESP collector. Furthermore, the gas, along with the solid particles and smaller droplets that penetrated the down-flow WESP section, again change direction by about 90° above the sump, moves through the scrubbing section 24 and enters into the up-flow WESP section of the apparatus 10. As a result of this flow pattern, the gas flow A makes a total change of direction of about 180° degrees above the common sump. In order to provide an even gas flow velocity in the cross section of the up-flow WESP section, following the 90° turn above the sump, the gas A enters additional scrubbing and gas distribution sections that have several perforated plates 42.",
        "The moving gas A enters the gas scrubbing section 24 which is comprised of scrubbing elements, spray nozzles, a separate recycle liquid loop, and a gas entering distribution section 42, where the liquid from the sprays 40 and turbulent gas flow creates a small pressure drop and, as a result, better gas velocity distribution in addition to the acidic gas scrubbing action, particularly when sprays 40 and 24 contain an alkali solution.",
        "The particles and liquid droplets that still remain in the gas flow enter the up-flow WESP section and, preferably charged by the corona, discharge between the ionizing points 50 and walls of the collector 44. When charged particles and droplets enter the space between the collector 44 and repeller 52, high efficiency collection takes place. Furthermore, since there are more fine liquid droplets than particles in this section the continuous self-cleaning action also takes place.",
        "In another embodiment, the space between the down-flow and up-flow WESP sections of housing 32 of the apparatus 10 may comprise additional gas scrubbing devices, such as packing, venturi, spray, rod decks and other with a separate recycle loop to remove various acid gases from a gas stream A. Scrubber designs depend on the specific inlet gas conditions including the types of acidic gases, their concentrations, and the required removal efficiency. In a case in which the inlet gas contains solids particles only, the scrubbing section is not required.",
        "It is preferable that all, or substantially all, of the particulate matter and water droplets that exit the down-flow WESP section are charged and are removed by the grounded scrubbing section 24 and by the up-flow WESP section. In this regard, most of the solid particles are removed from the gas flow A in the down-flow WESP section. The mixture of the gas with the fine liquid droplets (generated in the WESP by sparking and arcing), along with fine scrubbing liquid droplets that have originated along the gas path in the apparatus 10, enters the up-flow WESP section for final removal of submicron particles that have penetrated the down-flow WESP section and acid gas scrubbing section 24.",
        "Since there may be more liquid droplets than solids on a mass basis in the up-flow WESP section, the problem of contamination is overcome in addition to the complete and final mist elimination. Moreover, the fine droplets (e.g., of a size of less than about 10 microns, 5 microns, or even less than about 1 micron) which are generated by down-flow WESP section have the same or substantially the same diameter as solids particles and will be removed by the up-flow WESP section in the same or substantially the same part or portion of the collector area. This effect provides the continuous WESP washing and minimizes the sedimentation of solid particles on the upper dry surface of WESP collector as it takes place in the conventional up-flow WESP.",
        "In accordance with an embodiment of the present invention, down-flow and up-flow sections of the WESP are preferably located in a common housing 32, have a common sump, and/or can share a common high voltage power supply 62, as shown in FIG. 1. Each WESP section may also use separate power supplies 62A and 62B, as shown in FIG. 2, that are adjusted accordingly to maximize the charging in the down-flow section and collection in the up-flow section.",
        "In accordance with another embodiment of the present invention, if the level of so-called Corona Current Suppression has begun to influence WESP efficiency, each of the WESP section is equipped with its own power supply 62A, 62B, as shown in FIG. 2, which will be selected according to the required operating voltage and current, in a manner known to those of skill in the art.",
        "In still another embodiment of the invention, each of the WESP sections can be constructed as tubular or plate type and a liquid delivery method on the collecting surface 30 can be either as a fog from the spray nozzles 16 or as a liquid film with constant liquid delivery rate.",
        "In accordance with another embodiment of the present invention, the down-flow section of the WESP is a wet non-thermal plasma generator that is connected to a high voltage power supply that provides fast rising and short duration pulsed voltage with characteristics defined in a manner known to those of skill in the art. Non-thermal plasma, in this regard, can convert, for example, nitrous oxide (NO) into a soluble compound like nitrous dioxide (NO2) that will be scrubbed in the following scrubbing section, or can convert the elemental mercury to mercury oxide solids which can be removed by up-flow WESP. In this manner, the apparatus 10 can function as a multi-pollutant control system.",
        "The apparatus 10 of the present invention provides for extremely reliable and highly efficient wet particulate removal, while eliminating problems associated with conventional apparatuses, such as, for example, the presence of contaminated fine mist (e.g., droplets smaller than 15 microns in diameter) that are mainly responsible for the penetration from the conventional mist eliminator that follows the gas flow exiting the down-flow WESP section, and the need for periodic shut-downs for cleaning the conventional up-flow WESP section due to the contamination of the dry top of the collector resulting from large droplets which are bigger than particles not reaching the top.",
        "As shown in FIG. 1, the invention also involves an apparatus 10 for removing particulate matter and scrubbing toxic gases from a gas stream A, the apparatus 10 is comprised of a gas inlet 12 for a down-flow section of a WESP, at least one mist-producing device 16 located within the gas inlet 12, a gas distribution plate 14 downstream of the at least one mist-producing device 16, a plurality of ionizing electrodes 22 located in a collection section 30 positioned downstream of the at least one mist-producing device 16, a repelling section 28 located on each of the plurality of ionizing electrodes 22, a sump located downstream of the collection section 30, a plurality of spray nozzles 40 located downstream of the sump in an up-flow section of a WESP, a gas distribution plate 42 downstream of the plurality of spray nozzles 40, a plurality of collecting surfaces 44 downstream of the gas distribution plate 42, an ionizing electrode 48 located within each of the plurality of collecting surfaces 44, at least one wash nozzle 58 positioned downstream of the ionizing electrodes 48, a gas outlet 60 downstream of the at least one wash nozzle 58, and a power source 62 electrically connected to the apparatus 10.",
        "In one embodiment of the invention, a scrubbing section 24 is located in the sump upstream of the plurality of spray nozzles 40.",
        "The invention also involves a method for removing particulate matter and toxic gases from a gas stream, the method is comprised of: (1) introducing a contaminated gas stream into a housing; (2) spraying a fine liquid mist into the contaminated gas stream; (3) electrically charging particulates and droplets in the gas stream by passing the gas stream by at least one ionizing electrode; (4) collecting the electrically charged particulates and droplets on a collecting surface; (5) draining the collected electrically charged particulates and droplets into a sump; (6) flowing the gas stream upward; (7) spraying a fine liquid mist into the contaminated gas stream; (8) electrically charging particulates and droplets in the gas stream by passing the gas stream by at least one ionizing electrode; and (9) collecting charged particles and droplets on the collecting surfaces and discharging the gas stream through an outlet.",
        "In another embodiment of the method, the gas stream is chemically scrubbed prior to flowing upward from the sump. In a specific version of this embodiment, the chemical scrubbing is accomplished using an alkaline solution.",
        "In still another embodiment, the invention involves an air purification system for removing particulate matter and environmentally hazardous gases resulting from the combustion of biomass and biomass supplemented fuel sources. As shown in FIG. 3, the air purification system is comprised of an apparatus 110 having an inlet transition 112 that includes a liquid mist nozzle 114 located downstream of, and proximal to the inlet 112. A perforated distribution plate 116 is located downstream of the mist nozzle 114. In a particular embodiment of the invention, an ozone induction zone is located downstream of the distribution plate 116. A support structure 118 for ionizing electrodes is positioned downstream of the distribution plate 116. Support insulators 120 isolate negative ionizing electrodes 122 from positively charged tubes. The ionizing electrodes 122 include a charging stage with sharp corona generating points 126 and a smooth repelling stage 128.",
        "The ionizing electrodes 122 are preferably located centrally in the spaces defined by the collecting surfaces 130 (collectors). These collector surfaces 130 can by created by either tubular or flat plates structures. Located below the collectors 130, and preferably in the bottom of a housing 132 is a sump 133 for collecting any liquids from the WESP and a chemical scrubbing section 124. A liquid circulation pump 138 is connected to the chemical scrubbing section 124.",
        "In an embodiment as shown in FIGS. 1-4, the sump 32, 132 is separated by a dividing wall 36, 136 to segregate liquids draining from the WESP section and from the chemical scrubbing section 24, 124. FIG. 5 depicts an alternate arrangement in which two physically separate sumps 133, 135 handle the liquid collection from the WESP and the chemical scrubbing section 124, respectively.",
        "As shown in FIGS. 1 and 2, the chemical scrubbing section 24 can be located between two separate WESP sections having collectors 30 and 44. As shown in FIGS. 3 and 5, the chemical scrubbing section 124 may also be downstream of a single WESP collection system. Furthermore, as shown in FIG. 4, the chemical scrubbing section 124 may be downstream of the inlet flange 112 but upstream of a single WESP collecting section 130.",
        "The chemical scrubbing section 124 is comprised of scrubbing elements (not shown), spray nozzles 137, and a recirculating liquid pump 138. Acidic gas scrubbing results in this section 124 when spray nozzles 137 contain an alkali solution.",
        "In various embodiments, as shown in FIGS. 1, 2, and 4, a WESP section with ionizing electrodes 22, 122 is positioned downstream of the chemical scrubbing section 24, 124. The ionizing electrodes 22, 122 may be of the up-flow type depicted in FIG. 1B. These up-flow collectors 30, 130 may be of a hexagonal shape. In the event the inlet gas contains high concentrations of submicron particles (i.e., more than 0.2 gr/acf for particles below 0.5 microns) two separate power supplies 62A, 62B will be supplied for each WESP section, as shown in FIG. 2. For lower concentrations a high voltage switch 64 will be supplied allowing one high voltage source 62 to supply both WESP collection sections 30, 52 as shown in FIG. 1.",
        "When in operation, an incoming gas stream “A” laden with solid particulates, acidic gases, and NOx from a biomass oxidation off-gas enter the inlet transition 112. A mist nozzle 116 sprays the gas stream A with a fine liquid mist. In some embodiments, such as shown in FIGS. 1, 2, and 3, a perforated distribution plate/ozone introduction zone 14, 114 is used to distribute flow and reduce NOx.",
        "The gas stream A enters the WESP section in either a down-flow, as shown in FIGS. 1, 2, and 3, or a counter-flow manner, as shown in FIGS. 4 and 5. Once in the WESP section, the solid particles along with the liquid droplets are charged in an ionizing stage where the sharp points 26 of the ionizing electrodes 22, as shown in FIG. 1A, create the flow of the negative ions. Under the influence of the created electric field, the charge particles and droplets migrate toward the collectors 30,130.",
        "In certain embodiments of the invention, the WESP ionizing collectors 130 act as a wet non-thermal plasma generator connected to the high voltage power supply 162. When acting as a non-thermal plasma generator, the collectors 130 aid in the conversion of compounds such as nitrous oxide (NO) into a soluble compound such as nitrous dioxide NO2) that is then scrubbed in the acid gas removal section 124.",
        "The acid gas removal section 124 is comprised of additional gas scrubbing devices, such as packing, venturi, spray, rod decks, and other chemical introduction systems that are used to remove various acid gases from the gas stream A. The design of this section depends on the specific conditions of the inlet gas including the types of acid gases, their concentrations, and required removal efficiencies. Where the particulate concentration is low, the gas scrubber 124 can be located upstream of the WESP collectors 130, as shown in FIG. 4. When in operation, the chemicals utilized for acid gas neutralization are injected into the suction of recycle pump 138 and enter the scrubbing process through the acid gas solution scrubbing nozzles 137. In still other embodiments of the invention, as shown in FIGS. 1 and 2, a second WESP section is located downstream of the acid gas removal section. This allows for added NOx removal and greater particulate removal efficiency in cases involving high particulate gases. In these embodiments, the second downstream collection section is kept in a state of saturation through the use of outlet mist nozzles 158. In all embodiments of the invention, the treated gas stream “A” exits the inventive apparatus 110 via an outlet transition that is designed to minimize the possibility of downstream liquid carry-over.",
        "All references, including publications, patent applications, and patents, cited herein are hereby incorporated by reference to the same extent as if each reference were individually and specifically indicated to be incorporated by reference and were set forth in its entirety herein.",
        "The use of the terms “a” and “an” and “the” and similar referents in the context of describing the invention (especially in the context of the following claims) are to be construed to cover both the singular and the plural, unless otherwise indicated herein or clearly contradicted by context. Recitation of ranges of values herein are merely intended to serve as a shorthand method of referring individually to each separate value falling within the range, unless otherwise indicated herein, and each separate value is incorporated into the specification as if it were individually recited herein. All methods described herein can be performed in any suitable order unless otherwise indicated herein or otherwise clearly contradicted by context. The use of any and all examples, or exemplary language (e.g., “such as”) provided herein, is intended merely to better illuminate the invention and does not pose a limitation on the scope of the invention unless otherwise claimed. No language in the specification should be construed as indicating any non-claimed element as essential to the practice of the invention.",
        "Preferred embodiments of this invention are described herein, including the best mode known to the inventors for carrying out the invention. It should be understood that the illustrated embodiments are exemplary only, and should not be taken as limiting the scope of the invention."
    ],
    "citations": [
        "1250088",
        "1329817",
        "1444627",
        "1766422",
        "1811797",
        "1951867",
        "2024226",
        "2055368",
        "2195431",
        "2273194",
        "2422564",
        "2443780",
        "2592508",
        "2677439",
        "2701028",
        "2800192",
        "2874802",
        "2937709",
        "3029578",
        "3124437",
        "3248857",
        "3444668",
        "3656441",
        "3765154",
        "3874858",
        "3958958",
        "3958960",
        "3958961",
        "4049399",
        "4072477",
        "4256468",
        "4355108",
        "4441897",
        "4516991",
        "4523928",
        "5039318",
        "5084072",
        "5137546",
        "5154734",
        "5254155",
        "5624476",
        "6117403",
        "6224653",
        "6231643",
        "6294003",
        "6302945",
        "6558454",
        "2002/0061270",
        "2002/0164730",
        "2004/0121436",
        "2005/0112056",
        "2005/0220695",
        "401 566",
        "1 600 232",
        "52-3767",
        "2 189 866"
    ],
    "us_classification": "95 64",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "03",
            "subclass": "C",
            "main_group": "3",
            "subgroup": "014"
        }
    ]
}