{
    "title": "Refrigerator housing",
    "abstract": "Refrigerator housing including",
    "inventors": [
        "Müller",
        "Lorek"
    ],
    "document_number": "07296432",
    "publication_date": "20071120",
    "assignees": [
        "Dometic GmbH"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. Refrigerator housing including",
            "components": [
                {
                    "component": "an one-piece external housing made (",
                    "subcomponents": []
                },
                {
                    "component": "an internal housing (",
                    "subcomponents": []
                },
                {
                    "component": "said external housing (",
                    "subcomponents": []
                },
                {
                    "component": "said external housing (",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. Refrigerator housing as defined in claim 1 , characterized in that said internal housing (",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. Refrigerator housing as defined in one of the preceding claims, characterized in that said opening (",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. Refrigerator housing as defined in claim 1 , characterized in that said opening (",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. Refrigerator housing as defined in claim 1 , characterized in that said hollow space (",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. Refrigerator housing as defined in claim 5 , characterized in that said isolation material includes vacuum isolation panels.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. Refrigerator housing as defined in claim 5 , characterized in that said isolation material includes polyurethane foam and/or styrofoam and/or glass wool.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. Refrigerator housing as defined in claim 1 characterized in that one or several hinges or hinge elements (",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. Refrigerator housing as defined in claim 8 , characterized in that said hinge element or elements (",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. Refrigerator housing as defined in claim 8 or 9 , characterized in that said hinge element or elements are integrally formed with said external housing (",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. Refrigerator housing as defined in claim 1 , characterized in that said a condensation water outlet (",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. Refrigerator housing as defined in claim 1 , characterized in that said internal housing comprises recesses (",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. Refrigerator housing as defined in claim 1 , characterized in that said internal housing (",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. Refrigerator housing as defined in claim 1 , characterized in that said the electronics of a refrigerating unit or a component including electronics can be inset into said refrigerator housing.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. Refrigerator housing as defined in claim 1 , characterized in that at least one passage channel integrally formed with said internal housing (",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. Refrigerator housing as defined in claim 1 , characterized in that a door (",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. Refrigerator housing as defined claim 16 , characterized in that said door (",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. Refrigerator housing as defined claim 17 , characterized in that on said inside part (",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. Refrigerator housing as defined claim 17 or 18 , characterized in that between said inside part (",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. Refrigerator housing as defined in one of the claims 16 , characterized in that said door (",
            "components": []
        }
    ],
    "description": [
        "The invention relates to a refrigerator housing as defined in the preamble of claim 1, said housing preferably being used for absorption refrigerators, for hotel refrigerators or refrigerators in caravan vehicles in particular.",
        "Traditionally, refrigerator housings are assembled from several individual components which can be fitted into one another. Said multi-component composed housing comprises a hollow space between an internal housing and an external housing, said hollow space being filled with isolating material. However, filling with isolation material creates the problem that the assembled housing parts are not very stable and in addition sealing has to be provided for between the assembled components for avoiding exit of isolation material. This problem occurs in increased manner in case of the filling material being polyurethane foam since this foam penetrates through the gaps of the assembled housing components.",
        "From EP 0936428 A2 a refrigerator housing made from synthetic material, in accordance with the preamble of claim 1 is known. Said housing consists of an one-piece internal housing forming the cooling compartment and comprising an access opening, as well as of an external housing connected thereto. External and internal housing therein are welded together along said access opening so that a closed hollow space is formed between internal housing and external housing, which space for isolation purpose can be evacuated using a vacuum pump. In this housing it turns out to be disadvantageous that internal housing and external housing are built in shape of a trough so that after welding together of the two housing parts it is no longer possible to provide for isolation material in the hollow space created therebetween. As a consequence the hollow space had to be filled with isolation material prior to connecting the housing parts, this rendering the manufacturing process of said refrigerator housing complicated.",
        "In EP 0 587 456 B1 a refrigerator housing is disclosed, having an hermetically sealed hollow space between an internal housing and an external housing. In this housing, too, subsequent filling with isolation material is not possible.",
        "In the patent specification GB 840 855 a refrigerator housing of synthetic material is shown, comprising an external part and an internal part, between which a hollow space is provided for which is filled with foamed synthetic material for isolation. Said hollow space is filled from the front side of the housing and subsequently a frame is inserted into said front side between external part and internal part for sealing said hollow space. In this refrigerator housing, too, the problem arises that during filling with isolation material said inner part and said outer part are not mutually connected.",
        "It, therefore, is the object of the present invention to create a refrigerator housing which can be manufactured in more simple manner and at lower costs than the refrigerator housings under the state of art.",
        "This object is solved by the refrigerator housing as defined in claim 1. Preferred embodiments of said refrigerator housing are subject of the depending claims.",
        "The refrigerator housing in accordance with the present invention includes an one-piece external housing made from synthetic material as well as an one-piece internal housing also consisting of synthetic material, forming a cooling compartment and comprising an access opening. Said external housing and said internal housing in the area of said access opening on the front side are mutually connected in sealing manner, welded together or glued together in particular, and an isolating hollow space is formed between said internal housing and said external housing. Said external housing therein is embodied such that on its rear side it comprises an opening through which essentially the entire hollow space is accessible for introducing isolation material. Thereby filling of said hollow space with isolation material subsequently to welding together or glueing, respectively, together of said internal housing and said external housing is rendered possible so that it is not required to position internal housing or external housing by corresponding devices for filling purposes. Rather is a self-supporting housing formed after welding together of said internal housing and said external housing, whose shape predefines the hollow space. Thereby manufacture of said refrigerator housing is simplified essentially.",
        "In a particularly advantageous embodiment said external housing and said internal housing are injection-molded parts. This permits manufacture of a variety of different shapes of external housings and internal housings. In particular, it is possible to now form connecting parts, like e.g. a condensation water outlet or hinge elements, integrally with the housing parts. This also simplifies manufacture of the refrigerator housing, since it no longer is required to apply separate connection parts, by means of screwing e.g., to the housing.",
        "In the connection between internal housing and external housing in a preferred embodiment a synthetic material joining method, ultra-sonic welding e.g., is used, thereby a safe and sealed connection of the two parts by fusing together of the synthetic materials during welding being guaranteed.",
        "In a preferred embodiment of the invention the opening in the rear side of said external housing is covered by a cover plate for sealing the isolating hollow space. Preferably, the rear side of said external housing is completely open, i.e. the opening in said external housing is created by the side walls of said external housing.",
        "As isolation material by which said hollow space between internal housing and external housing can be filled, vacuum isolation panels can be used, which have excellent isolating properties. However, it also is possible to use less expensive isolation material, like e.g. polyurethane foam and/or styrofoam and/or glass wool or similar materials with isolating properties.",
        "In said external housing preferably one or several hinges or joint bushings, respectively, and/or pins, integrally formed with said external housing are provided for, which preferably serve for hanging up a refrigerator door. Said hinges therein in a preferred embodiment are formed as snap elements which permit latching of a hinge pin. Said snap elements have a double function, since on one hand they can be used as hinge bushings for a door or on the other hand as closing elements for the door, wherein for closing a corresponding pin of said refrigerator door latches in said snap element and thus locks the door. In addition or in alternative to the above-described integrated hinge elements which preferably are arranged in the upper region of said refrigerator housing, other and/or further hinges or hinge elements, respectively, can be provided for which are inset into said external housing in locking manner. Said hinges or hinge elements, respectively, preferably are arranged in the lower region of said refrigerator housing. By the interaction of an upper hinge with a lower hinge an axis of rotation is created around which said refrigerator door can be pivoted. Said hinges therein preferable are positioned in the corners of the front side of said refrigerator housing. The pivotal axis of a refrigerator door can thus be fixed by corresponding positioning of said lower and upper hinges in the right-hand or left-hand corners of said refrigerator housing and can in simple manner be exchanged by insetting the corresponding hinges or hinge elements, respectively, in the other housing corner.",
        "In a preferred embodiment in which said upper hinges or hinge elements, respectively, are integrally formed in said external housing and said lower hinges or hinge elements, respectively, are given as inset elements, by simply changing inset of said lower hinge elements the axis of rotation of said refrigerator door can be shifted from one side to the other side. This in particular is also true when on said external housing not only snap elements are provided for as hinge elements but e.g. also pin elements for receiving hinge bushings of said refrigerator door, as lower insettable hinge members in particular. Of course, it is, however, possible to provide for any suitable combination of snap and pin elements, the above-described variations being advantageous because of their simple manufacturability and flexibility. In particular, is also is preferred to provide for a pin element as upper hinge element in form of a pin which is detachably inserted in a counterbore, since the corresponding snap element as hinge bushing in the lower region is better suited for receiving the weight of said refrigerator door.",
        "Instead of the closing elements in form of snap elements and corresponding closure pins also other closing elements, like e.g. magnet arrangements, can be provided for.",
        "In a further preferred embodiment of the invention a condensation water outlet for condensation water from the cooling compartment is integrally formed with said internal housing. Thus, it is no longer required after finishing of said refrigerator housing to provide for corresponding bores through said internal housing, said hollow space filled with isolation material and said external housing for a condensated water outlet. This also reduces manufacturing costs and subsequent cleaning of said refrigerator housing due to drilling chips occurring in drilling is not required. In addition, in said internal housing preferably recesses are provided for inserting supporting or carrying elements for the latter, wherein the goods to be cooled can be positioned on said support elements like e.g. drawers, glass plates or the like.",
        "In a further embodiment said internal housing on its rear side has an opening into which the refrigerating unit of said refrigerator or parts thereof can be hung or passed through. In addition, said internal housing preferably is designed such that the electronics of said refrigerating unit or a component containing said electronics can be inset into said housing. Furthermore, said internal housing comprises a passage channel preferably formed integrally with said internal housing, a cable guide channel in particular, which serves for guidance of illumination cables. Thus, it is no longer required to fix corresponding cables to said internal housing and to seal them prior to filling said hollow space with isolation material. Consequently, manufacturing of said refrigerator housing is simplified.",
        "The housing in a preferred embodiment further comprises an door connected to said external housing. Said door therein preferably is formed of injection-molded plastic material by an inside part and an outside part, which are mutually connected in sealed manner, welded together or glued together in particular. On said inside part a sealing or part of a sealing is provided for, in order to seal off the cooling compartment of said refrigerating housing by said door.",
        "Said sealing between refrigerator door and housing can either be embodied as air chamber sealing, said elastic air chamber serving as sealing preferably being arranged on said refrigerator door. In particular, said sealing can also be embodied as integrated component of said door, injected therein in particular. This also is true for the case of air chamber sealing. In addition, however, also a sealing can be provided for which is pressed into a groove, wherein said sealing preferably comprises protrusions on the sides so that in cross-section they have the shape of a X-mas tree. If such sealing from an elastic material is pressed into a corresponding groove preferably on said housing, said lateral protrusions dig into said groove walls and thus form a reliable seal. Of course, the arrangement of said sealing or corresponding parts thereof on said door and said housing is exchangeable.",
        "Furthermore, said door comprises hinge pins and/or hinge bushings for fixation thereof on said refrigerator housing. For guaranteeing good isolation properties of the door, it preferably like said housing is filled with isolation material, polyurethane foam in particular.",
        "Further features, details and advantages of the invention will become evident from the following detailed description of an embodiment with reference to the attached drawing, wherein",
        "FIG. 1 shows a perspective front view of said internal housing of said refrigerator housing in accordance with the present invention;",
        "FIG. 2 shows a perspective rear view of said internal housing of FIG. 1;",
        "FIG. 3 shows a perspective front view of said external housing of said refrigerator housing in accordance with the present invention;",
        "FIG. 4 shows a perspective rear view of said external housing of FIG. 1;",
        "FIG. 5 shows a sectional view along the upper side of said external housing of FIG. 3;",
        "FIG. 6 shows a perspective front view of said refrigerator in accordance with the present invention, consisting of internal housing and external housing;",
        "FIG. 7 shows a longitudinal section through said housing of FIG. 6;",
        "FIG. 8 shows a perspective view of the inside of a refrigerator door of said refrigerator housing in accordance with the present invention and",
        "FIG. 9 shows a cross-section through said door of FIG. 8.",
        "The internal housing 1 of a preferred embodiment, shown in FIG. 1 is made from synthetic material and is manufactured by injection molding. Said internal housing is of essentially rectangular shape and has a front access opening 2. Said inside space of said internal housing in assembled condition of said refrigerator forms the cooling compartment in which the goods to be cooled are stored. Said internal housing on the side walls in addition comprises recesses 5 for insertion of deposit members which serve for storage of the goods to be cooled in said cooling compartment. As can be seen from FIG. 2 in particular, an opening 4 into which the refrigerating unit of said refrigerator can be hung is provided for on the rear side of said internal housing.",
        "Furthermore, on the rear side of said internal housing a condensation water outlet 3 is arranged. Due to manufacture of said housing by injection molding said condensation water outlet can be integrally formed with said internal housing. Thus, it is no longer required to subsequently provided for breaking-through bores for condensation water drainage in the already assembled refrigerator housing, pollution of said refrigerator housing by drilling chips being avoided.",
        "In accordance with a modification not shown, the rear side of said internal housing 1, however, can also be closed, wherein said refrigerating elements can be arranged behind said inside of said cooling compartment in particular in the hollow space between internal housing and external housing. E.g. said rear wall which is welded or glued to said external housing in the end of the manufacturing process for closing the opening in said external housing, said opening being provided for filling with isolation material, can comprise a passage through which the pipe connection between refrigerating elements arranged in the space between external housing and internal housing, and the remaining components of said refrigerator, e.g. an absorption refrigerating unit, can be passed. In such an embodiment the rear wall to be welded or glued thereto comprises means for hanging up said refrigerating unit or the parts, respectively, of said refrigerating unit to be arranged on the outside so that it can be hung in in simple manner. Using spacer ribs provided for on the outside of said rear wall said refrigerating unit is kept on distance to said rear wall. By foaming said passage of said rear wall and/or said space between rear wall, external housing and/or internal housing, respectively, said refrigerating unit in addition can be fixed in this position. Of course, as a matter of course also other possibilities of fixation are conceivable.",
        "From FIG. 3 a front view of said external housing of said refrigerator housing in accordance with the present invention is shown. Said external housing also consists of synthetic material and is manufactured by injection molding technology. Said external housing 6 on its front side comprises a circumferential rim 7. On the rear side said external housing 6 comprises an opening 11 formed by the side walls of said external housing, as can be seen from FIG. 4. Said rear side of said external housing thus is open and in the end of manufacture is closed with a rear wall which can also be welded or glued on. The upper side 8 of said external housing in its front region comprises two hinge bushings 9 which can be seen in more detail from the sectional view of FIG. 5. Said hinge bushings 9 are snap elements formed integrally or in one piece, respectively, with said housing, having semicircular elastic legs which on one side limit an opening, a so-called mouth, through which pins or studs with their longitudinal axis having an orientation perpendicular to the plane of drawing of FIG. 5 can be inserted or removed again. Into said snap elements said hinge pins of a door can be inserted. Said snap elements on one hand have the function of hinge bushings for guiding hinge pins and on the other hand can take over the function of a lock for locking hinge pins in these elements. In the lower region of said external housing furthermore guides 10 are provided for into which lower hinges or hinge elements, respectively, for connection with corresponding hinge elements of a door can be inset.",
        "From FIG. 6 a refrigerator housing in accordance with the present invention can be seen, wherein said internal and external housings described earlier now are welded together with one another by ultrasonic welding in the area of said access opening 2 along a welding seam S, wherein also other suitable joining methods are conceivable. For doing so said internal housing was inserted into said external housing through said rearward opening 11 thereof and subsequently welded together on the front side. Thereby a self-supporting housing was formed which then can be filled with isolation material through said opening 11 on the rear side. From the longitudinal section of FIG. 7 it can be seen that between internal housing 1 and external housing 6 a hollow space 12 is formed which is filled with isolation material, e.g. polyurethane foam, styrofoam, glass wool or similar materials with isolating properties. In this way simple manufacture of said refrigerator housing is rendered possible, since first of all a self-supporting housing is formed whose shape already defines the filling space for the isolation material. Thus, internal housing and external housing need not to be kept at a relative position with respect to one another during filling. Said hollow space 12 then again is closed from the rear side with a cover plate or rear wall 13. In said cover plate a corresponding opening is located for the condensation water outlet 3.",
        "From FIG. 8 a perspective view of the inside of a refrigerator door can be seen, which can be hung into said refrigerator housing in accordance with the present invention. For this purpose said door in its corners has hinge pins 16 which cooperate with said snap elements 9 of said external housing. Said door consists of injection-molded synthetic material, a sealing 15 being injected to said inside for sealing of said cooling compartment. As sealing element herein air chamber seals or other elastic seals can be used, which also can be put or glued on and which can engage with an opposing groove in particular. As can be seen from the sectional view of FIG. 9, said door includes an injection-molded inside part 17 and an injection-molded outside part 18 which are welded together by ultrasonic welding. From FIG. 9 in addition the sealing 15 applied by injection molding can be seen. The hollow space between inside part 17 and outside part 18 preferably is filled with isolation material, e.g. polyurethane foam or similar materials."
    ],
    "citations": [
        "2095847",
        "3989328",
        "4123130",
        "4199205",
        "4609234",
        "4725107",
        "5473901",
        "5638896",
        "5765379",
        "6101819",
        "6109712",
        "6150026",
        "6209265",
        "86 29 578",
        "197 12 140",
        "197 45 826",
        "198 08 227",
        "0 660 448",
        "0 753 710",
        "2 452 685",
        "2 175 384",
        "2 191 852",
        "5-65180"
    ],
    "us_classification": "62440",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "F",
            "classification_class": "25",
            "subclass": "D",
            "main_group": "11",
            "subgroup": "00"
        }
    ]
}