{
    "title": "Method and apparatus for providing a polynomial based virtual age estimation for remaining lifetime prediction of a system",
    "abstract": "A method for providing a virtual age estimation for predicting the remaining lifetime of a device of a given type, comprises the steps of monitoring a predetermined number of significant parameters of respective ones of a training set of devices of the given type, the parameters contributing respective wear increments, determining coefficients of a multivariate Hermite polynomial for modeling the wear increments determined from the training set operated to failure and whereof the respective virtual ages are normalized substantially to a desired norm value, deriving from the multivariate Hermite polynomial a formula for virtual age of a device of the given type, and applying the formula to the significant parameters from a further device of the given type for deriving wear increments for the further device.",
    "inventors": [
        "Loecher",
        "Darken"
    ],
    "document_number": "07299162",
    "publication_date": "20071120",
    "assignees": [
        "Siemens Corporate Research, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A method for providing a virtual age estimation for predicting the remaining lifetime of a device of a given type, comprising the steps of:",
            "components": [
                {
                    "component": "monitoring a predetermined number of significant parameters of respective ones of a training set of devices of said given type, said parameters contributing respective wear increments;",
                    "subcomponents": []
                },
                {
                    "component": "determining coefficients of a multivariate Hermite polynomial for modeling said wear increments determined from said training set operated to failure and whereof the respective virtual ages are normalized substantially to a desired norm value;",
                    "subcomponents": []
                },
                {
                    "component": "deriving from said multivariate Hermite polynomial a formula for virtual age of a device of said given type; and",
                    "subcomponents": []
                },
                {
                    "component": "applying said formula to said significant parameters from a further device of the said given type for deriving wear increments for said further device.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. A method for providing a virtual age estimation as recited in claim 1 , including a step of cumulating said further device so as to derive a virtual age estimation for said further device.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. A method for providing a virtual age estimation as recited in claim 1 , including a step of selecting said predetermined number of significant parameters by selecting a number thereof so as to minimize deviations of said virtual ages from said normalized virtual age.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. A method for providing a virtual age estimation for devices of a given type by predicting the remaining lifetime of a further device of said given type by computing wear increments, comprising the steps of:",
            "components": [
                {
                    "component": "collecting data on parameters contributing wear increments in a training set of sample devices until failure, said sample devices being similar to said given device;",
                    "subcomponents": []
                },
                {
                    "component": "modeling a wear increment by a multivariate Hermite polynomial of degree k;",
                    "subcomponents": []
                },
                {
                    "component": "computing the sum of increments for individual sample devices in said training set to obtain a virtual age therefore, said virtual age being normalized substantially to a convenient normalized virtual age; and",
                    "subcomponents": []
                },
                {
                    "component": "determining coefficients of said multivariate Hermite polynomial in a supervised training phase of said sample devices in said training set for said normalized virtual age; and",
                    "subcomponents": []
                },
                {
                    "component": "deriving incremental wear data for a further device, similar to said sample devices, by utilizing device data for said further device in conjunction with said coefficients of said multivariate Hermite polynomial determined in the preceding step.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. A method for providing a virtual age estimation for devices as recited in claim 4 , including a step of cumulating said incremental wear data to derive a virtual age for said further device.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A method for providing a virtual age estimation for devices as recited in claim 4 , wherein said step of determining coefficients of said multivariate Hermite polynomial comprises a step of optimizing said determining by utilizing Ridge regression.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. A method for providing a virtual age estimation for devices as recited in claim 6 , wherein said step utilizing Ridge regression includes a step of optimizing by cross validation between devices in a subset of said training set and the remainder of devices in said training set.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. A method for providing a virtual age estimation for devices as recited in claim 4 , wherein said step of determining coefficients of said multivariate Hermite polynomial includes a step of optimizing said coefficients for reducing deviations of said virtual ages from said normalized virtual age.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A method for providing a virtual age estimation for devices as recited in claim 6 , wherein said step of optimizing said coefficients includes a step of minimizing the sum of least squares of said deviations.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. A method for providing a virtual age estimation for devices by predicting the remaining lifetime of a given device by computing wear increments, comprising the steps of:",
            "components": [
                {
                    "component": "modeling wear increments by a Hermite polynomial based on selected wear parameters which contribute wear increments for said devices;",
                    "subcomponents": []
                },
                {
                    "component": "adjusting coefficients of said polynomial in accordance with data derived in a training set of such devices for deriving an equation for increments of virtual age for each device in said training set, said virtual ages being normalized substantially to a desired standard value; and",
                    "subcomponents": []
                },
                {
                    "component": "applying said equation to said selected wear parameters of a further device similar to devices in said training set for computing wear increments for said further device.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. A method for providing a virtual age estimation for devices as recited in claim 10 , including a step of cumulating said wear increments for said further device for computing a virtual age for said further device.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. A method for providing a virtual age estimation for devices as recited in claim 10 , wherein said step of determining coefficients of said multivariate Hermite polynomial comprises a step of optimizing said determining by utilizing Ridge regression.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. A method for providing a virtual age estimation for devices as recited in claim 12 , wherein said step utilizing Ridge regression includes a step of optimizing by cross validation between devices in a subset of said training set and the remainder of devices in said training set.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A method for providing a virtual age estimation for devices as recited in claim 10 , wherein said step of determining coefficients of said multivariate Hermite polynomial includes a step of optimizing said coefficients for reducing deviations of said virtual ages from said normalized virtual age.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. A method for providing a virtual age estimation for devices as recited in claim 14 , wherein said step of optimizing said coefficients includes a step of minimizing the sum of least squares of said deviations.",
            "components": []
        }
    ],
    "description": [
        "Reference is hereby made to:",
        "U.S. Provisional Patent Application No. 60/255,615 filed Dec. 14, 2000 for NEURAL NETWORK-BASED VIRTUAL AGE ESTIMIATION FOR REMAINING LIFETIME, in the names of Christian Darken and Markus Loecher;",
        "U.S. Provisional Patent Application No. 60/255,614 filed Dec. 14, 2000 for POLYNOMIAL BASED VIRTUAL AGE ESTIMIATION FOR REMAINING LIFETIME PREDICTION, in the names of Markus Loecher and Christian Darken; and",
        "U.S. Provisional Patent Application No. 60/255,613 filed Dec. 14, 2000 for MARKOV TRANSITION PROBABILITIES FOR PREDICTIVE MAINTENANCE, in the name of Markus Loecher, of which priority is claimed and whereof the disclosures are hereby incorporated herein by reference.",
        "Reference is also made to copending patent applications being filed on even date herewith:",
        "METHOD AND APPARATUS FOR PROVIDING A VIRTUAL AGE ESTIMATION FOR REMAINING LIFETIME PREDICTION OF A SYSTEM USING NEURAL NETWORKS, in the names of Christian Darken and Markus Loecher, Ser. No. 10/017,015, and METHOD AND APPARATUS FOR PROVIDING PREDICTIVE MAINTENANCE OF A DEVICE BY USING MARKOV TRANSITION PROBABILITIES, in the name of Markus Loecher, Ser. No. 10/017,013, and whereof the disclosures are hereby incorporated herein by reference.",
        "The present invention relates generally to the field of failure prediction and, more specifically to deriving an estimate of the remaining lifetime of a generic system or apparatus.",
        "Devices and apparatus used in various fields of medicine, industry, transportation, communications, and so forth, typically have a certain useful or operational life, after which replacement, repair, or maintenance is needed. Generally, the expected length of the operational life is known only approximately and, not untypically, premature failure is a possibility. Simple running time criteria are typically inadequate to provide timely indication of an incipient failure. In some applications, unanticipated failure of devices constitutes a at least a nuisance; however, more typically, unanticipated device failure may be a major nuisance leading to costly interruption of services and production. In other cases, such unexpected failure can seriously compromise safety and may result in potentially dangerous and life-threatening situations.",
        "In accordance with an aspect of the invention, a weighted history of monitored variables is used to compute a system's “virtual age”, which is then compared with a fixed threshold.",
        "In accordance with an aspect of the invention, a method for providing a virtual age estimation for predicting the remaining lifetime of a device of a given type, comprises the steps of monitoring a predetermined number of significant parameters of respective ones of a training set of devices of the given type, the parameters contributing respective wear increments, determining coefficients of a multivariate Hermite polynomial for modeling the wear increments determined from the training set operated to failure and whereof the respective virtual ages are normalized substantially to a desired norm value, deriving from the multivariate Hermite polynomial a formula for virtual age of a device of the given type, and applying the formula to the significant parameters from a further device of the given type for deriving wear increments for the further device.",
        "The method will be more fully understood from the following detailed description of preferred embodiments, in conjunction with the Drawing, in which:",
        "FIG. 1 shows a diagrammatic flow chart of steps in accordance with the principles of the invention; and",
        "FIG. 2 shows a block diagram for apparatus in accordance with the principles of the invention.",
        "In FIG. 1, step 2 involves collecting data histories of devices until failure. In general this will conform to a matrix with N rows (uses) and M columns (variables).",
        "In step 4, a polynomial of degree d is chosen and a data matrix C is computed, and solving for linear weights a using Ridge regression. Cross validation is used for optimizing as will be further explained.",
        "In step 6, linear weights a and degree are used to compute wear increments for devices in operation.",
        "In step 8, a warning is produced if the sum of wear increments, that is, the virtual age, crosses a user specified threshold.",
        "10 generally indicates the use of cross validation to optimize the number of variables to be used and the degree of the polynomial.",
        "In FIG. 2, a computer 20 is equipped with data and program storage equipment 22 and a source 26 of programs for training and operating in an interactive manner as hereinafter described. Data from training sessions as further explained below is provided at 24. A device or system 28 which is being monitored provides data by way of data collection interface unit 30 to computer 20. Computer 20 provides an imminent or prospective alarm as to lifetime expiration and/or failure expectation at an alarm device 32.",
        "The method in accordance with the present invention is widely applicable in many fields. In order to facilitate understanding of the invention and to illustrate the use of device-specific information and parameters, the invention will next be more fully described by way of an exemplary, non-limiting embodiment relating to X-ray tubes; where appropriate, generally applicable notions are also stated in the context of the specific exemplary embodiment. The example used is also appropriate in that an unexpected failure of such an X-ray tube, for example during a critical surgical procedure, should be avoided insofar as is possible.",
        "Suppose, xn=(x1,n . . . xd,n) is a time-series of d-dimensional measurement vectors. The individual scalars xi could be any quantity affecting the rate of wear or ageing of the device, including directly measured physical quantities such as temperature or voltage or composite functions thereof such as, for example, power (product of voltage and current) or temperature difference, or e.g. control parameters such as load settings and time of operation. The choice of both the number d and kind of variables, which usually is only a small subset of available measurements, can be done following existing variable selection to techniques. In the X-ray tube case, it turns out to have been possible to perform an exhaustive search, which selected the d unique scalars that minimized the cross validation (CV) error as will be explained in more detail below.",
        "During the life of the device there will be typically many thousands of vectors, each of which contributes a small increment to the total wear. It is herein proposed to reduce the uncertainty in remaining lifetime estimation by the following method:",
        "We model the wear increment by a multivariate Hermite polynomial of degree k, i.e. denote the univariate Hermite polynomial of degree k by Hk(x):",
        "f\n    ⁡\n    \n      (\n      \n        \n          x\n          →\n        \n        n\n      \n      )\n    \n  \n  =\n  \n    \n      H\n      0\n    \n    +\n    \n      \n        ∑\n        \n          j\n          =\n          1\n        \n        k\n      \n      ⁢\n      \n        \n          ∑\n          \n            \n              \n                i\n                1\n              \n              +\n              …\n              +\n              \n                i\n                d\n              \n            \n            =\n            j\n          \n        \n        ⁢\n        \n          \n            a\n            \n              \n                i\n                1\n              \n              ,\n              …\n              ,\n              \n                i\n                d\n              \n            \n          \n          ⁢\n          \n            \n              ∏\n              \n                z\n                =\n                1\n              \n              d\n            \n            ⁢\n            \n              \n                H\n                \n                  i\n                  z\n                \n              \n              ⁡\n              \n                (\n                \n                  x\n                  \n                    \n                      i\n                      z\n                    \n                    ,\n                    n\n                  \n                \n                )\n              \n            \n          \n        \n      \n    \n  \n\n\n\n\nNote that this sum can be conveniently rewritten into a sum of M terms of the form",
        "f\n    ⁡\n    \n      (\n      \n        \n          x\n          →\n        \n        n\n      \n      )\n    \n  \n  =\n  \n    \n      ∑\n      \n        j\n        =\n        0\n      \n      \n        M\n        -\n        1\n      \n    \n    ⁢\n    \n      \n        a\n        j\n      \n      ⁢\n      \n        \n          f\n          j\n        \n        ⁡\n        \n          (\n          \n            \n              x\n              →\n            \n            n\n          \n          )\n        \n      \n    \n  \n\n\n\n\nwhere",
        "M\n  =\n  \n    \n      (\n      \n        \n          \n            \n              k\n              +\n              d\n            \n          \n        \n        \n          \n            k\n          \n        \n      \n      )\n    \n    =\n    \n      \n        \n          (\n          \n            k\n            +\n            d\n          \n          )\n        \n        !\n      \n      \n        \n          k\n          !\n        \n        ⁢\n        \n          d\n          !\n        \n      \n    \n  \n\n\n\n\nis the number of coefficients aj. The degree k and hence the number of coefficients M is a free parameter, which again should be optimized by cross validation.",
        "Hermite polynomials can be computed in a straightforward fashion via the recurrence formula\n\nHn+1(x)=2xHn(x)−2nHn−1(x),H0(x)=1, H1(x)=2x",
        "We determine the M coefficients aj in the supervised training phase as follows:",
        "Suppose, there are N device histories of tubes, which eventually failed, indexed by k. This constitutes our training set. Denote the number of vectors for each device by Lk. For each device we compute the M independent sums over all wear increments, which naturally depend on the M unknown coefficients:",
        "C\n    \n      z\n      ,\n      j\n    \n  \n  =\n  \n    \n      ∑\n      \n        n\n        =\n        1\n      \n      \n        L\n        z\n      \n    \n    ⁢\n    \n      \n        f\n        j\n      \n      ⁡\n      \n        (\n        \n          \n            x\n            →\n          \n          n\n          z\n        \n        )",
        "This yields a (N×M) matrix (C)z,j and N equations for the virtual age of each device, which will have the form",
        "(\n      VirtualAge\n      )\n    \n    z\n  \n  =\n  \n    \n      ∑\n      \n        j\n        =\n        0\n      \n      \n        M\n        -\n        1\n      \n    \n    ⁢\n    \n      \n        a\n        j\n      \n      ⁢\n      \n        C\n        \n          z\n          ,\n          j",
        "Ideally, the virtual ages for each device would be normalized to the same value, say 1 (one). In order to find the best weights, such that all virtual ages are as closes as possible to an arbitrary constant (we choose 1), we propose to minimize the sum-of-squared-error criterion function\n\nJ({right arrow over (a)})=∥ C·{right arrow over (a)}−{right arrow over (1)}∥2+λ{right arrow over (a)}T B{right arrow over (a)}",
        "The first term on the right side corresponds to the ordinary linear least squares regression. The additional term involving λ, is intended to improve the generalizability and avoid over fitting. This technique is referred to as ridge regression in the literature. The parameter λ should be optimized via cross validation. The matrix B is positive definite and for the X-ray tubes was taken to be the identity matrix.",
        "In the case of missing data, i.e. if for a particular device z only a fraction ƒz of data is available, we have to replace the constant vector 1 with the device dependent vector f:\n\n( C−λ B)·{right arrow over (a)}={right arrow over (ƒ)}",
        "After determining the coefficients a for the N devices in the training set, it is proposed in accordance with the embodiment of the invention to estimate the remaining lifetime of devices in the same family by computing the incremental (and resulting cumulative) wear according to equation (2). Since the virtual age was normalized to one (1), the cumulative wear directly yields the fractional life that has elapsed.",
        "The applicability of the principles of cross correlation in the context of the present invention is next addressed. K-fold cross validation is a well known technique to estimate the test error of a predictor if the available data set (size n) is too small to allow the split into training and test sets. Instead, we iterate the splitting process by dividing the data into a “small” part of k elements and use the remaining n-k elements for training. The test errors on the small k-set are then averaged to yield the k-fold cross validation error. In the X-ray tube example, the data set comprised approximately 70 tubes (n˜70) and we chose k˜1-5.",
        "It will be understood that the invention may be implemented in a number of ways, utilizing available hardware and software technologies. Implementation by way of a programmable digital computer is suitable, with or without the addition of supplemental apparatus. A dedicated system may also be used, with a dedicated programmed computer and appropriate peripheral equipment. When various functions and subfunctions are implemented in software, subsequent changes and improvements to the operation are readily implemented.",
        "While the present invention has been described by way of illustrative embodiments, it will be understood by one of skill in the art to which it pertains that various changes and modifications may be made without departing from the spirit of the invention. Such changes and modifications are intended to be within the scope of the claims following."
    ],
    "citations": [
        "5060279",
        "5331579",
        "5465321",
        "5719675",
        "6031246",
        "6208953",
        "6226597",
        "6363332",
        "6369815",
        "6386018",
        "6424930",
        "6453009",
        "6754601",
        "6820038"
    ],
    "us_classification": "703  2",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "G",
            "classification_class": "06",
            "subclass": "F",
            "main_group": "17",
            "subgroup": "10"
        }
    ]
}