{
    "title": "Composite polymer microfluidic control device",
    "abstract": "A device for microfluidic control comprising a regulator that is moveable in a conduit where the regulator is a composite polymer formed from a composite mixture comprising a polymerizable precursor and a particulate filler.",
    "inventors": [
        "Rehm",
        "Paul",
        "Cyr"
    ],
    "document_number": "07296592",
    "publication_date": "20071120",
    "assignees": [
        "Eksigent Technologies, LLC"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A microfluidic device comprising:",
            "components": [
                {
                    "component": "a. a substrate;",
                    "subcomponents": []
                },
                {
                    "component": "b. a conduit within said substrate, said conduit having an inner diameter between 0.1 μm and 1000 μm, and having first and second ends; and,",
                    "subcomponents": []
                },
                {
                    "component": "c. a composite mobile element within said conduit between said first and second ends, said mobile element comprising:",
                    "subcomponents": [
                        "i. a polymer matrix; and,",
                        "ii. polymeric particles dispersed within said element;",
                        "wherein when a fluid pressure is applied to said first end, said element slides away from said first end and towards said second end, and said element only sliding along one axis within said conduit."
                    ]
                },
                {
                    "component": "i. a polymer matrix; and,",
                    "subcomponents": []
                },
                {
                    "component": "ii. polymeric particles dispersed within said element;",
                    "subcomponents": [
                        "wherein when a fluid pressure is applied to said first end, said element slides away from said first end and towards said second end, and said element only sliding along one axis within said conduit."
                    ]
                },
                {
                    "component": "wherein when a fluid pressure is applied to said first end, said element slides away from said first end and towards said second end, and said element only sliding along one axis within said conduit.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The microfluidic device of claim 1 , wherein said polymeric particles are not chemically bound to said polymer matrix.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The microfluidic device of claim 1 , wherein said polymeric particles are chemically bound to said polymer matrix.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The microfluidic device of claim 1 , wherein said polymer matrix contains a polymer of a halogenated acrylate monomer.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The microfluidic device of claim 4 wherein the halogenated acrylate monomer is a fluorinated acrylate.",
            "components": []
        }
    ],
    "description": [
        "Microfluidic systems, that is, systems or devices having channels or chambers that are fabricated on the micron or submicron scale, are used to perform a multitude of chemical and physical processes on a micro-scale. Individual components of the microfluidic systems can be used alone or together, for example, to control or measure the transport of fluid inside microchannels. Typical applications for microfluidic systems include analytical and medical instrumentation, industrial process control equipment, and liquid and gas phase chromatography. In these systems, methods to reliably aliquot volumes of sample from one conduit into a second conduit are important for performance of the analysis. In some cases, sample volumes as small as 1 nL are required for analysis, which is a volume too small to be reliably dispensed by known macroscale methods, such as conventional valves or pipettes. It would be advantageous to have a microfluidic system that could be used with a wide range of processes and process liquids and could be fabricated on a microchip platform. It would also be advantageous to have a device with a fast response time and precise control over small sample volumes and flows.",
        "Microfluidic control devices, such as microvalves manufactured from silicon or elastomers, including devices fabricated from hydrogels, soft elastomers with control lines embossed in a substrate, and devices fabricated with structures that are free to move within microchannels are currently known. More information on these devices can be found in Shoji and Esashi, J., Micromech. Microeng., 4, 157-171, 1994; Beebe et al., Nature, 404, 588-590, April, 2000; Unger et al., Science, 288, 113-116, April, 2000; and Rehm et al., uTAS 2001, 227-229, October, 2001. Disadvantageously, however, these devices suffer from one or more of the disadvantages of not being easily integrated into microchip platforms, have excess dead volume, high power requirements, slow response times, are difficult and costly to manufacture and assemble, are able to withstand only modest pressure differentials, are restricted to a narrow range of processes and process liquids, are subject to solvent-induced deformation effects, exhibit performance variations from minor variations in material properties, and respond poorly to solvent-induced shrinkage and swelling.",
        "Therefore, there is a need for a microfluidic control device that has a fast response time, precise control over small gas and liquid flows, and precise control over small gas and liquid volumes in the channels and chambers of microfluidic systems. There is also a need for a microfluidic control device that can be integrated into a microchip platform and is compatible with a wide range of chemical solvents that are used in microfluidic systems.",
        "According to the present invention, a device for microfluidic control is provided. The device comprises a conduit having a first end and a second end, a first path in fluid flow contact with the conduit, a second path in fluid flow contact with the conduit, and a regulator that is moveable in the conduit. The regulator has an outer dimension that is larger than the first end and the second end so the regulator cannot pass out of the conduit and is comprised of a substantially elastic material having a structural component, which can be a composite polymer formed from a composite mixture comprising a polymerizable precursor and a particulate filler. The composite mixture can additionally comprise a photo-initiator, and/or two or more polymerizable precursors. Optionally, the device can have a plurality of paths, such as first, second, and third paths, where each path is in fluid flow contact with the conduit, and/or a plurality of regulators that are movable in a conduit. The regulator can be substantially incompressible, have optical properties, and/or have a substantially stable volume when exposed to a fluid. Further, the regulator can be formed from a composite mixture in the conduit by the in situ polymerization of the composite mixture with an energy source. The composite mixture can additionally comprise a photo-initiator and the energy source can be a radiating light source. The regulator can also be substantially cylindrically shaped and moveable in a back and forth motion or reciprocating motion within the conduit. Alternately, the regulator can be substantially toothed wheel shaped and rotationally moveable within the conduit. The device can additionally comprise a substrate where the conduit, and/or a plurality of conduits are in the substrate. Optionally, the substrate can have an axle and the regulator can be substantially toothed wheel shaped and rotationally moveable around the axle.",
        "A system for microfluidic control comprising a plurality of conduits is also provided, where each conduit has a first end and a second end, a first path in fluid flow contact with one or more conduit, a second path in fluid flow contact with one or more conduit, and a plurality of regulators, each regulator being independently moveable in a separate conduit. Each regulator has an outer diameter that is larger than the first end and the second end so each regulator cannot pass out of the conduit, and is comprised of a substantially elastic material having a structural component.",
        "The device can be fabricated by combining a polymerizable precursor and a particulate filler to form a composite mixture, introducing the composite mixture into a conduit, and exposing the conduit to an energy source to polymerize the composite mixture in situ thereby forming a regulator. The composite mixture can additionally comprise a photo-initiator and the conduit can be exposed to a radiating light source through a mask to form the regulator. Additionally, the device can have two or more regulators within each conduit, and/or unpolymerized composite mixture can be removed from the conduit. Optionally, a substrate having a plurality of conduits can be selected and the composite mixture can be introduced into each conduit, thereby forming a plurality of regulators. The substrate can have three or more conduits and the composite mixture can be introduced into three or more conduits to form three or more regulators on the same substrate. One or more of the conduits can be exposed to a radiating light to form one or more substantially cylindrically shaped regulators and each substantially cylindrically shaped regulator can be moveable in a back and forth motion within the conduit. Alternately, one or more of the conduits can be exposed to a radiating light to form one or more substantially toothed wheel shaped regulators and each substantially toothed wheel shaped regulator can be rotationally moveable within the conduit. The substrate can additionally have an axle and the conduit can be exposed to a radiating light to form a substantially toothed wheel shaped regulator around the axle.",
        "The device can be used for determining a fluid flow rate in a microfluidic device by moving a fluid with a viscosity past a regulator, thereby moving the regulator at the fluid flow rate. A radiating light is directed to a portion of the regulator such that the radiating light is reflected or transmitted to a detector and the reflected or transmitted light is measured as a periodic signal in time. Then, the signal is processed and the frequency of the signal is determined, followed by relating the signal frequency to the fluid flow rate. The radiating light can be reflected or transmitted to a plurality of detectors. Also, a plurality of radiating lights can be directed to the regulator and the radiating lights can be reflected or transmitted to a plurality of detectors. A device for microfluidic control as described above having a substantially toothed wheel shaped regulator can be used to determine fluid flow rate and the radiating light can be directed to a toothed portion of the regulator such that the radiating light is reflected or transmitted to the detector.",
        "These and other features, aspects and advantages of the present invention will become better understood from the following description, appended claims, and accompanying drawings where:",
        "FIG. 1A, 1B and 1C schematically show a microfluidic control device where the device is a composite check valve according to the present invention;",
        "FIG. 2A, 2B, 2C, and 2D schematically show a microfluidic control device where the device is a composite check valve with an integrated flow path according to the present invention;",
        "FIG. 3A and 3B schematically show a system comprising a plurality of microfluidic control devices where the system is a used as a fluid dispenser according to the present invention;",
        "FIG. 4A and 4B schematically show a microfluidic control device where the device is a mixing valve according to the present invention;",
        "FIG. 5A and 5B schematically show a microfluidic control device where the device is a flow meter comprising a substantially toothed wheel shaped regulator that is rotationally moveable within a conduit according to the present invention;",
        "FIG. 6 schematically shows a microfluidic control device where the device comprises a plurality of gears used to perform mechanical work according the present invention;",
        "FIG. 7 schematically shows a method of making a device for microfluidic control according to the seventh embodiment of the present invention; and",
        "FIG. 8 is a flow chart showing a method of using a device for microfluidic control for determining a fluid flow rate according to the present invention.",
        "According to one embodiment of the present invention, there is provided a device for microfluidic control. The device comprises a regulator that is moveable in a conduit and is formed from a composite mixture comprising a polymerizable precursor and a particulate filler. The use of a particulate filler in the regulator confers a wide range of desirable properties to the regulator, such as, a range of rigidity versus flexibility, additional tensile and compressive strength, optical properties, and dimensional stability. The regulator can operate under high pressure, such as thousands of pounds per square inch (psi), and the addition of the particulate filler to the regulator provides substantial advantages in reduced compressibility. Further, the microfluidic control device of the present invention has a fast response time and precise control over small gas and liquid flows and small gas and liquid volumes in the channels and chambers of the microfluidic system. Further, the microfluidic control device can be integrated into a substrate, such as a microchip platform.",
        "The microfluidic control device of the present invention can include interconnecting conduits that can be filled with fluids. These devices can be used for analytical procedures such as analysis of chemical and biological substances. Examples of such devices include high-performance liquid chromatography (HPLC) and flow-injection analysis (FIA).",
        "As used in this disclosure, the following terms have the specified meanings.",
        "The term “composite polymer” means a material obtained by the polymerization of a mixture of a particulate filler and one or more polymerizable precursors.",
        "The term “conduit” means any of various channels or networks of channels including capillaries and tubing.",
        "The term “elastic material” means a material that recovers its original shape partially or completely after a deforming force has been removed.",
        "The term “fluid” means any of various liquids, gasses, or loose solid materials in bulk.",
        "The term “micro-scale” means a micron or submicron scale, that is, having at least one cross-sectional dimension in the range from about 0.1 μm to about 500 μm.",
        "The term “microfluidic” means a system or device having channels or chambers that are on the micro-scale.",
        "The term “monolithic polymer” means a polymerized polymerizable precursor without a particulate filler.",
        "The term “regulator” means any of various devices by which a fluid flow can be started, stopped, or adjusted by a movable part that opens, shuts, or partially obstructs one or more openings.",
        "The term “structural component” means a particle or a part affecting the structure, composition, physical make-up, or nature of a substance.",
        "The term “substrate” means a chip with lithographically fabricated microchannels or conduits, and includes other conduit and channel networks such as capillaries and tubing.",
        "The term “comprise” and variations of the term, such as “comprising” and “comprises,” are not intended to exclude other additives, components, integers or steps.",
        "All dimensions specified in this disclosure are by way of example only and are not intended to be limiting. Further, the proportions shown in these Figures are not necessarily to scale. As will be understood by those with skill in the art with reference to this disclosure, the actual dimensions of any device or part of a device disclosed in this disclosure will be determined by intended use.",
        "All amounts disclosed herein as a percentage is a weight percent of the total weight of the composition.",
        "Referring now to FIG. 1A and 1B, there is schematically shown a microfluidic control device 10 where the device is a composite check valve according to the present invention. The device comprises a conduit 11 having a first end 12 and a second end 13. The conduit has a first path 14 and a second path 15 that are in fluid flow contact with the conduit 11. The device also has a regulator 16 that is moveable in the conduit 11. Referring now to FIG. 1B, and 1C, the regulator 16 has an outer dimension 17 that is larger than the first end 12 and the second end 13 so the regulator 16 cannot pass out of the conduit 11. FIG. 1C shows the cross-sectional configuration of the regulator 16 at position A-A of FIG. 1B, which illustrates the outer dimension 17 of the regulator 16. The regulator 16 is comprised of a substantially elastic material having a structural component which can be a composite polymer formed from a composite mixture comprising a polymerizable precursor and a particulate filler.",
        "According to one embodiment of the present invention, as shown in FIG. 1A and 1B, the regulator 16 is a composite check valve comprising a conduit 11 having walls fabricated in such a way that the shape of the conduit 11 encloses the regulator 16. The regulator 16 is movable in the conduit in a reciprocating, that is, a back and forth, or piston-like motion. The motion of the regulator 16 is stopped by an altered conduit geometry. The altered conduit geometry creates a barrier, also referred to herein as a weir, in the conduit 11 so that the regulator 16 cannot pass out of the conduit. In a preferred, but not required embodiment, the geometry of the conduit 11 is altered by changing the depth, width, diameter or shape of the conduit, or inserting another material between the regulator 16 and the conduit 11, such as a porous membrane, that allows fluid flow but prevents the regulator 16 from passing out of the conduit. In a most preferred but not required embodiment, the regulator 16 is a sliding piece that is substantially cylindrically shaped moved by or moving against fluid pressure in a back and forth motion within a cylindrically shaped conduit 11. The movement of the regulator 16 is stopped by narrowing the diameter of the conduit 11. However, other regulator and conduit geometries can be used for stopping the motion of the regulator, as will be understood by those of skill in the art with reference to this disclosure.",
        "The device 10 can additionally comprise an interconnecting conduit 18 that provides a route for fluid to be redirected around the regulator 16 when the regulator 16 is seated against the conduit second end 13, as shown in FIG. 1A. As shown in FIG. 1B, fluid does not pass through the conduit 11 when the regulator 16 is seated against the conduit first end 12.",
        "Referring now to FIG. 2A, 2B, 2C, and 2D, which schematically show microfluidic control devices according to the present invention, where the device is a composite check valve with an integrated flow path. According to this embodiment, a detached flow path 18, as shown in FIG. 1A and 1B, is not needed for fluid flow. The device 30 comprises a conduit 31 having a first end 32 and a second end 33. The conduit has a first path 34 that is in fluid flow contact with the conduit 31 and a second path 35 that is in fluid flow contact with the conduit 31. The device also has a regulator 36 that is moveable in the conduit. The regulator has an outer diameter 37 that is larger than the first end 32 and the second end 33 so the regulator 36 cannot pass out of the conduit 31. The regulator 36 is comprised of a substantially elastic material having a structural component. In a preferred but not required embodiment, the regulator 36 is a composite polymer obtained by photoinitiated polymerization of a mixture of particulate filler and one or more polymerizable precursors.",
        "Referring again to FIG. 2A and 2B, FIG. 2A shows fluid flow into the device, which actuates the regulator 36 until the regulator 36 rests against the second end 33. A gap between the second end 33 and the regulator 36 allows unobstructed fluid flow between the first path 34, which is an inlet, and the second path 35, which is an outlet. FIG. 2B shows the device stopping fluid flow in the opposite direction. Fluid entering from the second end 35 actuates the regulator 36 until its rests against the first end 32. The fluid path is blocked and no flow is allowed from the second path 35 to the first path 34. Referring again to FIG. 2C and 2D, which schematically show an embodiment of the invention where there is no conduit end directly between the second path 35 and the regulator 36. According to this embodiment, the second end 33, which is a side weir, provides the same functionality as the second end 33 shown in FIG. 2A and 2B.",
        "Referring now to FIG. 3A and 3B, a system comprising a plurality of microfluidic control devices is schematically shown. In this system, multiple regulators are combined to create a system used for dispensing fluid from a sample source, that is, a sample dispenser. FIG. 3A and 3B show a system comprising a conduit 41, 42, and 43 where each conduit 41, 42, and 43 has a first end 44, 45, and 46, respectively, and a second end 47, 48, and 49, respectively. A first path 50, from a sample source, is in fluid flow contact with the conduit 41, 42, and 43, respectively. A second path 51, from a fluid source, is in fluid flow contact with the conduit 41 and 43, respectively. A flow path 55 is in fluid flow contact with an actuation source. Each regulator 52, 53, and 54 is moveable in the conduit 41, 42, and 43, respectively, and the outer diameter of each regulator 52, 53, and 54 is larger than the first end 44, 45, and 46, respectively, and the second end 47, 48, and 49, respectively, so each regulator cannot pass out of the respective conduit 41, 42, and 43. Further, each regulator 52, 53, and 54 is comprised of a substantially elastic material having a structural component. In a preferred but not required embodiment, the regulator 52, 53, and 54 is a composite polymer obtained by photoinitiated polymerization of a mixture of particulate filler and one or more polymerizable precursors.",
        "FIG. 3A shows the system 40 in a loading position, where sample inlet check valve 401 is in an open position, that is, the regulator 52 is drawn against the second end 47 of the conduit 41; in sample chamber 402 the regulator 53 is a primary piston drawn against the second end 48 of the conduit 42, that is, the conduit closest to an actuation source; and outlet check valve 403 is in the closed position, that is, the regulator 54 is drawn against the first end 46 of the interconnected conduit 43. According to a preferred but not required embodiment, the sample source can be a reservoir of a sample fluid, a system of channels containing a sample fluid, or an external connection to the device containing a sample fluid, such as a syringe. The actuation source is a source of pressure and/or a vacuum used to actuate the primary piston. However, the system can have other configurations for loading and delivering samples and the sample source can be other fluid containing devices, as will be understood by those of skill in the art with reference to this disclosure.",
        "Now referring again to FIG. 3A and 3B, the system 40 additionally comprises an excess fluid outlet 58 that can be a conduit leading to a waste reservoir, or can be a conduit connected to a vacuum source, or a conduit connected to the actuation source. In another embodiment, the system 40 additionally comprises interconnecting conduits to provide a route to redirect fluid around the regulator 52 and 54. In another preferred but not required embodiment, the device 50 additionally comprises an analysis conduit 59, that is a conduit that can be open and filled with material to connect a fluid, such as a running buffer fluid with another apparatus, such as an analysis column. FIG. 3B shows the system 40 in an analysis position. In the analysis position, the regulator 52 in sample inlet check valve 401 is in a closed position, that is, drawn against the first end 44 of the interconnected conduit 41; the regulator 53 in sample chamber 402 is drawn toward the first end 45 of the conduit 42; and the regulator 54 in sample outlet check valve 403 is in the closed position, that is, drawn against the second end 49 of the interconnected conduit 43. According to the present invention, the system can have other regulator and conduit geometries the device can be used for procedures other than dispensing fluid from a sample source, as will be understood by those of skill in the art with reference to this disclosure.",
        "Now referring to FIG. 4A and 4B, a device for microfluidic control 60 where the device is a mixing valve is shown. The device comprises a conduit 61 having a first end 62 and a second end 63. The conduit 61 has a first path 64, a second path 65, and a third path in fluid flow contact with the conduit 61. The device also comprises a regulator 67 that is moveable in the conduit 61, where the regulator 67 has an outer diameter that is larger than the first end 62 and the second end 63 so the regulator 67 cannot pass out of the conduit 61. Further, the regulator 67 is comprised of a substantially elastic material having a structural component. In a preferred but not required embodiment, the regulator 67 is a composite polymer obtained by photoinitiated polymerization of a mixture of particulate filler and one or more polymerizable precursors which can be a composite polymer formed from a composite mixture comprising a polymerizable precursor and a particulate filler.",
        "Now referring again to FIG. 4A and 4B, in a preferred but not required embodiment, the device 60 is a mixing valve used for mixing fluids in various concentrations, or to alternate the source of fluid flowing into a conduit. As shown in FIG. 4A and 4B, the device 60 can be connected to an apparatus, such as an analysis column through flow path 66, and the device 60 can deliver a sample to the apparatus. As shown in FIG. 4A, fluid can flow from flow path 64, which is an inlet flow path to flow path 66, which is an outlet flow path, when the regulator 67 is drawn against the second end 63. The regulator 67 can be drawn against the second end 63 when pressure greater than that in flow path 66 is applied at flow path 64, or pressure at flow path 65 is reduced below that at flow path 64, or a combination thereof. As shown in FIG. 4B, fluid can flow from flow path 65 to flow path 66 when the regulator 67 is drawn against the first end 62. The regulator 67 can be drawn against the first end 62 when pressure greater than that in flow path 66 is applied at flow path 65, or pressure at flow path 64 is reduced below that at flow path 65, or a combination thereof. In another preferred but not required embodiment, the pressure between flow path 64 and 65 can be switched to alternately deliver different fluids from flow path 64 and 65 into the flow path 66, which is an outlet flow path. Inherent fluid dispersion in the outlet flow path 66 can mix the fluids delivered from flow path 64 and 65. The duration of the pressure pulses to flow path 64 and 65 can be varied. For example, the-pressure pulse at flow path 64 can be longer than the pressure pulse at flow path 65. Varying the pressure pulse of the flow paths will vary the relative volumes of fluid that are individually delivered from flow path 64 and 65 to flow path 66, and the fluids delivered to flow path 66 can be delivered in defined concentrations. In another preferred but not required embodiment, multiple flow paths can be multiplexed to the outlet flow path 66 such that multiple inlet flow paths, greater than the two inlet flow paths 64 and 65 shown in FIG. 4A and 4B, can be delivered to the outlet flow path 66, and an alternately connected apparatus. According to the present invention, the device can have other regulator and conduit geometries and the device can be used for procedures other than mixing fluids in various concentrations, or alternating the source of fluid flowing into a conduit, as will be understood by those of skill in the art with reference to this disclosure.",
        "Now referring to FIG. 5A and 5B, a device 70 for microfluidic control where the device has a substantially toothed shaped regulator, or a gear, that is, a mechanism that performs a function in a machine, is shown. The device comprises a conduit 71 having a first end 72 and a second end 73. The conduit 71 has a first path 74 and a second path 75 in fluid flow contact with the conduit 71. The device also has a regulator 76 that is substantially toothed shaped and moveable in the conduit 71, and the regulator 76 has an outer diameter 77 that is larger than the first end 72 and the second end 73 so the regulator 76 cannot pass out of the conduit 71. Further, the regulator 76 is comprised of a substantially elastic material having a structural component. In a preferred but not required embodiment, the regulator 76 is a composite polymer obtained by photoinitiated polymerization of a mixture of particulate filler and one or more polymerizable precursors. In another preferred but not required embodiment, the substantially toothed shaped regulator 76 is rotationally moveable within the conduit. In a most preferred but not required embodiment, the device 70 additionally comprises a substrate having an axle 78, also referred to herein as an axis or center peg, and the regulator 76 is rotationally movable around the axle. However, the regulator can have other gear configurations that surround a central point or pin, as will be understood by those of skill in the art with reference to this disclosure.",
        "Now referring again to FIG. 5A and 5B, in a preferred but not required embodiment, the device can be used as a flowmeter. As shown in FIG. 5A, fluid can flow from the first path 74, which is an inlet path, to the second path 75, which is an outlet path, through the conduit 71. When the fluid flows past the regulator 76, viscous drag from the fluid flow in the conduit can turn the regulator 76 at a rate that is a function of the fluid flow. A light source 79 can be used to measure the rotation of the regulator 76, which can be measured by examining the reflected (or transmitted) light incident on a portion of the regulator 76 with a detector 80, such as a photo sensor. As shown in FIG. 5B, a mask 81 with a window 82 can be used to ensure that light is incident only on a region where the teeth of the toothed wheel shaped regulator will be visible. As the regulator 76 turns, and the teeth pass by the window 81, a measured signal of light reflected by the teeth will be periodic in time. In a preferred but not required embodiment, the device does not aliquot fixed volumes of fluid and the regulator can rotate freely in a moving fluid stream. As will be understood by those of skill in the art with reference to this disclosure, the flow meter can operate with other types and arrangement of detectors, such as using a magnetic filler in the regulator and sensing the motion of regulator 76 with a magnetic sensor, for example as used in a Hall field sensor.",
        "A second detector can be added to the device shown in FIG. 5A and 5B. The second detector can be located adjacent to the detector 80 and along a path that parallels the direction of motion of regulator 76. In this fashion, the two detectors are sequentially illuminated as the regulator 76 rotates. In the illumination sequence, the signal from the first detector 80 changes prior to that from the second detector, or vice versa, providing the direction of rotation and hence the direction of the flow. As will be understood by those of skill in the art with reference to this disclosure, an increased flowrate resolution can be obtained through the addition of a second, a third, and more detectors. Also, a second, a third, and more sources of light can also be added to the device. Additional detectors can be arranged along an arc that is parallel to the arc of rotation of regulator 76, and where the angular spacing of the detectors along this arc does not match the angle between the teeth on regulator 76.",
        "Now referring to FIG. 6, there is schematically shown a device for microfluidic control 90 where the device has a plurality of substantially toothed shaped regulators, also referred to as gears. In a preferred but not required embodiment, as shown in FIG. 6, the device comprises a conduit 91 having a first end 92 and a second end 93. The conduit 91 has a first flow path 94 in fluid flow contact with the conduit 91, and a second flow path 95 in fluid flow contact with the conduit 91. The device also comprises a plurality of regulators 96 and 97 that are moveable in the conduit 91, and the regulators 96 and 97 each have an outer diameter 98 and 99, respectively, that is larger than the first end 92 and the second end 93 so each regulator 96 and 97 cannot pass out of the conduit 91. Further, each regulator 96 and 97 is comprised of a substantially elastic material having a structural component. In a preferred but not required embodiment, the regulator 96 and 97 is a composite polymer obtained by photoinitiated polymerization of a mixture of particulate filler and one or more polymerizable precursors. In another preferred but not required embodiment, the regulators 96 and 97 are substantially toothed shaped and rotationally moveable within the conduit. In a most preferred but not required embodiment, the device 90 additionally comprises a substrate having an axle 100 and 101 and each regulator 96 and 97 is rotationally movable around the axle 100 and 101. However, the regulator can have other configurations and geometries that surround a central point or pin, including arbitrary geometries, as will be understood by those of skill in the art with reference to this disclosure.",
        "Now referring again to FIG. 6, the device 90 can be used to perform mechanical work. In a preferred but not required embodiment, fluid can flow from the first path 94, which is an inlet path, to the second path 95, which is an outlet path, through the conduit 91, as shown in FIG. 9. When the fluid flows past the upper regulator 97, viscous drag from the fluid flow in the conduit can apply a force to the upper regulator 97, causing it to rotationally move about the axle 100. If more than one gear, such as the lower regulator 96, is meshed with the upper regulator 97, it can actuate or be forced to rotate by the motion of the upper gear 97. However, the device 90 can be used for other procedures, as will be understood by those of skill in the art with reference to this disclosure.",
        "In one embodiment, the regulator is a substantially elastic material having a structural additive or component structure. The regulator can be a composite polymer formed from the polymerization of a composite mixture comprising a polymerizable precursor and a particulate filler. The regulator is movable in the conduit, that is, the regulator will not bond to the surrounding conduit walls or surrounding structures and is free to move or rotate inside the conduit. The regulator is also confined within regions of the conduit, as defined by specific features in the device geometry. In a preferred but not required embodiment, the regulator is formed by the in situ polymerization of the composite mixture in the conduit. In a more preferred but not required embodiment, the in situ polymerization is effected by light exposure or heating. In a most preferred but not required embodiment, the composite mixture is polymerized by the in situ photo-initiated and lithographically defined polymerization of a polymerizable precursor and a particulate filler in the conduit. According to this embodiment, the composite mixture is polymerized in situ in the shape of a mask by exposing a region of the conduit to a radiating light through the mask. The use of a mask allows fabrication of regulators with irregular and arbitrary geometry inside the channel. Furthermore, since the regulators do not bond to the surrounding conduit walls or surrounding structures, the regulators are moveable in the conduit. For example, the regulator can move in a back and forth motion within the conduit, or the regulator can be rotationally movable in the conduit. When the regulator is formed by photo-initiated polymerization of the composite mixture in situ, optical access to the composite mixture in the conduit region of polymerization is provided. When the regulator is formed by in situ polymerization by thermal or other radiative means, optical access is not necessarily provided.",
        "The composite mixture is comprised of one or more polymerizable precursor and a particulate filler and can additionally comprise a polymerization initiator, such as a photo-initiator, and one or more solvents. The composite mixture can be in the form of a slurry, that is, a liquid containing a particulate filler that may not necessarily be suspended, such as with a particulate filler having a particle size of between about 100 nm and about 100 μm; a colloidal suspension, such as with a particulate filler having a particle size range of between about 1 nm and 100 nm); and a free-flowing liquid. However, the composite mixture can have other forms as will be understood by those of skill in the art with reference to this disclosure.",
        "The polymerizable precursor can be any of various monomer materials, such as butanediol diacrylate, diethylene glycol diacrylate, divinyl benzene, ethylene glycol diacrylate, hexanediol diacrylate, neopentyl glycol diacrylate, pentaerythritol triacrylate, pentaerythritol tetracrylate, propylene glycol diacrylate, trimethylolpropane triacrylate, heptafluorobutyl acrylate, trifluoroethylacrylate, and combinations of the preceding monomers. In a preferred but not required embodiment, the polymerizable precursor is hexanediol diacrylate. However, other polymerizable precursors that are capable of forming a composite polymer can be used according to the present invention, as will be understood by those of skill in the art with reference to this disclosure.",
        "The particulate filler can be in the form of a particle, bead, powder, fumed ceramic, fiber, floc, and other structural material, and a combination of the preceding particulate fillers. The particulate filler can be encapsulated, that is, chemically non-bonded with the surrounding polymer. Alternately, the particulate filler can bond directly to the surrounding polymer. The size of the particulate filler is selected to be less than the smallest dimension of the conduit and can be as small as several nanometers. The composition of the particulate filler can be a glass, ceramic, metals and metal oxides, polymer, carbon black, and combinations of the preceding fillers. The surfaces of the particulate can be modified to control hydrophobicity, reactivity, etc., for example an acrylate-modified silica. In a preferred but not required embodiment, the particulate filler is selected from the group consisting of a silica, such as SiO2, titania, such as TiO2, alumina, such as AlOx, zirconia, such as ZrOx, magnetically permeable matearials, such as colloidal iron and iron-nickel alloys, mica, glass, and polymers, such as polytetrafluoroethylene, poly(methyl methacrylate), latex, polystyrene, and combinations of the preceding fillers. In a more preferred embodiment, the particulate filler is silica. However, other forms, sizes, and compositions of the particulate fillers can be used according to the present invention, as will be understood by those of skill in the art with reference to this disclosure.",
        "According to another embodiment of the present invention, a particulate filler can be selected such that the composite polymer regulator is substantially incompressible as compared to a monolithic polymer regulator. The particulate filler can occupy a substantial fraction of the volume of the regulator and the particulate filler can be selected such that the particulate filler is selected to have a higher modulus of elasticity than that of a monolithic polymer. According to the present invention, when the composite polymer regulator is under compression, the compaction of the regulator is limited to a value greater than the filler volume fraction, thereby resulting in increased durability of the regulator under high compressive forces. In a preferred but not required embodiment, a composite polymer regulator will not exceed the bulk polymer elastic limit of the polymer and the composite polymer regulator will be substantially resistant to creep when a compressive force is applied to the composite polymer regulator. However, polymers with other compressive properties can be used according to the present invention, as will be understood by those of skill in the art with reference to this disclosure.",
        "According to another embodiment, the particulate filler or other additives, such as dyes, etc., can be selected to add specific optical properties to a composite polymer regulator. Micro-scale polymer devices can disappear when immersed in a liquid. The use of a particulate filler in the composite mixture results in a composite polymer regulator that can exhibit amplified light scattering and/or light-absorbing and/or fluorescent properties as compared to a monolithic polymer. When a regulator with an optical property is desired, a particulate filler can be selected that is naturally colored and/or that has a refractive index substantially different than that of the bulk polymer and/or that is fluorescent. For example, light reflected, absorbed, or fluoresced from a regulator can be used as a diagnostic to obtain information on the location or orientation or motion of the regulator. Regulators having optical properties can be used in a sensing system, such as with a microfluidic control device that is used as a flow meter. According to the present invention, the particulate filler can be varied to modify other properties of the composite polymer, such as the volume and type of particulate filler can be varied to modify the friction coefficient of the regulator, and the volume and type of filler can be varied to improve the polymerization resolution of the regulator, as will be understood by those of skill in the art with reference to this disclosure.",
        "According to another embodiment of the present invention, a particulate filler can be selected such that the composite polymer has a substantially stable volume when exposed to various fluid compositions, that is, the composite polymer will have reduced or no dimensional change in response to variations in fluid composition, as compared to a monolithic polymer. Micro-scale polymer devices that are immersed in liquid can be prone to solvent-induced dimensional change due to the chemical interaction of the polymer surface with ions in the fluid, that is, the shape and size of the polymer can change with exposure to fluids of varying polarity. This behavior can limit the practical usefulness of polymer devices to perform reliable mechanical functions. According to the present invention, an amount and a composition of a particulate filler can be selected and added to the composite mixture, prior to polymerization, such that the composite polymer containing the selected particulate filler will have reduced or no dimensional change in response to variations in fluid composition. However, composite polymers with other volumetric properties, such as other dimensional change properties, can be used according to the present invention, as will be understood by those of skill in the art with reference to this disclosure.",
        "According to another embodiment of the present invention, a solvent can be combined with the polymerizable precursor and the particulate filler. The solvent component can be any of various solvents capable of being suitably combined with the selected polymerizable precursor and particulate filler, such as water and organic solvents. In a preferred but not required embodiment, the solvent is selected from the group consisting of C1-C6 alcohols, C4-C8 ethers, C3-C6 esters, C1-C4 carboxylic acids, methyl sulfoxide, sulfolane, and N-methyl pyrrolidone, and combinations of the preceding solvents. In a more preferred but not required embodiment, the solvent is methanol. However, other solvents can be used according to the present invention, as will be understood by those of skill in the art with reference to this disclosure.",
        "According to another embodiment of the present invention, a polymerizing element can be combined with the polymerizable precursor and the particulate filler. The polymerizing element can include any of various common polymerization initiators and combinations thereof, such as azobisisobutyronitrile, azobisdihydrochloride, benzoyl peroxide, lauroyl peroxide, potassium persulfate, and other common free radical thermal-and photo-initiators. In a preferred but not required embodiment, the polymerizing element is a photo-initiator. In a more preferred embodiment, the polymerizing element is azobisisobutyronitrile. However, other polymerizing elements can be used according to the present invention, as will be understood by those of skill in the art with reference to this disclosure.",
        "According to another embodiment of the present invention is a method of making a device for microfluidic control. The method comprises combining a polymerizable precursor and a particulate filler to form a composite mixture. Then, the composite mixture is introduced into the conduit. Next, the conduit is exposed to an energy source to polymerize the composite mixture in situ, thereby forming a regulator, where the regulator is movable in the conduit, and the conduit is sized so the regulator cannot pass out of the conduit. In a preferred but not required embodiment, the composite mixture additionally comprises a photo-initiator. In a more preferred but not required embodiment, the conduit is exposed to a radiating light source through a mask to form the regulator.",
        "Now referring to FIG. 7, which schematically shows a method of making a device for microfluidic control according to the present invention. As shown in FIG. 7, the method comprises selecting a substrate having a conduit 110. Then, a composite mixture 111 comprising a particulate filler, a polymerizable precursor, a solvent and a photo-initiator are combined and introduced into the conduit 110. The composite mixture 111 can be combined by mixing together the liquid and particle components and may be in the form of a slurry, a colloidal suspension, or a free-flowing liquid. Next, a region of the conduit 110 containing the composite mixture 111 is selected. Next, the composite mixture is selectively polymerized and defined in the channel in a specific geometry to form a composite polymer regulator 112 by exposing the conduit 110 to a radiating light 113, which can be ultraviolet light, heat, or other radiation, through an exposure mask 114. Next, the unpolymerized composite mixture 111 is removed from the conduit 110, such as by flushing the conduit 110, thereby forming a composite polymer regulator 112 that is movable in the conduit and sized so the regulator 112 cannot pass out of the conduit 110.",
        "In a preferred but not required embodiment, the method comprises premixing the particulate filler and the polymerizable precursor to form the composite mixture. In a more preferred but not required embodiment, the method additionally comprises forming the composite mixture by combining the particulate filler with a premixed mixture of one or more polymerizable precursors, photo-initiators, and solvents. However, the composite mixture can be combined by other methods, such as combining the composite mixture in situ, as will be understood by those of skill in the art with reference to this disclosure.",
        "In another preferred but not required embodiment, the composite mixture is introduced into a conduit that is an existing microchannel structure or a conduit formed within a substrate. In a more preferred embodiment, the composite mixture is introduced into a conduit by injecting the composite mixture into the conduit.",
        "In a preferred but not required embodiment, the above-described methods for making a device for microfluidic control can be used to fabricate a regulator in a conduit where the conduit can be actuated by pressure. In another preferred embodiment, the above-described methods for making a device for microfluidic control can be used to fabricate fluidic components such as a valve and a flow meter inside a network of microfluidic channels. The method of making a device for microfluidic control can be used to fabricate composite polymer gears inside a conduit. This can be accomplished by fabricating a gear around a center point, which can be a pin or axle formed in the substrate. However, the above described methods for making a device for microfluidic control can be used to fabricate other components for microfluidic control as will be understood by those of skill in the art with reference to this disclosure.",
        "In another embodiment, the present invention is a method for microfluidic control. The method comprises selecting a device for microfluidic control, where the device comprises a conduit having a first path and a second path that are in fluid flow contact with the conduit, and a regulator, where the regulator is movable in the conduit and the conduit is sized so the regulator cannot pass out of the conduit. Then, fluid is placed into the conduit. Next, the regulator is moved by the application of a pressurizing force to direct or stop the fluid flow.",
        "In a preferred but not required embodiment, the fluid is placed in the conduit by injecting the fluid into the conduit. According to the present invention, the initial state of operation of the device is a load state. In the load state, a fluid fills an open conduit between the first path, which is a fluid inlet, and a second path, which is a fluid outlet. The injection can be performed from this initial load state. However, the injection can be performed by other methods, such as with the fluid inlet and fluid outlet at varying pressures, as will be understood by those of skill in the art with reference to this disclosure.",
        "In another preferred but not required embodiment, the method comprises a method for microfluidic control where the device delivers a sample to an apparatus, such as an analysis column. Now referring again to FIG. 3A and 3B, the method comprises injecting a sample into the device when the device is in a load state. As shown in FIG. 3A, the regulator 53, which is a primary piston, is drawn against the second end 48 of the conduit 42 when the device is in the load state. Then, the sample is injected into the device through the flow path 50 at the first end 44 of the conduit 41. Next, the regulator 53 is actuated by applying a positive pressure, or a pressure that is greater than that of the adjoining conduits through flow path 55, as shown in FIG. 3B. Next, the regulator 53 is moved down the sample chamber 402 and an associated fluid flow and pressure are generated in front of the regulator 53 which moves the regulator 52 and closes is an inlet check valve 401, and also moves regulator 54 and opens outlet check valve 403, as shown in FIG. 3B. Next, the sample flows into an analysis column 59. The injection is completed when the regulator 53 reaches the first end 45 of the conduit 56 at the end of the sample chamber 402. Any fluid from the actuation source that continues to flow into the actuation inlet can be diverted to the excess fluid outlet 58 and an equilibrium pressure can be reached behind the primary piston that will be a function of the hydrodynamic flow resistance of the excess fluid outlet and ability of the actuation source to deliver said pressure at that flow rate. The volume of sample injected into the analysis column can be approximately equal to the original open volume in the sample chamber 402. The method of using the device to deliver a sample can be performed at other pressures, including vacuum, at the fluid outlet 58, the sample inlet, and in the analysis column 59, that are of any value less than the pressure at the actuation source inlet.",
        "In a preferred but not required embodiment, as shown in FIG. 3A, the device is in an inject state when the sample inlet, excess fluid outlet 58, analysis column inlet 49, and outlet are at or near atmospheric pressure, and the regulator 53 is drawn against the second end 48 of the conduit 42. Applying a negative pressure differential (vacuum) to the second end 48 of the conduit 42 through actuation inlet 55 draws the regulator 53, which is a primary piston, toward the actuation inlet 55. The inlet check valve 401 is opened by generating a corresponding fluid flow and vacuum behind the primary piston 53, which opens the inlet check valve 401 and also closes the outlet check valve 403. A sample fluid is drawn from plow path 50 through the first end 44 of the conduit 41, which is a sample inlet, and an open conduit path is created between the sample inlet and an excess fluid outlet 58, as shown in FIG. 3A. Additional suction can be applied to the excess fluid outlet 58 to flush the sample chamber 402 with multiple volumes of sample in order to ensure the sample chamber 402 contains pure sample fluid. This step can also be performed with a separate cleaning/flushing fluid in the sample reservoir in order to clean the device prior to insertion of a new sample fluid. In an alternate embodiment, the excess fluid outlet 58 and flow path to the actuation inlet 56 can be connected to achieve the same effect. The sample inlet, analysis column inlets and outlets can be at various pressures above the actuation inlet/excess fluid outlet pressure in order to achieve this process.",
        "In another embodiment, the pressure in the analysis column 59 can be the highest pressure in the system at that time, leading to the outlet check valve 403 closing immediately after the injection state is terminated. This procedure leads to an alternate method of filling the sample chamber and achieving the load state. Now referring again to FIG. 3A and 3B, when the actuation inlet and excess fluid outlet are at or near atmospheric pressure and the pressure in the analysis column is above the sample inlet pressure, the regulator 53, which is a primary piston, is in an ‘inject’ state, where the regulator is drawn against the first end 45 of the conduit 42. Applying a positive pressure differential to the sample inlet forces the inlet check valve 401 to open and the regulator 53 moves toward the actuation inlet 56. The outlet check valve 403 remains closed due to the higher pressure in the analysis column 59. The sample fluid flows through the opened conduit path 41 and fills the sample chamber 402. When the primary piston reaches the second end 48 of the conduit 42, as shown in FIG. 4, the sample fluid flows through the sample chamber and out the excess fluid outlet. The excess fluid outlet can be connected to the second end 48 of the conduit 42 in this embodiment.",
        "Now referring to FIG. 11, which is a flow chart showing the method of using a device according to the present invention as a flowmeter. As shown in FIG. 11, the method comprises selecting a device having a substantially toothed wheel regulator, according to the present invention. Then, a fluid with a viscosity is passed by the regulator, thereby turning the regulator at a fluid flow rate. Next, a radiating light is directed to a toothed portion of the regulator and the radiating light is reflected or transmitted to a detector, such as a photo-sensor. Next, the reflected or transmitted light is measured as a periodic signal in time. Next, the signal is processed and the frequency of the signal is determined and related to the fluid flow rate as a function of the fluid viscosity. In one embodiment, multiple regulators of varying dimensions and conduit cross-sections can be used in succession to widen the dynamic range of the measurement and improve measurement accuracy.",
        "A composite mixture was formed from the substances listed in Table I.",
        "TABLE I\n\n\n\n\n\n\n\nSUBSTANCE\nAMOUNT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nethoxylated trimethylolpropane triacrylate\n900\nμL\n\n\n\ntrifluoroethylacrylate (2,2,2 TFEA)\n100\nμL\n\n\n\n2,2′-azobisisobutyronitrile\n5\nmg\n\n\n\nDioxane\n500\nμL\n\n\n\n500 μL of 2-methoxyethanol\n500\nμL\n\n\n\nsilica particles\n10%",
        "The composite mixture was prepared by mixing the ethoxylated trimethylolpropane triacrylate, SR454, available from Sartomer Corporation, Exton, Pa., US and the trifluoroethylacrylate, 2,2,2 TFEA, available from Sigma-Aldrich Corp., St. Louis, Mo., US to form a monomer mixture. Then, the photo-initiator, 2,2′-azobisisobutyronitrile, AIBN, (5 mg) available from Sigma-Aldrich Corp., St. Louis, Mo., US was added to the monomer mixture. A solvent mixture was prepared by combining the dioxane, available from Sigma-Aldrich Corp., St. Louis, Mo., US and the 2-methoxyethanol, available from Sigma-Aldrich Corp., St. Louis, Mo., US The monomer mixture and solvent mixture were then mixed in a 8:2 volume:volume ratio, that is, 800 μL of the monomer mixture was mixed with 200 μL of the solvent mixture. A particulate filler of 1 μm diameter, non-porous silica particles (10 wt %), available from Sigma-Aldrich Corp., St. Louis, Mo., US, was then added to the monomer mixture and solvent mixture to create a suspension/slurry of monomer, solvent, and particles.",
        "A particulate filler was selected such that the composite polymer regulator was substantially incompressible, as compared to a monolithic polymer regulator. As a comparative example, a regulator comprising a monolithic polymer was substantially extruded through a fine passage when the regulator was subjected to a 10,000 psi high compressive force. Whereas, a regulator comprising a composite polymer containing a 50% silica particulate filler, prepared according to the present invention, compressed to about 50% of the initial volume. This degree of compression did not exceed the bulk polymer elastic limit of the polymer and the regulator part was substantially resistant to extrusion.",
        "As a further example, the compressive strength of Nylon 6,6 and compared to the compressive strength of a composite polymer prepared with Nylon 6,6 according to the present invention. The compressive strength of Nylon 6,6 was tested and at 10% compression, the compressive strength was about 12,000 psi. Whereas, a composite polymer prepared according to the present invention with 30% glass-filled Nylon 6,6 was tested and the compressive strength at 10% compression was about 39,000 psi.",
        "A particulate filler was selected such that the composite polymer had a substantially stable volume when exposed to various fluid compositions, that is, the composite polymer had reduced or no dimensional change in response to variations in fluid composition, as compared to a monolithic polymer. As a comparative example, a monomer mixture containing ethoxylated trimethylolpropane triacrylate and trifluoroethylacrylate in an 80:20 volume:volume ratio was mixed with methoxyethanol in a 50:50 volume:volume ratio. Trace amounts of azobisisobutyronitrile, a photoinitiator, was added and the mixture was photopolymerized. When the resulting monolithic polymer was placed in water, the element shrank to 55% of its original volume. Whereas, following the same procedure, and adding 7 wt % of particles of colloidal antimony pentoxide, with an outer diameter of 7-11 nm, to the mixture, the polymerized composite polymer shrank by only 20% of its original volume.",
        "A regulator that was used as a composite piston was formed by introducing the composite mixture from Example I into a 150 μm inner diameter optically transparent silica capillary by injecting the composite mixture into the capillary with a syringe. A 2 mm length of the capillary was then exposed to broadband ultraviolet radiation, peaking at around 365 nm with total energy flux of 40 mW/cm2, for 30 seconds. Upon exposure to the ultraviolet radiation, a composite particle-filled solid polymer piston with a length dimension of 2 mm and a width dimension that is approximately equal to the inner diameter of the surrounding capillary was formed. The composite piston did not bond to the surrounding capillary and was thus free floating. The piston was mobilized by applying between about 1 psi to about 5 psi of pressure to one terminal end of this first capillary. An adjoining second capillary, having a 25 μm inner diameter, was connected to the second terminal of the first capillary. The composite piston within the first capillary was pushed against the adjoining capillary and put under pressure in excess of 2000 psi with little to no damage or permanent distortion to the composite piston. Ejecting the composite piston from the first capillary and examining the composite piston under a microscope confirmed the geometry of the composite piston. The composite piston was iteratively exposed to acetonitrile, methanol, isopropanol, water, and aqueous buffers with pH ranging from between about 2 to about 12. The swelling and shrinking of the composite piston was observed between exposures to these liquids and the swelling and shrinking of the composite piston was less than 10% of its original diameter in all cases.",
        "Although the present invention has been discussed in considerable detail with reference to certain preferred embodiments, other embodiments are possible. Therefore, the scope of the appended claims should not be limited to the description of preferred embodiments contained herein."
    ],
    "citations": [
        "3661166",
        "5334310",
        "5391587",
        "5400824",
        "5417235",
        "5649423",
        "5885470",
        "5927325",
        "6076555",
        "6136171",
        "6136212",
        "6238538",
        "6279606",
        "6283440",
        "6284072",
        "6290685",
        "6293308",
        "6302134",
        "6408878",
        "6422528",
        "6488872",
        "6523560",
        "6533366",
        "6540203",
        "6782746",
        "2001/0008212",
        "2001/0055812",
        "2002/0017487",
        "2002/0022261",
        "2002/0025529",
        "2002/0054252",
        "2002/0058332",
        "2002/0067992",
        "2002/0170668",
        "2002/0194909",
        "2002/0198282",
        "2003/0015682",
        "2003/0055193",
        "2003/0057391",
        "2003/0062734",
        "2004/0052929",
        "2004/0079424",
        "2004/0123658"
    ],
    "us_classification": "137528",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "81",
            "subclass": "B",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}