{
    "title": "Computer system for determining a customized animal feed",
    "abstract": "A method and system for creating a customized animal feed is disclosed. The method and system include having ingredient data from more than one location, animal data, evaluation data, and optimization weighting data. The specifications for a customized feed are generated using ingredient data representative of the mix of ingredients available at one or more locations. A customized feed is generated which is designed to fulfill the nutritional requirements for the animal's diet. The nutritional requirements are derived from the animal data. Furthermore, the feed is optimized based upon the profile data, the feed data, the evaluation data, and the optimization weighting data.",
    "inventors": [
        "Burghardi",
        "Knudson",
        "Peterson",
        "Cook",
        "Oedekoven"
    ],
    "document_number": "07296537",
    "publication_date": "20071120",
    "assignees": [
        "CAN Technologies, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A system for determining customized feed for at least one animal, the system comprising:",
            "components": [
                {
                    "component": "a first memory portion configured to store animal data representative of the characteristics of the animal;",
                    "subcomponents": []
                },
                {
                    "component": "a second memory portion configured to store feed data representative of the feed ingredients located at at least one location;",
                    "subcomponents": []
                },
                {
                    "component": "a third memory portion configured to store evaluation data representative of at least two evaluation criteria;",
                    "subcomponents": []
                },
                {
                    "component": "a data processing circuit in communication with the memory portions and configured to generate nutrient profile data representative of a nutrient profile for the animal based upon the animal data, the data processing circuit being further configured to generate ration data representative of a combination of ingredients from the at least one location, the ration data being generated by the data processing circuit based upon the profile data, the feed data and the evaluation data; and",
                    "subcomponents": []
                },
                {
                    "component": "a fourth memory portion in communication with the data processing circuit and configured to store optimization weighting data representative of the effect a respective evaluation criteria has on the generation of the ration data, the data processing circuit further generating the ration data based upon the optimization weighting data.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The system of claim 1 , wherein the animal data is representative of at least one of a beginning weight of the animal; a desired weight of the animal; an environment of the animal; a feed form; an actual or desired production level of the animal; and a relationship of animal muscle to fat of the animal.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The system of claim 1 , wherein the feed ingredients include at least one of a grain source, a protein source, a vitamin source, a mineral source and a fat source.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The system of claim 3 , wherein the animal data is representative of at least one of a beginning weight of the animal; a desired weight of the animal; an environment of the animal; a feed form; an actual or desired production level of the animal; and a relationship of animal muscle to fat of the animal.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The system of claim 4 , wherein the evaluation criteria include at least two of (i) animal production rate, (ii) the cost of feed per unit animal weight gain, and (iii) the feed weight per unit animal weight gain.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The system of claim 5 , wherein the feed ingredients include at least one of a grain source, a protein source, a vitamin source, a mineral source and a fat source.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The system of claim 5 , wherein the animal production rate is at least one of a milk production rate, an egg production rate and a rate of lean weight gain.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The system of claim 1 , wherein the optimization weighting data may be selected to cause one of the evaluation criteria to have no effect on the generation of the ration data.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The system of claim 1 , wherein the memory portions are portions of a digital memory and a parallel data bus is coupled between the digital memory and the data processing circuit to facilitate communication therebetween.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The system of claim 1 , wherein the memory portions are portions of a plurality of digital memories and a network couples the digital memories to the data processing circuit to facilitate communication therebetween.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The system of claim 1 , wherein the nutrient profile data is representative of at least two nutrient components, and the system further includes a fifth memory portion in communication with the digital processor, the fifth memory portion storing variation data representative of a range for the nutrient components of the nutrient profile and the digital processor generates a set of ration data based upon the variation data.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The system of claim 11 , wherein the nutrient components include at least true digestible lysine and net energy.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The system of claim 1 , wherein the feed data includes an amount for each feed ingredient.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. The system of claim 13 , wherein the amount for each feed ingredient can be constrained according to one or more criteria.",
            "components": []
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The system of claim 14 , wherein the amount of each feed ingredient can be constrained according to at least two criteria.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The system of claim 1 , wherein the animal data includes an animal characteristic related to at least one of an environment, a current condition, a desired final condition, a genotype, a feed form, a current production level and a desired production level.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The system of claim 1 , wherein the at least one animal is one or more cattle, swine, poultry, fish, or crustaceans.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The system of claim 1 , wherein the animal data includes a parameter related to an animal production level.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The system of claim 1 , wherein the animal data includes a parameter related to an animal genotype.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The system of claim 1 , wherein the animal data includes a parameter related to an animal environment.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The system of claim 1 , wherein the animal data includes a parameter related to an animal feeding regime.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The system of claim 1 , wherein the feed data includes supplier feed data representative of sets of ingredients located at a supplier site and on-farm feed data representative of sets of ingredients located at an on-farm site,",
            "components": [
                {
                    "component": "wherein the on-farm feed data include data representative of costs and amounts of ingredients located at the on-farm site.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The system of claim 1 , wherein the evaluation criteria include at least one of cost/gain, cost/output, animal production rate, and feed/gain.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The system of claim 1 , wherein the evaluation criteria include data representative of an amount of feed required to produce a unit of gain.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The system of claim 1 , wherein the evaluation criteria include data representative of a rate of weight gain of an animal.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The system of claim 1 , wherein the evaluation criteria include data representative of a cost of feed required to produce a unit of weight gain of an animal.",
            "components": []
        },
        {
            "claim_number": "CLM-00027",
            "preamble": "27. The system of claim 1 , wherein the ration data include data representative of a cost associated with the ration data, data representative of a feed weight associated with the ration data, and data representative of projected animal performance associated with the ration data.",
            "components": []
        },
        {
            "claim_number": "CLM-00028",
            "preamble": "28. A system for determining customized feed for at least one animal, the system comprising:",
            "components": [
                {
                    "component": "first memory means for storing animal data representative of the characteristics of the animal;",
                    "subcomponents": []
                },
                {
                    "component": "second memory means for storing feed data representative of the feed ingredients located at at least one location;",
                    "subcomponents": []
                },
                {
                    "component": "third memory for storing evaluation data representative of at least two evaluation criteria;",
                    "subcomponents": []
                },
                {
                    "component": "processing means for generating profile data representative of a nutrient profile for the animal based upon the animal data, processing means further generating ration data representative of a combination of ingredients from the location, the ration data being generated by the processing means based upon the profile data, the feed data and the evaluation data; and",
                    "subcomponents": []
                },
                {
                    "component": "fourth memory means for storing optimization weighting data representative of the effect a respective evaluation criteria has on the generation of the ration data, the processing means further generating the ration data based upon the optimization weighting data.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00029",
            "preamble": "29. The system of claim 28 , wherein the animal data is representative of at least one of a beginning weight of the animal; a desired weight of the animal; an environment of the animal; a feed form; an actual or desired production level of the animal; and a relationship of animal muscle to fat of the animal and the feed ingredients include at least one of a grain source, a protein source, a vitamin source, a mineral source and a fat source.",
            "components": []
        },
        {
            "claim_number": "CLM-00030",
            "preamble": "30. The system of claim 28 , wherein the evaluation criteria include at least two of (i) animal production rate, (ii) the cost of feed per unit animal weight gain, and (iii) the feed weight per unit animal weight gain.",
            "components": []
        },
        {
            "claim_number": "CLM-00031",
            "preamble": "31. The system of claim 30 , wherein the feed ingredients include at least one of a grain source, a protein source, a vitamin source, a mineral source and a fat source.",
            "components": []
        },
        {
            "claim_number": "CLM-00032",
            "preamble": "32. A method for determining customized feed for at least one animal, the method comprising:",
            "components": [
                {
                    "component": "storing animal data representative of the characteristics of the animal;",
                    "subcomponents": []
                },
                {
                    "component": "storing feed data representative of the feed ingredients located at at least one location;",
                    "subcomponents": []
                },
                {
                    "component": "storing evaluation data representative of at least two evaluation criteria;",
                    "subcomponents": []
                },
                {
                    "component": "storing optimization weighting data representative of the effect a respective evaluation criteria;",
                    "subcomponents": []
                },
                {
                    "component": "generating profile data representative of a nutrient profile for the animal based upon the animal data; and",
                    "subcomponents": []
                },
                {
                    "component": "generating ration data representative of a combination of ingredients from the location, the ration data being generated based upon the profile data, the feed data, the evaluation data, and the optimization weighting data.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00033",
            "preamble": "33. The method of claim 32 , wherein the feed data includes an amount for each feed ingredient.",
            "components": []
        }
    ],
    "description": [
        "This application is a continuation of application Ser. No. 10/985,365, filed Nov. 10, 2004 now abandoned, which is a continuation of application Ser. No. 10/715,053, filed Nov. 17, 2003, now U.S. Pat. No. 6,863,023, which is a continuation of application Ser. No. 09/739,550, filed Dec. 15, 2000, now U.S. Pat. No. 6,681,717.",
        "The present invention relates to a computerized system for determining a customized feed for animals, such as cattle, swine, poultry, fish, crustaceans and the like. In particular, the system determines a feed mix based upon data relating to information such as animal characteristics, available ingredients, speed of product production, and cost of production.",
        "In food production, and specifically producing animal products such as milk, beef, pork, eggs, chicken, fish etc., there is need to improve production efficiency. Production efficiency, i.e. producing the maximum quantity of animal products while minimizing the time and cost of production for those products, is important in maintaining a competitive advantage.",
        "A producer (i.e. a farmer, rancher, pork producer, and the like) generally wants to maximize the amount of animal product produced (e.g. gallons of milk, pounds of beef or pork produced) while keeping the costs associated with feed at a low level in order to achieve maximum animal productivity. The maximized amount of animal product should be produced at a minimized cost to the producer. Costs to the producer include the cost of feed needed to produce the animal products, as well as the costs of related equipment and facilities needed in the production of animal products. In order to minimize the effect of fixed costs associated with equipment and facilities, the maximum amount of animal product should preferably be produced in a minimum time period.",
        "Producers are constantly trying to increase these production efficiencies. One way of increasing production efficiencies is by altering the feed which animals are fed. For example, a feed with certain amounts of nutrients can cause an animal to grow or produce animal products quickly and/or perform better, whereas a different feed with different amounts of nutrients may cause an animal to grow or produce animal products on a more cost effective basis.",
        "Current systems for creating animal feed are not fully capable of helping producers evaluate and improve production efficiencies. Current systems commonly generate an overall nutrient profile which is related to a set of animal characteristics. Such systems then look at the overall nutrient profile and compare what nutrients may be had from the on-farm ingredients. From this comparison, a “nutritional gap” can be calculated, i.e., the nutritional requirements that the producer needs to fulfill his production goals after accounting for the use of his on-site feed. This nutritional gap is then compared to the nutritional components which may be available from ingredients located at a supplier's mill. Through a comparison of the nutritional gap and the nutritional components available from the mill, current systems allow a supplier to provide a cost effective custom feed which is optimized to permit an animal to produce desired animal products on a cost minimized basis.",
        "Currently systems exist that are capable of taking the amounts of on-farm ingredients to be used in the overall diet of the animal into account. This is typically done by accounting for the on-farm component of the animal's diet as a fixed input parameter in the determination. It would be advantageous to be able to modify the amounts of on-farm ingredients to be used in forming the custom feed as part of the optimization process. Moreover, current systems are generally limited to generating the custom feed based on a single evaluation criteria, typically based on the cost of the feed (e.g., on a cost of feed per unit of animal weight gain basis). It would be advantageous to have a system which is capable of utilizing more than one evaluation criteria in generating the custom feed.",
        "One embodiment of the present invention provides a system for determining customized feed for animals, such as farm livestock, poultry, fish and crustaceans. The system stores animal data representative of the characteristics of the animal, feed data representative of the feed ingredients located at one or more locations, and evaluation data representative of at least one evaluation criteria. The evaluation criteria are generally related to factors representative of animal productivity. An optimization weighting is used to indicate the weight assigned to the evaluation criteria. Examples of evaluation criteria include (i) animal production rate (e.g., the rate of animal weight gain or the rate of production of a food product such as milk or eggs); (ii) cost of feed per unit animal weight gain; and (iii) feed weight per unit animal weight gain. The system includes a data processing circuit, which may be one or more programmed microprocessors, in communication with a data storage device or devices which store the data. The data processing circuit is configured to generate profile data representative of a nutrient profile for the animals based upon the animal data. In effect, the nutrient profile is a description of the overall diet to be fed to the animals defined in terms of a set of nutritional parameters (“nutrients”). Using the profile data, the data processing circuit generates ration data representative of a combination of ingredients from one or more locations. The ration data is generated by the data processing circuit based upon the profile data, the feed data, the evaluation data, and the optimization weighting data.",
        "Another embodiment of the system includes system for determining customized feed for at least one animal. The system includes first memory means for storing animal data representative of the characteristics of the animal, second memory means for storing feed data representative of the feed ingredients located at at least one location, third memory for storing evaluation data representative of at least two evaluation criteria, and processing means for generating profile data representative of a nutrient profile for the animal based upon the animal data, processing means further generating ration data representative of a combination of ingredients from the location, the ration data being generated by the processing means based upon the profile data, the feed data and the evaluation data. The system further includes fourth memory means for storing optimization weighting data representative of the effect a respective evaluation criteria has on the generation of the ration data, the processing means further generating the ration data based upon the optimization weighting data.",
        "A further embodiment of the present invention provides a method for determining customized feed for at least one animal. The method includes storing animal data representative of the characteristics of the animal, storing feed data representative of the feed ingredients located at at least one location, storing evaluation data representative of at least two evaluation criteria, storing optimization weighting data representative of the effect a respective evaluation criteria, generating profile data representative of a nutrient profile for the animal based upon the animal data; and generating ration data representative of a combination of ingredients from the location, the ration data being generated based upon the profile data, the feed data, the evaluation data, and the optimization weighting data.",
        "As modifications to the embodiments described herein, systems and/or methods may rely on more than one optimizing criteria and/or feed data representative of ingredients located at more than one location. For example, ingredients which could be used to create the ration may be located at the farm associated with the animals as well as at the mill of an ingredient supplier. Depending upon the requirements of the system, processing can be consolidated in one processor or divided between processors in communication via a network such as a LAN or the Internet. Furthermore, the processors may be located in devices such as workstations, portable PC's and/or hand held computers.",
        "In other variations of the embodiments described herein, the systems and/or methods may further include a memory portion in communication with the digital processor which stores variation data representative of a range for one or more nutrients of the nutrient profile. The digital processor is capable of generating a set of ration data based upon the variation data. A memory portion of the system may store variation data which corresponds to preselected incremental variations for the values assigned to one or more individual nutrients in the nutritional profile.",
        "Throughout this application, the text refers to various embodiments of the system and/or method. The various embodiments described are meant to provide a variety of exemplary examples and should not be construed as descriptions of alternative species. Moreover, it should be noted that the descriptions of the various embodiments provided herein may be of overlapping scope. The embodiments discussed herein are merely illustrative and are not meant to limit the scope of the present invention.",
        "FIG. 1 is a general schematic representation of the data flow in one embodiment of the present System.",
        "FIG. 2 is a general schematic representation of the data flow in another embodiment of the System which is designed to be used to generate a custom product (“Custom Ration”) and/or feed mix from on-site ingredients (“On-Farm Ration”) optimized for milk production and/or quality.",
        "FIG. 3 is a general schematic representation of the data flow in a variation of the System shown in FIG. 1.",
        "An exemplary system, and process which can be used in producing a customized feed for animals, such as livestock, poultry, fish or crustaceans is described herein. How the system and process can increase production efficiencies by customizing feed is also disclosed. It is particularly desirable if the system and methods are capable of determining an optimized feed using one or more evaluation criteria. Examples of suitable evaluation criteria include a feed cost per unit animal weight gain basis, an animal production rate basis (e.g., based upon a rate of animal weight gain or a rate of production of an animal product, such as milk or eggs), and a feed amount per unit of animal weight gain basis.",
        "In one embodiment of the present system, a computer system may be used which has a processing unit that executes sequences of instructions contained in memory. More specifically, execution of the sequences of instructions causes the processing unit to perform various operations, which are described herein. The instructions may be loaded into a random access memory (RAM) for execution by the processing unit from a read-only memory (ROM), a mass storage device, or some other persistent storage. In other embodiments, hardwired circuitry may be used in place of, or in combination with, software instructions to implement the present method. Thus, the embodiments described herein are not limited to any specific combination of hardware circuitry and/or software, nor to any particular source for the instructions executed by the computer system.",
        "Creating a customized feed typically involves processing and manipulating at least four basic data sets (see, e.g., FIG. 1): first feed data representative of the collection of ingredients located at a first location 1, second feed data representative of the collection ingredients located at a second location 2, animal data representative of characteristics of the animal 3 (e.g., parameters related to its genotype, production level, environment and/or feeding regime), and evaluation criteria 4. As will be explained below, very often first and second feed data representative of sets of ingredients located at an on-farm site (first ingredients 1 located at a first location) and ingredients located at a supplier's mill site (second ingredients 2 located at a second location) are used to generate the recommended mix of ingredients to be fed to the animal. In many instances, the ration data define an overall diet for the animal which includes custom rations from more than one location (e.g., a custom ration from a first location 7 and a custom ration from a second location 8 as depicted in FIG. 1). These can be combined to create a customized feed (“ration”) which fulfills the animal data requirements while meeting the evaluation criteria 4.",
        "The evaluation criteria may be chosen from such suitable criteria related to animal productivity as (i) animal production rate, (ii) cost of feed per unit animal weight gain, and (iii) feed weight per unit animal weight gain.",
        "In some modified embodiments, the present system may include additional memory portions for storing nutrient level constraints 5 and/or ingredient level constraints 6. This may be useful where, for example, it has been established that higher levels of certain nutritional components could pose a risk to the health of an animal being fed the custom feed. For example, if the custom feed includes some trace minerals, such as selenium, present in too great an amount, the custom feed may have adverse health consequences to the animal. Various embodiments of the present invention allow constraints to be placed on the maximum and/or minimum amounts of one or more nutrients in the profile data generated. In some embodiments, this may be used together with the animal data as a basis to calculate the profile data. These constraints may be stored in a memory location as part of the system or the system may permit an individual operator to input one or more constraints on the amount of particular nutrient(s) in the profile data generated by the system. Similarly, it may be desirable to limit the amounts of one or more ingredients in either a custom product mix or in the overall diet to be fed to the animal. For example, for ease of formulation of a custom feed in pellet form it may be desirable to limit the amount of certain ingredients and/or require the inclusion of minimum amounts of specified ingredients.",
        "The first data set that is generally input into the system and subsequently stored in a memory portion includes data representative of characteristics of the animal. Examples of types of data representative of animal characteristics (“animal data”) include beginning weight of the animal; a desired weight of the animal; an environment of the animal; a feed form; an actual or desired production level of the animal; and a relationship of animal muscle to fat of the animal. For example, the nutrient profile generated for a particular animal can vary based upon a number of different characteristics of the animal relating to one or more of its genotype, environment, current condition (e.g., defined in terms of health and/or weight), desired production level, feed form (e.g., meal or pellet), current production level, desired final condition (e.g., defined in terms of final weight and/or relationship of animal muscle to fat of the animal) and the like. Tables 1 and 2 below list illustrative sets of animal characteristics which can be used as a basis to generate nutritional profiles to be used in designing custom rations (“custom feeds”) for swine and dairy cattle, respectively.",
        "TABLE 1\n\n\n\n\n\nAnimal Characteristics Suitable for Generating\n\n\na Nutritional Profile for a Feed for Swine\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnimal Category\nGenotype (lean gain)\n\n\n\nFinisher\nEffective Ambient Temperature\n\n\n\nGilt Replacement\nTemperature\n\n\n\nGrow\nDraft\n\n\n\nPrebred\nBedding\n\n\n\nSow\n% of pigs that are wet)\n\n\n\nGestation\nPigs per pen\n\n\n\nLactation\nPig density (square feet per pig)\n\n\n\nArtificial Insemination Boar\nHealth\n\n\n\nBegin Weight\nFlooring Type\n\n\n\nEnd Weight\nTotal pigs born/litter\n\n\n\nFeed Disappearance (Intake)\nLitter weight gain\n\n\n\nFeed Wastage\nTotal pigs born/litter\n\n\n\nFeed Form",
        "TABLE 2\n\n\n\n\n\nAnimal Characteristics Suitable for Generating\n\n\na Nutritional Profile for Dairy Cattle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTarget Milk Weight (volume)\nBody Weight\n\n\nTarget Milk Butterfat %\nBody Weight Change\n\n\nTarget Milk Protein %\nBody Condition Score (current)\n\n\nCurrent Milk Weight (volume)\nBody Condition Score (desired)\n\n\nCurrent Milk Butterfat %\nActual Dry Matter Intake\n\n\nCurrent Milk Protein %\nEnvironmental Temperature\n\n\nPercent of group in first lactation\nEnvironmental Humidity\n\n\nPercent of group in second lactation\nGenotype",
        "The animal data representative of the characteristics of the animal may be inputted into a computer system with a memory portion available and configured to store the data. The animal data representative of the characteristics of the animal may be inputted into the system by a variety of methods known to those skilled in the art including a keyboard, mouse, touchpad, computer, internet or other related device.",
        "The system includes a data processing circuit which is configured to generate profile data representative of a nutrient profile for the animals based upon the animal data. In effect, the nutrient profile is a description of the overall diet to be fed to the animals defined in terms of a set of nutritional parameters (“nutrients”). Depending on the desired degree of sophistication of the system, the profile data may include a relatively small set of amounts of nutrients or large number of amounts of nutrients. Table 3 includes an illustrative list of nutrients that may be used delineating profile data for animals such as pigs and dairy cattle. Of course, the list of nutrients used in generating profile data may differ for different types of livestock or other animals. Tables 4 and 5 respectively contain lists of nutrients suitable for use in generating nutritional profiles for swine and dairy cattle, respectively.",
        "The data processing circuit in the present system is also configured to generate ration data representative of a combination of ingredients from one or more locations. The ration data is generated by the data processing circuit based upon the profile data, feed data representative of the feed ingredients available at the location(s) and evaluation data representative of one or more evaluation criteria.",
        "TABLE 3\n\n\n\n\n\nNutrients Suitable for Generating\n\n\na Nutritional Profile\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnimal Fat\nRumres Nfc\n\n\n\nAscorbic Acid\nSalt\n\n\n\nBiotin\nSelenium\n\n\n\nCal/Phos\nSimple Sugar\n\n\n\nChloride\nSodium\n\n\n\nCholine\nSol Rdp\n\n\n\nChromium\nSulfur\n\n\n\nCobalt\nSw Obs Me\n\n\n\nCopper\nThiamine\n\n\n\nArginine (Total and/or Digestible)\nTotal Rdp\n\n\n\nCystine (Total and/or Digestible)\nVerified Adf\n\n\n\nIsoleucine (Total and/or Digestible)\nVerified Ash\n\n\n\nLeucine (Total and/or Digestible)\nVerified Calcium\n\n\n\nLysine (Total and/or Digestible)\nVerified Dry Matt\n\n\n\nMethionine (Total and/or Digestible)\nVerified Fat\n\n\n\nPhenylalanine (Total and/or Digestible)\nVerified Fiber\n\n\n\nThreonine (Total and/or Digestible)\nVerified Hemi\n\n\n\nTryptophan (Total and/or Digestible)\nVerified Moisture\n\n\n\nValine (Total and/or Digestible)\nVerified Ndf\n\n\n\nFolic Acid\nVerified Neg\n\n\n\nPhosphate\nVerified Nel\n\n\n\nIodine\nVerified Nem\n\n\n\nIron\nVerified Nfc\n\n\n\nLactose\nVerified Phos\n\n\n\nLasalocid\nVerified Protein\n\n\n\nMagnesium\nVerified Rup\n\n\n\nManganese\nVitamin A\n\n\n\nMonensin\nVitamin B12\n\n\n\nNiacin\nVitamin B6\n\n\n\nPotassium\nVitamin D\n\n\n\nProtein\nVitamin E\n\n\n\nPyridoxine\nVitamin K\n\n\n\nRh Index\nZinc\n\n\n\nRiboflavin\n\n\n\nRough Ndf\n\n\n\nRum Solsug",
        "TABLE 4\n\n\n\n\n\nNutrients Suitable for Generating\n\n\na Nutritional Profile for Swine\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBiotin\n\n\n\nCal/Phos\n\n\n\nCholine\n\n\n\nCoppr Add\n\n\n\nFolic Acid\n\n\n\nIodine Add\n\n\n\nIron Add\n\n\n\nMang Add\n\n\n\nNiacin\n\n\n\nPantotnc\n\n\n\nPyridoxine\n\n\n\nRiboflavin\n\n\n\nSalt\n\n\n\nSelenium Add\n\n\n\nSodium\n\n\n\nSw Digphos\n\n\n\nThiamine\n\n\n\nTrue Swine Digestible isoleucine\n\n\n\nTrue Swine Digestible lysine\n\n\n\nTrue Swine Digestible methionine\n\n\n\nTrue Swine Digestible threonine\n\n\n\nTrue Swine Digestible tryptophan\n\n\n\nTrue Swine Digestible valine\n\n\n\nV Calcium\n\n\n\nV Phos\n\n\n\nV Protein\n\n\n\nVit A\n\n\n\nVit D\n\n\n\nVit E\n\n\n\nVit K\n\n\n\nVitamin B12\n\n\n\nZinc",
        "TABLE 5\n\n\n\n\n\nNutrients Suitable for Generating\n\n\na Nutritional Profile for Dairy Cattle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAcid Detergent Fiber\nNon-Protein Nitrogen\n\n\nBiotin\nPhosphorus\n\n\nCalcium\nPotassium\n\n\nChloride\nProtein\n\n\nCobalt\nRumen Degradable Protein\n\n\nCopper\nRumen Undegraded Alanine\n\n\nDietary Cation Anion Difference\nRumen Undegraded Histidine\n\n\nDigestible Neutral Detergent Fiber\nRumen Undegraded Isoleucine\n\n\nDry Matter\nRumen Undegraded Leucine\n\n\nFat\nRumen Undegraded Lysine\n\n\nIntestinally Digestible Arginine\nRumen Undegraded Methionine\n\n\nIntestinally Digestible Histidine\nRumen Undegraded Phenylalanine\n\n\nIntestinally Digestible Isoleucine\nRumen Undegraded Protein\n\n\nIntestinally Digestible Leucine\nRumen Undegraded Tryptophan\n\n\nIntestinally Digestible Lysine\nRumen Undegraded Valine\n\n\nIntestinally Digestible Methionine\nSalt\n\n\nIntestinally Digestible Phenylalanine\nSelenium\n\n\nIntestinally Digestible Threonine\nSodium\n\n\nIntestinally Digestible Tryptophan\nSoluble Protein\n\n\nIntestinally Digestible Valine\nSoluble Sugar\n\n\nIodine\nStarch\n\n\nIron\nSulfur\n\n\nMagnesium\nVerified Net Energy for Lactation\n\n\nManganese\nVitamin A\n\n\nNeutral Detergent Fiber\nVitamin D\n\n\nNeutral Detergent Fiber from\nVitamin E\n\n\nRoughage\nZinc\n\n\nNiacin\n\n\nNon Fiber Carbohydrates",
        "Evaluation criteria are typically related to factors representative of animal productivity and reflect an aspect of production a producer would like to optimize. The present system allows a producer to select evaluation criteria (e.g. cost/gain, cost/output, animal production rate, and/or feed/gain) which fits the producer's production goals. For example, a dairy producer may focus on the cost of feed required to produce a unit of output (cost/output), whereas a pork producer may focus on cost/gain or rate of gain.",
        "Examples of suitable animal production criteria which may be used as evaluation criteria in the generation of ration data include (i) animal production rate, (ii) the cost of feed per unit animal weight gain, and (iii) the feed weight per unit animal weight gain. The animal production rate may simply be a measure representative of the rate of weight gain of the animal in question (rate of gain). For example, a pork producer may wish to optimize rate of gain by selecting a feed which maximizes the rate at which a pig gains weight. This could be selected if a pig farmer was interested in turning over production as quickly as possible in a fixed asset which has limited space. The evaluation data may include data representative of the cost of feed required to produce a unit of weight gain of the animal (“cost/gain” basis). For example, a pork producer may wish to optimize cost/gain by selecting a feed which minimizes the feed cost required to make a pig gain a unit of weight. The evaluation data can include data representative of the amount of feed required to produce a unit of gain (feed/gain). For example, a producer may wish to optimize the feed/gain by selecting a feed which minimizes the amount of feed required to produce a unit of gain. A producer might select this criterion if they were faced with feed storage space constraints.",
        "Examples of other suitable animal production rates which may be used as an evaluation criteria include rates of production of food products, such as milk or eggs, from the animal. Other suitable evaluation criteria include the cost of feed required to produce a unit of output of a particular animal product (“cost/output”). For example, a milk producer may wish to optimize the cost/output by selecting a feed which minimizes the cost of feed required to produce a unit of milk. In addition to utilizing evaluation data representative of only a single evaluation criteria, the present system may be capable of using evaluation data representative of a combination of two or more evaluation criteria in generating the ration data. For example, when considering an appropriate feed, a producer may wish to generate a custom feed based on the rate of production as well as cost of the feed (typically on a cost/gain basis).",
        "Furthermore, the producer may choose to weight the relative contributions of two or more evaluation criteria. The system may include a data processing circuit which generates ration data based in part upon a weighted average of more than one evaluation criteria. In one specific embodiment, the system generates ration data based in part upon a 70:30 weighted average of two evaluation criteria (primary and secondary), such as a combination of cost of feed per unit animal weight gain and animal production rate. The system may also allow a user to alter the relative weighting accorded to the various evaluation criteria selected.",
        "For instance, in the example referred to above, the producer may want to generate ration data using a combination of evaluation criteria that is weighted 70% on a cost/gain basis and 30% on a rate of animal weight gain basis. One method for providing such a weighted optimization analysis is to generate one solution for ration data using cost/gain as the sole evaluation criteria and generating a second for ration data using rate of animal weight gain as the sole evaluation criteria. Ration data which is representative of the weighted combined solution can be achieved by summing 70% of the amounts of ingredients from the cost/gain ration data set and 30% of the amounts of ingredients from the rate of gain ration data set. For example, in the instance where cost/gain ration data (generated solely on a cost/gain basis) includes 10% dehulled corn meal, and rate of gain ration data (generated solely on a rate of gain basis) includes 15% dehulled corn meal, if a producer chose cost/gain as the primary evaluation criteria the ingredient mix in the diet will include roughly 70% of the 10% dehulled corn meal requirement, and 30% of the 15% dehulled corn meal requirement summed to produce the amount of dehulled corn meal in the overall diet (i.e., circa 11.5% dehulled corn meal). This weighted summation is then repeated for all the amounts of ingredients present in the two custom diets generated by the two approaches. As one skilled in the art will recognize, there are other methods of generating ration data based on a weighted combination of evaluation criteria. The present system can also be configured to generate ration data based on other weightings of combinations of two or more evaluation criteria (e.g., two evaluation criteria weighted on either a 60:40 or 80:20 basis). In some embodiments of the present system, the weighting factors assigned to various evaluation criteria can themselves be input parameter(s) chosen by a producer to reflect the needs of his/her particular situation.",
        "FIG. 2 depicts the general flow of data in one embodiment of the present system. The system shown in FIG. 2 includes a data processing circuit 30 configured to generate a nutrient profile 32 based on the animal data 31 and optional adjustments which may be provided by a nutritionist. Other data processing circuits generate lists of nutrient amounts associated with individual ingredients available at an on-farm site 33 and manufacturing site 34. A data processing circuit 36, which includes a linear program generates a custom product based on evaluation criteria 35. The linear program typically also generates the custom product solution based on pricing data associated with both the on-farm and manufacturing site ingredients. In one embodiment, retail and wholesale pricing information may be normalized to allow the linear program to facilitate consideration of potential ingredients with different types of associated prices as the basis for a solution to a single multivariable problem. The linear program is a mathematical model capable of solving problems involving a large number of variables limited by constraints using linear math functions. A variety of different linear programs capable of solving problems of this type are known to those of skill in the art. One example of a program of this type is commercially available from Format International as part of computer software system for solving complicated multivariable problems.",
        "Memory portions of the systems which store animal data, evaluation data, and feed data representative of on-hand ingredients and/or mill ingredients are in communication with a data processing unit capable of generating ration data. The data processing unit can include a data processing circuit or a digital processing circuit. The memory portions which store the animal data, feed data for on-hand and mill ingredients, and evaluation data may be in communication with the data processing unit by inputted keyboard commands, mouse commands, a network connection with another computer, personal data assistants, via a modem connection, via an internet, or via an intranet.",
        "Data processing circuit(s) which include the linear program can take input data (e.g., profile data, feed data, evaluation data and ingredient constraint data) as a basis to compute ration data. Ration data includes data specifying a combination of ingredients solution which is solved to fulfill a desired nutrient profile based on one or more evaluation criteria. Ration data generated by the present system generally includes data representative of the types and amounts of ingredients to be used to provide an overall custom diet for an animal. The ration data provided by the system generally also specifies a solution that is described in terms of a combination of types and amounts of ingredients from a first location (e.g., an on-farm location) and types and amounts of ingredients from at least one additional site (e.g., one or more supplier locations). Where the overall set of potential ingredients includes ingredients located at more than one location, the custom feed specified by the ration data may be made of ingredients located at either a single location or from more than one location. For example, the ration data may define a custom feed made up from ingredients located solely at supplier location or made up from ingredients located at both an on-farm location and a supplier location.",
        "The ration data generally include custom feed data representative of a combination of amounts of the feed ingredients. The custom feed data may specify the type and corresponding amounts of the ingredients to be used in formulating the overall diet of an animal. This may be made up from a set of ingredients available at more than one location, e.g., from ingredients available at a producer's site and as well as ingredients available at a supplier location. The present system may also provide custom feed data which specifies the types and amounts of ingredients to be used from individual locations. For example, the custom feed data may include a listing of the types and amounts of ingredients available at a first location (e.g., on-farm ingredients) to be used to form a first feed mix and a listing of the types and amounts of ingredients available at a second location (e.g., ingredients available at a supplier location) to be used to form a second feed mix. In such instances, the custom feed data will typically also specify the amounts of the first and second feed mixes that are to be used to make up the overall custom diet for an animal.",
        "The ration data typically includes amounts of a variety of types of ingredients. The actual ingredients available at any particular location can vary over time and will generally vary on a regional basis as well as reflect the type of animal feed that is typically produced and/or stored at the particular site. Commonly, the ration data include feed data representative of amounts of ingredients from a number of different ingredient categories, such as a grain source, a protein source, a vitamin source, a mineral source (e.g., a macromineral source and/or a trace mineral source) and/or a fat source. Table 6 includes a list of exemplary ingredients suitable for use in formulating custom feed mixes for a variety of animals. Tables 7, 8 and 9 include lists of ingredients which may be used in generating custom feed products for swine or dairy cattle.",
        "TABLE 7\n\n\n\n\n\nIngredients Suitable for Use in Producing\n\n\na Custom Feed for a Finishing Diet for Swine\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlimet\n\n\n\nBakery Product\n\n\n\nBeet Pulp\n\n\n\nBrewers Rice\n\n\n\nBrown Sugar\n\n\n\nCalcium Carb\n\n\n\nCane Sugar\n\n\n\nCanola Meal\n\n\n\nCereal Fines\n\n\n\nCg Feed\n\n\n\nCholine\n\n\n\nCopper Sulfate\n\n\n\nCorn - Ground Fine\n\n\n\nCorn Gluten Meal\n\n\n\nCorn Oil\n\n\n\nCorn Starch\n\n\n\nDehydrated Alfalfa\n\n\n\nDistillers Grains With Soil\n\n\n\nDried Potato Waste\n\n\n\nDynasol\n\n\n\nFat\n\n\n\nFat Sprayed\n\n\n\nFeather Meal\n\n\n\nFeeding Rate\n\n\n\nFish Meal\n\n\n\nLinseed Meal\n\n\n\nL-Lysine HCl\n\n\n\nLt. Barley\n\n\n\nL-Threonine\n\n\n\nMalt Sprouts\n\n\n\nMeat And Bone Meal\n\n\n\nMenhaden Fish\n\n\n\nMolasses\n\n\n\nMono-Dical Phos\n\n\n\nMonosod Phos\n\n\n\nOat Mill Byproducts\n\n\n\nOat Mill Byproducts\n\n\n\nOats - Ground\n\n\n\nOats - Rolled\n\n\n\nPork Bloodmeal\n\n\n\nSafflower Meal\n\n\n\nSalt\n\n\n\nSelenium\n\n\n\nSoybean Hulls\n\n\n\nSoybean Meal\n\n\n\nSoybean Oil\n\n\n\nSunflower\n\n\n\nTryptosin\n\n\n\nWheat Midds",
        "TABLE 8\n\n\n\n\n\nIngredients Suitable for Use in Producing\n\n\na Custom Feed for Breeding Swine\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAlimet\n\n\n\nAnimal Fat\n\n\n\nAscorb Acid\n\n\n\nBakery Product\n\n\n\nBentonite\n\n\n\nBlood Meal - Beef/Pork\n\n\n\nCalcium Carbonate\n\n\n\nCereal Fines\n\n\n\nCholine Chloride\n\n\n\nCopper Sulfate\n\n\n\nCorn Germ Meal\n\n\n\nCorn Gluten Feed\n\n\n\nDistillers Grains With Solubles\n\n\n\nDry Methionine Hydroxy Analog\n\n\n\nFish Meal\n\n\n\nMalt Sprouts\n\n\n\nMeat And Bone Meal; Pork Carcass\n\n\n\nMethionine\n\n\n\nMineral Oil\n\n\n\nMolasses-Cane\n\n\n\nMono-Dicalcium Phosphate\n\n\n\nOat Hulls\n\n\n\nRed Flavor\n\n\n\nRice Bran\n\n\n\nSalt\n\n\n\nSelenium\n\n\n\nSoybean Hulls\n\n\n\nThreonine\n\n\n\nTryptophan\n\n\n\nVitamin E\n\n\n\nWheat Midds\n\n\n\nWheat Starch\n\n\n\nZinc Oxide\n\n\n\nZinc Sulfate",
        "TABLE 9\n\n\n\n\n\nIngredients Suitable for Producing\n\n\na Custom Feed for Dairy Cattle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCalcium Carbonate\nSalt\n\n\n\nCopper Sulfate\nSelenium\n\n\n\nCorn Gluten Meal\nSodium Sesquicarbonate\n\n\n\nFat\nSoybean Hulls\n\n\n\nMagnesium Oxide\nSoybean Meal\n\n\n\nMeat And Bone Meal, Pork\nTrace Minerals\n\n\n\nMono-Dical Phos\nUrea\n\n\n\nNiacin\nVitamin-E\n\n\n\nPork Blood Meal\nWheat Midds\n\n\n\nK/Mg/Sulfate\nZin-Pro\n\n\n\nYeast",
        "When feeding animals, producers may not be able to satisfy nutritional requirements of the animals solely using on-hand ingredients (e.g., on-farm ingredients). To satisfy the animal's nutritional requirements, producers may desire to use on-hand ingredients in conjunction with a custom feed product made up of feed ingredients available from an outside supplier, such as a mill, feed mixer, and the like. The outside supplier will commonly have a range of ingredients available or on hand in their inventory (e.g., corn in various forms, soybean meal, wheat mids, barley, oats, animal fat, various vitamin supplements).",
        "In addition to data specifying the types and amounts of ingredients to be used to provide the overall custom diet for an animal, the ration data generated by the present system can also include other data associated with the overall custom diet. Examples of such other data include cost data representative of a cost associated with the custom feed data, feed weight data representative of a feed weight associated with the custom feed data, and performance data representative of projected animal performance associated with the custom feed data. For example, Table 10 below lists a number of categories of ration data that may be useful in assisting a producer and/or supplier in evaluating a custom feed with respect to productivity, animal performance and cost effectiveness. The availability of these types of information can provide a producer and/or supplier with additional information concerning the effects of variations in dietary composition on factors such as cost, volume of feed, wastage and animal performance. As with the listing(s) of the types and amounts of ingredients, the cost data and feed weight data can be representative of costs and feed weights associated with the overall custom diet and/or with feed mix(es) to be provided from individual locations.",
        "TABLE 10\n\n\n\n\n\nIllustrative Categories of Ration Data\n\n\nAssociated with a Custom Feed for Swine\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEnd Weight\nLean Gain\n\n\n\nDays in Phase\nLean %\n\n\n\nAvg Daily Gain\nEffective Ambient Temp\n\n\n\nAvg Daily Feed Intake\nCost of Gain\n\n\n\nTotal Feed Consumed\nTotal Cost per phase\n\n\n\nFeed/Gain",
        "In other variations of the embodiments described herein, the systems and/or methods may also include a memory portion in communication with the digital processor which stores variation data representative of a range for one or more nutrient components of the nutrient profile. The digital processor is capable of generating a set of ration data based upon the variation data. The memory portion may store variation data which correspond to preselected incremental variations for the values assigned to one or more individual nutrients in the nutritional profile. For example, memory portion may store variation data which correspond to preselected incremental positive and negative variations of the values assigned to two individual nutrients, such as true digestible lysine and net energy. The digital processor would generate ration data corresponding to each of the eight possible additional combinations of values for the two specified nutrients. Together with the ration data associated with the original nutritional profile, the resulting set of nine ration data corresponding to the various combinations of values for each specified nutrient (original value, original value plus an increment; original value minus an increment) would make up a three by three matrix of ration data. One example of this approach is illustrated in Table 11 below. A general approach to generating a set of ration data based upon variation data is depicted schematically in FIG. 3. The determination of ration data for the center point in the matrix (“Ration Data 5”) corresponds to the solution generated by the data processing circuit based on the nutrient profile. In the example shown in Table 11, the nutrient profile has values of 0.90% for true digestible lysine and 2150 kcal/kg for net energy. Each of the eight other ration data in the set depicted in Table 11 corresponds to a ration data generated for a modified nutrient profile in which the value for at least one nutrient has been varied by a specified increment. For example, Ration Data 1 represents ration data associated with a modified nutrient profile has values of 0.95% for true digestible lysine and 2100 kcal/kg for net energy. Ration Data 6 represents ration data associated with a modified nutrient profile in which only the value for true digestible lysine (0.85%) has been varied from the values in the nutrient profile. The generation of such a matrix can facilitate an evaluation of the effect of incremental variations in amounts of specified nutrient(s) on the assessment of optimum ration data for a given evaluation criteria.",
        "TABLE 11\n\n\n\n\n\n\n\nTrue Digestible Lysine\n\n\n\n\n\n\n\n\n\n\n\n\n\n0.95%\n0.90%\n0.85%\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNet\n2100\nRation Data 1\nRation Data 2\nRation Data 3\n\n\nEnergy\n2150\nRation Data 4\nRation Data 5\nRation Data 6\n\n\n(kcal/kg)\n2200\nRation Data 7\nRation Data 8\nRation Data 9",
        "The invention has been described with reference to various specific and illustrative embodiments and techniques. However, it should be understood that many variations and modifications may be made while remaining within the spirit and scope of the invention.",
        "TABLE 6\n\n\n\n\n\nExemplary Ingredients Suitable for\n\n\nUse in Formulating Custom Feed Mixes\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAcidulated Soap Stocks\n\n\n\nActive Dry Yeast\n\n\n\nAlfalfa Meal\n\n\n\nAlfalfa-Dehydrated\n\n\n\nAlimet\n\n\n\nAlka Culture\n\n\n\nAlkaten\n\n\n\nAlmond Hulls\n\n\n\nAmmonium Chloride\n\n\n\nAmmonium Lignin\n\n\n\nAmmonium\n\n\n\nPolyphosphate\n\n\n\nAmmonium Sulfate\n\n\n\nAmprol\n\n\n\nAmprol Ethopaba\n\n\n\nAnhydrous Ammonia\n\n\n\nAppetein\n\n\n\nApramycin\n\n\n\nArsanilic Acid\n\n\n\nAscorb Acid\n\n\n\nAspen Bedding\n\n\n\nAvaila\n\n\n\nAvizyme\n\n\n\nBacitracin Zinc\n\n\n\nBakery Product\n\n\n\nBarley\n\n\n\nBarley-Crimped\n\n\n\nBarley-Ground\n\n\n\nBarley-Hulless\n\n\n\nBarley-Hulls\n\n\n\nBarley-Midds\n\n\n\nBarley-Needles\n\n\n\nBarley-Rolled\n\n\n\nBarley-St. Bon.\n\n\n\nBarley-Whole\n\n\n\nBarley-With Enzyme\n\n\n\nBaymag\n\n\n\nBeef Peanut Hulls\n\n\n\nBeef Peanut Meal\n\n\n\nBeet\n\n\n\nBeet Pulp\n\n\n\nBiotin\n\n\n\nBiscuit By Product\n\n\n\nBlack Beans\n\n\n\nBlood-Flash Dry\n\n\n\nBlueprint Rx\n\n\n\nBone Meal\n\n\n\nBrewers Rice\n\n\n\nBrix Cane\n\n\n\nBuckwheat\n\n\n\nBugs\n\n\n\nCage Calcium\n\n\n\nCalcium Cake\n\n\n\nCalcium Chloride\n\n\n\nCalcium Formate\n\n\n\nCalcium Iodate\n\n\n\nCalcium Sulfate\n\n\n\nCalciun Prop\n\n\n\nCalf Manna\n\n\n\nCanadian Peas\n\n\n\nCane-Whey\n\n\n\nCanola Cake\n\n\n\nCanola Fines\n\n\n\nCanola Meal\n\n\n\nCanola Oil\n\n\n\nCanola Oil Blender\n\n\n\nCanola Oil Mix\n\n\n\nCanola Screenings\n\n\n\nCanola-Whole\n\n\n\nCarbadox\n\n\n\nCarob Germ\n\n\n\nCarob Meal\n\n\n\nCashew Nut By Product\n\n\n\nCatfish Offal Meal\n\n\n\nCholine Chloride\n\n\n\nChromium Tripicolinate\n\n\n\nCitrus Pulp\n\n\n\nClopidol\n\n\n\nCobalt\n\n\n\nCobalt Carbonate\n\n\n\nCobalt Sulfate\n\n\n\nCocoa Cake\n\n\n\nCocoa Hulls\n\n\n\nCopper Oxide\n\n\n\nCopper Sulfate\n\n\n\nCorn Chips\n\n\n\nCorn Chops\n\n\n\nCorn Coarse Cracked\n\n\n\nCorn-Coarse Ground\n\n\n\nCorn Cob-Ground\n\n\n\nCorn Distillers\n\n\n\nCorn Flint\n\n\n\nCorn Flour\n\n\n\nCorn Germ Bran\n\n\n\nCorn Germ Meal\n\n\n\nCorn Gluten\n\n\n\nCorn-High Oil\n\n\n\nCorn Kiblets\n\n\n\nCorn Meal Dehulled\n\n\n\nCorn Oil\n\n\n\nCorn Residue\n\n\n\nCorn Starch\n\n\n\nCorn/Sugar Blend\n\n\n\nCorn-Cracked\n\n\n\nCorn-Crimped\n\n\n\nCorn-Ground Fine\n\n\n\nCorn-Ground Roasted\n\n\n\nCorn-Steam Flaked\n\n\n\nCorn-Steamed\n\n\n\nCorn-Whole\n\n\n\nCottonseed Culled\n\n\n\nCottonseed Hull\n\n\n\nCottonseed Meal\n\n\n\nCottonseed Oil\n\n\n\nCottonseed Whole\n\n\n\nCoumaphos\n\n\n\nCulled Beans\n\n\n\nDanish Fishmeal\n\n\n\nDecoquinate\n\n\n\nDextrose\n\n\n\nDiamond V Yeast\n\n\n\nDisodium Phosphate\n\n\n\nDistillers Grains\n\n\n\nDried Apple Pomace\n\n\n\nDried Brewers Yeast\n\n\n\nDried Distillers Milo\n\n\n\nDried Porcine\n\n\n\nDried Whole Milk\n\n\n\nPowder\n\n\n\nDuralass\n\n\n\nEnzyme Booster\n\n\n\nEpsom Salts\n\n\n\nErythromycin\n\n\n\nExtruded Grain\n\n\n\nExtruded Soy Flour\n\n\n\nFat\n\n\n\nFeather Meal\n\n\n\nFeeding Oatmeal\n\n\n\nFenbendazole\n\n\n\nFermacto\n\n\n\nFerric Chloride\n\n\n\nFerrou Cabonate\n\n\n\nFerrous Carbonate\n\n\n\nFerrous Sulfate\n\n\n\nFine Job's Tear Bran\n\n\n\nFish Meal\n\n\n\nFish\n\n\n\nFlavoring\n\n\n\nFolic Acid\n\n\n\nFrench Fry Rejects\n\n\n\nFresh Arome\n\n\n\nFried Wheat Noodles\n\n\n\nGold Dye\n\n\n\nGold Flavor\n\n\n\nGrain Dust\n\n\n\nGrain Screening\n\n\n\nGranite Grit\n\n\n\nGrape Pomace\n\n\n\nGreen Dye\n\n\n\nGreen Flavor\n\n\n\nGuar Gum\n\n\n\nHard Shell\n\n\n\nHemicellulose Extract\n\n\n\nHemp\n\n\n\nHerring Meal\n\n\n\nHominy\n\n\n\nHygromycin\n\n\n\nIndian Soybean Meal\n\n\n\nIron Oxide-Red\n\n\n\nIron-Oxide Yellow\n\n\n\nJob's Tear Broken Seeds\n\n\n\nKapok Seed Meal\n\n\n\nKelp Meal\n\n\n\nKem Wet\n\n\n\nLactose\n\n\n\nLarvadex\n\n\n\nLasalocid\n\n\n\nLevams Hcl\n\n\n\nLimestone\n\n\n\nLinco\n\n\n\nLincomix\n\n\n\nLincomycin\n\n\n\nLinseed Meal\n\n\n\nLiquid Fish Solubles\n\n\n\nLupins\n\n\n\nLysine\n\n\n\nMagnesium\n\n\n\nMagnesium Sulfate\n\n\n\nMalt Plant By-Products\n\n\n\nManganous Ox\n\n\n\nMaple Flavor\n\n\n\nMasonex\n\n\n\nMeat And Bone Meal\n\n\n\nMeat And Bone Meal\n\n\n\nMeat Meal\n\n\n\nMepron\n\n\n\nMethionine\n\n\n\nMillet Screenings\n\n\n\nMillet White\n\n\n\nMillet-Ground\n\n\n\nMilo Binder\n\n\n\nMilo-Coarse Ground\n\n\n\nMilo-Cracked\n\n\n\nMilo-Whole\n\n\n\nMineral Flavor\n\n\n\nMineral Oil\n\n\n\nMixed Blood Meal\n\n\n\nMolasses\n\n\n\nMolasses Blend\n\n\n\nMolasses Dried\n\n\n\nMolasses Standard Beet\n\n\n\nMolasses Standard Cane\n\n\n\nMolasses-Pellet\n\n\n\nMold\n\n\n\nMonensin\n\n\n\nMonoamonum Phos\n\n\n\nMonosodium Glutamate\n\n\n\nMonosodium Phosphate\n\n\n\nMung Bean Hulls\n\n\n\nMustard Meal High Fat\n\n\n\nMustard Oil\n\n\n\nMustard Shorts\n\n\n\nNarasin\n\n\n\nNatuphos\n\n\n\nNiacin\n\n\n\nNicarbazin\n\n\n\nNitarsone\n\n\n\nOat Cullets\n\n\n\nOat Flour\n\n\n\nOat Groats\n\n\n\nOat Hulls\n\n\n\nOat Mill Byproducts\n\n\n\nOat Screenings\n\n\n\nOat Whole Cereal\n\n\n\nOatmill Feed\n\n\n\nOats Flaked\n\n\n\nOats-Ground\n\n\n\nOats-Hulless\n\n\n\nOats-Premium\n\n\n\nOats-Rolled\n\n\n\nOats-Whole\n\n\n\nOyster Shell\n\n\n\nPaddy Rice\n\n\n\nPalm Kernel\n\n\n\nPapain\n\n\n\nPapain Enzyme\n\n\n\nPaprika Spent Meal\n\n\n\nParboiled Broken Rice\n\n\n\nPea By-Product\n\n\n\nPea Flour\n\n\n\nPeanut Meal\n\n\n\nPeanut Skins\n\n\n\nPelcote Dusting\n\n\n\nPhosphate\n\n\n\nPhosphoric Acid\n\n\n\nPhosphorus\n\n\n\nPhosphorus\n\n\n\nDefluorinated\n\n\n\nPig Nectar\n\n\n\nPlant Waste\n\n\n\nPoloxalene\n\n\n\nPopcorn\n\n\n\nPopcorn Screenings\n\n\n\nPorcine Plasma; Dried\n\n\n\nPork Bloodmeal\n\n\n\nPorzyme\n\n\n\nPosistac\n\n\n\nPotassium Bicarbonate\n\n\n\nPotassium Carbonate\n\n\n\nPotassium Magnesium\n\n\n\nSulfate\n\n\n\nPotassium Sulfate\n\n\n\nPotato Chips\n\n\n\nPoultry Blood/Feather\n\n\n\nMeal\n\n\n\nPoultry Blood Meal\n\n\n\nPoultry Byproduct\n\n\n\nPredispersed Clay\n\n\n\nProbios\n\n\n\nProcain Penicillen\n\n\n\nPropionic Acid\n\n\n\nPropylene Glycol\n\n\n\nPyran Tart\n\n\n\nPyridoxine\n\n\n\nQuest Anise\n\n\n\nRabon\n\n\n\nRapeseed Meal\n\n\n\nRed Flavor\n\n\n\nRed Millet\n\n\n\nRiboflavin\n\n\n\nRice Bran\n\n\n\nRice By-Products\n\n\n\nFractions\n\n\n\nRice Dust\n\n\n\nRice Ground\n\n\n\nRice Hulls\n\n\n\nRice Mill By-Product\n\n\n\nRice Rejects Ground\n\n\n\nRoxarsone\n\n\n\nRumen Paunch\n\n\n\nRumensin\n\n\n\nRye\n\n\n\nRye Distillers\n\n\n\nRye With Enzymes\n\n\n\nSafflower Meal\n\n\n\nSafflower Oil\n\n\n\nSafflower Seed\n\n\n\nSago Meal\n\n\n\nSalinomycin\n\n\n\nSalt\n\n\n\nScallop Meal\n\n\n\nSeaweed Meal\n\n\n\nSelenium\n\n\n\nShell Aid\n\n\n\nShrimp Byproduct\n\n\n\nSilkworms\n\n\n\nSipernate\n\n\n\nSodium Acetate\n\n\n\nSodium Benzoate\n\n\n\nSodium Bicarbonate\n\n\n\nSodium Molybdate\n\n\n\nSodium Sesquicarbonate\n\n\n\nSodium Sulfate\n\n\n\nSolulac\n\n\n\nSoweena\n\n\n\nSoy Flour\n\n\n\nSoy Pass\n\n\n\nSoy Protein Concentrate\n\n\n\nSoybean Cake\n\n\n\nSoybean Curd By-\n\n\n\nProduct\n\n\n\nSoybean Dehulled Milk\n\n\n\nBy-Product\n\n\n\nSoybean Hulls\n\n\n\nSoybean Mill Run\n\n\n\nSoybean Oil\n\n\n\nSoybean Residue\n\n\n\nSoybeans Extruded\n\n\n\nSoybeans-Roasted\n\n\n\nSoycorn Extruded\n\n\n\nSpray Dried Egg\n\n\n\nStandard Micro Premix\n\n\n\nStarch Molasses\n\n\n\nSteam Flaked Corn\n\n\n\nSteam Flaked Wheat\n\n\n\nSugar (Cane)\n\n\n\nSulfamex-Ormeto\n\n\n\nSulfur\n\n\n\nSulfur\n\n\n\nSunflower Meal\n\n\n\nSunflower Seed\n\n\n\nTallow Fancy\n\n\n\nTallow-Die\n\n\n\nTallow-Mixer\n\n\n\nTapioca Meal\n\n\n\nTapioca Promeance\n\n\n\nTaurine\n\n\n\nTerramycin\n\n\n\nThiabenzol\n\n\n\nThiamine Mono\n\n\n\nThreonine\n\n\n\nTiamulin\n\n\n\nTilmicosin\n\n\n\nTomato Pomace\n\n\n\nTrace Min\n\n\n\nTricalcium Phosphate\n\n\n\nTriticale\n\n\n\nTryptophan\n\n\n\nTryptosine\n\n\n\nTuna Offal Meal\n\n\n\nTylan\n\n\n\nTylosin\n\n\n\nUrea\n\n\n\nVegetable Oil Blend\n\n\n\nVirginiamycin\n\n\n\nVitamin A\n\n\n\nVitamin B Complex\n\n\n\nVitamin B12\n\n\n\nVitamin D3\n\n\n\nVitamin E\n\n\n\nWalnut Meal\n\n\n\nWheat Bran\n\n\n\nWheat Coarse Ground\n\n\n\nWheat Germ Meal\n\n\n\nWheat Gluten\n\n\n\nWheat Meal Shredded\n\n\n\nWheat Millrun\n\n\n\nWheat Mix\n\n\n\nWheat Noodles Low Fat\n\n\n\nWheat Red Dog\n\n\n\nWheat Starch\n\n\n\nWheat Straw\n\n\n\nWheat With Enzyme\n\n\n\nWheat-Ground\n\n\n\nWheat-Rolled\n\n\n\nWheat-Whole\n\n\n\nWhey Dried\n\n\n\nWhey Permeate\n\n\n\nWhey Protein\n\n\n\nConcentrate\n\n\n\nWhey-Product Dried\n\n\n\nYeast Brewer Dried\n\n\n\nYeast Sugar Cane\n\n\n\nZinc\n\n\n\nZinc Oxide\n\n\n\nZoalene"
    ],
    "citations": [
        "4463706",
        "4493290",
        "4498424",
        "4517923",
        "4532892",
        "4589372",
        "4712511",
        "4729894",
        "5105767",
        "5174244",
        "5309864",
        "5355833",
        "5374524",
        "5474085",
        "5478989",
        "5579719",
        "5595444",
        "5636118",
        "5668718",
        "5673647",
        "5700590",
        "5816191",
        "5843498",
        "5878402",
        "5901660",
        "6076043",
        "6082304",
        "6115692",
        "6135055",
        "6314909",
        "6394963",
        "6556948",
        "6658308",
        "6681717",
        "6805074",
        "6868804",
        "6895893",
        "2002/0007798",
        "2002/0082486",
        "2004/0098209",
        "0 715 806",
        "209 360",
        "WO 00/41575",
        "WO 01/54043",
        "WO 01/89285",
        "WO 02/02822",
        "WO 02/47473"
    ],
    "us_classification": "119 5102",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "01",
            "subclass": "K",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}