{
    "title": "Actuator cap and product refill for a housing",
    "abstract": "An actuator cap for a container of product includes a main peripheral wall and a central discharge member axially movable relative to the main peripheral wall. The central discharge member is oriented to discharge product substantially axially. A pillar has a peripheral surface, and the pillar is deflectable relative to the main peripheral wall in a direction toward the central discharge member. Movement of the pillar is communicated to the central discharge member to displace the central discharge member when the pillar is deflected.",
    "inventors": [
        "Mineau",
        "Yee",
        "Houser",
        "McCracken"
    ],
    "document_number": "07296713",
    "publication_date": "20071120",
    "assignees": [
        "S.C. Johnson & Son, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. An actuator cap for a container of product in combination with a housing having a housing wall that tapers to a discharge opening, the actuator cap comprising:",
            "components": [
                {
                    "component": "a main peripheral wall;",
                    "subcomponents": []
                },
                {
                    "component": "a central discharge member axially movable relative to the main peripheral wall and oriented to discharge product substantially axially; and",
                    "subcomponents": []
                },
                {
                    "component": "a pillar having a peripheral surface, the pillar being radially deflectable relative to the main peripheral wall in a direction toward the central discharge member;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the pillar is disposed in interfering relationship with the housing wall and movement of the pillar is communicated to the central discharge member to displace the central discharge member when the pillar is deflected.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The actuator cap of claim 1 , further comprising an additional pillar spaced from the pillar.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The actuator cap of claim 2 , wherein centerlines of the additional pillar and the pillar are arcuately spaced apart by about 180 degrees.",
            "components": []
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The actuator cap of claim 1 , wherein the pillar is connected to the central discharge member.",
            "components": []
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The actuator cap of claim 1 , wherein the pillar is not connected to the central discharge member.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. The actuator cap of claim 1 , further comprising an actuator arm extending from the central discharge member in a direction from the central discharge member toward the main peripheral wall wherein movement of the pillar is communicated to the actuator arm which in turn axially displaces the central discharge member.",
            "components": []
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The actuator cap of claim 1 , in combination with a container of pressurized product wherein product discharges from the container when the central discharge member is axially displaced.",
            "components": []
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The actuator cap of claim 7 , wherein the discharge opening has a cross sectional size larger than a radius of the container.",
            "components": []
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. The actuator cap of claim 2 , wherein the pillars are biased radially away from the central discharge member.",
            "components": []
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The actuator cap of claim 1 , wherein a distance is measured between an exterior surface of the pillar and an axial centerline of the cap and wherein the distance is greater than one-quarter the diameter of an end of the cap for fitting to the container.",
            "components": []
        },
        {
            "claim_number": "CLM-00011",
            "preamble": "11. The actuator cap of claim 7 , wherein a distance is measured between an exterior surface of the pillar and an axial centerline of the cap and wherein the distance is greater than one-quarter the diameter of a main body of the container.",
            "components": []
        },
        {
            "claim_number": "CLM-00012",
            "preamble": "12. The actuator cap of claim 1 , further comprising means for orienting the actuator cap in a particular angular orientation when placed into the housing.",
            "components": []
        },
        {
            "claim_number": "CLM-00013",
            "preamble": "13. The actuator cap of claim 1 , wherein the peripheral surface is tapered.",
            "components": []
        },
        {
            "claim_number": "CLM-00014",
            "preamble": "14. A product refill in combination with a housing therefor, comprising:",
            "components": [
                {
                    "component": "a container of product;",
                    "subcomponents": []
                },
                {
                    "component": "a housing wall that tapers to a discharge opening; and",
                    "subcomponents": []
                },
                {
                    "component": "an actuator cap including:",
                    "subcomponents": [
                        "a main peripheral wall;",
                        "a central discharge member axially movable relative to the main peripheral wall and oriented to discharge product substantially axially; and",
                        "a pillar having a peripheral surface, the pillar being radially deflectable relative to the main peripheral wall in a direction toward the central discharge member;"
                    ]
                },
                {
                    "component": "a main peripheral wall;",
                    "subcomponents": []
                },
                {
                    "component": "a central discharge member axially movable relative to the main peripheral wall and oriented to discharge product substantially axially; and",
                    "subcomponents": []
                },
                {
                    "component": "a pillar having a peripheral surface, the pillar being radially deflectable relative to the main peripheral wall in a direction toward the central discharge member;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the pillar is disposed in interfering relationship with the housing wall and movement of the pillar is communicated to the central discharge member to displace the central discharge member when the pillar is deflected; and",
                    "subcomponents": []
                },
                {
                    "component": "wherein a length between the peripheral surface and an axial centerline of the cap is greater than about one-quarter a largest lateral dimension across the product refill.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00015",
            "preamble": "15. The product refill of claim 14 , further comprising an additional pillar spaced from the pillar.",
            "components": []
        },
        {
            "claim_number": "CLM-00016",
            "preamble": "16. The product refill of claim 14 , wherein the pillar is connected to the central discharge member.",
            "components": []
        },
        {
            "claim_number": "CLM-00017",
            "preamble": "17. The product refill of claim 14 , wherein the pillar is not connected to the central discharge member.",
            "components": []
        },
        {
            "claim_number": "CLM-00018",
            "preamble": "18. The product refill of claim 14 , further comprising an actuator arm extending from the central discharge member in a direction from the central discharge member toward the main peripheral wall wherein movement of the pillar is communicated to the actuator arm which in turn axially displaces the central discharge member.",
            "components": []
        },
        {
            "claim_number": "CLM-00019",
            "preamble": "19. The product refill of claim 14 , wherein the discharge opening has a cross sectional size larger than a radius of the container.",
            "components": []
        },
        {
            "claim_number": "CLM-00020",
            "preamble": "20. The product refill of claim 14 , wherein the largest lateral dimension is a diameter of an end of the cap for fitting to the container.",
            "components": []
        },
        {
            "claim_number": "CLM-00021",
            "preamble": "21. The product refill of claim 14 , wherein the largest lateral dimension is a diameter of a main body of the container.",
            "components": []
        },
        {
            "claim_number": "CLM-00022",
            "preamble": "22. The product refill of claim 14 further comprising means for orienting the product refill in a particular angular orientation when placed into the housing.",
            "components": []
        },
        {
            "claim_number": "CLM-00023",
            "preamble": "23. The product refill of claim 14 , further comprising a positioning key.",
            "components": []
        },
        {
            "claim_number": "CLM-00024",
            "preamble": "24. The product refill of claim 23 , wherein the positioning key comprises a positioning rib extending from the product refill.",
            "components": []
        },
        {
            "claim_number": "CLM-00025",
            "preamble": "25. The product refill of claim 14 , wherein the container is cylindrical.",
            "components": []
        },
        {
            "claim_number": "CLM-00026",
            "preamble": "26. The product refill of claim 23 , wherein the central discharge member is oriented to discharge product at an angle to an axial centerline of the cap and wherein the angle is less than 90 degrees.",
            "components": []
        }
    ],
    "description": [
        "Not applicable",
        "Not applicable",
        "Not applicable",
        "1. Field of the Invention",
        "The present invention relates generally to actuating apparatus, and more particularly to actuator caps that are placed on containers and used to dispense product from the containers.",
        "2. Description of the Background of the Invention",
        "Various apparatus for dispensing product from a container or reservoir of product have been developed. Smrt U.S. Pat. No. 5,287,998 discloses an actuator fitted to a container and including an axially extending passage therethrough for discharging product. The actuator includes a pair of wings that extend transversely from the actuator. The container may be moved axially within a device such that the wings bear against a surface defining a passage, thereby discharging product through the passage.",
        "Brotspies et al. U.S. Pat. No. 6,386,397 discloses a spray bottle grip used with a nasal spray bottle. The grip is coupled to a reciprocating nozzle of the spray bottle, and two arms extend downwardly along the spray bottle. The arms include finger flanges that provide an ergonomic means of reciprocating the nozzle to dispense product from the spray bottle.",
        "Haas U.S. Pat. No. 3,318,492 discloses a disc-shaped actuator attached to a nozzle of a container. A user may depress the actuator with his finger to dispense product from the container.",
        "Scheindel et al. U.S. Pat. No. 6,340,103 discloses a handle extending along a container body. When a user pulls the handle toward the container body, a portion of the handle pushes downwardly upon a nozzle portion of the container to dispense product from the container.",
        "Micallef U.S. Pat. No. 4,138,039 discloses a container having a vertically reciprocating tubular pump. A cap is fitted to the container and includes an actuator button extending from a sidewall of the cap. Movement of the actuator button in a direction toward the sidewall of the cap is translated into perpendicular reciprocating movement of the pump.",
        "Other patents disclose devices having a container of product disposed at a first end of a rod and having a trigger mechanism at a second end of the rod wherein a user may actuate the container from a distance. Discharging product from a distance can be an advantage for many purposes, such as accessing hard-to-reach places or perhaps for discharging an insecticide into a hornet nest without placing oneself too close to the nest. Smrt U.S. Pat. No. 5,518,148 discloses a device where an actuating rod has a trigger on a first end and a container on a second end. Pulling the trigger moves the actuating rod longitudinally such that the second end of the rod moves a bell crank, which in turn, moves an additional rod that actuates a valve on the container. Aberegg et al. U.S. Pat. No. 6,551,001, assigned to the assignee of the present application and the disclosure of which is incorporated by reference herein, discloses a cleaning device having a trigger at a first end of a rod and a mop cleaning head and a container at a second end of the rod. Pulling the trigger moves a pivot link, which in turn actuates a valve of the container, thereby discharging product from the container onto the surface to be cleaned by the mop cleaning head.",
        "Adams et al. U.S. Pat. No. 5,358,147, assigned to the present assignee and also incorporated herein by reference, discloses a container of air freshener inserted into a shroud. The shroud includes a nozzle that is fitted over a valve stem of the container. The combination of the container and the shroud is placed within a housing. When a user wishes to spray air freshener into ambient air, the user pushes the housing, which in turn pushes the shroud and the valve stem to dispense the air freshener out of the housing.",
        "In accordance with one aspect of the present invention, an actuator cap for a container of product includes a main peripheral wall and a central discharge member axially movable relative to the main peripheral wall. The central discharge member is oriented to discharge product substantially axially. A pillar has a peripheral surface, and the pillar is deflectable relative to the main peripheral wall in a direction toward the central discharge member. Movement of the pillar is communicated to the central discharge member to displace the central discharge member when the pillar is deflected.",
        "In accordance with a further aspect of the present invention, a product refill for a housing includes an actuator cap and a container of product. The actuator cap has a main peripheral wall, a central discharge member axially movable relative to the main peripheral wall and oriented to discharge product substantially axially. A pillar of the cap has a peripheral surface, and the pillar is radially deflectable relative to the main peripheral wall in a direction toward the central discharge member. Movement of the pillar is communicated to the central discharge member to displace the central discharge member when the pillar is deflected. A length between the peripheral surface and an axial centerline of the cap is greater than about one-quarter a largest lateral dimension across the product refill.",
        "Other aspects and advantages of the present invention will become apparent upon consideration of the following detailed description.",
        "FIG. 1 is an exploded isometric view of a container and actuator cap;",
        "FIG. 2 is an exploded isometric view of a housing into which the container and actuator cap of FIG. 1 may be placed;",
        "FIG. 3 is a side elevational view showing a rod and trigger mechanism in combination with the housing of FIG. 2;",
        "FIG. 4 is a sectional view taken generally along the lines 4-4 of FIG. 3 further illustrating the container of FIG. 1 in elevation and the actuator cap thereof in section;",
        "FIG. 5 is an enlarged fragmentary view of FIG. 4;",
        "FIG. 6 is a view similar to FIG. 5, but showing the actuator cap of FIG. 1 in an actuating position;",
        "FIG. 7 is a plan view of the actuator cap of FIG. 1;",
        "FIG. 8 is a sectional view taken generally along the lines 8-8 of FIG. 7;",
        "FIG. 9 is a bottom elevational view of the actuator cap of FIG. 1;",
        "FIG. 10 is an enlarged fragmentary isometric view of components of the actuator cap of FIG. 1;",
        "FIG. 11 is an enlarged fragmentary bottom elevational view of the components of the actuator cap of FIG. 1;",
        "FIG. 12 is a sectional view taken generally along the lines 12-12 of FIG. 10;",
        "FIG. 12A is a sectional view similar to FIG. 12, but showing an alternative adapter;",
        "FIG. 13 is a diagrammatic and fragmentary side elevational view of components of the actuator cap of FIG. 1;",
        "FIG. 14 is a diagrammatic and fragmentary side elevational view of components of an actuator cap similar to the actuator cap of FIG. 1;",
        "FIG. 15 is a diagrammatic and fragmentary side elevational view illustrating an alternative actuator arm and pillar design;",
        "FIG. 16 is a full sectional view of an alternative actuator cap;",
        "FIG. 17A is a diagrammatic and fragmentary isometric view partly in section illustrating an alternative adapter;",
        "FIGS. 17B and 17C are fragmentary sectional views illustrating alternative valve stem designs;",
        "FIG. 18 is a diagrammatic full sectional view of an alternative actuator cap;",
        "FIG. 19 is a fragmentary isometric view illustrating the cap of FIG. 18 secured to a container;",
        "FIG. 20 is a fragmentary isometric view of a housing into which the components of FIGS. 18 and 19 may be placed; and",
        "FIG. 21 is a diagrammatic sectional view taken generally along the lines 21-21 of FIG. 20 and further illustrating a fragmentary sectional view of the cap of FIG. 18.",
        "Referring to FIG. 1, a container 50 has a valve stem 52 and a main body 56 containing product. The valve stem 52 could be either a vertically depressible valve stem or a tilt valve stem. As will be appreciated hereinafter, if a tilt valve stem is utilized such stem could also alternatively be depressed vertically without tilting to dispense product therethrough. It should be noted that the valve stem 52 could be replaced by any suitable apparatus that may be displaced to release product from the container 50. An actuator cap 60 is fitted to the container 50. FIG. 2 illustrates a housing 70 into which the container 50 and the actuator cap 60 may be placed. The container 50 and the actuator cap 60 are a product refill for the housing 70. It should be noted that the product refill may include additional components (not shown) besides the container 50 and the actuator cap 60, such as a sleeve (not shown) disposed around the container 50. The actuator cap 60 has deflectable valve actuating apparatus in the form of deflectable pillars 78a-78f and any suitable central adapter 80 secured to the valve stem 52. The housing 70 has a discharge opening 82 through which product stored within the container 50 may be dispensed. Referring to FIGS. 3 and 4, relatively moving the container 50 and the housing 70 such that the container 50 is moved toward the discharge opening 82 deflects the pillars 78, thereby actuating the valve stem 52 as described hereinbelow, causing product to be released from the container 50 and dispensed from the housing 70. A rod and trigger mechanism 84 may be used to move the container 50 within the housing 70. The mechanism 84 includes a hollow tube 86 with a handle assembly 88 at a first end 90 of the tube 86, and a second end 92 of the tube 86 is secured within a sleeve 94 of the housing 70 in any suitable manner such as by welding or appropriately threading the sleeve 94 and the end 92. Pulling a trigger 96 of the handle assembly 88 advances a push rod 100 disposed within the tube 86 against a bottom surface 102 of the container 50, thereby advancing the container 50 toward the discharge opening 82. If necessary or desirable, an end 104 of the push rod 100 may be shaped and/or fitted with a plate or other member to distribute forces more evenly across the bottom surface 102 of the container 50. Further, if desired, rather than moving the container 50 relative to the housing 70 by using the rod and trigger mechanism 84 one could move the container 50 and/or the housing 70 relative to one another by hand to dispense product.",
        "The housing 70 includes a wall 108 that decreases in cross sectional size, tapering to the discharge opening 82. The discharge opening 82 has a cross sectional size greater than a radius R (FIG. 1) of the container 50. Referring again to FIG. 2, the housing 70 may include first and second wall portions 114, 116 that may be joined together to house the container 50 and the actuator cap 60 fitted thereto. The wall portion 114 may include three bayonet slots 118a-118c disposed on an end 120 of the portion 114 and equally spaced from one another by 120 degrees. To join the portions 114, 116, a user inserts pins 124 carried by an end 126 of the portion 116 into the slots 118a-118c and provides a relative rotation of the portions 114, 116 to seat the pins 124 within recessed regions 130a-130c of the slots 118.",
        "Either of the portions 114, 116 may include protrusions 136 such as guide fins 138 having edges 140 that abut the exterior surface of the container 50 to center the container 50 within the housing 70. Either of the portions 114, 116 may include elongate openings or windows 144 that allow a user to see the container 50 when the container 50 is disposed within the housing 70. The housing portions 114, 116 may include three of the windows 144 spaced apart by 120 degrees. One advantage of the windows 144 is that a user might see any written directions or graphics disposed on the container 50. Referring to FIG. 6, a main region 150 of the wall portions 114 and 116 may have an inner cross sectional size C1 of about 66 mm, and thus the product refill, comprising the container 50 and the actuator cap 60, could have a cross sectional size of up to about 66 mm. In this regard, while a range of sizes is available for the container 50 one might wish to provide a container sized at or near maximum to provide a maximum useful life for the container 50 given the available space within the housing 70.",
        "Referring to FIG. 8, the actuator cap 60 decreases in cross sectional size along an axial dimension defined between a first end 152 for fitting to the container 50 and a second end 154. The actuator cap 60 provides a useful centering function in that peripheral surfaces 156a-156f of the pillars 78a-78f maintain a point of discharge 160 of the actuator cap 60 in a centrally located position relative to the discharge opening 82, thereby minimizing the potential for product impingement against a surface 164 of the tapered wall 108. The surfaces 156 may optionally be tapered. Referring also to FIG. 5, the pillars 78a-78f of the actuator cap 60 have a length L defined between a longitudinal centerline C (FIG. 5) of the cap 60 and a peripheral surface 168 of the pillars 78a-78f. The length L is selected relative to the inner dimensions of the tapered wall 108 such that the peripheral surface 168 is disposed in interfering relationship with the tapered wall 108. It should be appreciated that the actuator cap 60 and/or the pillars 78 could have any suitable shape so long as the pillars 78 are sized to have an interference relationship with the tapered wall 108. The length L may have any suitable value such as greater than about one-quarter (25%) a largest diameter of the product refill or greater than or equal to one-third (33%) the largest diameter of the product refill, whether the largest diameter is defined by the container 50, the actuator cap 60, or some other component of the product refill. The length L may be greater than one-quarter (25%) of a largest diameter D of the cap 60, measured at the first end 152. The length L may be greater than or equal to one-third (33%) the largest diameter D. Of course, the length L may be alternatively expressed relative to the size of the container 50. In any event, a largest lateral dimension across the product refill cannot exceed the internal cross sectional size C1 (FIG. 6) of the housing 70, and L may have any suitable value such as greater than one-quarter (25%) of this largest lateral dimension C1. One could select any suitable cross sectional size S (FIG. 5) for the discharge opening 82, such as a cross sectional size of about 34 mm, and suitable values of L might range between about 18 mm and about 33 mm to provide the above-described interfering relationship. A preferred value for L may be about 25 mm. It should be noted that while the tapered wall 108 of the housing 70 is illustrated as symmetrical around the longitudinal centerline C of the housing 70, the wall 108 could be made asymmetrical, greater in cross sectional size in one plane rather than another, and the shape of the actuator cap 60 could be made complementary therewith to serve as a keying function to orient the container 50 relative to the housing 70 in a particular angular orientation. This could be advantageous for various reasons, such as where product discharges in an asymmetrical pattern.",
        "Referring to FIG. 8, the pillars 78 are cantilevered from a main peripheral wall 170 of the actuator cap 60, attached thereto at a hinge point 174. The pillars 78 are capable of being deflected radially inwardly toward the central adapter 80 about the hinge point 174. The pillars 78 are hollow, and arcuate strengthening ribs 176 bisect the hollow pillars 78. The ribs 176 connect an internal surface 180 of the main peripheral wall 170 to internal surfaces 184a-184f (FIG. 9) of the pillars 78. During deflection of the pillars 78, each of the pillars 78 moves unitarily. Referring to FIGS. 5, 6, and 8, a lower edge 187 of the ribs 176 may be positioned sufficiently close to the hinge point 174 such that the ribs 176 need not substantially flex during deflection of the pillars 78. The central adapter 80 is secured to the valve stem 52 as shown in FIGS. 5 and 6. The central adapter 80 includes a nozzle member 190 having a tapered surface 192 to facilitate insertion of the valve stem 52 therein.",
        "Referring to FIGS. 7, 8, and 10, the pillars 78b, 78d, and 78f carry posts 214a, 214b, 214c disposed in notches 215a, 215b, 215c of actuator arms 216a, 216b, 216c. Referring to FIGS. 10 and 8, the arms 216a-216c extend from the central adapter 80 transversely to the axial dimension of the cap 60 and the arms 216a-216c are cantilevered from the central adapter 80. The arms 216a-216c are spaced apart by 120 degrees. Flexible strap members 218, 219, 220 also extend from the central adapter 80 and flexibly connect the central adapter 80 to the main peripheral wall 170 of the cap 60. The strap members 218, 219, 220 are disposed between the arms 216a-216c and are also spaced apart by 120 degrees. The strap members 218, 219, 220 and the arms 216 are disposed in recesses defined between the pillars 78a-78f. Referring to FIG. 8, a cover (not shown) could be fitted to the actuator cap 60 at the position of a phantom line 222 to shield the pillars 78, thereby preventing inadvertent dispensing of product during shipment. The cap 60 may include a ledge 224 modified as necessary for seating the cover. The actuator cap 60 may include a circumferential inwardly-tapered flange 226 and a plurality of spaced apart inwardly-directed beads 228. As shown in FIGS. 5 and 6, the flange 226 and the beads 228 are snap fitted over a rim 230 of the container 50.",
        "Referring to FIG. 6, relatively moving the container 50 and the housing 70 such that the main body 56 of the container 50 and the discharge opening 82 are moved toward each other causes the peripheral surfaces 156 of the pillars 78 to engage the surface 164 of the tapered wall 108, thereby deflecting the pillars 78. During such deflection, the pillars 78 tip inwardly about the hinge point 174, bowing toward the central adapter 80. The posts 214a-214c press against the arms 216a-216c, thereby deflecting the arms 216a-216c and thus displacing the central adapter 80 axially toward the container 50. Sufficient displacement of the central adapter 80 to an actuating position thereof displaces the valve stem 52 into the container 50 such that product dispenses from the container 50, through a spray tip 240 of the nozzle member 190 and out of the housing 70. It should be noted that providing a plurality of the actuator arms 216 and the posts 214 at spaced apart positions, such as 180 degrees or 120 degrees, ensures substantially axial reciprocating movement of the valve stem 52, rather than tilting movement, potentially minimizing product discharge against the tapered wall 108. For example, referring to FIG. 13, if only a single pillar and actuator arm were employed, the central adapter 80 would tilt upon deflection of such single actuator arm. In contrast, it should be evident from FIG. 14 that providing multiple pillars and actuator arms, circumferentially spaced apart by a suitable distance, ensures substantially axial movement of the valve stem 52. It should also be noted that the notches 215 should preferably be sized larger than the posts 214. In this regard, considering the pillars 78 and thus the posts 214 traverse an arcuate path, oversizing the notches 215 accommodates radial sliding movement of the posts 214 as the posts 214 deflect the arms 216 axially toward the container 50.",
        "Referring to FIG. 15, an alternative actuator arm 400 could include a rod 402 or other projection extending therefrom into a deflection path R of one or more pillars 406, similar or identical to the pillars 78. As the pillar 406 moves along the deflection path R, a surface 410 of the pillar 406 pushes the rod 402, and thus deflects the actuator arm 400 axially in the direction of an arrow A.",
        "Referring to FIG. 16, an alternative actuator cap 430 includes one or more connection members 436 connecting the pillars 78 to the central adapter 80. Pivoting of the pillars 78 about the hinge point 174 pulls the connection members 436 axially toward the end 152 of the cap, thereby axially displacing the central adapter 80. The connection members 436 should be designed sufficiently rigid and/or sufficiently taut to provide sufficient axial displacement of the central adapter 80 when the pillars 78 are deflected.",
        "Referring to FIG. 17A, in an alternative arrangement, deflection of a pillar 450 brings a surface 452 of the pillar 450 into engagement with a sloped surface 454 of a flange 460 secured to the valve stem 52. Sufficient deflection of the pillar 450 displaces the valve stem 52 axially into the container 50 to effect dispensing.",
        "Referring to FIG. 17B, the flange 460 may be replaced by a valve stem 470 having an integral flange member 474. The flange member 474 includes a beveled surface 476 for engagement with the surface 452 of the pillar 450. Referring to FIG. 17C, an alternative valve stem 480 has a relatively thick wall 484 and a beveled surface 486.",
        "Referring to FIGS. 12 and 12A, while FIG. 12 shows the adapter 80 having an integrally molded nozzle member 190, FIG. 12A shows that a separately molded nozzle 490 could be made and snap fitted within a separately molded adapter 492. One or more arms 493 may connect inner and outer walls 494a, 494b of the nozzle 490. The nozzle 490 includes a circumferential flange 495 that abuts a lower circumferential surface 496 of the adapter 492, and the nozzle 490 further includes a shoulder surface 498 abutting a circumferential wall 499 of the adapter 492.",
        "FIGS. 18 and 19 illustrate an alternative actuator cap 500. The cap 500 includes an adapter 502 having a spray tip 504 that directs product discharge in the direction of an arrow B. (The details of the arms 216, the strap members 218-220, and the pillars 78 are omitted from FIGS. 18 and 21 for simplicity.) The angle of discharge from the centerline C may be of any suitable value less than 90 degrees, such as 15, 20, or 45 degrees. Referring to FIG. 20, a housing 520 may be provided for the cap 500, and the housing 520 includes a wall 522 that covers a portion of the discharge opening 82. If one attempted to use an actuator cap that discharges product axially along the centerline C, rather than at an angle thereto, such product would impinge against the wall 522. In the design of the components of FIGS. 18-21, one may provide any suitable structures for orienting the container 50 and the cap 500 in a particular orientation relative to the housing 520. For example, FIG. 19 shows that the container 50 may include a positioning key 524, such as a rib 530 that is radially aligned with the spray tip 504 for orienting the container 50 and the actuator cap 500 within the housing 520. FIG. 21 shows a slot 540 that receives the rib 530 to align the container 50 and the cap 500 such that the spray tip 504 discharges product out of the housing 520 rather than against the wall 522. It is within the scope of the invention(s) to alternatively provide a suitable key on the cap 500, rather than on the container 50, and a corresponding slot (not shown) for such key in the housing 520. In addition, one might alternatively provide the product refill with a particular shape corresponding to a particular internal shape of the housing 520 such that the product refill may only be disposed inside the housing 520 in a particular angular orientation.",
        "The actuator cap embodiments disclosed herein may be designed to reduce the likelihood of inadvertent dispensing that might result from a user inadvertently shaking or jostling the housing 70 with the container 50 disposed therein. In this regard, the pillars 78 while deflectable toward the central adapter 80 have an inherent resistance to movement, and a manufacturer may increase or decrease this resistance as desired for a particular actuator cap design. For example, the pillars 78 may be provided with a resilient bias outward away from the central adapter 80. In order to axially displace the central adapter 80 a sufficient distance to the actuating position thereof, an amount of force must be applied that is sufficient to overcome the bias of the pillars 78, and thus move the pillars 78 to allow sufficient deflection of the actuator arms 216a-216c to the actuating position thereof.",
        "Because the pillars 78 must be deflected in order for dispensing to occur, a sufficient amount of external mechanical force must act upon the actuator cap 60 to overcome the resistance provided by the pillars 78. In this regard, this resistance of the pillars 78 against movement provides a reactive force against forces directing the container 50 toward the discharge opening 82, such that this reactive force must be overcome before dispensing may occur. This reactive force is advantageous in that low force levels may be insufficient to overcome same to dispense product from the housing 70. For example, such low force levels may occur from a user jostling the housing 70 while walking or manipulating the housing 70 or may arise as a user shakes the housing 70 to mix the contents of the container 50. Such jostling could cause the cap 60 to be in a condition where the pillars 78 are slightly deflected and the actuator arms 216a-216c are either undeflected or deflected to a lesser extent than the actuating position thereof. Ideally, the reactive force provided by the pillars 78 prevents inadvertent dispensing until such time as the user intentionally applies sufficient force, thereby radially deflecting the pillars 78 and axially deflecting the actuator arms 216a-216c to the actuating position thereof. Thus, the user can pull the trigger 96 shown in FIG. 3 to intentionally dispense product, while inadvertent dispensing is avoided.",
        "The foregoing embodiments may provide one or more of the following advantages.",
        "First, because the deflectable pillars 78 have a sufficiently large value of L, the pillars 78 have an interfering relationship with the tapered wall 108, and thus, the actuator cap 60 is usable with the housing 70 despite the large discharge opening 82. (As noted above, the cross sectional size of the discharge opening 82 is greater than the container radius R.) Containers lacking an actuating apparatus of the length L are not usable with the housing 70. This may be useful because containers lacking a cap with the deflectable pillars 78 of length L may not be designed for use with the housing 70 or the housing 70 may not be marketed for use with a particular container of product that lacks the pillars 78. For example, the housing 70 may be marketed for use with a container of a specific type of insecticide having the actuator cap 60. A further advantage of the large discharge opening 82 and large value of L is that contact near the point of discharge 160 is avoided. Because the tapered wall 108 contacts the peripheral surfaces 156 at the distance L from the orifice of the valve stem 52, the potential for product obstruction or impingement is minimized. This feature could be especially advantageous for some products that fan out while discharging from the container 50 as the product gets farther away from the container 50. The large cross sectional size of the discharge opening 82 would accommodate such fanning out while minimizing potential product impingement or deposition thereupon. A further advantage of the large size of the discharge opening 82 is that the surface 164 of the tapered wall 108 might be potentially more easily manually accessed for cleaning than other housing types.",
        "The product stored within the container body 56 could be any of a broad variety of products such as an air freshener, an insect control agent, a hair spray, a cleaning agent, a polishing agent, a fragrance, or other any other product stored in a container. Further, the product may be pressurized by a suitable propellant disposed within the container 50.",
        "The foregoing embodiments are useful for dispensing a variety of products such as insecticides, cleaning products, air treatment products (e.g., air fresheners), or other products.",
        "Numerous modifications to the present invention will be apparent to those skilled in the art in view of the foregoing description. Accordingly, this description is to be construed as merely exemplary of the inventive concepts taught herein and is presented for the purpose of enabling those skilled in the art to make and use the invention and to teach the best mode of carrying out same. The exclusive rights to all modifications which come within the scope of the appended claims are reserved."
    ],
    "citations": [
        "2575124",
        "2673008",
        "2766913",
        "2941700",
        "3127065",
        "3128916",
        "3161196",
        "3247655",
        "3318492",
        "3404814",
        "3516424",
        "3618833",
        "3648905",
        "3739941",
        "3759431",
        "3760988",
        "3871557",
        "3884398",
        "3884399",
        "3888392",
        "3907175",
        "3915353",
        "3946911",
        "3987942",
        "4013231",
        "4077548",
        "4077549",
        "4087027",
        "4124148",
        "4132359",
        "4138039",
        "4170316",
        "4186855",
        "4277004",
        "4378081",
        "4826054",
        "4860932",
        "5139180",
        "5279444",
        "5287998",
        "D347263",
        "5307959",
        "5310096",
        "5335832",
        "5358147",
        "5411184",
        "5503303",
        "5518148",
        "5702036",
        "5743431",
        "5875926",
        "5875934",
        "5915599",
        "5971226",
        "5992707",
        "6003739",
        "6004056",
        "6299032",
        "6321742",
        "6340103",
        "6386397",
        "6390336",
        "6543653",
        "6551001",
        "D474403",
        "6569387",
        "6588631",
        "6592011",
        "2004/0028458",
        "2004/0188473",
        "2004/0222245",
        "0641727",
        "WO 01/26995",
        "WO01/26995",
        "WO03/024836"
    ],
    "us_classification": "222182",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "B",
            "classification_class": "67",
            "subclass": "D",
            "main_group": "5",
            "subgroup": "06"
        }
    ]
}