{
    "title": "Digital-to-analog converter (DAC) using multiple PWMs and method thereof",
    "abstract": "A digital-to-analog converter (DAC) for generating an analog output voltage according to a digital input value includes a plurality of pulse width modulation (PWM) units and a voltage generating unit. The digital input value includes a plurality of bit segments. The plurality of PWM units generates a plurality of PWM signals according to the plurality of bit segments of the digital input value. The voltage generating unit is coupled to the plurality of PWM units and generates the analog output voltage according to the plurality of PWM signals.",
    "inventors": [
        "Wu",
        "Lee"
    ],
    "document_number": "07298309",
    "publication_date": "20071120",
    "assignees": [
        "MStar Semiconductor, Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A digital-to-analog converter (DAC), for generating an analog output voltage according to a digital input value, the digital input value comprising a plurality of bit segments, the DAC comprising:",
            "components": [
                {
                    "component": "a plurality of pulse width modulation (PWM) units, for generating a plurality of PWM signals according to the plurality of bit segments, respectively; and",
                    "subcomponents": []
                },
                {
                    "component": "a voltage generating unit, coupled to the plurality of PWM units, for generating the analog output voltage according to the plurality of PWM signals.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00002",
            "preamble": "2. The DAC of claim 1 , wherein the plurality of bit segments comprises a first bit segment and a second bit segment, and wherein the plurality of PWM units comprises a first PWM unit and a second PWM unit for generating a first PWM signal and a second PWM signal according to the first bit segment and the second bit segment, respectively.",
            "components": []
        },
        {
            "claim_number": "CLM-00003",
            "preamble": "3. The DAC of claim 2 , wherein:",
            "components": [
                {
                    "component": "the voltage generating unit elevates the analog output voltage by a first voltage step whenever a duty cycle of the first PWM signal is increased by a predetermined time period;",
                    "subcomponents": []
                },
                {
                    "component": "the voltage generating unit elevates the analog output voltage by a second voltage step whenever a duty cycle of the second PWM signal is increased by the predetermined time period; and",
                    "subcomponents": []
                },
                {
                    "component": "the second voltage step is a predetermined number times a size of a first voltage step.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00004",
            "preamble": "4. The DAC of claim 3 , wherein the voltage generating unit comprises:",
            "components": [
                {
                    "component": "a first resistor, a first end of the first resistor being coupled to the first PWM unit for receiving the first PWM signal;",
                    "subcomponents": []
                },
                {
                    "component": "a second resistor, a first end of the second resistor being coupled to the second PWM unit for receiving the second PWM signal; and",
                    "subcomponents": []
                },
                {
                    "component": "a capacitor, a first end of the capacitor being coupled to a second end of the first resistor and a second end of the second resistor for generating the analog output voltage, a second end of the capacitor being coupled to a node having a reference voltage level.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00005",
            "preamble": "5. The DAC of claim 4 , wherein the second resistor has the predetermined number times the resistance of the first resistor.",
            "components": []
        },
        {
            "claim_number": "CLM-00006",
            "preamble": "6. A method for generating an analog output voltage according to a digital input value, the method comprising:",
            "components": [
                {
                    "component": "segmenting the digital input value into a plurality of bit segments;",
                    "subcomponents": []
                },
                {
                    "component": "generating a plurality of PWM signals according to the plurality of bit segments, respectively; and",
                    "subcomponents": []
                },
                {
                    "component": "generating the analog output voltage according to the plurality of PWM signals.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00007",
            "preamble": "7. The method of claim 6 , wherein generating the plurality of PWM signals according to the plurality of bit segments comprises:",
            "components": [
                {
                    "component": "generating a first and a second PWM signal of the plurality of PWM signals according to a first and a second bit segment of the plurality of bit segments, respectively.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00008",
            "preamble": "8. The method of claim 7 , wherein generating the analog output voltage according to the plurality of PWM signals comprises:",
            "components": [
                {
                    "component": "elevating the analog output voltage by a first voltage step whenever a duty cycle of the first PWM signal is increased by a predetermined time period;",
                    "subcomponents": []
                },
                {
                    "component": "elevating the analog output voltage by a second voltage step whenever the duty cycle of the second PWM signal is increased by the step;",
                    "subcomponents": []
                },
                {
                    "component": "wherein the second voltage step is a predetermined number times a size of the first voltage step.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00009",
            "preamble": "9. A digital-to-analog converter (DAC), for converting a digital input value to an analog output voltage, the DAC comprising:",
            "components": [
                {
                    "component": "a first pulse width modulation (PWM) unit, receiving a low portion of the digital input value to generate a first PWM signal;",
                    "subcomponents": []
                },
                {
                    "component": "a second pulse width modulation (PWM) unit, receiving a high portion of the digital input value to generate a second PWM signal;",
                    "subcomponents": []
                },
                {
                    "component": "a first resistor, one end of the first resistor being coupled to the output of the first PWM unit;",
                    "subcomponents": []
                },
                {
                    "component": "a second resistor, one end of the second resistor being coupled to an output of the second PWM unit; and",
                    "subcomponents": []
                },
                {
                    "component": "a capacitor, one end of the capacitor being coupled to the other ends of the first and the second resistors and the other end of the capacitor being coupled to a node having a reference voltage level, wherein the analog output voltage is crossed on the capacitor.",
                    "subcomponents": []
                }
            ]
        },
        {
            "claim_number": "CLM-00010",
            "preamble": "10. The DAC of claim 9 , wherein a resistance of the second resistor has a predetermined number times a resistance of the first resistor.",
            "components": []
        }
    ],
    "description": [
        "1. Field of the Invention",
        "The present invention relates to a digital-to-analog converter (DAC), and more particularly, to a DAC that is realized by a plurality of pulse width modulation (PWM) units, and a method thereof.",
        "2. Description of the Prior Art",
        "A digital-to-analog converter (DAC) is a device that converts a digital input value into a corresponding analog output voltage, which is then supplied to a backend circuit. For example, in a television (TV) system, after the user has chosen a TV channel, the TV system determines a digital input value according to the chosen TV channel. A DAC is utilized to convert the digital input value into an analog output voltage, which is then supplied to a TV tuner and allows the TV tuner to process received TV signals accordingly.",
        "With technological advances, electrical products demand higher and higher resolutions on DACs. More specifically, a DAC is required to generate an accurate analog output voltage according to a digital input value with increased bit counts. However, the cost of a high resolution DAC is usually much higher than that of a low resolution DAC. Since cost is always a critical concern when manufacturing electrical products, reducing the costs of high resolution DACs has becomes a desire of manufacturers of electrical products.",
        "One of the objectives of the present invention is to provide high resolution DACs with low costs.",
        "The invention discloses a DAC for generating an analog output voltage according to a digital input value. The digital input value comprises a plurality of bit segments. The DAC comprises a plurality of PWM units and a voltage generating unit. The plurality of PWM units generates a plurality of PWM signals according to the plurality of bit segments. The voltage generating unit is coupled to the plurality of PWM units and generates the analog output voltage according to the plurality of PWM signals.",
        "In the aforementioned DAC, a first and a second PWM unit of the plurality of PWM units generate a first and a second PWM signal of the plurality of PWM signals according to a first and a second bit segment of the plurality of bit segments, respectively. In the digital input value, the first bit segment is a predetermined number times the significance of the second bit segment.",
        "The invention also discloses a method for generating an analog output voltage according to a digital input value. The method comprises segmenting the digital input value into a plurality of bit segments, generating a plurality of PWM signals according to the plurality of bit segments, and generating the analog output voltage according to the plurality of PWM signals.",
        "In the aforementioned method, the step of generating a plurality of PWM signals according to the plurality of bit segments comprises generating a first and a second PWM signal of the plurality of PWM signals according to a first and a second bit segment of the plurality of bit segments, respectively. And in the digital input value, the first bit segment is a predetermined number times the significance of the second bit segment.",
        "These and other objectives of the present invention will no doubt become obvious to those of ordinary skill in the art after reading the following detailed description of the preferred embodiment that is illustrated in the various figures and drawings.",
        "FIG. 1 shows a DAC according to an exemplary embodiment of the present invention.",
        "FIG. 2 shows an example of the DAC of FIG. 1.",
        "Pulse width modulation (PWM) is a modulation technology that can be applied to realize DACs. Generally speaking, a high resolution PWM unit should be used to make a high resolution DAC. For example, if a DAC with 16-bit resolution is required, a PWM unit with 16-bit resolution should be used to realize the DAC. However, a high resolution PWM unit is much more expansive than a low resolution PWM unit. Moreover, the cost-resolution ratio of a high resolution PWM unit is always larger than that of a low resolution PWM unit. Therefore, the overall cost of two 8-bit resolution DACs is much lower than the cost of a single 16-bit resolution DAC.",
        "To reduce the costs of high resolution DACs, this disclosure proposes an idea of using a plurality of PWM units, each of which has relatively low resolution, to realize a single high resolution DAC. FIG. 1 shows an embodiment of the proposed DAC. The resolution of the DAC 100 shown in FIG. 1 is M*N bits, where both M and N are positive integers. In other words, the DAC 100 generates an analog output voltage VOUT according to a digital input value DI that is M*N-bit-long. The binary form of the digital input value DI is BM*N−1BM*N−2BM*N−3 . . . B2B1B0, where BM*N−1 is the most significant bit (MSB) and B0 is the least significant bit (LSB).",
        "The DAC 100 comprises M PWM units 120_1˜120_M and a voltage generating unit 140. The resolution of each of the M PWM units 120_1˜120_M is N bits. For an integer K between 1 and M, a Kth PWM unit 120_K generates a Kth PWM signal PWMS_K according to a Kth bit segment of the digital input value DI. The binary form of the Kth bit segment of DI is BK*N−1BK*N−2BK*N−3 . . . B(K−1)*N+2B(K−1)*N+1B(K−1)*N. The duty cycle of the Kth PWM signal PWMS_K is determined by the value of the Kth bit segment BK*N−1BK*N−2BK*N−3 . . . B(K−1)*N+2B(K−1)*N+1B(K−1)*N. Since there are N bits included in the Kth bit segment, the duty cycle of the Kth PWM signal PWMS_K is selected from 2^N possible duty cycles. The difference between a largest and a smallest duty cycles of the 2^N possible duty cycles is (2^N)−1 times the size of a step. For example, when N equals 8, the step is approximately 0.3922%.",
        "When the value of the Kth bit segment BK*N−1BK*N−2BK*N−3 . . . B(K−1)*N+2B(K−1)*N+1B(K−1)*N is increased by 1, the duty cycle of the Kth PWM signal PWMS_K is increased by one step, and the voltage generating unit 140 elevates the analog output voltage VOUT by a Kth voltage step VS_K. Since in the digital input value DI, a K1th bit segment is 2^[(K1−K2)*N] times the significance of a K2th bit segment, a K1th voltage stepVS_K1 should be 2^[(K1−K2)*N] times the size of a K2th voltage stepVS_K2. In other words, the voltage steps VS_1˜VS_M conform to the following equation:",
        "VS_M\n  =\n  \n    \n      VS_\n      ⁢\n      \n        (\n        \n          M\n          -\n          1\n        \n        )\n      \n      ×\n      \n        2\n        ⋀\n        N\n      \n    \n    =\n    \n      \n        VS_\n        ⁢\n        \n          (\n          \n            M\n            -\n            2\n          \n          )\n        \n        ×\n        \n          2\n          ⋀\n          \n            (\n            \n              2\n              *\n              N\n            \n            )\n          \n        \n      \n      ⁢\n      \n        \n      \n      =\n      \n        …\n        ⁢\n        \n          \n        \n        =\n        \n          \n            VS_\n            ⁢\n            2\n            ×\n            \n              2\n              ⋀\n              \n                [\n                \n                  \n                    (\n                    \n                      M\n                      -\n                      2\n                    \n                    )\n                  \n                  *\n                  N\n                \n                ]\n              \n            \n          \n          =\n          \n            VS_\n            ⁢\n            1\n            ×\n            \n              2\n              ⋀\n              \n                \n                  [\n                  \n                    \n                      (\n                      \n                        M\n                        -\n                        1\n                      \n                      )\n                    \n                    *\n                    N\n                  \n                  ]\n                \n                .",
        "In order for the voltage steps VS_1˜VS_M to conform to the equation, the voltage generating unit 140 of this embodiment comprises M resistors R_1˜R_M and one capacitor C. Among the M resistors R_1˜R_M, a Kth resistor R_K has a first end coupled to the Kth PWM unit 120_K for receiving the Kth PWM signal PWMS_K, and a second end coupled to a first end of the capacitor C, where K is an integer between 1 and M. A second end of the capacitor C is coupled to a node having a reference voltage level. For example, the node is ground. The resistances of the resistors R_1˜R_M conform to the following equation:",
        "R_M\n  =\n  \n    \n      R_\n      ⁢\n      \n        (\n        \n          M\n          -\n          1\n        \n        )\n      \n      ×\n      \n        2\n        ⋀\n        N_R\n      \n      ⁢\n      _\n      ⁢\n      \n        (\n        \n          M\n          -\n          2\n        \n        )\n      \n      ×\n      \n        2\n        ⋀\n        \n          (\n          \n            2\n            *\n            N\n          \n          )\n        \n      \n    \n    =\n    \n      …\n      ⁢\n      \n        \n      \n      =\n      \n        \n          R_\n          ⁢\n          2\n          ×\n          \n            2\n            ⋀\n            \n              [\n              \n                \n                  (\n                  \n                    M\n                    -\n                    2\n                  \n                  )\n                \n                *\n                N\n              \n              ]\n            \n          \n        \n        =\n        \n          R_\n          ⁢\n          1\n          ×\n          \n            2\n            ⋀\n            \n              \n                [\n                \n                  \n                    (\n                    \n                      M\n                      -\n                      1\n                    \n                    )\n                  \n                  *\n                  N\n                \n                ]\n              \n              .",
        "The resolution of the DAC 100 is M*N bits, however, no PWM unit with M*N bits resolution is required. Relatively, M PWM units, each of which is N bits in resolution, are used to make the DAC 100. Since the overall cost of the M N-bit-resolution PWM units is much lower than that of a single M*N-bit-resolution PWM unit, the DAC 100 is more cost effective than the M*N-bit-resolution DACs of the prior art.",
        "FIG. 2 shows an example of the DAC 100 of FIG. 1. In the example shown in FIG. 2, M is equal to 2 while N is equal to 8. The binary form of the digital input value DI is B15B14B13 . . . B2B1B0, the binary form of the first bit segment is B7B6B5 . . . B2B1B0, and the binary form of the second bit segment is B15B14B13 . . . B10B9B8. The first bit segment can be referred to as a low portion of the digital input value DI, and the second bit segment can be referred to as a high portion of the digital input value DI. The resolution of both the first PWM unit 120_1 and the second PWM unit 120_2 is 8 bits. The second resistor R_2 has 2^8=256 times the resistance of the first resistor R_1.",
        "Those skilled in the art will readily observe that numerous modifications and alterations of the device and method may be made while retaining the teachings of the invention. Accordingly, the above disclosure should be construed as limited only by the metes and bounds of the appended claims."
    ],
    "citations": [
        "4908710",
        "5872603",
        "6362766",
        "6606046",
        "6801146",
        "7019502"
    ],
    "us_classification": "341152",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "H",
            "classification_class": "03",
            "subclass": "M",
            "main_group": "1",
            "subgroup": "82"
        }
    ]
}