{
    "title": "Conically-shaped glass for an outside wedge-style display case",
    "abstract": "",
    "inventors": [
        "Arrosagaray"
    ],
    "document_number": "D0555403",
    "publication_date": "20071120",
    "assignees": [
        "Hussmann Corporation"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "I claim the ornamental design for a conically-shaped glass for an outside wedge-style display case, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a perspective view of a conically-shaped glass for an outside wedge-style display case.",
        "FIG. 2 is a side view of the conically-shaped glass for an outside wedge-style display case shown in FIG. 1.",
        "FIG. 3 is a front view of the conically-shaped glass for an outside wedge-style display case shown in FIG. 1; and,",
        "FIG. 4 is a top view of the conically-shaped glass for an outside wedge-style display case shown in FIG. 1.",
        "The broken line showing of the environment is for illustrative purposes only and forms no part of the claimed design. The opposite side view of the side view illustrated in FIG. 2 is a mirror image of the side view illustrated in FIG. 2. The claimed conically-shaped glass is transparent. The boundary lines showing the boundary between the claimed design and the unclaimed portions of the design are for illustrative purposes only and form no part of the claimed design. The boundary lines are represented by alternating dashes and dots."
    ],
    "citations": [
        "2166577",
        "D129258",
        "D174892",
        "2869749",
        "3011602",
        "D199709",
        "D224001",
        "D231630",
        "4068421",
        "D251068",
        "D251503",
        "D260587",
        "D264995",
        "4808234",
        "5105262",
        "D350657",
        "D351298",
        "5507143",
        "5589814",
        "D399176",
        "5857815",
        "5885714",
        "D413459",
        "6200664",
        "D484990",
        "D529731",
        "D530104",
        "7125462",
        "D533199"
    ],
    "us_classification": "0604",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}