{
    "title": "Blood pressure monitor",
    "abstract": "",
    "inventors": [
        "McCulloch"
    ],
    "document_number": "D0555790",
    "publication_date": "20071120",
    "assignees": [
        "FKA Distributing Co."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for a blood pressure monitor, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a perspective view of a blood pressure monitor according to the present invention wherein the lid is in an open position;",
        "FIG. 2 is a left side elevational view of the blood pressure monitor of FIG. 1;",
        "FIG. 3 is a right side elevational view of the blood pressure monitor of FIG. 1;",
        "FIG. 4 is a front elevational view of the blood pressure monitor of FIG. 1;",
        "FIG. 5 is a rear elevational view of the blood pressure monitor of FIG. 1;",
        "FIG. 6 is a top plan view of the blood pressure monitor of FIG. 1;",
        "FIG. 7 is a bottom plan view of the blood pressure monitor of FIG. 1;",
        "FIG. 8 is a perspective view a blood pressure monitor according to the present invention wherein the lid is in a closed position;",
        "FIG. 9 is a left side elevational view of the blood pressure monitor of FIG. 8;",
        "FIG. 10 is a right side elevational view of the blood pressure monitor of FIG. 8;",
        "FIG. 11 is a front elevational view of the blood pressure monitor of FIG. 8;",
        "FIG. 12 is a rear elevational view of the blood pressure monitor of FIG. 8;",
        "FIG. 13 is a top plan view of the blood pressure monitor of FIG. 8; and,",
        "FIG. 14 is a bottom plan view of the blood pressure monitor of FIG. 8.",
        "The broken lines are for illustrative purposes only and form no part of the claimed design."
    ],
    "citations": [
        "D338271",
        "5687732",
        "D390661",
        "D403770",
        "6251080",
        "6344025",
        "D473651",
        "D520638",
        "60-249938"
    ],
    "us_classification": "2401",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}