{
    "title": "Foldable chair/table",
    "abstract": "",
    "inventors": [
        "Miyakawa"
    ],
    "document_number": "D0555370",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for a foldable chair/table, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a front perspective view of the foldable chair/table according to my new design configured as a chair;",
        "FIG. 2 is a rear perspective view thereof;",
        "FIG. 3 is a front elevational view thereof;",
        "FIG. 4 is a right-side elevational view thereof, the left-side elevational view being a mirror image of FIG. 4;",
        "FIG. 5 is a rear elevational view thereof;",
        "FIG. 6 is a plan view thereof taken from above;",
        "FIG. 7 is a plan view thereof taken from below;",
        "FIG. 8 is a front perspective view of the foldable chair/table configured as a table;",
        "FIG. 9 is a rear perspective view thereof;",
        "FIG. 10 is a front elevational view thereof;",
        "FIG. 11 is a right-side elevational view thereof, the left-side elevational view being a mirror image of FIG. 11;",
        "FIG. 12 is a rear elevational view thereof;",
        "FIG. 13 is a plan view thereof taken from above;",
        "FIG. 14 is a plan view thereof taken from below;",
        "FIG. 15 is a front perspective view of the foldable chair/table in a folded condition;",
        "FIG. 16 is a rear perspective view thereof;",
        "FIG. 17 is a front elevational view thereof;",
        "FIG. 18 is a right-side elevational view thereof, the left-side elevational view being a mirror image of FIG. 18;",
        "FIG. 19 is a rear elevational view thereof, this view being identical to that shown in FIG. 12;",
        "FIG. 20 is a plan view thereof taken from above, the view being identical to that shown in FIG. 13;",
        "FIG. 21 is a plan view thereof taken from below; and,",
        "FIG. 22 is a rear perspective view thereof taken from below."
    ],
    "citations": [
        "D143466",
        "D155023",
        "D202103",
        "3427074",
        "D355772",
        "D419313",
        "D447354",
        "D461966"
    ],
    "us_classification": "0601",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}