{
    "title": "Hanger for a lavatory dispensing device",
    "abstract": "",
    "inventors": [
        "King",
        "Pheiff"
    ],
    "document_number": "D0555758",
    "publication_date": "20071120",
    "assignees": [
        "Reckitt Benekiser Inc."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for a hanger for a lavatory dispensing device, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a perspective view of the top and front of a first embodiment of my hanger;",
        "FIG. 2 is a plan view of the front of a first embodiment of my hanger;",
        "FIG. 3 is a plan view of a side of a first embodiment of my hanger; the other side of a first embodiment of my hanger which is not depicted in the figures is symmetrical with this side view;",
        "FIG. 4 is a plan view of the back of a first embodiment of my hanger;",
        "FIG. 5 is a plan view of the bottom of a first embodiment of my hanger;",
        "FIG. 6 is a plan view of the top of a first embodiment of my hanger;",
        "FIG. 7 is a perspective view of the top and front of a first embodiment of my hanger further illustrating in phantom a lavatory block;",
        "FIG. 8 is a plan view of the front of a first embodiment of my hanger further illustrating in phantom a lavatory block;",
        "FIG. 9 is a plan view of a side of a first embodiment of my hanger further illustrating in phantom a lavatory block;",
        "FIG. 10 is a perspective view of the top and front of a second embodiment of my hanger;",
        "FIG. 11 is a plan view of the front of a second embodiment of my hanger;",
        "FIG. 12 is a plan view of a side of a second embodiment of my hanger; the other side of a second embodiment of my hanger which is not depicted in the figures is symmetrical with this side view;",
        "FIG. 13 is a plan view of the back of a second embodiment of my hanger;",
        "FIG. 14 is a plan view of the bottom of a second embodiment of my hanger;",
        "FIG. 15 is a plan view of the top of a second embodiment of my hanger;",
        "FIG. 16 is a perspective view of the top and front of a second embodiment of my hanger further illustrating in phantom a lavatory block;",
        "FIG. 17 is a plan view of the front of a second embodiment of my hanger further illustrating in phantom a lavatory block; and,",
        "FIG. 18 is a plan view of a side of a second embodiment of my hanger further illustrating in phantom a lavatory block.",
        "The broken line showing is included for the purpose of illustrating and forms no part of the claimed design."
    ],
    "citations": [
        "4168551",
        "4203172",
        "4261957",
        "D273607",
        "D307934",
        "D387848",
        "D419347",
        "D464107",
        "6505356",
        "D484566",
        "D500548",
        "D508549",
        "6934973",
        "D514661",
        "D523923"
    ],
    "us_classification": "2301",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}