{
    "title": "Injection device",
    "abstract": "",
    "inventors": [
        "Galbraith"
    ],
    "document_number": "D0555609",
    "publication_date": "20071120",
    "assignees": [
        "TecPharma Licensing AG"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for an injection device, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a perspective view of the injection device according to one embodiment of the present invention showing the top, one side and an end.",
        "FIG. 2 is a side elevation of the other side, being a mirror image of the side shown in FIG. 1.",
        "FIG. 3 is an end elevation view showing the end visible in FIG. 1.",
        "FIG. 4 is an end elevation view showing the end opposite the end shown in FIG. 3.",
        "FIG. 5 is a top plan view of FIG. 1.",
        "FIG. 6 is a bottom plan view of Figure.",
        "FIG. 7 is a perspective view of the injection device according to a second embodiment of the present invention showing the top, one side and an end.",
        "FIG. 8 is a side elevation of the other side, being a mirror image of the side shown in FIG. 7.",
        "FIG. 9 is an end elevation showing the end visible in FIG. 7.",
        "FIG. 10 is an end elevation showing the end opposite the end shown in FIG. 9.",
        "FIG. 11 is a top plan view respective to FIG. 7.",
        "FIG. 12 is a bottom plan view respective to FIG. 7.",
        "FIG. 13 is a perspective view of the injection device with the cap removed according to the embodiments of the present invention showing the top, one side and an end.",
        "FIG. 14 is a side elevation of the other side, being a mirror image of the side shown in FIG. 13.",
        "FIG. 15 is an end elevation showing the end opposite the end visible in FIG. 13.",
        "FIG. 16 is an end elevation showing the end visible in FIG. 13.",
        "FIG. 17 is a top plan view respective to FIG. 13; and,",
        "FIG. 18 is a bottom plan view respective to FIG. 13.",
        "The broken line portions of the drawings are for illustrative purposes only and form no part of the claimed design."
    ],
    "citations": [
        "5478316",
        "5709662",
        "D441398",
        "D447174",
        "D460485",
        "D461204",
        "D462760",
        "D479748",
        "D501253",
        "D506507",
        "D508264",
        "D508717",
        "2004/0010233"
    ],
    "us_classification": "2402",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}