{
    "title": "Computer keyboard with oversized keys and multiple adjustable legs",
    "abstract": "",
    "inventors": [
        "Hippenstiel",
        "Boller"
    ],
    "document_number": "D0555650",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for a computer keyboard with oversized keys and multiple adjustable legs, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a top plan view of the computer keyboard with oversized keys;",
        "FIG. 2 is a front view of the computer keyboard of the present invention with its front legs extended;",
        "FIG. 3 is a side view of the computer keyboard of the present invention with its front and back legs extended, the front of the keyboard is on the left and the back of the keyboard is on the right, illustrating one of the multiple angles at which the keyboard may be set by the adjustable legs;",
        "FIG. 4 is a side view of the computer keyboard of the present invention with its front and back legs extended, the front of the keyboard is on the left and the back of the keyboard is on the right, illustrating one of the multiple angles at which the keyboard may be set by the adjustable legs;",
        "FIG. 5 is an opposite side view of the computer keyboard of the present invention with its front and back adjustable legs extended, illustrating the multi-leg stand design of each individual leg that enables multiple leg heights and keyboard angles; and,",
        "FIG. 6 is a perspective view of the bottom of the computer keyboard of the present invention with its adjustable legs extended illustrating the multi-leg stand design of each individual leg that enables multiple leg heights and keyboard angles and their extended and retracted positions as well as the range of motion.",
        "The present design is directed to a computer keyboard with oversized keys and multiple adjustable legs. The adjustable legs consist of multiple leg stands of varying length and width that may be extended or retracted to produce a plurality of keyboard angles."
    ],
    "citations": [
        "D270729",
        "D295761",
        "D426834",
        "D439903",
        "D442177",
        "D458930"
    ],
    "us_classification": "1402",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}