{
    "title": "Display and control unit",
    "abstract": "",
    "inventors": [
        "Grözinger"
    ],
    "document_number": "D0555392",
    "publication_date": "20071120",
    "assignees": [
        "Siemens Aktiengesellschaft"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for a display and control unit, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a front elevational view of a display and control unit showing my new design;",
        "FIG. 2 is a rear elevational view thereof;",
        "FIG. 3 is a top plan view thereof;",
        "FIG. 4 is a bottom plan view thereof;",
        "FIG. 5 is a right side elevational view thereof;",
        "FIG. 6 is a left side elevational view thereof; and",
        "FIG. 7 is a perspective view thereof.",
        "FIG. 8 is a front elevational view of a second embodiment of the display and control unit showing my new design;",
        "FIG. 9 is a rear elevational view thereof;",
        "FIG. 10 is a top plan view thereof;",
        "FIG. 11 is a bottom plan view thereof;",
        "FIG. 12 is a right side elevational view thereof;",
        "FIG. 13 is a left side elevational view thereof; and",
        "FIG. 14 is a perspective view thereof.",
        "FIG. 15 is a front elevational view of a third embodiment of the display and control unit showing my new design;",
        "FIG. 16 is a rear elevational view thereof;",
        "FIG. 17 is a top plan view thereof;",
        "FIG. 18 is a bottom plan view thereof;",
        "FIG. 19 is a right side elevational view thereof;",
        "FIG. 20 is a left side elevational view thereof; and",
        "FIG. 21 is a perspective view thereof.",
        "FIG. 22 is a front elevational view of a fourth embodiment of the display and control unit showing my new design;",
        "FIG. 23 is a rear elevational view thereof;",
        "FIG. 24 is a top plan view thereof;",
        "FIG. 25 is a bottom plan view thereof;",
        "FIG. 26 is a right side elevational view thereof;",
        "FIG. 27 is a left side elevational view thereof; and,",
        "FIG. 28 is a perspective view thereof."
    ],
    "citations": [
        "809592",
        "1556353",
        "2166430",
        "4070074",
        "4076350",
        "RE31409",
        "D276964",
        "D286484",
        "D291037",
        "5163745",
        "5368378",
        "5484196",
        "5860537",
        "D408657",
        "D421196",
        "D457768",
        "D497069",
        "2003/0090177",
        "2006/0119236",
        "2007/0013279"
    ],
    "us_classification": "0604",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}