{
    "title": "Rear panel for a ponytail cap",
    "abstract": "",
    "inventors": [
        "Chun"
    ],
    "document_number": "D0555331",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for a rear panel for a ponytail cap, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a perspective view of a rear panel for a ponytail cap showing my new design;",
        "FIG. 2 is a rear view of FIG. 1;",
        "FIG. 3 is a rear view of FIG. 1 showing the inside view of the strap;",
        "FIG. 4 is an enlarged view of the outer side of the strap shown in an uncontracted condition;",
        "FIG. 5 is an inside view thereof;",
        "FIG. 6 is an enlarged side view of the strap shown in a contracted condition;",
        "FIG. 7 is a second embodiment of the rear panel for a ponytail cap, showing my new design;",
        "FIG. 8 is a rear view of FIG. 7;",
        "FIG. 9 is an enlarged view of the outer side of one of the straps of FIG. 8, shown in an uncontracted condition;",
        "FIG. 10 is an inside view thereof; and,",
        "FIG. 11 is an enlarged side view of the strap thereof, shown in a contracted condition.",
        "The broken lines occurring inside and adjacent to the gore seams and rear opening and on the strap represent stitching. The broken lines showing other parts of the cap, as well as a person's head and hair are for the purpose of illustrating environmental matter and form no part of the claimed design.",
        "The crosshatched pattern, although shown intermittently, is meant to represent fabric, and is understood to be distributed uniformly over the surfaces of the claimed design.",
        "In FIGS. 9, 10, and 11, only one strap of the second embodiment has been shown, the other strap being the same as the strap shown.",
        "The lined rectangular shape shown on the cap in FIG. 3 and on the strap in FIGS. 3, 5 and 10 represent hook and loop fasteners. The loose folds of the cloth impart the appearance of a scrunchy to the strap."
    ],
    "citations": [
        "3933872",
        "5170509",
        "5321854",
        "5539929",
        "D374548",
        "D391674",
        "D405590",
        "D406189",
        "5875494",
        "D424282",
        "6421838",
        "D474576",
        "2002/0108165",
        "2003/0106134",
        "2006/0010566",
        "2006/0117461"
    ],
    "us_classification": "0203",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}