{
    "title": "Solar tent",
    "abstract": "",
    "inventors": [
        "Gyr",
        "Fischer"
    ],
    "document_number": "D0555748",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for a solar tent, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a front or right top perspective view of a solar tent showing our new design therefor in a first position and with a ground sheet according to a first embodiment thereof;",
        "FIG. 2 is a view similar to FIG. 1 in a different position;",
        "FIG. 3 is a view similar to FIG. 1 in a still further position;",
        "FIG. 4 is a view similar to FIG. 1 in a still further position;",
        "FIG. 5 is a view similar to FIG. 1 in a still further position;",
        "FIG. 6 is a perspective view of the embodiment of FIG. 1 taken with more of the top of the design visible and in a position similar to that of FIG. 3;",
        "FIG. 7 is a perspective view of the second embodiment of our invention in a first position and with front and rear beams at ground level;",
        "FIG. 8 is a view similar to FIG. 7 in a further position;",
        "FIG. 9 is a view similar to FIG. 7 in a further position;",
        "FIG. 10 is a view similar to FIG. 7 in a further position;",
        "FIG. 11 is a view similar to FIG. 7 in a further position; and,",
        "FIG. 12 is a view similar to FIG. 7 but with more of the top visible and in a position substantially corresponding to that of FIG. 9."
    ],
    "citations": [
        "2961802",
        "D227662",
        "D245015",
        "D256829",
        "D341407",
        "5690133",
        "5823217",
        "D400949",
        "D412354",
        "5927311",
        "D413394",
        "6062243",
        "D428100",
        "6363955",
        "6595227",
        "D496880",
        "6901940",
        "6942005",
        "2003/0070703",
        "2006/0016468"
    ],
    "us_classification": "2104",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}