{
    "title": "Surface configuration of a vehicle, toy, and/or other replicas",
    "abstract": "",
    "inventors": [
        "Pfeiffer"
    ],
    "document_number": "D0555539",
    "publication_date": "20071120",
    "assignees": [
        "DaimlerChrysler AG"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for a surface configuration of a vehicle, toy, and/or other replicas, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "This application is related to the following co-pending applications, of the inventor: application Ser. No. 29/274,913, entitled “Surface Configuration of a Vehicle, Toy, and/or Other Replicas”; application Ser. No. 29/274,915, entitled “Surface Configuration of a Vehicle, Toy, and/or Other Replicas”; application Ser. No. 29/274,914, entitled “Surface Configuration of a Vehicle, Toy, and/or Other Replicas”; application Ser. No. 29/225,802, entitled “Surface Configuration of a Vehicle, Toy, and/or Other Replicas”; application Ser. No. 29/225,843, entitled “Surface Configuration of a Vehicle, Toy, and/or Other Replicas”; and application Ser. No. 29/225,812, entitled “Surface Configuration of a Headlight for a Vehicle”, now U.S. patent No. D536,112.",
        "FIG. 1 is a left, front perspective view of a first embodiment of a surface configuration of a vehicle, toy, and/or other replicas according to my novel design, the right, front perspective view being mirror symmetrical;",
        "FIG. 2 is a left, rear perspective view thereof, the right, rear perspective view being mirror symmetrical;",
        "FIG. 3 is a left side view thereof, the right side view being mirror symmetrical;",
        "FIG. 4 is a front view thereof;",
        "FIG. 5 is a rear view thereof; and",
        "FIG. 6 is a top view thereof.",
        "FIG. 7 is a left, front perspective view of a second embodiment of the surface configuration of a vehicle, toy, and/or other replicas according to my novel design, the right, front perspective view being mirror symmetrical;",
        "FIG. 8 is a left, rear perspective view of FIG. 7, the right, rear perspective view being mirror symmetrical;",
        "FIG. 9 is a left side view of FIG. 7, the right side view being mirror symmetrical;",
        "FIG. 10 is a front view of FIG. 7;",
        "FIG. 11 is a rear view of FIG. 7; and",
        "FIG. 12 is a top view of FIG. 7.",
        "FIG. 13 is a left, front perspective view of a third embodiment of the surface configuration of a vehicle, toy, and/or other replicas according to my novel design, the right, front perspective view being mirror symmetrical;",
        "FIG. 14 is a left, rear perspective view of FIG. 13, the right, rear perspective view being mirror symmetrical;",
        "FIG. 15 is a left side view of FIG. 13, the right side view being mirror symmetrical;",
        "FIG. 16 is a front view of FIG. 13;",
        "FIG. 17 is a rear view of FIG. 13; and,",
        "FIG. 18 is a top view of FIG. 13.",
        "The broken lines are for illustrative purposes only and form no part of the claimed design."
    ],
    "citations": [
        "D441691",
        "D472186",
        "D495975",
        "D496607",
        "D505095",
        "D511716",
        "D539190"
    ],
    "us_classification": "1208",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}