{
    "title": "Camping, kitchen accessory for a cooking pot",
    "abstract": "",
    "inventors": [
        "Gostt",
        "Gostt"
    ],
    "document_number": "D0555431",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "The ornamental design for a camping, kitchen accessory, as shown and described.",
            "components": []
        }
    ],
    "description": [
        "FIG. 1 is a top, front perspective view of a camping, kitchen accessory for a cooking pot showing our new design;",
        "FIG. 2 is a top, rear perspective view thereof;",
        "FIG. 3 is a top, front perspective view thereof in an open position;",
        "FIG. 4 is a bottom, front perspective view of FIG. 3;",
        "FIG. 5 is a top, rear perspective view of FIG. 3;",
        "FIG. 6 is a top plan view thereof;",
        "FIG. 7 is a front, top perspective view thereof turned inside out; and",
        "FIG. 8 is a front perspective view thereof in a cinched position;",
        "FIG. 9 is a top, front perspective view of a thereof of an alternate embodiment;",
        "FIG. 10 is a top, rear perspective view of FIG. 9;",
        "FIG. 11 is a top, front perspective view of FIG. 9 in an open position;",
        "FIG. 12 is a bottom, front perspective view of FIG. 11;",
        "FIG. 13 is a top, rear perspective view of FIG. 11;",
        "FIG. 14 is a top plan view of FIG. 9;",
        "FIG. 15 is a front, top perspective view of FIG. 9 turned inside out; and,",
        "FIG. 16 is a front perspective view of FIG. 9 in a cinched position."
    ],
    "citations": [
        "D135857",
        "2678672",
        "D187112",
        "D264772",
        "D294912",
        "D391120",
        "6264391",
        "D509996"
    ],
    "us_classification": "0701",
    "international_classifications": [
        {
            "classification_level": "",
            "section": "",
            "classification_class": "",
            "subclass": "",
            "main_group": "",
            "subgroup": ""
        }
    ]
}