{
    "title": "Lobelia plant named ‘Lobmounwi’",
    "abstract": "A new and distinct cultivar of",
    "inventors": [
        "van Kleinwee"
    ],
    "document_number": "PP018240",
    "publication_date": "20071120",
    "assignees": [
        "Syngenta Seeds B.V."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A new and distinct cultivar of",
            "components": []
        }
    ],
    "description": [
        "Latin name of the genus and species of the plant claimed: Lobelia erinus.",
        "Varietal denomination: ‘Lobmounwi’.",
        "The present invention comprises a new and distinct Lobelia plant botanically known as Lobelia erinus and referred to by the cultivar name ‘Lobmounwi’.",
        "The new cultivar is propagated by cuttings resulting from the cross between ‘R616’ and ‘A950.’ ‘R616’ is a white flower color selection of our own breeding, having a mounding to semitrailing habit, very strong growth, good branching plant habit and being early flowering. ‘A950’ is a white flower color selection of our own breeding, having a strong growth, semitrailing plant habit and not very branching. Neither ‘R616’ or ‘A950’ has been patented.",
        "As a result of this cross the present cultivar was created from a single plant in 2001 in Enkhuizen, Netherlands and has been repeatedly asexually reproduced by cuttings in Enkhuizen, Netherlands over a five year period. It has been found to retain its distinctive characteristics through successive propagations and this novelty appears to be firmly fixed.",
        "This new Lobelia plant is illustrated by the accompanying photographic drawing which shows blooms, buds and foliage of the plant in full color, the color showing being as true as can be reasonably obtained by conventional photographic procedures.",
        "The following detailed descriptions set forth the distinctive characteristics of this new Lobelia. The data which defines these characteristics were collected from asexual reproductions carried out in Enkhuizen, Netherlands. The plant history was taken on 20 week old plants.",
        "Colors readings were taken in the laboratory under ambient light. Color references are primarily to The R.H.S. Colour Chart of The Royal Horticultural Society of London.",
        "TABLE 1\n\n\n\n\n\n\n\nDIFFERENCES BETWEEN\n\n\n‘LOBMOUNWI’ AND THE MOST RESEMBLING VARIETY\n\n\n\n\n\n\n\n\n\n\n\n‘Weslowei’ (U.S. Pat. No.\n\n\n\n‘Lobmounwi’\n12,708)\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlant\n\n\n\n\nheight\n20 cm\n20 cm\n\n\nwidth\n40 cm\n45 cm\n\n\nshape\nUpright\nSpreading to upright\n\n\nFlower color\n\n\nupper surface\nN155A\nN155A occasionally 97B\n\n\nlower surface\nN155A\nN155A\n\n\nflower tube\nN155A\nN155A\n\n\nPetiole\nNot present\nPresent\n\n\nLeaves\nLanceolate to ovate\nOvate\n\n\nMargin of old leaves\nEntire\nCrenate\n\n\n\n\n\n\n\n\n\n    The plant: Classification — Botanical: Lobelia erinus. \n    \n        \n        \n            Female parent.—A seedling named ‘R616’ is one of our seedlings from our R-generation of plants bred in 1997.\n            Male parent.—A seedling named ‘A950’ is one of our seedlings from our A-generation of plants bred in 1999.\n            Growth habit.—Upright.\n            Plant height.—20 cm.\n            Spreading area of plant.—45 cm.\n            Growth rate.—Strong growth.\n            Strength.—Good.\n            Branching character.—Freely branching and lateral branching at every node. Pinching will enhance branching. Branches strong and flexible.\n            Blooming period.—From May until October.\n        \n        \n    \n    \n    The stem:\n    \n        \n        \n            Diameter.—1.5 mm.\n            Texture.—Smooth, slightly pubescent, glossy.\n            Color.—RHS 143A.\n            Length of internode.—6-25 mm, depending on light conditions where the plant is grown, and the age of the stem.\n            Shape.—Triangular.\n        \n        \n    \n    \n    The foliage:\n    \n        \n        \n            Shape.—Leaves simple, generally symmetrical and flat. Broadly ovate with rounded apex, obtuse and attenuate base and crenate margin in young plant; more lanceolate with entire margin in mature plant.\n            Texture.—Slightly pubescent, glossy.\n            Length.—25 mm, leaves of juvenile plants up to 40 mm.\n            Width.—In juvenile plant up to 20 mm, mature plant 5 mm.\n            Color.—Upper surface: RHS 137B, RHS 137C in young leaves. Lower surface: RHS 137C, RHS 137C in young leaves.\n            Petiole.—Not present.\n        \n        \n    \n    \n    The flower:\n    \n        \n        \n            Type and habit.—Flowers form at apical axils, usually one flower per axil. Flowers labiate, upper lip consisting of two small petals and lower lip consisting of three larger and broader petals.\n            Lastingness.—10-14 days depending on temperature. Petals are fused at base into a tube. Freely and continuously flowering, around 100-150 flowers. Flowers face outward. Texture, slightly pubescent. Oblong shape with acute apex and entire margin.\n            Flower.—Width: Upper petals 1 mm, lower petals 6 mm. Length: Upper petals 5 mm, lower petals 8 mm. Depth: 13 mm.\n            Texture.—Smooth, pubescent.\n            Buds.—Length: 10 mm. Diameter: 3 mm. Form: Tubular. Color: Light green.\n            Flower color.—Upper surface: RHS N155A. Lower surface: RHS N155A. Flower tube: RHS N155A.\n            Sepals.—No. of sepals: 5. Length: 6 mm. Width: 0.5 mm. Texture: Smooth, slightly pubescent. Color: RHS 143C.\n            Flower stem.—Length: 20 mm. Angle: 45 degrees. Strength: Rigid, flexible. Color: RHS 137B.\n            Flower throat.—Color: Upper N155A. Lower N155A at base of the lower petals, where the throat starts, there are 2 yellow marking into the throat (length 8 mm, width 0.5 mm, RHS 2A). Texture: Whiskered. Depth: 8 mm.\n        \n        \n    \n    \n    Reproductive organs:\n    \n        \n        \n            Androecium.—Stamen number: 5. Anther shape: Oblong. Anther length: 2 mm. Anther color: RHS 200A. Amount of pollen: Moderate. Pollen color: RHS 9B.\n            Gynoecium.—Pistil length: About 8 mm. Stigma shape: Bilobate. Stigma diameter: 1 mm. Stigma color: RHS N80C. Style color: RHS 150B. Ovary color: RHS 143B.\n        \n        \n    \n    \n    Seed development: Some seed development has been observed on plants of the new Lobelia. \n    Seed:\n    \n        \n        \n            Color.—Brown.\n            Shape.—Round.\n            Size.—Very small, like dust.\n            Amount per seed pod.—Approximately 2000.\n        \n        \n    \n    \n    Fruit:\n    \n        \n        \n            Fruit size.—Diameter: 2 mm. Length: 5 mm.\n            Fruit color.—RHS 146B.\n        \n        \n    \n    \n    Disease resistance: No susceptibility or resistance to fungal, bacterial, or viral pathogens has been noted."
    ],
    "citations": [
        "PP12708",
        "PP17077",
        "2006/0137059"
    ],
    "us_classification": "PLT263",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "01",
            "subclass": "H",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}