{
    "title": "Campanula plant named ‘Camp Bule’",
    "abstract": "A new",
    "inventors": [
        "Kaagman"
    ],
    "document_number": "PP018236",
    "publication_date": "20071120",
    "assignees": [
        "Goldsmith Seeds Europe B.V."
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A new and distinct cultivar of",
            "components": []
        }
    ],
    "description": [
        "Genus and species: Campanula hybrid.",
        "Variety denomination: ‘Camp Bule’.",
        "The present invention comprises a new and distinct cultivar of campanula, botanically known as Campanula hybrid, and hereinafter referred to by the cultivar name ‘Camp Bule’. The new cultivar originated from a hybridization made in May 1995 in Andijk, The Netherlands. The female parent was ‘CR-37-2’, a proprietary (unpatented) interspecific blue-flowered campanula plant, while the male parent was ‘CR-40-2’, a proprietary (unpatented) interspecific blue-flowered campanula plant. The seeds produced by the hybridization were sown in February 1996, and the resulting seedlings were selected in July 1996. A single plant selection was chosen for further evaluation and for asexual propagation in 1997.",
        "The new cultivar was created in 1995 in Andijk, The Netherlands and has been asexually reproduced repeatedly by vegetative cuttings and tissue in Andijk, The Netherlands over a nine-year period. ‘Camp Bule’ has also been trialed at Hillscheid, Germany. The present invention has been found to retain its distinctive characteristics through successive asexual propagations.",
        "Plant Breeder's Rights for this cultivar were applied for in Canada on Mar. 21, 2006 and with the European Union on Jan. 24, 2005.",
        "The following are the most outstanding and distinguishing characteristics of this new cultivar when grown under normal horticultural practices in Andijk, The Netherlands and Hillscheid, Germany.\n\n    \n    \n        1. Small to medium-sized blue-violet, bell-shaped flowers;\n        2. Floriferous with the flowers borne well-above the foliage;\n        3. An early flowering response;\n        4. Deep green and slightly glossy foliage with small, cordate leaves;\n        5. A compact, well-branched plant habit; and\n        6. A mainly tight and bushy, later partly decumbent growth habit.",
        "This new campanula plant is illustrated by the accompanying photograph which shows overall plant habit including blooms, buds, and foliage of the plant; the colors shown are as true as can be reasonably obtained by conventional photographic procedures. The photograph is of 5-month-old plants grown in a greenhouse in Andijk, The Netherlands in May 2003.",
        "The following detailed description sets forth the distinctive characteristics of ‘Camp Bule’. The data which define these characteristics were collected from asexual reproductions carried out in Andijk, The Netherlands. The plant history was taken partly on 5-week old plants, still in a vegetative state and grown in Hillscheid, Germany. Rooted cuttings were planted in 10.5-cm pots and grown in a greenhouse. The plants were not pinched. Flower observations were made on 35-week-old plants in fall of 2005. Color readings were taken under natural light. Color references are primarily to The R.H.S. Colour Chart of The Royal Horticultural Society of London (R.H.S.) (2001).",
        "Classification:\n    \n        \n        \n            Family.—Campanulaceae.\n            Botanical.—Campanula hybrid.\n            Common name.—Bellflower.\n        \n        \n    \n    \n    Parentage:\n    \n        \n        \n            Female parent.—‘CR-37-2’, a proprietary interspecific blue-flowered campanula plant (unpatented).\n            Male parent.—‘CR-40-2’, a proprietary interspecific blue-flowered campanula plant (unpatented).\n        \n        \n    \n    \n    Growth:\n    \n        \n        \n            Form.—Herbaceous perennial; continuously flowers under long-day conditions (late spring through early fall); for commercial purposes, the variety can be cultivated as an annual.\n            Habit.—Free-branching with many upright, flexible stems, tight and bushy, later partly decumbent plant habit.\n            Height (measured from the top of the soil).—10 cm.\n            Width (horizontal plant diameter).—12 cm.\n            Propagation.—Terminal tips for cutting.\n            Time to produce a finished flowering plant.—10 to 13 weeks for a 10 cm to 12 cm pot.\n            Outdoor plant performance.—Use in small containers or in flower borders.\n            Time to initiate and develop roots.—21 days.\n            Root description.—Fibrous and white.\n        \n        \n    \n    \n    Stems:\n    \n        \n        \n            Average number (per plant).—15 to 17.\n            Length.—10 cm to 14 cm.\n            Internode length.—0.5 cm to 1.0 cm.\n            Diameter (at midpoint).—0.1 cm to 0.2 cm.\n            Color.—RHS 145A (light-green) at the midpoint and deeper, RHS 144B, near the tips.\n            Anthocyanin.—Occasionally RHS 174A near the base.\n            Texture.—Smooth and sparsely pubescent.\n        \n        \n    \n    \n    Leaves:\n    \n        \n        \n            Arrangement.—Alternate.\n            Size.—Length (fully expanded): 2.0 cm. Width: 2.1 cm.\n            Shape.—Mostly cordate to nearly round.\n            Margin.—Somewhat serrate.\n            Apex.—Mainly obtuse.\n            Base.—Weakly cordate, nearly truncate.\n            Color.—Immature leaves: Upper surface: RHS 137C. Lower surface: RHS 137D. Mature leaves: General: Deep green. Upper surface: RHS 137A. Lower surface: RHS 137D.\n            Texture.—Glabrous and weakly glossy.\n            Venation.—Between palmate and pinnate.\n            Venation color.—RHS 144D for the midrib, lower surface.\n            Petioles.—Length: 1.0 cm to 2.3 cm. Width: 0.1 cm to 0.2 cm. Color: Upper surface: RHS 137D. Lower surface: RHS 145A. Texture: Smooth with a few short hairs.\n        \n        \n    \n    \n    Flower bud:\n    \n        \n        \n            Shape.—Narrow and oval (elongated) with deep furrows.\n            Size.—Length: 1.3 cm. Diameter: 0.6 cm.\n            Color at tight bud.—RHS 92A (light-blue) at the tip; RHS 92D for the rest of the bud.\n        \n        \n    \n    \n    Inflorescence:\n    \n        \n        \n            Blooming habit.—Continuous under long-day conditions.\n            Inflorescence type.—Peduncles emerge from the leaf axils of the upper nodes and inflorescence is mostly upright directed.\n            Number of flowers per inflorescence.—About 2 to 5 flowers and buds.\n            Lastingness of individual blooms on the plant.—About 14 days.\n            Fragrance.—None.\n            Length.—8.0 cm to 9.0 cm.\n            Diameter.—3.0 cm to 4.0 cm.\n            Peduncel.—Length: Up to 8 cm. Diameter: 0.1 cm to 0.2 cm. Color: RHS 143B (green). Texture: Glabrous.\n            Pedicels.—Length: 1.0 cm to 3.0 cm. Diameter: 0.1 cm. Color: RHS 143A (green). Anthocyanin: Absent. Texture: Glabrous.\n        \n        \n    \n    \n    Flowers:\n    \n        \n        \n            Flower type.—Solitary, round (actinomorphic) and campanulate.\n            Corolla.—Shape: Bell-shaped with somewhat pointed lobes; composed of 5 petals that are mainly fused and open slightly outwards. Size: Diameter: 2.5 cm. Depth: 1.4 cm. Color: General: Violet-blue. Outer surface: RHS 92A. Inner surface: RHS 91A.\n            Petals.—Size (from the opening): Length: 0.8 cm. Width: 1.0 cm. Quantity: 5. Apex: Acute to obtuse. Base: Fused. Margin: Entire. Texture: Glabrous.\n            Calyx.—Composed of 5 sepals fused at the base.\n            Sepals.—Number: 5. Color: Upper surface: RHS 137A to RHS 139A (deep green). Lower surface: RHS 137A. Length: 0.4 cm. Width: 0.1 cm at the base. Shape: Narrow, lanceolate, reflexed. Apex: Acute. Base: Fused. Margin: Mostly entire, occasionally single notches. Texture: Glabrous, glossy.\n        \n        \n    \n    \n    Reproductive organs:\n    \n        \n        \n            Stamens.—Quantity: 5 and upward-directed; close to the lower part of the style. Filament: Color: RHS N155D (white). Length: 0.3 cm to 0.4 cm. Diameter: 0.3 cm to 0.4 cm at the base and 0.1 cm under the stamen. Anther: Color: RHS N187A. Size: Length: 0.2 cm to 0.3 cm. Diameter: Less than 0.1 cm. Pollen: Color: RHS 162D (yellowish). Amount: Moderate.\n            Pistil.—Quantity: 1. Length: 1.7 cm. Stigma: Color: RHS 157D (palest green-white). Shape: 3-lobed with brush-like-arranged hair below the stigma. Style: Color: RHS N155A (whitish) at the lower part and RHS 92B (light-blue) at the upper part. Length: 1.2 cm to 1.3 cm.\n            Ovary.—Type: Intermediate (neither superior nor inferior). Shape: Ovate. Length: 0.4 cm to 0.5 cm. Diameter: 0.3 cm. Color: RHS 145A (pale green).\n        \n        \n    \n    \n    Fruit and seed set: None observed.\n    Disease and insect resistance: No special observations made.",
        "‘Camp Bule’ differs from the female parent ‘CR-37-2’ (unpatented) in that ‘Camp Bule’ has smaller bell-shaped flowers, while ‘CR-37-2’ has cup-shaped flowers. Additionally, ‘Camp Bule’ has a lighter flower color and smaller leaves than ‘CR-37-2’.",
        "‘Camp Bule’ differs from the male parent ‘CR-40-2’ (unpatented) in that ‘Camp Bule’ has larger and deeper blue flowers than ‘CR-40-2’.",
        "‘Camp Bule’ differs from the commercial variety ‘Bavaria Blue’ (unpatented) in that ‘Camp Bule’ has larger, deeper-blue flowers than ‘Bavaria Blue’."
    ],
    "citations": [],
    "us_classification": "PLT263",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "01",
            "subclass": "H",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}