{
    "title": "Nemesia plant named ‘FLEURCEL’",
    "abstract": "A new and distinct cultivar of",
    "inventors": [
        "Tellwright"
    ],
    "document_number": "PP018239",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A new and distinct cultivar of",
            "components": []
        }
    ],
    "description": [
        "Genus: Nemesia.",
        "Species: ×hybrida.",
        "Denomination: ‘FLEURCEL’.",
        "The present invention relates to a new and distinct cultivar of Nemesia plant grown as an ornamental for use in borders, hanging basket or flower bed. The new variety is known botanically as Nemesia×hybrida and will be referred to hereinafter by the cultivar name ‘FLEURCEL’.",
        "The new Nemesia cultivar named ‘FLEURCEL’ resulted from a formal breeding program that was conducted by the inventor at the inventor's nursery in West Sussex, United Kingdom. The purpose of the breeding program was to produce new varieties of Nemesia that exhibited improved flower size, new flower color, and compact habit. Three other varieties that have resulted from this breeding program are:",
        "‘FLEURIPI’ (U.S. Plant Pat. No. 16,851).",
        "‘FLEURFLAME’ (U.S. Plant Pat. No. 17,035).",
        "‘FLEURBAC’ (U.S. Plant Pat. No. 16,931).",
        "The new Nemesia variety named ‘FLEURCEL’ is a selection arising from controlled cross-pollination that began in 1998 and proceeded as follows.",
        "(All of the seedling plants referenced herein by number are unreleased, unpatented selections retained by the inventor from previous generations).",
        "Nemesia seedling 111 was crossed with Nemesia seedling 110 to produce Nemesia seedling 152.",
        "Nemesia seedling 110 was crossed with Nemesia seedling 145 to produce Nemesia seedling 168.",
        "Nemesia seedling 152 was then crossed with Nemesia seedling 168 and produced ‘FLEURCEL’. The seed parent is Nemesia seedling 152 (unpatented) and the pollen parent is Nemesia seedling 168 (unpatented). Cross-pollination of the parents took place in West Sussex, United Kingdom in 2002. ‘FLEURCEL’ is one of the seedlings that was selected from this cross. The distinguishing characteristics that make ‘FLEURCEL’ unique from all other Nemesia known to the inventor are compact upright habit, large flower size, and cerise-red flowers.",
        "‘FLEURCEL’ is distinguishable from the female parent by flower color and disease resistance. Seedling 152 exhibits large dark-blue flowers, and is prone to disease, whereas ‘FLEURCEL’ exhibits cerise-red flowers and is not susceptible to the diseases that affects seedling 152. ‘FLEURCEL’ is distinguishable from the male parent by plant habit, and flower color. Seedling 168 exhibits compact habit, and mauve flowers, each with a large yellow eye, compared to ‘FLEURCEL’, which exhibits compact upright habit and cerise-red flowers each with a small yellow eye.",
        "The two closest comparison plants known to the inventor are Nemesia ‘FLEURAME’ (U.S. patent application Ser. No. 11/095,139, filed Mar. 30, 2005), and Nemesia ‘FLEURBAC’ (U.S. patent application Ser. No. 11/138,003, filed May 27, 2005).",
        "‘FLEURCEL’ is distinguishable from ‘FLEURAME’ by plant height and flower color. ‘FLEURCEL’ is distinguishable from ‘FLEURBAC’ by plant height and flower color. ‘FLEURBAC’ exhibits bi-colored flowers, and both ‘FLEURAME’ and ‘FLEURAME’ are short in height compared to ‘FLEURCEL’.",
        "‘FLEURCEL’ was first asexually propagated in 2002 at the inventor's nursery in West Sussex, United Kingdom. The asexual propagation was conducted by the inventor and the method utilized was softwood cuttings. The inventor has determined that ‘FLEURCEL’ is stable and uniform, and reproduces true to type in successive generations of asexual reproduction.",
        "The following traits have been repeatedly observed and represent the distinguishing characteristics of ‘FLEURCEL’. In combination these traits set the new cultivar apart from all other existing varieties of Nemesia known to the inventor. ‘FLEURCEL’ has not been tested under all possible conditions and phenotypic differences may be observed with variations in environmental, climatic, and cultural conditions, without however, any variance in genotype.\n\n    \n    \n        1. ‘FLEURCEL’ exhibits compact upright habit.\n        2. ‘FLEURCEL’ exhibits large cerise-red flowers.\n        3. ‘FLEURCEL’ exhibits green foliage.\n        4. Growing conditions of ‘FLEURCEL’ include peat and bark soil, fertilizer, normal daylight, and adequate but not excess water.\n        5. ‘FLEURCEL’ is asexually propagated utilizing the method of softwood cuttings.\n        6. ‘FLEURCEL’ is hardy to minus 6° Centigrade.\n        7. ‘FLEURCEL’ is grown for use as a border plant, hanging basket, or bedding plant.",
        "The accompanying color drawings illustrate the overall appearance of the new Nemesia cultivar named ‘FLEURCEL’ showing the colors as true as it is reasonably possible to obtain in colored reproductions of this type. Colors in the drawings may differ from the color values cited in the detailed botanical description, which accurately describe the actual colors of the new variety ‘FLEURCEL’. Plants are 8-months-old, in 1-liter containers and were grown under greenhouse conditions in Encinitas, Calif.",
        "The drawing labeled FIG. 1 depicts a side view illustrating plant habit.",
        "The drawing labeled FIG. 2 is a close-up view of the flower. Drawings were made using conventional techniques, and although colors may appear different from actual colors due to light reflectance, they are as accurate as possible by conventional photography.",
        "The following is a detailed description of the new Nemesia cultivar named ‘FLEURCEL’. Data was collected in Arroyo Grande, Calif. from 4-week-old plants grown indoors in 10 cm. containers. Phenotypic differences may be observed with variations in environmental, climatic, and cultural conditions, without however, any genotypic differences. The color determinations are in accordance with The 2001 Royal Horticultural Society Colour Chart of London, England except where general color terms of ordinary dictionary significance are used. The growing requirements are similar to that of other Nemesia plants.\n\n    Botanical classification: Nemesia×hybrida ‘FLEURCEL’.\n    Family: Scrophulariaceae.\n    Genus: Nemesia. \n    Species: ×hybrida. \n    Denomination: ‘FLEURCEL’.\n    Common name: Nemesia. \n    Plant use: Grown for use as a border plant, hanging basket, or bedding plant.\n    Parentage: Nemesia×hybrida ‘FLEURCEL’ is a selection arising from the controlled cross-pollination of the following parents:\n    \n        \n        \n            Female parent.—Nemesia Seedling 152.\n            Male parent.—Nemesia Seedling 168.\n        \n        \n    \n    \n    Asexual plant propagation: Asexual propagation is accomplished using the method of softwood cuttings.\n    Plant habit: Compact upright habit.\n    Plant vigor: Vigorous.\n    Plant dimensions (at maturity): 20 cm. in height and 15 cm in width.\n    Plant type: Perennial herb.\n    Soil requirements: 70% medium grade peat, 10% coarse peat, 20% 12 mm. bark with air-filled porosity (AFP) of approximately 17%-19%, and a pH value of approximately 6.0.\n    Fertilizer requirements: The inventor has found that a combination of fertilizers with the following proportions of Nitrogen, Phosphorus and Potassium produces satisfactory plants with good vigor and flower coloration: (a) N:P:K of 12:14:24 and (b) N:P:K of 14:09:14.\n    Light requirements: Normal daylight.\n    Water requirements: Adequate but not excess water.\n    Time to develop roots on cuttings: Maximum of 14 days.\n    Required temperature to develop roots: Air temperature of 16° Centigrade and soil temperature of 24° Centigrade.\n    Crop time: 3 weeks to produce a finished 10 cm. commercial container plant from a rooted cutting.\n    Seasonal interest: Cerise-red flowers in spring, summer and fall.\n    Root system: Numerous fine roots.\n    Plant hardiness: Hardy to minus 6° Centigrade.\n    Disease and pest susceptibility: ‘FLEURCEL’ is susceptible to viruses and whitefly.\n    Special growing requirements: When plugs are transferred to final commercial pots pinch-back to promote fullness.\n    Stem:\n    \n        \n        \n            Stem shape.—Quadrangular.\n            Stem dimensions.—17 cm in length and 3 mm in diameter.\n            Stem surface.—Glabrous.\n            Stem color.—144A.\n            Internodes.—Ranging from 1 cm. to 3 cm.\n            Branching.—Upright and freely branching.\n        \n        \n    \n    \n    Foliage:\n    \n        \n        \n            Leaf arrangement.—Opposite.\n            Leaf shape.—Ovate.\n            Leaf division.—Simple.\n            Leaf apex.—Broadly acute.\n            Leaf base.—Rounded.\n            Leaf margin.—Dentate.\n            Leaf surfaces (adaxial and abaxial).—Glabrous.\n            Leaf length.—Average of 2.50 cm.\n            Leaf width.—Average of 1.10 cm.\n            Leaf color (adaxial surface).—138A.\n            Leaf color (abaxial surface).—138B.\n            Leaf attachment.—Combination of petiolate and sessile.\n            Petiole dimensions.—5 mm long and 3 mm wide.\n            Petiole shape.—Sulcate.\n            Petiole color.—138C.\n            Petiole surface.—Glabrous.\n            Vein pattern.—Pinnate.\n            Vein color (adaxial and abaxial surfaces).—138C.\n        \n        \n    \n    \n    Flowers:\n    \n        \n        \n            Type of inflorescence.—Terminal raceme.\n            Inflorescence dimensions.—7 cm in length and 3 cm in width.\n            Inflorescence quantity.—Average of 40 per 10 cm. container.\n            Flowering season.—Spring, summer and fall.\n            Self-cleaning or persistent.—Self-cleaning.\n            Pedicel length.—Average is 1 cm.\n            Pedicel diameter.—Average is 0.75 mm.\n            Pedicel shape.—Cylindrical.\n            Pedicel surface.—Stipitate glandular.\n            Pedicel color.—144A.\n            Peduncle length.—Average is 9 cm.\n            Peduncle diameter.—3 mm.\n            Peduncle shape.—Quadrangular.\n            Pedundle surface.—Glabrous.\n            Peduncle color.—144A.\n            Bud color.—N79A.\n            Bud length.—Average is 6 mm.\n            Bud width.—Average is 5 mm.\n            Bud surface.—Glabrous.\n            Bud apex.—Obtuse.\n            Flower shape.—Personate.\n            Flower depth.—2.50 cm.\n            Flower height.—1.75 cm.\n            Flower width.—1.50 cm.\n            Upper lip dimensions.—1.60 cm. in width and 1 cm in length.\n            Upper lip lobes.—4 in number.\n            Lobe dimensions.—0.40 cm. in width and 1 cm. in length.\n            Lobe shape.—Elongated rotund.\n            Upper lip margin.—Entire.\n            Upper lip apex.—Obtuse.\n            Lower lip dimensions.—1.25 cm in width and 1 cm in length.\n            Lower lip shape.—Bilabiate.\n            Lower lip margin.—Sinuous.\n            Lower lip apex.—Emarginate.\n            Upper and lower lips fused or unfused.—Basally fused.\n            Upper and lower lip surfaces (adaxial and abaxial).—Glabrous. \n            Upper lip color (adaxial surface).—61A.\n            Upper lip color fading to (adaxial surface).—N79B/C.\n            Upper lip color (abaxial surface).—79D.\n            Lower lip color (adaxial surface).—61A.\n            Lower lip color fading to (adaxial surface).—Between N79B and N79C.\n            Lower lip color (abaxial surface).—79D.\n            Palate color.—10A.\n            Palate dimensions.—3 mm in height and 3 mm in width.\n            Palate surface.—Glabrous.\n            Nectary color.—3B.\n            Nectary surface.—Lanate.\n            Flower spur dimensions.—0.50 cm in length and 2 mm in diameter.\n            Spur color.—79D.\n            Spur surface.—Glabrous.\n            Calyx dimensions.—7 mm in diameter.\n            Calyx shape.—Stellate.\n            Calyx surface.—Stipitate glandular.\n            Sepals.—Five in number.\n            Sepal dimensions.—3 mm in length and 1.50 mm in width.\n            Sepal surface (abaxial surface).—Stipitate glandular.\n            Sepal apex.—Acute.\n            Sepal margin.—Entire.\n            Sepal color (adaxial and abaxial surfaces).—144A.\n            Sepals fused or unfused.—Unfused.\n            Lastingness of individual flower.—An individual flower lasts for an average of 5 days.\n            Flower fragrance.—Slightly and pleasantly perfumed.\n        \n        \n    \n    \n    Reproductive organs:\n    \n        \n        \n            Stamens.—Two in number.\n            Stamen color.—155A.\n            Stamen dimensions.—3 mm in length and less than 1 mm in diameter.\n            Anther color.—161C.\n            Anther dimensions.—Less than 0.50 mm in length and less than 0.50 mm in width.\n            Pollen quantity.—Moderate.\n            Pollen color.—161C.\n            Pistil.—1 in number.\n            Pistil color.—155A.\n            Pistil dimensions.—0.25 mm in length and 0.25 mm in diameter.\n            Ovary dimensions.—0.50 mm in length and 0.50 mm in width.\n            Ovary shape.—Round in shape.\n            Ovary position.—Superior.\n            Ovary color.—145A.\n        \n        \n    \n    \n    Seed production: No seed has been observed to date."
    ],
    "citations": [],
    "us_classification": "PLT263",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "01",
            "subclass": "H",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}