{
    "title": "Dianthus plant named ‘DEVON ESTHER’",
    "abstract": "A new cultivar of",
    "inventors": [
        "Whetman"
    ],
    "document_number": "PP018222",
    "publication_date": "20071120",
    "assignees": [],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A new and distinct cultivar of",
            "components": []
        }
    ],
    "description": [
        "Genus: Dianthus. Species: ×hybrida.",
        "Denomination: ‘DEVON ESTHER’.",
        "The present invention relates to a new and distinct cultivar of carnation that is grown for use as a flowering plant for pots and containers. The new cultivar is known botanically as Dianthus×hybrida and will be referred to hereinafter by the cultivar name ‘DEVON ESTHER’.",
        "‘DEVON ESTHER’ is a complex hybrid plant that is the product of a breeding program started by the inventor in 1980. The breeding program is ongoing, conducted in a cultivated area of Houndspool, Dawlish, Devon, United Kingdom. The primary focus of the breeding program is to produce new cultivars of carnations that exhibit unique growth habit. The inventor selected ‘DEVON ESTHER’ in 2001 for its unique pronounced compact habit accompanied by abundant soft magenta flowers that bloom from May through October.",
        "‘DEVON ESTHER’ is a dwarf carnation exhibiting pronounced compact habit, grey-green foliage, and soft magenta flowers. The colors of stems, leaves, calyx, and epicalyx are of material retaining the characteristic waxy bloom of Dianthus. ‘DEVON ESTHER’ resulted from the open pollination between two unknown varieties of Dianthus.",
        "The variety of Dianthus which is considered by the inventor to most closely resemble ‘DEVON ESTHER’ is the inventor's variety Dianthus ‘Devon Winnie’ (U.S. Plant Pat. No. 14,893). When compared with these two varieties, the vigor of ‘DEVON ESTHER’ is greater than ‘Devon Winnie’. ‘DEVON ESTHER’ exhibits a softer and more purple flower than ‘Devon Winnie’. ‘DEVON ESTHER’ has a stronger perfume than the moderately perfumed ‘Devon Winnie’.",
        "Asexual reproduction of the new cultivar was first accomplished by the inventor in 2001 in a cultivated area of Houndspool, United Kingdom. The method of asexual propagation used was vegetative cuttings. Since that time the characteristics of the new cultivar have been determined stable and are reproduced true to type in successive generations of asexual reproduction.",
        "The following traits have been repeatedly observed and represent the characteristics of the new Dianthus cultivar ‘DEVON ESTHER’. These traits in combination distinguish this cultivar from all other commercial varieties known to the inventor. ‘DEVON ESTHER’ has not been tested under all possible conditions and phenotypic differences may be observed with variations in environmental, climatic and cultural conditions, however, without any variance in genotype.\n\n    \n    \n        1. Dianthus ‘DEVON ESTHER’ exhibits a pronounced compact habit.\n        2. Dianthus ‘DEVON ESTHER’ blooms profusely.\n        3. Dianthus ‘DEVON ESTHER’ exhibits soft magenta flowers from May through October.\n        4. Dianthus ‘DEVON ESTHER’ exhibits grey-green foliage.\n        5. At maturity, the height of the foliage mound of Dianthus ‘DEVON ESTHER’ is 15 cm-20 cm. The mature width is approximately 10 cm-15 cm.\n        6. Dianthus ‘DEVON ESTHER’ is a perennial herb.\n        7. Dianthus ‘DEVON ESTHER’ is suitable for use as a flowering plant in pots and containers.\n        8. Dianthus ‘DEVON ESTHER’ is hardy to minus 15° Centigrade.",
        "The accompanying color drawings illustrate the overall appearance of the new Dianthus variety ‘DEVON ESTHER’ showing colors as true as it is reasonably possible to obtain in colored reproductions of this type. Colors in the drawings may differ from the color values cited in the detailed botanical description, which accurately describe the actual colors of the new variety ‘DEVON ESTHER’.",
        "The drawing labeled as FIG. 1 depicts an entire flowering plant.",
        "The drawing labeled as FIG. 2 depicts a close-up view of the flower.",
        "All drawings were made from 12 months old plants which had been grown in 1.5-liter containers in a cold glasshouse in Devon, United Kingdom. No chemicals were used to treat the plants. All drawings were made using conventional techniques and although colors may appear different from actual colors due to light reflectance they are as accurate as possible by conventional photography.",
        "The following is a detailed description of the new cultivar ‘DEVON ESTHER’. Data was collected in spring from 1.5-liter container plants which had been grown for 12 months in an unheated greenhouse in Devon, United Kingdom. The color determinations are in accordance with the 2001 edition of The Royal Horticultural Society Colour Chart except where general color terms of ordinary dictionary significance are used. No chemicals were used to treat the plants. Growing conditions are typical to other Dianthus. \n\n    Botanical classification: Dianthus ‘DEVON ESTHER’.\n    Species: ×hybrida. \n    Common name: Dwarf carnation.\n    Commercial classification: DianThus hybrid.\n    Type: Perennial herb.\n    Use: Used as a flowering plant for pots and containers.\n    Parentage: ‘DEVON ESTHER’ is a complex hybrid plant that resulted from open pollination between two unknown varieties of Dianthus. \n    Plant description:\n    \n        \n        \n            Bloom period.—May through October.\n            Plant habit.—Pronounced compact habit.\n            Plant height.—15 cm-20 cm. in height at maturity.\n            Plant width.—10 cm-15 cm in width at maturity.\n            Plant hardiness.—Hardy to minus 15° Centigrade.\n            Root system.—Fine fibrous roots.\n            Propagation.—Propagation is accomplished using vegetative cuttings.\n            Cultural requirements.—Grow in full sun, with moderate water, and well-drained moderately fertile soil.\n            Diseases and pests.—Susceptible to known Dianthus pests and disease but no other susceptibilities to pests or disease are known to the inventor.\n            Time and temperature needed to produce a rooted cutting.—2 weeks are needed to produce roots on cuttings using a mist propagation unit with bottom heat of 21° Centigrade, and a minimum air temperature of 15° Centigrade.\n            Crop time.—An average of 3 months in the spring and 6 months in the fall are needed to produce a finished container size plant from a well-rooted cutting.\n        \n        \n    \n    \n    Stem:\n    \n        \n        \n            Shape.—Cylindrical.\n            Stem dimensions.—80 mm-90 mm. in length and 3 mm. in diameter.\n            Stem surface.—Glabrous and glaucous.\n            Stem color.—136A.\n            Branching.—Numerous basal breaks.\n            Internode length.—10 mm-12 mm between nodes.\n            Node color.—145D.\n            Node dimensions.—4 mm. in diameter and 3 mm. in length.\n        \n        \n    \n    \n    Foliage: Loose cushion of grass-like glaucous leaves.\n    Leaf:\n    \n        \n        \n            Type.—Simple.\n            Shape.—Linear.\n            Apex.—Acute.\n            Base.—Decurrent.\n            Venation.—Not Prominent.\n            Margins.—Entire.\n            Attachment.—Sheathing.\n            Arrangement.—Opposite and spiraling up stem.\n            Surfaces (adaxial and abaxial).—Glaucous.\n            Leaf dimensions.—35 mm in length and an average of 4 mm in width.\n            Leaf color (adaxial surfaces).—N136A.\n            Leaf color (abaxial surfaces).—N136B.\n            Fragrance.—Absent.\n        \n        \n    \n    \n    Flowers:\n    \n        \n        \n            Inflorescence.—Cymose.\n            Number of flowers per stem.—From 3 to 5.\n            Flower type.—Salviform, double and symmetrical.\n            Flower length.—(Pedicel, including calyx): 35 mm.\n            Flower diameter.—40 mm.\n            Fragrance.—Present, strongly clove-like.\n            Bud color.—Each bud is N138C on apical half and 13A on basal half.\n            Anthocyanin.—When present 137C.\n            Bud dimensions.—20 mm in length and 8 mm in width.\n            Bud shape.—Cylindrical.\n            Petals.—Persistent, double, overlapping and sympetalous.\n            Petal number.—13 to 15 often with 5 petaloid stamens.\n            Petal margin.—Slightly dentate (toothed 3 mm deep).\n            Petal shape.—Obdeltoid and slightly folded.\n            Petal surface.—Glabrous.\n            Petal dimensions.—35 mm in length and 25 mm in width.\n            Petal color (adaxial surface).—Petal consists of rounded blade with strap-like base. Ground color of blade: N78C. Color of band in center of blade: N79C. Strap: 145D.\n            Calyx dimensions.—8 mm. in diameter and 18 mm in length.\n            Calyx color.—N137C.\n            Anthocyanin.—Absent.\n            Sepal number.—5 in number.\n            Fused or unfused.—Fused.\n            Color.—133B.\n            Peduncle.—Dimensions: 150 mm in length and 2 mm in diameter. Color: N138C. Suface: Glaucous.\n            Bracts.—Epicalyx bracts: 1 pair (2 individual bracts). Shape of outer lobe: acuminate. Dimensions: 7 mm wide, 6 mm long. Color: 137C. Anthocyanin: absent.\n            Bracteoles.—Number: 1 pair (2 individual bracts). Dimensions: 3 mm wide, 5 mm long. Anthocyanin: absent.\n            Stipules.—Number: Two per node. Dimensions: A range of 3 mm to 5 mm in width, and a range of 7 mm to 35 mm in length. Color: 139C.\n            Lastingness of the flower.—15 days at 20° C.\n        \n        \n    \n    \n    Reproductive organs:\n    \n        \n        \n            Stamens.—Variable or malformed.\n            Stamen dimensions.—5 mm to 15 mm in length and 0.5 mm in diameter.\n            Stamen color.—147C.\n            Anther number.—Usually absent.\n            Pollen.—Absent.\n            Amount of pollen.—When present the amount is moderate.\n            Pollen color.—When pollen is present the color ranges from 155A to N74D.\n            Pistil.—One that divides into two above the ovary.\n            Pistil dimensions.—37 mm in length.\n            Styles.—Two in number.\n            Style dimensions.—25 mm in length and 1 mm. in diameter.\n            Style color.—Upper half N74D, lower half white.\n            Stigma number.—Two in number.\n            Stigma shape.—Undivided.\n            Color of stigma.—N74D.\n            Height above petals.—5 mm. above petals.\n            Ovary position.—Superior.\n            Ovary dimensions.—12 mm in length and 4 mm in diameter.\n            Ovary shape.—Spindle shaped.\n            Ovary color.—144C.\n        \n        \n    \n    \n    Seed:\n    \n        \n        \n            Seed.—Absent."
    ],
    "citations": [],
    "us_classification": "PLT272",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "01",
            "subclass": "H",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}