{
    "title": "Poinsettia plant named ‘PER2004’",
    "abstract": "A new and distinct cultivar of Poinsettia plant named ‘PER2004’, characterized by its uniform, upright and mounded plant habit; freely branching habit; recurved dark green-colored leaves; mid-season flowering response; inflorescences with pink and creamy white bi-colored flower bracts that are recurved; and excellent post-production longevity.",
    "inventors": [
        "Kobayashi"
    ],
    "document_number": "PP018232",
    "publication_date": "20071120",
    "assignees": [
        "Paul Ecke Ranch"
    ],
    "claims": [
        {
            "claim_number": "CLM-00001",
            "preamble": "1. A new and distinct Poinsettia plant named ‘PER2004’ as illustrated and described.",
            "components": []
        }
    ],
    "description": [
        "Botanical designation: Euphorbia pulcherrima.",
        "Cultivar denomination: ‘PER2004’.",
        "Title: Poinsettia Plant Named ‘PER 1904’. Application: Ruth Kobayashi; filed concurrently (U.S. Plant patent application Ser. No. 11/483,222).",
        "The present invention relates to a new and distinct cultivar of Poinsettia plant, botanically known as Euphorbia pulcherrima Willd., and hereinafter referred to by the name ‘PER2004’.",
        "The new Poinsettia a product of a planned breeding program conducted by the Inventor in Encinitas, Calif. The objective of the breeding program is to create new Poinsettia cultivars having flower bracts with desirable colors, uniform plant habit and excellent post-production longevity.",
        "The new Poinsettia is a naturally-occurring branch mutation of the Euphorbia pulcherrima Willd. cultivar PER1072, disclosed in U.S. Plant Pat. No. 15,883. The cultivar PER2004 was discovered and selected by the Inventor from within a population of plants of ‘PER1072’ in a controlled environment in Encinitas, Calif. in December, 2003.",
        "Asexual reproduction of the new Poinsettia by terminal vegetative cuttings in a controlled environment in Encinitas, Calif. has shown that the unique features of this new Poinsettia are stable and reproduced true to type in successive generations of asexual reproduction.",
        "The cultivar PER2004 has not been observed under all possible environmental conditions. The phenotype may vary somewhat with variations in environment such as temperature, daylength and light intensity, without, however, any variance in genotype.",
        "The following traits have been repeatedly observed and are determined to be the unique characteristics of ‘PER2004’. These characteristics in combination distinguish ‘PER2004’ as a new and distinct cultivar of Poinsettia:\n\n    \n    \n        1. Uniform, upright and mounded plant habit.\n        2. Freely branching habit.\n        3. Recurved dark green-colored leaves.\n        4. Mid-season flowering response; under natural season conditions, plants flower in about 7.5 weeks in Encinitas, Calif.\n        5. Inflorescences with pink and creamy white bi-colored flower bracts that are recurved.\n        6. Excellent post-production longevity.",
        "In side-by-side comparisons conducted in Encinitas, Calif., plants of the new Poinsettia differed from plants of the parent, the cultivar PER1072, primarily in flower bract color as plants of the cultivar PER1072 had dark red-colored flower bracts.",
        "In side-by-side comparisons conducted in Encinitas, Calif., plants of the new Poinsettia differed from plants the cultivar PER1904, primarily in flower bract color as plants of the cultivar PER1904 had pink-colored flower bracts.",
        "Plants of the new Poinsettia can be compared to plants of the Poinsettia cultivar Eckaddis, disclosed in U.S. Plant Pat. No. 12,782. In side-by-side comparisons conducted in Encinitas, Calif., plants of the new Poinsettia differed from plants of the cultivar Eckaddis in the following characteristics:\n\n    \n    \n        1. Plants of the new Poinsettia were more compact than plants of the cultivar Eckaddis.\n        2. Plants of the new Poinsettia flowered about two weeks earlier than plants of the cultivar Eckaddis grown under natural season conditions.\n        3. Plants of the new Poinsettia and the cultivar Eckaddis differed in flower bract coloration as plants of the cultivar Eckaddis had pink-colored flower bracts.",
        "The accompanying photographs illustrate the overall appearance of the new Poinsettia. These photographs show the colors as true as it is reasonably possible to obtain in colored reproductions of this type. Colors in the photographs may differ slightly from the color values cited in the detailed botanical description which accurately describe the colors of the new Poinsettia.",
        "The photograph at the bottom of sheet comprises a side perspective view of a typical flowering plant of ‘PER2004’ grown in a container.",
        "The photograph at the top of the sheet is a close-up view of a typical inflorescence of ‘PER2004’.",
        "In the following description, color references are made to The Royal Horticultural Society Colour Chart, 1995 Edition, except where general terms of ordinary dictionary significance are used. The following observations and measurements describe plants grown in Encinitas, Calif. during the winter in a polyethylene-covered greenhouse and under conditions and practices which approximate those generally used in commercial Poinsettia production. During the production of the plants, day temperatures averaged 24° C., night averaged 19° C. and light levels were about 4,000 foot-candles. Measurements and numerical values represent averages for typical flowering plants. Single plants were grown in 16.5-cm pots and pinched one time. Plants were about 19 weeks old when the photographs and the detailed description were taken.\n\n    Botanical classification: Euphorbia pulcherrima cultivar PER2004.\n    Parentage: Naturally-occurring branch mutation of the Euphorbia pulcherrima Willd. cultivar PER1072, disclosed in U.S. Plant Pat. No. 15,883.\n    Propagation:\n    \n        \n        \n            Type.—Terminal vegetative cuttings.\n            Time to initiate roots.—About ten days at 20° C. to 22° C.\n            Time to produce a rooted young plant.—About four weeks at 20° C. to 22° C.\n            Root description.—Fibrous; white in color.\n        \n        \n    \n    \n    Plant description:\n    \n        \n        \n            Plant habit and form.—Uniform, upright and mounded plant habit; inverted triangle. Inflorescences positioned above the foliar plane. Moderately vigorous growth habit.\n            Plant height.—About 32 cm.\n            Plant diameter or spread.—About 34 cm.\n            Lateral branch description.—Quantity: Freely branching habit, about nine lateral branches develop after pinching. Length: About 28 cm. Diameter: About 6 mm. Internode length: About 1.5 cm. Strength: Strong. Texture: Smooth, glabrous. Color: 144A.\n            Foliage description.—Arrangement: Alternate, simple. Length: About 7.8 cm. Width: About 8 cm. Shape: Elliptic; occasionally three-pointed. Apex: Acute. Base: Acute. Margin: Entire or with shallow lobing. Venation pattern: Pinnate. Texture, upper surface: Smooth, glabrous. Texture, lower surface: Minute pubescence. Surface: Rugose. Aspect: Recurved. Color: Developing foliage, upper surface: 147A. Developing foliage, lower surface: 147B. Fully expanded foliage, upper surface: Darker than 147A; venation, 146C. Fully expanded foliage, lower surface: 147A; venation, 146D. Petiole: Length: About 2.5 cm. Diameter: About 3 mm. Texture, upper and lower surfaces: Smooth, glabrous. Color, upper and lower surfaces: 146B.\n        \n        \n    \n    \n    Inflorescence description:\n    \n        \n        \n            Inflorescence type and habit.—Inflorescences are compound corymbs of cyathia with colored flower bracts subtending the cyathia. One inflorescence per lateral branch. Flowers are not fragrant. Flowers persistent. Inflorescences positioned above the foliage.\n            Natural flowering season.—Autumn/winter; inflorescence initiation and development is induced under long nyctoperiod conditions. Mid-season flowering; response time, about 7.5 weeks; natural season flowering maturity date is mid-November for plants grown in Encinitas, Calif.\n            Post-production longevity.—Excellent post-production longevity; plants of the new Poinsettia maintain good substance and bract color for about four weeks under interior conditions.\n            Inflorescence size.—Diameter: About 12 cm. Height (depth): About 8 cm.\n            Flower bracts.—Quantity per inflorescence: About 28. Length, largest bracts: About 8 cm. Width, largest bracts: About 8.5 cm. Shape: Elliptic. Apex: Acuminate. Base: Acute. Margin: Entire. Texture, upper and lower surfaces: Smooth, glabrous. Surface: Rugose. Aspect: Recurved. Venation pattern: Pinnate. Color: Developing or transitional bracts, upper surface: Centers, 39C; towards the margins, 10C. Developing or transitional bracts, lower surface: Centers, 39B; towards the margins, 10C. Fully developed bracts, upper surface: Centers, 39C to 39D; towards the margins, 10D. Fully developed bracts, lower surface: Centers, 39D; towards the margins, 10D. Venation, upper and lower surfaces: Similar to flower bract color. Bract petiole: Length: About 1.6 cm. Diameter: About 3 mm. Texture, upper and lower surfaces: Smooth, glabrous. Color, upper and lower surfaces: 150C.\n            Cyathia.—Quantity per corymb: About 20. Diameter of cyathia cluster: About 2.5 cm by 3 cm. Length: About 7 mm. Width: About 6 mm. Shape: Ovoid. Color, immature: 145B. Color, mature: 145B. Nectaries: Quantity per cyathium: About one or two. Size: About 2 mm by 4 mm. Color: 14A.\n            Peduncles.—Length: About 3 mm. Diameter: About 2 mm. Strength: Strong. Aspect: Upright. Texture: Smooth, glabrous. Color: 145C.\n            Reproductive organs.—Stamens: Quantity per cyathium: About ten. Anther shape: Oval; bi-lobed. Anther length: About 1 mm. Anther color: 16C. Amount of pollen: Scarce. Pollen color: 12A. Pistils: None observed. Seed/fruit: Seed and fruit production has not been observed.\n        \n        \n    \n    \n    Disease/pest resistance: Plants of the new Poinsettia have not been shown to be resistant to pathogens and pests common to Poinsettias.\n    Temperature tolerance: Plants of the new Poinsettia have been observed to tolerate temperatures ranging from about 15° C. to about 30° C."
    ],
    "citations": [],
    "us_classification": "PLT303",
    "international_classifications": [
        {
            "classification_level": "A",
            "section": "A",
            "classification_class": "01",
            "subclass": "H",
            "main_group": "5",
            "subgroup": "00"
        }
    ]
}